{
  "id": 11574,
  "title": "Winners Announced at 4th Annual Juried Emerging Playwright Competition",
  "slug": "11574",
  "date": "2021-11-08T00:27:30",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "Phillips’ Mill Community Association"
  ],
  "excerpt": "<p>Phillips’ Mill Community Association to Also Present 2 ArtTalks on Competition As the lights come up on Broadway, so too will they brighten the stage at Phillips’ Mill on November 20 with a live reading of the six winning short plays of its 4th Annual Juried Emerging Playwright Competition.  Chosen by this year’s esteemed panel [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b><i>Phillips’ Mill Community Association to Also Present 2 ArtTalks on Competition</i></b></p>\n<p class=\"p3\"><span class=\"s2\">As the lights come up on Broadway, so too will they brighten the stage at Phillips’ Mill on November 20 with a live reading of the six winning short plays of its 4th Annual Juried Emerging Playwright Competition.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">Chosen by this year’s esteemed panel of jurors, Judy Hallberg, Kimberly Kalaja and Wilbert Turner (bios available on the Phillips’ Mill website at <a href=\"http://www.phillipsmill.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.phillipsmill.org</a>)<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s4\"><b>The Winners Are:</b></span></p>\n<p class=\"p7\"><strong>“The Wonderer” by Lynda Crawford</strong></p>\n<p class=\"p7\"><strong>“Beware the Kraken” by Sherry Friedman</strong></p>\n<p class=\"p7\"><strong>“Northern Lights” by Nancy Vander Zwan</strong></p>\n<p class=\"p7\"><strong>“The Advocate” by Kate Thomas</strong></p>\n<p class=\"p7\"><strong>“Blighted” by Dominique Cieri</strong></p>\n<p class=\"p7\"><strong>“The Eulogy” by Jeff Stolzer</strong></p>\n<p class=\"p4\"><span class=\"s2\">To be eligible for the competition, playwrights must live within a 100-mile radius of the Phillips’ Mill Community Association located on River Road just north of New Hope. Submissions close after fifty plays are submitted or the deadline is reached. This is a blind competition meaning the scripts are identified to the judges only by a number. The name of the playwright is revealed only after the six winning scripts have been chosen. The plays selected this year come from Pennsylvania, New York, Brooklyn and New Jersey.</span></p>\n<p class=\"p4\"><span class=\"s2\">The list of talented actors who have volunteered to read the winning scripts so far include Laura Brenner-Scotti, Tabitha Dell’Angelo, Cecily Laidman, Kevin Nalty, Tim Wade, Tom Metelski, Sarah LaClair, Dan Gramkee, and Rick Goodwin. Fran Young will direct.</span></p>\n<p class=\"p4\"><span class=\"s2\">Valerie Eastburn, chair of the Mill’s drama program points out, “the Mill is creating a valuable opportunity for the playwright to gain insight into how an audience responds to their play. This feedback is critical for further development of the play and playwright, and the audience is an integral part of that process.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">The plays will be read on stage at the Mill on November 20 at 7:00 p.m. and a moderated Q &amp; A between audience and playwrights will follow. A wine reception to allow judges, playwrights, actors, sponsors of the event, and the audience a chance to mingle will wrap up the evening.<span class=\"Apple-converted-space\">  </span>The community is invited and, in lieu of admission, a donation is appreciated but not required.</span></p>\n<p class=\"p4\"><span class=\"s2\">In addition to the November 20 event, Phillips’ Mill will present two ArtTalks focusing on the Emerging Playwright Competition. The first, on November 7, will feature the judges of this year’s competition.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">A second in December will be a pre-recorded program featuring the winning playwrights and scenes from the live November event. The popular ArtTalk series features online conversations with artists, curators, playwrights and more, two Sundays every month, from 5 to 6 p.m. Visit<span class=\"Apple-converted-space\">  </span>the website at <a href=\"http://www.phillipsmill.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.phillipsmill.org</a> for events and ArtTalk updates.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/11/PlayReadings.jpg"
}