{
  "id": 18625,
  "title": "Gluten-Free Treats Await at Sweetah’s",
  "slug": "18625",
  "date": "2023-12-14T20:06:08",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "Beverly Berkeley",
    "Danielle Gannon",
    "doylestown cardinal",
    "Sweetah’s"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer A few years ago, Beverly Berkeley, who had worked at a private school for over a decade, wanted a career change. In her kitchen, she started playing around with ingredients to make delicious gluten-free, vegan treats with less sugar. She whipped up cookies, cupcakes, and scones. Her [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Danielle Gannon • </strong></em>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">A </span><span class=\"s1\">few years ago, Beverly Berkeley, who had worked at a private school for over a decade, wanted a career change. In her kitchen, she started playing around with ingredients to make delicious gluten-free, vegan treats with less sugar. She whipped up cookies, cupcakes, and scones. Her friends and family loved them and encouraged her to start selling these special treats to the community.</span></p>\n<p class=\"p5\"><span class=\"s1\">Beverly started setting up Saturdays at the STANGL market in Flemington, NJ. Every week, the treats would sell out. There, she met Basil Bandwagon’s owners, a Flemington natural food store. They knew Beverly’s treats were special and began buying them from her weekly to sell in their stores in Flemington, Clinton and Lambertville.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">From that point, Beverly saw this was a viable business she wanted to enter fully. She took up space at the Hargrave House B &amp; B in Doylestown Borough and served her goods to the inn’s patrons and the community in and around Doylestown. Finally, in 2016, Sweetah’s on Clinton Street opened its doors.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">“Doylestown has been so good to me,” Beverly says. “The customers and store owners alike truly want you to succeed. The smiles on people’s faces and the relief they feel knowing these treats are safe for kids’ classes, holidays, and birthdays is so rewarding.”</span></p>\n<p class=\"p5\"><span class=\"s1\">Whatever dietary restriction one may have. Sweetah’s can accommodate. Cupcakes, donuts, muffins, cookies, mini buns, lemon bars, cream puffs, eclairs, chocolate moose bars, pumpkin cheesecake bars, and specialty cakes &#8211; all are gluten-free, some dairy-free, and some vegan. Using mostly organic ingredients, the bakery offers an opportunity for patrons to feel good about eating these desserts. Beverly says that about half of her customers keep a gluten-free diet, while the other half just keep coming for more delicious desserts.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Beverly supports many other local gluten-free companies by selling their goods such as pasta and soft pretzels in a small case in her shop.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">As Sweetah’s approaches its ninth year in business, Beverly reflects on the strong community bonds formed. “I can’t imagine a better community to be a part of. The people here are my clients and friends,” she says with a smile.</span></p>\n<p class=\"p5\"><span class=\"s1\">With the holiday season in full swing, Sweetah’s is gearing up for the festivities. From the annual tree lighting to special shopping days, Beverly looks forward to spreading joy through her delectable treats and special holiday menu. Stop by, say hello, and try some treats. It’s a place with a lot of heart because Beverly puts all hers right into the bakery.</span></p>\n<p class=\"p5\"><span class=\"s1\">Sweetah’s located at 23 South Clinton Street in Doylestown and on IG @Sweetahs1<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><i>Danielle Gannon is a local Bucks County entrepreneur. Mom to three, she is co-owner of Organnons Natural Market and Founder &amp; Managing Director of Local Spotlight with Danielle. Her passion is connecting people and creating community. Residing in Ivyland, writing has always been a passion of hers. Find her on IG @localspotlightwithdanielle</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/Sweetahs-990x1320.jpg"
}