{
  "id": 18639,
  "title": "Create Lasting Memories in Bucks County This Coming Holiday Season",
  "slug": "18639",
  "date": "2023-12-14T20:19:59",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Play",
    "Stay"
  ],
  "tags": [
    "Britt Around Town",
    "brittany brown",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Britt Around Town • The Cardinal Contributing Writer December brings a familiar sense of excitement in the air. The anticipation of festive gatherings, warm-hearted traditions, and the joy of gift-giving begins to take center stage. But as you embark on your holiday shopping journey, perhaps it’s time to re-imagine the perfect presents.  This year, [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Britt Around Town • </strong></em>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">D</span><span class=\"s1\">ecember brings a familiar sense of excitement in the air. The anticipation of festive gatherings, warm-hearted traditions, and the joy of gift-giving begins to take center stage. But as you embark on your holiday shopping journey, perhaps it’s time to re-imagine the perfect presents.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">This year, let Bucks County be your guide to a different kind of gifting – one that promises cherished memories, laughter, and unforgettable experiences.</span></p>\n<p class=\"p6\"><strong>VISIT A THEME PARK</strong></p>\n<p class=\"p5\"><span class=\"s1\">For over four decades, <strong>Sesame Place</strong> has enchanted families with its unique blend of entertainment and education, all inspired by Jim Henson’s beloved children’s show, Sesame Street. Since its inception in 1980, this delightful children’s amusement park has been a cherished destination for creating lasting memories with loved ones. But did you know that Sesame Place holds another significant title? It proudly wears the crown as the world’s first autism-certified theme park.</span></p>\n<p class=\"p5\"><span class=\"s1\">As soon as you step through the gates of Sesame Place, you’re transported to the iconic Sesame Street, where the magic unfolds right before your eyes. Sesame Place boasts an exciting selection of rides, promising laughter and adventure for the entire family. From gentle rides suitable for the little ones to thrilling roller coasters for the daredevils, there’s something for everyone.</span></p>\n<p class=\"p5\"><span class=\"s1\">But the fun doesn’t stop there. Sesame Place takes entertainment to the next level with vibrant parades and captivating stage shows. Be prepared to be dazzled by the performances that bring Sesame Street to life right before your eyes. Perhaps one of the most enchanting experiences is dining with none other than Elmo himself. Delight in a meal in the company of this beloved character and make your visit truly magical.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong>EXPLORE LIKE A TOURIST</strong></p>\n<p class=\"p5\"><span class=\"s1\"><strong>Bucks County Joyrides</strong>, a premier private tour company, invites you to embark on an unforgettable journey through the captivating landscapes of Bucks County, Pennsylvania.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">In 2016, a group of avid adventure enthusiasts came together with a shared passion for exploration, music-filled road trips, and the exhilaration of the wind in their hair. It was this deep-seated love for the open road and the scenic beauty of Bucks County that led to the inception of Bucks County Joyrides. Since then, the company has been committed to sharing adventure with fellow travelers.</span></p>\n<p class=\"p5\"><span class=\"s1\">Starting in 2022, Bucks County Joyrides introduced a unique way to experience the breathtaking beauty of Bucks County—the private tour in a Jeep® Wrangler. This exciting adventure promises to transport you through time and place as you explore historic sites, meander through picturesque valleys, and wander through charming river towns that dot the landscape.</span></p>\n<p class=\"p5\"><span class=\"s1\">With Bucks County Joyrides, the path less traveled becomes your playground. Traverse tranquil creeks, venture down rugged dirt roads, and uncover the hidden treasures that define the essence of Bucks County. Along the way, you’ll encounter iconic covered bridges that stand as a testament to the county’s rich history.</span></p>\n<p class=\"p6\"><strong>TAKE FLIGHT</strong></p>\n<p class=\"p5\"><span class=\"s1\"><strong>Van Sant Airfield</strong> is a hidden gem that has captivated aviation enthusiasts and history buffs for over half a century. The park provides an experience like no other. With its rich history, antique aircraft, and thrilling adventures, Van Sant offers a unique blend of nostalgia and excitement that beckons visitors to explore its wonders.</span></p>\n<p class=\"p5\"><span class=\"s1\">For more than 50 years, Van Sant Airfield Park has cultivated a character and charisma all its own. Its name alone is steeped in history, and every corner of this aviation paradise is adorned with antiques that breathe life into its captivating stories. Whether you’re a seasoned aviator or a curious traveler, Van Sant invites you to step back in time and embark on a journey through its fascinating past.</span></p>\n<p class=\"p5\"><span class=\"s1\">As if the airfield’s ambiance and history weren’t enough, Van Sant offers a variety of aerial adventures to choose from:</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">• Satchmoe’s Sonata:</span></strong><span class=\"s1\"> Dance around the Delaware River, following its gentle curves up towards Frenchtown and Milford.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">• Find Our Mojo:</span></strong><span class=\"s1\"> Embark on a westward flight to discover new lands, with Lake Nockamixon and beyond waiting to be explored.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">• Barnstormin’ Bar’s Best:</span></strong><span class=\"s1\"> Head downriver to New Hope’s historic railroad, pay homage to Washington’s Crossing and enjoy panoramic views from Bowman’s Tower. Circle back over Peddlers Village and Doylestown for a truly memorable journey.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">• Dare Devil Dannie’s Delight: </span></strong><span class=\"s1\">Combine all of the above adventures and extend your flight over beautiful Bucks County, reaching Lake Nockamixon. Alternatively, opt for a city run up the river to explore Phillipsburg, Easton, Bethlehem, and Allentown.</span></p>\n<p class=\"p5\"><span class=\"s1\">Van Sant Airfield-Park is more than an airfield; it’s a living testament to the magic of flight and the enduring spirit of aviation.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong>SEE A LIVE SHOW</strong></p>\n<p class=\"p5\"><span class=\"s1\">Offering a diverse range of shows, <strong>Sellersville Theater</strong> offers a variety of live entertainment from musical performances to comedic acts and more.</span></p>\n<p class=\"p5\"><span class=\"s1\">When you step into Sellersville Theater, you aren’t merely attending a show; you are surrounded by centuries of history. This cherished venue symbolizes the enduring spirit of Sellersville, serving as a vibrant hub for entertainment that continues to captivate audiences of all ages.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong>CLIMB A TREE</strong></p>\n<p class=\"p5\"><span class=\"s1\">Yes, you read that right. The heart of <strong>Tree Trails Adventures</strong> lies in its diverse range of adventure courses. From beginners seeking a taste of the skies to thrill-seekers craving advanced challenges, this park in Trevose caters to all. These courses are not just about reaching heights but also about mastering a series of skill and element challenges that grow in complexity as participants ascend.</span></p>\n<p class=\"p5\"><span class=\"s1\">Safety is paramount in TCA’s world of adventure. Each adventure begins at a centralized main platform where participants are harnessed and briefed on safety and training protocols. This ensures that every guest explores the park at their preferred pace and comfort level, knowing they’re in safe hands.</span></p>\n<p class=\"p5\"><span class=\"s1\">These courses are a playground in the treetops. Both adult and kids’ courses feature an array of exciting elements, including zip lines that whisk you through the canopy, bridges crafted from sturdy cables and ropes, and netted tunnels suspended between platforms artfully constructed around trees and poles.</span></p>\n<p class=\"p6\"><strong>PLAN A STAYCATION</strong></p>\n<p class=\"p5\"><span class=\"s1\">If you’re looking for a relaxing getaway without straying too far from home, planning a staycation in Bucks County might be your perfect solution.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">One of the first steps to planning your staycation is selecting your ideal accommodation. Bucks County boasts a variety of charming inns, each offering its own unique charm and character. A few of the local options include:</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">• Logan Inn:</span></strong><span class=\"s1\"> Nestled in New Hope, the Logan Inn is one of Bucks County’s most iconic historic inns. With its classic architecture and welcoming atmosphere, it’s an excellent choice for those seeking a touch of elegance during their staycation.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">• The Washington House:</span></strong><span class=\"s1\"> Located in Sellersville, The Washington House combines classic charm with modern comforts. Its convenient proximity to Sellersville Theater makes it a perfect choice for theater enthusiasts.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">• Aaron Burr House:</span></strong><span class=\"s1\"> For a touch of history, consider the Aaron Burr House in New Hope. This beautifully restored inn offers a glimpse into the past while providing modern amenities.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">• Hargrave House: </span></strong><span class=\"s1\">Situated in charming Doylestown, Hargrave House offers a cozy and intimate stay with a delightful garden for relaxation.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">• Black Bass Hotel:</span></strong><span class=\"s1\"> If waterfront views are your preference, the Black Bass Hotel in Lumberville provides luxurious accommodations with breathtaking views of the Delaware River.</span></p>\n<p class=\"p5\"><span class=\"s1\">This holiday season, let Bucks County guide you toward a gift that transcends material possessions – a gift of cherished memories, laughter, and unforgettable experiences that will be treasured for years to come.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/Sesame-Place.jpg"
}