{
  "id": 11713,
  "title": "5 Quick Tips for Hosting Thanksgiving",
  "slug": "5-quick-tips-for-hosting-thanksgiving",
  "date": "2021-11-23T21:00:09",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "dakota latorre",
    "doylestown cardinal",
    "thanksgiving"
  ],
  "excerpt": "<p>By Dakota Latorre • Special to The Cardinal 1 Delegate  Assign family members sides, deserts, and drinks to bring. Get your kids involved by setting the table and helping cook (depending on what age, this might be the opposite of helpful. If you’re still in the toddler stage- I’d say add some extra screen time [&hellip;]</p>\n",
  "content": "<p class=\"p3\"><b>By Dakota Latorre • </b>Special to The Cardinal</p>\n<p class=\"p6\"><b>1 Delegate<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p3\">Assign family members sides, deserts, and drinks to bring. Get your kids involved by setting the table and helping cook (depending on what age, this might be the opposite of helpful. If you’re still in the toddler stage- I’d say add some extra screen time without the mom guilt!) This holiday is not supposed to be a 1-man (or woman) show!<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p6\"><b>2) Keep the Apps Simple<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p3\">Planning and preparing appetizers are yet another to-do on your never-ending list to complete. But the truth is, there’s nothing worse than being too full right before that long-awaited thanksgiving meal is served.<span class=\"Apple-converted-space\">  </span>Maybe skip the apps completely (it’s radical, I know!). If you’re not quite there yet, keep them light and easy. A veggie tray or olive spread are good options. Avoid breads and cheeses. Let the focus be on the meal and desert!<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p6\"><b>3) Preparation <span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p3\">Start days beforehand so you’re not running around like a turkey with their head cut off! Set the table, order your groceries online, and get your house ready early in the week, so the day of, you can be present and enjoy!</p>\n<p class=\"p6\"><b>4) Conserve your Energy<span class=\"Apple-converted-space\"> </span></b><b>and De-stress<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p3\">Order from Nat’s pizza the night before and have cereal for breakfast in the morning.<span class=\"Apple-converted-space\">  </span>Get a great night sleep. Maybe attend a yoga class at Sun Dog Yoga Studio or if you need a quicker solution, start pouring the wine before the guests arrive!<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p6\"><b>5) Make it Special<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p3\">Take a moment to reflect how wonderful it is to have this crew all together to share this special day (no matter how crazy some of them are and how different their views can be from ours!). Maybe make a little speech, or the traditional going around the table taking turns sharing what everyone’s thankful for. Having the kids do gratitude arts and crafts and display them for the whole family is always an option. Most importantly, enjoy!</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/11/5-Tips-for-Thanksgiving.jpg"
}