{
  "id": 11170,
  "title": "A Proclamation Honoring The Service To Our Community By Councilman Joe Flood",
  "slug": "a-proclamation-honoring-the-service-to-our-community-by-councilman-joe-flood",
  "date": "2021-07-19T14:26:57",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "joe flood",
    "ron strouse"
  ],
  "excerpt": "<p>Public servants are the lifeblood of our Democracy.  Among countless public servants are researchers and scientists, healthcare workers, first responders, educators, military service members, and elected officials. Joe Flood has been fulfilling the role of public servant for seven and a half years as an elected member of Doylestown Borough Council.  He has represented Ward [&hellip;]</p>\n",
  "content": "<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<p class=\"p1\">Public servants are the lifeblood of our Democracy.<span class=\"Apple-converted-space\">  </span>Among countless public servants are researchers and scientists, healthcare workers, first responders, educators, military service members, and elected officials.</p>\n<p class=\"p1\">Joe Flood has been fulfilling the role of public servant for seven and a half years as an elected member of Doylestown Borough Council.<span class=\"Apple-converted-space\">  </span>He has represented Ward 2 in Doylestown Borough with the fidelity that the oath of office requires and much, much more.</p>\n<p class=\"p1\">Joe has consistently and enthusiastically argued for the interests and concerns of his constituents and he has worked to advance Doylestown as a community.</p>\n<p class=\"p1\">So much of the work of Borough Council takes place in the committees of Council.<span class=\"Apple-converted-space\">  </span>Joe has served on so many of those committees with commitment.<span class=\"Apple-converted-space\">  </span>Whether it be Personnel, Public Works, Water, or Public Safety, Joe&#8217;s level of service has been exemplary, as has his leadership as chair of Public Works and Administration and, before that, Water Utility.</p>\n<p class=\"p1\">Joe Flood&#8217;s service during these seven and a half years could not have been more timely – and more appreciated.<span class=\"Apple-converted-space\">  </span>As Doylestown experiences growth and change while working to maintain its unique identity and qualities and as we work through a pandemic to have a stronger community, we appreciate Joe&#8217;s contributions even more.</p>\n<p class=\"p1\"><strong>WHEREAS</strong>, Joe Flood is deserving of appreciation and considerable thanks for his distinguished work as a member of Borough Council.</p>\n<p class=\"p1\"><strong>NOW, THEREFORE</strong>, I call upon the residents of our community to thank Joe Flood for his service on Borough Council and in so many other ways in our community.</p>\n<p class=\"p1\"><strong>IN WITNESS WHEREOF</strong>, I have hereunto set my hand this 19th day of July 2021.</p>\n<p class=\"p1\"><strong>Ron Strouse, </strong><em><strong>Mayor</strong></em></p>\n</div>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/07/Joe-Flood.jpg"
}