{
  "id": 19206,
  "title": "An Unconventional Workout: PA Pole Academy Celebrating 15 Years",
  "slug": "an-unconventional-workout-pa-pole-academy-celebrating-15-years",
  "date": "2024-03-17T20:53:49",
  "author": "Staff",
  "category": [
    "Fit"
  ],
  "tags": [
    "Blaire Galaton",
    "doylestown cardinal",
    "ennsylvania Pole Academy"
  ],
  "excerpt": "<p>By Blaire Galaton • Special to The Cardinal Is going to the gym not your cup of tea? There are plenty of fitness options available to meet your 2024 fitness goals. Pole dancing has rapidly grown in popularity over the past few years, transforming from a misunderstood pastime to a legitimate and well-respected form of [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Blaire Galaton • </b>Special to The Cardinal</p>\n<p class=\"p3\"><b>Is going to the gym not your cup of tea?</b></p>\n<p class=\"p4\"><span class=\"s1\">There are plenty of fitness options available to meet your 2024 fitness goals. Pole dancing has rapidly grown in popularity over the past few years, transforming from a misunderstood pastime to a legitimate and well-respected form of fitness. People have found pole dancing to be a fun way to move your body, challenge and work your core strength and gain muscle.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">One who knows that well is Emily Cipriano owner and trainer at the Pennsylvania Pole Academy in Doylestown. Emily has been operating her studio for 15 years now, surviving the pandemic, and looking to expand her studio space in 2024. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Early on, Emily trained on a pole while looking to regain her fitness level after the birth of her first child. She had taken classes in NYC and Las Vegas but didn’t find anything offered in the Bucks County area. Soon, she realized that opening her studio gave people the chance to get a good workout, make friends, build confidence, and be in a safe place.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">PA Pole offers classes in pole, lyra, hammock, and flexibility. You’ll find a diverse group of men and women of all sizes, ages, fitness levels, and body types taking classes throughout the week. The place truly is for everyone.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">If you are super self-conscious but still want to try it, Emily offers private instruction classes as well. In addition to instruction, PA Pole also has a traveling competition team and a performance team that is available to hire for live performances. The academy has worked with countless charities and organizations and is an ally to the LGBTQ+ community.<span class=\"Apple-converted-space\">  </span>Come, let your guard down, and try it out for yourself.</span></p>\n<p class=\"p4\"><span class=\"s1\">For more information, visit <a href=\"http://papoledancing.com\" target=\"_blank\" rel=\"noopener noreferrer\">papoledancing.com</a>.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/03/Pole-Workout.jpg"
}