{
  "id": 11671,
  "title": "Artist Spotlight: Marie Borrelli",
  "slug": "artist-spotlight-marie-borrelli",
  "date": "2021-11-23T11:17:52",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "artist spotlight",
    "doylestown cardinal",
    "makers off main",
    "Marie Borrelli"
  ],
  "excerpt": "<p>Welcome to a new segment in The Cardinal where Makers Off Main will highlight, each month, one of their partner artists or crafters. Get an inside look at who they are and what inspires them to make their products that you will find at Makers Off Main! This month say hello to Marie Borrelli. Hello, [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><i>Welcome to a new segment in The Cardinal where Makers Off Main will highlight, each month, one of their partner artists or crafters. Get an inside look at who they are and what inspires them to make their products that you will find at Makers Off Main! This month say hello to <strong>Marie Borrelli.</strong></i></p>\n<p class=\"p1\"><span class=\"s1\">H</span><span class=\"s2\">ello, name is Marie Borrelli, and to say I have always been into art in one form or another would be an understatement. I don’t remember a time in my life when I didn’t find joy in being creative. It is part of who I am.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">As a child, my favorite classes in school were those that fell under the umbrella of the arts. I grew up in a house were my mother always had my sister and me doing arts and crafts projects. I went to school for graphic design and now have a small graphic design business.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">In my spare time I like to garden, practice yoga, paint, decorate, organize, and be creative. I love to learn, and I am always looking to broaden my horizons.</span></p>\n<p class=\"p3\"><span class=\"s3\">Velvet Pumpkins…. So, one day I was shopping, and I came upon some velvet pumpkins in a boutique and was shocked at how expensive they were. I decided that I would create the same thing, only my version would have real stems, not plastic…and I did.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">I realized that I needed to start collecting pumpkin stems a season in advance so they would have time to dry out, so my project took a little longer than expected to get started. During that time, I also started collecting jewel tone velvets that I thought I would use to create the pumpkins, and I began to make the pumpkins.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s3\">When I showed the finished produce (pun intended) to my family, they all wanted them, so I started taking requests. Then, with some encouraging from my family and friends, I decided to sell them, and that is where my partnership with Makers Off Main began. I am so thankful for the opportunity to be able to share my creations with so many other fabulous makers from the area!</span></p>\n<p class=\"p3\"><span class=\"s2\">For more information check out Marie’s Instagram @mrsdesign17.”</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/11/Marie-Borrelli.jpg"
}