{
  "id": 11834,
  "title": "Artist Spotlight: Kristen Kerwin",
  "slug": "artist-spotlight-kristen-kerwin",
  "date": "2021-12-13T11:42:53",
  "author": "Staff",
  "category": [
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "kristen kerwin",
    "look something shiny",
    "makers off main"
  ],
  "excerpt": "<p>Each month Makers Off Main highlights one of their partner artists or crafters. Get an inside look at who they are and what inspires them to make their products that you will find at Makers Off Main! This month say hello to Kristen Kerwin. Hello! My name is Kristen Kerwin, and I live in Montgomery County [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><i>Each month Makers Off Main highlights one of their partner artists or crafters. Get an inside look at who they are and what inspires them to make their products that you will find at Makers Off Main! This month say hello to Kristen Kerwin.</i></p>\n<p class=\"p1\"><span class=\"s1\">H</span><span class=\"s2\">ello! My name is Kristen Kerwin, and I live in Montgomery County with my husband and four children. As a Doylestown native (CB West ’89), I find myself in town often &#8211; because it’s HOME.  </span></p>\n<p class=\"p3\"><span class=\"s3\">Whether visiting family, watching the Memorial Day Parade, or enjoying the many small businesses and cultural events in town, I just can’t stay away. Doylestown is a thriving, close-knit community that supports and encourages small business and the arts &#8211; and it’s a dream come true to continue to be a part of it! </span></p>\n<p class=\"p3\"><span class=\"s2\">My business name, Look Something Shiny, sums up my entire personality as a maker. I’ve been ‘crafty’ since childhood, grateful for a mom who welcomed me into her sewing room and encouraged my creativity. I love to make a little of everything, and I’ve yet to find a creative outlet that I didn’t want to try.</span></p>\n<p class=\"p3\"><span class=\"s3\">I’m also grateful for the seasoned makers that have walked alongside me, reminding me that my most unique and precious craft supply is ME. Now at age 50, I’m leaning into the things that light my soul on fire &#8211; my family, bright colors, mixed media projects, and rescuing forgotten or ‘well-loved’ treasures by transforming them into something new and beautiful. Many of my materials are sourced from thrifting, kind donations, and found items&#8230;and the rest are from other small businesses whenever possible. I shop small business, local, and fair trade, any chance I get!</span></p>\n<p class=\"p3\"><span class=\"s2\">At Makers Off Main, you’ll find my colorful Fiber Art Rainbows, hand-painted ornaments, original art vinyl stickers, and many gifts and home decor items made from vintage quilts and linens. All of my creations reflect my love of color, handmade treasures, and anything with a story. And what a JOY it’s been to be a part of this amazing shop (thank you Caitlin and Wendy!), and to share my creative journey with the Doylestown community.</span></p>\n<p class=\"p3\"><span class=\"s2\">To see what I’m working on next, please come say hello on Instagram @looksomethingshiny</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/12/kristen-kerwin.jpg"
}