{
  "id": 15399,
  "title": "Artist Spotlight: Christie Hurley",
  "slug": "artist-spotlight-christie-hurley",
  "date": "2022-10-25T22:59:11",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "Christie Hurley",
    "doylestown cardinal"
  ],
  "excerpt": "<p>My name is Christie Hurley and I own Threads by Gram, an embroidery and  handmade business, with my husband, Derek Hurley. We began this business out of necessity during the pandemic. We made face masks and that gradually  transformed into a passion. We believe that women should be able to feel good and wear the [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">M</span><span class=\"s1\">y name is Christie Hurley and I own Threads by Gram, an embroidery and<span class=\"Apple-converted-space\">  </span>handmade business, with my husband, Derek Hurley. We began this business out of necessity during the pandemic. We made face masks and that gradually<span class=\"Apple-converted-space\">  </span>transformed into a passion. We believe that women should be able to feel good and wear the highest quality embroidered products every day.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><b>Tell us about yourself. When did your journey with art begin?</b></p>\n<p class=\"p5\"><span class=\"s2\">My journey with art began as a little kid. I grew up with a dad who was an engineer and a mom who was crafty in every sense. I watched my mom from a young age sew and I helped her make many things. My background is in architectural engineering, so I have a passion for technical programs and art. I love bringing to life a real tangible product from designing and programming on a computer to something that you can use every day, which is exactly what machine embroidery is to me.</span></p>\n<p class=\"p4\"><b>Tell us about your art. What is your creative process like?</b></p>\n<p class=\"p5\"><span class=\"s2\">My focus is mainly on the machine embroidery, while “Gram” focuses on everything handmade. Once I have an idea of a product or type of design I want to do, I will search online for inspiration. Once I have that design, I will digitize it in a software program meant for machine embroidery. Understanding how your design will stitch out based on what you digitized is the fun part because there are always small changes a piece might need to turn it into a high-quality product.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><b>Who or what is a big inspiration for you?</b></p>\n<p class=\"p5\"><span class=\"s2\">Seeing other female entrepreneurs who are artists running their own businesses is a big inspiration to me. I love learning and growing alongside others that share the same passion of art and business.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><b>How do you like being a local artist in Doylestown?</b></p>\n<p class=\"p5\"><span class=\"s3\">Being a local artist in Doylestown has opened up many doors for us and we are extremely grateful to have found a community at Maker’s Off Main. Everyone is always willing to help and guide us when we have questions. One of my favorite things is getting to meet other small business owners in person.</span></p>\n<p class=\"p4\"><b>Where can we find your work?</b></p>\n<p class=\"p5\"><span class=\"s2\">You can find our work at Maker’s Off Main in Doylestown, Maker’s Vintage + Handmade in Dublin, online at our website, <a href=\"https://threadsbygram.com\" target=\"_blank\" rel=\"noopener noreferrer\">https://threadsbygram.com</a>/, Etsy at ThreadsByGram and we sell wholesale products on Faire.com. We also attend a few craft fairs each year, so follow us on Instagram to find out more (@threadsbygram).</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/10/Christine-Hurley.jpg"
}