{
  "id": 12765,
  "title": "Artist Spotlight: Amanda Fries of Wood Crafted Designs",
  "slug": "artist-spotlight-amanda-fries-of-wood-crafted-designs",
  "date": "2022-04-14T21:43:53",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "Amanda Fries",
    "doylestown cardinal",
    "Wood Crafted Designs"
  ],
  "excerpt": "<p>Get to know Amanda Fries of Wood Crafted Designs.  She creates measuring spoons, utensils, decor signs and much more through wood burning and paint! Her 5-star rating from on Etsy is no surprise when you see the beautiful detail and uniqueness of her creations. Check out her Easter decorations as well!  Tell us about yourself.  [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><i>Get to know Amanda Fries of Wood Crafted Designs.<span class=\"Apple-converted-space\">  </span>She creates measuring spoons, utensils, decor signs and much more through wood burning and paint! Her 5-star rating from on Etsy is no surprise when you see the beautiful detail and uniqueness of her creations. Check out her Easter decorations as well!<span class=\"Apple-converted-space\"> </span></i></span></p>\n<p class=\"p1\"><strong>Tell us about yourself.<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s1\">Hello! My name is Amanda Fries. I’m a calligraphy, pyrography, and woodworking artist. I’m the owner of Wood Crafted Designs based out of Richboro, PA. I love to create handmade wooden pieces that are both decorative and functional.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">I grew up loving to draw and doodle on anything and everything. I was always the kid that found joy in just having a pencil and paper to draw on.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">My love for typography and design began in my late teens when I started lettering for fun. I later gifted Bible verse signs to a sweet elderly couple whom I grew to adore when I worked at a retirement home. The joy that those gifts and Bible verses brought the couple was so special, especially during the difficulties they were facing at the time. I knew then that creating art for others was what the Lord created me to do.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s2\">I started Wood Crafted Designs solely selling wooden decor signs. Then, a few years in, I began merging functional items by learning the art of wood-burning, formally called pyrography. I originally picked up my first wood burner in high school and quickly gave up because I was absolutely horrible at it. Fast forward a few years into college, and I attempted it again and practiced over and over, and now it’s one of the main tools I use.</span></p>\n<p class=\"p1\"><strong>Tell us about your art and your creative process.</strong></p>\n<p class=\"p2\"><span class=\"s1\">I create handmade wooden pieces that range from measuring spoons, utensils, and magnets to decor signs. I’ve also recently explored creating children’s items such as kid-sized rolling pins and portable lego trays.</span></p>\n<p class=\"p2\"><span class=\"s2\">My creative process varies drastically with what piece I’m working on. I either wood burn, paint, or, in some cases, do both. I start each design with free-hand drawing and then continue to painting or wood burning. My creative juices flow the most at night when most normal people sleep. I will forever and always be the night owl artist wood-burning or packing orders till 2 am.</span></p>\n<p class=\"p2\"><span class=\"s1\">Another creative aspect of my business is product photography. I enjoy taking photos of the products I create. I went to Bucks County Community College for graphic design and photography, and I love to use both in my business.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>How do you like being a local artist in Doylestown?</strong></p>\n<p class=\"p2\"><span class=\"s1\">I absolutely love the sense of community in Doylestown. I’ve met so many local artists, especially those that sell at Makers Off Main, and it’s like a sweet little art family that I’m so fortunate to be a part of.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Where can we find your work?</strong></p>\n<p class=\"p2\"><span class=\"s1\">My artwork can be found at Makers Off Main, Organnons (Newtown &amp; New Britain), Richboro True Value, Lilly’s on Broad, and my Etsy shop, WoodCraftedDesigns. I also participate in a few local craft markets throughout Bucks County.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/04/Artist-Spotlight-Photo-April.jpg"
}