{
  "id": 12086,
  "title": "Artist Spotlight: Blair Greiner",
  "slug": "artist-spotlight-blair-greiner",
  "date": "2022-01-14T15:38:23",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "blair Greiner",
    "doylestown cardinal",
    "makers off main",
    "Newtown Community Center"
  ],
  "excerpt": "<p>Each month Makers Off Main highlights one of their partner artists or crafters. Get an inside look at who they are and what inspires them to make their products that you will find at Makers Off Main! This month say hello to Blair Greiner. Tell us about yourself. When did your journey with art begin?  [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><i>Each month Makers Off Main highlights one of their partner artists or crafters. Get an inside look at who they are and what inspires them to make their products that you will find at Makers Off Main! This month say hello to Blair Greiner.</i></p>\n<p class=\"p1\"><strong>Tell us about yourself. When did your journey with art begin? </strong></p>\n<p class=\"p2\"><span class=\"s1\">As an 8 year old kid in art class, at the Newtown Community Center, holding a pint of green paint, I decided right then that I wanted to do this for the rest of my life. I knew from that moment that I wanted to be an art teacher like the man who was teaching that class. I took all kinds of art classes as a kid and am super happy to say that I kept my promise to myself! I am an art educator for Pennsbury School District, and I balance my work/home lives with a heavy dose of pottery. </span></p>\n<p class=\"p1\"><strong>Tell us about your art. What is your creative process like? </strong></p>\n<p class=\"p2\"><span class=\"s2\">I have always been a creative. Jumping from medium to medium, trying all different techniques. That is what is so great about being an art teacher! I have the freedom to explore and learn new skills, concepts and ideas every day with my students. I enjoy all types of art and creating, but clay is my meditation. Throwing pottery has been a focus of mine during this season of life. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">I cannot tell you how much it fills my bucket to see a dinner photo posted on social media that has my dishes being used to enjoy a meal with a family or to show a recipe someone is so proud of.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s3\">My work is different from artwork that hangs on a wall because it is a functional and intimate piece that is interacted with daily. Every part of its design needs to be considered. The feel, the weight, the function and of course, the way it looks. I even take special care to the bottoms of my pieces, so they are so smooth. Next time you have my mug in your hand, feel the mug bottom to your cheek and tell me if I am right! </span></p>\n<p class=\"p1\"><strong>Who or what is a big inspiration for you? </strong></p>\n<p class=\"p2\"><span class=\"s1\">Many of my mugs, plates, bowls and dishes include words, I like to find meaning in things and often find that these words connect the client to my work in ways that I am often not privy to. I like that my pieces are sometimes chosen based on their emotional or inspirational power and not just because they look nice.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">I find relationships and human connection so valuable and hope that some of my work strengthens those connections. Having breast cancer at the age of 33 has taught me many lessons, but the most important one, is that life is short. Celebrate every day and every thing that you can. </span></p>\n<p class=\"p1\"><strong>Where can we find your work? </strong></p>\n<p class=\"p2\"><span class=\"s1\">Pottery is a time-consuming process and there is no way I could open my own brick and mortar store because I produce small batch work. That is why I am so grateful for women like Caitlin and Wendy and their shop, Makers Off Main, so I can still have the brick-and-mortar experience and allow customers to physically interact with my work before purchasing it which has been extremely fulfilling.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s4\">I do sell my work online in shop updates on instagram (@thenewtownstudio) where I announce a date and time of when my work will be “live” on the site for purchasing and I am so lucky that it sells out quickly! I am also so grateful for this newer “in person” experience that Makers Off Main has provided to me and my work. </span></p>\n<p class=\"p2\"><span class=\"s3\">Next time you are in Doylestown strolling along State Street, open the door to Makers Off Main, do one of those soft cheek tests of my work and check out all the other awesome artists and workshops they are home to. It is an absolute gem, and I am so glad that my work gets a place there to shine. </span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/01/Blair-Photo-by-Kiln.jpg"
}