{
  "id": 11479,
  "title": "At Home at the Michener Art Museum",
  "slug": "at-home-at-the-michener-art-museum",
  "date": "2021-10-08T22:11:15",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "Michener Art Museum",
    "robert beck"
  ],
  "excerpt": "<p>For more than three decades, Robert Beck has been an integral part of the Bucks County art community, as well as painting and exhibiting internationally. He is known as a leader and iconoclast, expanding the region’s fine art tradition. The Michener Art Museum is presenting a retrospective of Beck’s work through the end of the [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">F</span><span class=\"s2\">or more than three decades, Robert Beck has been an integral part of the Bucks County art community, as well as painting and exhibiting internationally. He is known as a leader and iconoclast, expanding the region’s fine art tradition. The Michener Art Museum is presenting a retrospective of Beck’s work through the end of the year.</span></p>\n<p class=\"p3\"><span class=\"s2\">In spite of the breadth of his career, Robert Beck remains a hometown boy. Beck grew up in Chalfont back in the 60’s, when the town was still mostly farmland. He graduated from Central Bucks High School, “Back when you didn’t have to ask which one,” he says. “There were quarter-midget races next to the bowling alley at the one shopping center, three all-night diners, and the prison was still a prison, not an art museum. This exhibition at the Michener has special significance for me. This is my home, and I get to celebrate with friends from all stages of my life.”</span></p>\n<p class=\"p3\"><span class=\"s2\">More than a “Best Of” exhibit, the Michener’s presentation of It’s Personal: The Art of Robert Beck is the remarkable story of a contemporary artist establishing a voice and creating an extraordinary body of work that will resonate for many years. <span class=\"Apple-converted-space\"> </span></span></p>\n<figure id=\"attachment_11481\" aria-describedby=\"caption-attachment-11481\" style=\"width: 1440px\" class=\"wp-caption alignnone\"><a href=\"https://doylestowncardinal.com/wp-content/uploads/2021/10/DogDayL.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-11481\" src=\"https://doylestowncardinal.com/wp-content/uploads/2021/10/DogDayL.jpg\" alt=\"\" width=\"1440\" height=\"1079\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2021/10/DogDayL.jpg 1440w, https://doylestowncardinal.com/wp-content/uploads/2021/10/DogDayL-300x225.jpg 300w, https://doylestowncardinal.com/wp-content/uploads/2021/10/DogDayL-768x575.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2021/10/DogDayL-1024x767.jpg 1024w, https://doylestowncardinal.com/wp-content/uploads/2021/10/DogDayL-74x55.jpg 74w, https://doylestowncardinal.com/wp-content/uploads/2021/10/DogDayL-111x83.jpg 111w, https://doylestowncardinal.com/wp-content/uploads/2021/10/DogDayL-215x161.jpg 215w, https://doylestowncardinal.com/wp-content/uploads/2021/10/DogDayL-990x742.jpg 990w, https://doylestowncardinal.com/wp-content/uploads/2021/10/DogDayL-1320x989.jpg 1320w\" sizes=\"auto, (max-width: 1440px) 100vw, 1440px\" /></a><figcaption id=\"caption-attachment-11481\" class=\"wp-caption-text\">Robert Beck, Dog Day, 2012, oil on panel 24 x 30, Private Collection</figcaption></figure>\n<p class=\"p3\"><span class=\"s2\">Guest Curator David Leopold, Director of the Studio of Ben Solowey and Creative Director of the Al Hirschfeld Foundation, explains: “For many in this area, Robert Beck’s paintings are as much a part of their world as Redfield, Garber, and Lathrop’s were to their time and community. As much as Bellows, Henri, and Sloan were to theirs.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s3\">His work is as complex as it is distinctive and accessible. Beck moves freely between painting his subjects from life and working in the studio, choosing to let his experience dictate how he relates it. He uses a language that is easy to understand, with a scope of subject matter that led one critic to call him an omnivore.</span></p>\n<p class=\"p3\"><span class=\"s2\">Beck’ images call to mind universal experiences. The painting Skating Party depicts the nighttime event through Beck’s suggestion of blade marks and the bonfire’s reflection on the ice. In Moby Dick, a girl reads while sitting in a boat stored in her grandfather’s barn. Each have a powerful sense of place. The image of a Manhattan intersection in a snowstorm, Blizzard, makes your feet cold. This is not nostalgia, it is connection.</span></p>\n<p class=\"p3\"><span class=\"s3\">“Beck is adept at capturing not just the look, but the feeling or impression of a moment,” says Laura Igoe, Chief Curator at the Michener Art Museum. “His paintings convey a strong sense of community and belonging that resonates with many of us, especially in light of the challenges of the past year, and help us imagine better days ahead.” <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">It’s Personal presents a common theme of “Us.” Episodes extend around the world, including man at a village well in Senegal and people eating breakfast at a café in Arles. The show keeps you moving; you are taken to Avignon in the morning, Manhattan in the afternoon, Dakar at night.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Where the Pennsylvania Impressionists and Urban Realists (Ashcan School) painted subjects of their time, Beck’s focus has been on our here and now, extending the region’s heritage forward with images that are remarkably accessible for contemporary work. The viewer doesn’t labor to see where Beck has brought them.<span class=\"Apple-converted-space\">  </span>He concentrates on a rapidly changing world; one he takes part in as well as observes.<span class=\"Apple-converted-space\">  </span>His writing in ICON magazine—a body of essays spanning 16 years—pulls a curtain back on art for tens of thousands of readers.<span class=\"Apple-converted-space\"> </span></span></p>\n<figure id=\"attachment_11482\" aria-describedby=\"caption-attachment-11482\" style=\"width: 1800px\" class=\"wp-caption alignnone\"><a href=\"https://doylestowncardinal.com/wp-content/uploads/2021/10/CarnegieHall_small.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-11482\" src=\"https://doylestowncardinal.com/wp-content/uploads/2021/10/CarnegieHall_small.jpg\" alt=\"\" width=\"1800\" height=\"1423\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2021/10/CarnegieHall_small.jpg 1800w, https://doylestowncardinal.com/wp-content/uploads/2021/10/CarnegieHall_small-300x237.jpg 300w, https://doylestowncardinal.com/wp-content/uploads/2021/10/CarnegieHall_small-768x607.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2021/10/CarnegieHall_small-1024x810.jpg 1024w, https://doylestowncardinal.com/wp-content/uploads/2021/10/CarnegieHall_small-990x783.jpg 990w, https://doylestowncardinal.com/wp-content/uploads/2021/10/CarnegieHall_small-1320x1044.jpg 1320w\" sizes=\"auto, (max-width: 1800px) 100vw, 1800px\" /></a><figcaption id=\"caption-attachment-11482\" class=\"wp-caption-text\">Robert Beck, Carnegie Hall, 2016, oil on panel 24 x 30 inches, Private Collection</figcaption></figure>\n<p class=\"p3\"><span class=\"s3\">He also hosted a radio interview show focused on creativity. Beck’s work was previously featured at the Michener at a four-person exhibition in 1999, and in two other solo museum shows (Trenton City Museum 2007, Maine Maritime Museum 2016), 10 museum invitationals, 85 juried exhibitions, and 35 solo gallery exhibitions. Beck is represented by Morpeth Contemporary, in Hopewell, NJ, where a separate exhibition of his recent work runs from October 8th through the 31st (morpethcontemporary.com).</span></p>\n<p class=\"p3\"><span class=\"s2\">Leopold has constructed a narrative for the Michener that blends the chronology of Becks career and his extraordinary relationship with the community with a selection of the diverse subjects that Beck has painted. There are two beautifully printed books that accompany the exhibition: a volume of Becks ICON Magazine essays, and a comprehensive catalogue. The show includes videos and audio recordings, so bring your smartphone and earbuds.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">As It’s Personal: The Art of Robert Beck, contains more than 70 works, and leaves you with a sense of the artist’s contentment. “My paintings are a celebration, rather than a catharsis,” says Beck. “They are conversations that start out, ‘Have you noticed?’”</span></p>\n<p class=\"p3\"><span class=\"s2\">David Leopold remarks in the catalogue: “Fifty or one hundred years from now, when scholars or laypeople want to know about the art of our time in this storied region, they will turn to Robert Beck’s work to get a real sense of who we are, what we did, and even from that distance, how it felt.”</span></p>\n<p class=\"p3\"><span class=\"s2\">It’s Personal: The Art of Robert Beck, runs through January 2nd. For more information visit <a href=\"http://www.michenermuseum.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.michenermuseum.org</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/10/Beck-in-Studio.jpg"
}