{
  "id": 15445,
  "title": "Beer. Barbeque. Bands.",
  "slug": "beer-barbeque-bands",
  "date": "2022-10-25T23:49:31",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Great Barn Brewery",
    "Maryana and Steve Furguson",
    "Natalya Bucuy"
  ],
  "excerpt": "<p>By Natalya Bucuy • The Cardinal Contributing Writer Passion. Imagination. Growth.  Those are the key ingredients to running a business. Maryana and Steve Furguson, owners of Great Barn Brewery, know this well. Staying true to these values, this fall they announce a brand new menu concept at Great Barn Taphouse in Warrington &#8211; barbecue.  “As [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Natalya Bucuy • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><strong><span class=\"s1\">Passion. Imagination. Growth. </span></strong></p>\n<p class=\"p4\"><span class=\"s2\">T</span><span class=\"s3\">hose are the key ingredients to running a business. Maryana and Steve Furguson, owners of Great Barn Brewery, know this well. Staying true to these values, this fall they announce a brand new menu concept at Great Barn Taphouse in Warrington &#8211; barbecue. </span></p>\n<p class=\"p6\"><span class=\"s3\">“As our business grows, I see opportunities,” Maryana says. “When you’re a businessperson, you can’t stop. You constantly are looking for new ways to improve.”</span></p>\n<p class=\"p6\"><span class=\"s3\">The couple opened the Taphouse in April of 2021 as an expansion of their growing brewery business. The goals of the new 8,000 sq. ft. location at the Shops at Valley Square included a full restaurant and a sound stage. The combination created a venue for patrons not only to indulge in local brews and food, but to hear live music from area’s artists of various genres.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s3\">From larger rock bands, to open-mike and karaoke nights, and local student groups such as the School of Rock &#8211; the Great Barn Taphouse has been hosting multiple events every week since the opening day. The plan ahead includes further expansion of the music line-up. The intention is to create a one-stop destination for food, beer, and entertainment.   </span></p>\n<p class=\"p6\"><span class=\"s3\">“We became heavily present in the local music scene,” Maryana says. “We’ve heard people say that the place has Nashville vibes. And when one thinks ‘Nashville,’ barbeque definitely comes to mind.”</span></p>\n<p class=\"p6\"><span class=\"s3\">Enter the new chef &#8211; Chris Furlano, a.k.a. “Papa Duck,” as his staff calls him. Furlano brings 38 years of experience in the restaurant business. His previous ventures included the Duck Deli in New Britain, modeled after his family’s business in Duck, North Carolina. </span></p>\n<p class=\"p6\"><span class=\"s3\">“The idea is to change the concept completely,” he says of the changes in the Great Barn kitchen. “People already come here for the entertainment and the beer. The new concept will bring people specifically for the food. The food transition will be a home run.”</span></p>\n<p class=\"p6\"><span class=\"s3\">Furlano believes that the most important thing about running a successful restaurant is finding people who are really passionate about food. </span></p>\n<p class=\"p6\"><span class=\"s3\">“Without passion food is lifeless,” he says. “I’m a very passionate and creative person. Building a menu from the ground up is super exciting. The kitchen is a playground for me.”</span></p>\n<p class=\"p6\"><span class=\"s3\">With a brand new smoker as a centerpiece in the Taphouse’s kitchen, menu items such as St. Luis ribs and pulled pork are sure to make an impact, Papa Duck says. Another soon-to-be favorite is hush puppies, in which he takes special pride.  </span></p>\n<p class=\"p6\"><span class=\"s3\">“The food doesn’t have to be complicated to be good,” Furlano says.  </span></p>\n<p class=\"p6\"><span class=\"s3\">Bucks County’s only farm-to-glass microbrewery, Great Barn has been a prominent player within the beer scene since 2017. In addition to the Taphouse in Warrington, Great Barn Taproom in New Hope has been another local favorite. </span></p>\n<p class=\"p6\"><span class=\"s3\">Great Barn Brewery’s sustainable practices  help keep its carbon footprint low and result in some delicious and unique creations. The Furgusons grow their own barley on their land in Kintnersville, a former goat farm built in 1976. The grain is malted locally at the Double Eagle Malt location just 25 miles away in Huntingdon Valley. Most of the spent grain goes to feed local farm animals, while some gets composted and returned back to the fields. Great Barn’s water source is a private spring-fed well located on the property, far away from industrial pollution. The old goat barn houses the brewhouse, which runs entirely on clean wind powered energy. </span></p>\n<p class=\"p6\"><span class=\"s4\">With the help of two experienced brewers, James McGowem and Lauren Franklin, Great Barn Brewery produces beer for every taste. Its selections include a variety of seasonal and core series brews, small batch specialty ales, and year-round small batch beers. The brewery offers canned take out options at its Taphouse and Taproom locations as well as online ordering and pick up at the farm. Unexpected bonus &#8211; Maryana, a talented graphic artist and painter, designs and creates all can art. If that’s not true labor of love, what is? </span></p>\n<p class=\"p6\"><span class=\"s4\">“I’m excited for this new beginning and what it will bring,” Maryana says. “Beer. Barbeque. Bands. Life is good.” </span></p>\n<p class=\"p6\"><span class=\"s3\">For hours, menu, and schedule of musical events visit, <a href=\"http://www.greatbarnbrewery.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.greatbarnbrewery.com</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/10/DSCF2482_Original.jpeg"
}