{
  "id": 17387,
  "title": "Bucks County Symphony Orchestra Announces Its Spring Concert",
  "slug": "bucks-county-symphony-orchestra-announces-its-spring-concert",
  "date": "2023-04-15T15:49:38",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "Bucks County Symphony Orchestra",
    "Central Bucks High School South",
    "doylestown cardinal",
    "José Luis Domínguez",
    "Zhenni Li-Cohen"
  ],
  "excerpt": "<p>The Bucks County Symphony Orchestra concludes its 70th Anniversary Season with a celebratory spring concert on Saturday, April 29 at 8:00 p.m. at Central Bucks High School South in Warrington.   Maestro José Luis Domínguez and the BCSO open the concert with Johannes Brahms’ Academic Festival Overture.  Composed in 1880, this richly orchestrated piece is [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">The </span><span class=\"s2\">Bucks County Symphony Orchestra concludes its 70th Anniversary Season with a celebratory spring concert on Saturday, April 29 at 8:00 p.m. at Central Bucks High School South in Warrington. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Maestro José Luis Domínguez and the BCSO open the concert with Johannes Brahms’ Academic Festival Overture.<span class=\"Apple-converted-space\">  </span>Composed in 1880, this richly orchestrated piece is a light-hearted work that incorporates four college drinking songs popular in 19th century Germany.</span></p>\n<p class=\"p3\"><span class=\"s2\">Acclaimed pianist Zhenni Li-Cohen joins the BCSO in a performance of the melodic Piano Concerto No. 3 by Ukrainian-Polish composer Sergei Bortkiewicz, for whose music she has developed a special affinity.<span class=\"Apple-converted-space\">  </span>A Steinway Artist, Ms. Li-Cohen has been hailed by The Philadelphia Inquirer for her “gorgeous tone and mesmerizing touch.” She has performed in notable venues throughout the world, including Carnegie Hall, The Kimmel Center, and the Berliner Philharmonie.</span></p>\n<p class=\"p3\"><span class=\"s2\">The BCSO completes its concert season with Ludwig van Beethoven’s rhythmically sophisticated Symphony No. 7. <span class=\"Apple-converted-space\">  </span>Premiered in Vienna in 1813, this symphony was considered by the composer to be among his best works. The Seventh has enthralled countless listeners ever since its highly successful debut, and the second movement is one of the most revered in the symphonic repertoire.<span class=\"Apple-converted-space\">  </span>There are many who consider this to be one of Beethoven’s most joyous and optimistic works.</span></p>\n<p class=\"p3\"><span class=\"s2\">Tickets, $25 for adults and $20 for seniors, can be purchased in Doylestown at Rutherford’s Camera Shop and the Doylestown Bookshop, or online at <a href=\"http://BucksCountySymphony.org\" target=\"_blank\" rel=\"noopener noreferrer\">BucksCountySymphony.org</a>.<span class=\"Apple-converted-space\">  </span>Students are admitted free.<span class=\"Apple-converted-space\">  </span>Call 215-348-7321 or visit the website for more information.<span class=\"Apple-converted-space\">  </span> </span><span class=\"s3\"> </span></p>\n<p class=\"p4\"><strong><span class=\"s4\">About the Bucks County Symphony Orchestra <span class=\"Apple-converted-space\"> </span></span></strong></p>\n<p class=\"p3\"><span class=\"s3\">For 70 years, the Bucks County Symphony Orchestra has enriched the community with performances of classical music in local venues at affordable ticket prices. Its board members and the majority of its musicians are volunteers committed to enriching the musical arts in Bucks County and the surrounding communities. The Bucks County Symphony Orchestra continues to carry forth the mission of its founders: sharing the joy of symphonic music through live performance and educational outreach.</span></p>\n<p class=\"p3\"><span class=\"s3\">To learn more about Bucks County Symphony Orchestra visit <a href=\"http://BucksCountySymphony.org\" target=\"_blank\" rel=\"noopener noreferrer\">BucksCountySymphony.org</a>.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/Zhenni-Li-Cohen-.jpg"
}