{
  "id": 12498,
  "title": "Bucks Beautiful’s Spring Fling Gala Returns April 8th",
  "slug": "bucks-beautifuls-spring-fling-gala-returns-april-8th",
  "date": "2022-03-02T20:44:16",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live",
    "Taste"
  ],
  "tags": [
    "Barley Sheaf Farm",
    "bucks beautiful",
    "doylestown cardinal"
  ],
  "excerpt": "<p>After a two-year hiatus due to the pandemic, Bucks Beautiful is pleased to announce the return of the annual Spring Fling Gala.  The first social event of the spring season will be held at the historic Inn at Barley Sheaf Farm on Friday April 8th, 2022 at 6 pm.   “With the help of community [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">A</span><span class=\"s2\">fter a two-year hiatus due to the pandemic, Bucks Beautiful is pleased to announce the return of the annual Spring Fling Gala.<span class=\"Apple-converted-space\">  </span>The first social event of the spring season will be held at the historic Inn at Barley Sheaf Farm on Friday April 8th, 2022 at 6 pm. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">“With the help of community partners, what started as a small backyard gathering has developed into a sellout evening event,” said Gary Mathern, Board President.<span class=\"Apple-converted-space\">  </span>Guests will enjoy dining in the country elegance of the 19th Century Stone Bank Barn, located at 5281 York Road in Holicong.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">The enchanting evening will include cocktails, seated dinner, silent auction, live auction, wine pull and raffle.<span class=\"Apple-converted-space\">  </span>The Master of Ceremonies will be Emmy Award Winner Grover Silcox, PBS 39 Reporter and “Counter Culture” Host, with DJ services provided by Geoff Panettieri of Party Scene Events.</span></p>\n<p class=\"p3\"><span class=\"s2\">Proceeds will benefit our reforestation initiative RePlant Bucks, the Bulbs for Bucks daffodil plantings, scholarship and educational programs and community garden projects throughout the county.<span class=\"Apple-converted-space\">  </span>Funds raised previously allowed us to install 500 indigenous trees, 100,000 more daffodils, support new school outdoor classrooms designed with native plantings, create beautiful plantings at our nursing homes, parks, museums, war memorials and more.</span></p>\n<p class=\"p3\"><span class=\"s2\">Please RSVP as soon as possible as seating is limited.<span class=\"Apple-converted-space\">  </span>Tickets can be purchased online at <a href=\"http://www.bucksbeautiful.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.bucksbeautiful.org</a> or by phone at 215-340-3639.<span class=\"Apple-converted-space\">  </span>To become an event sponsor or donate an auction item contact <a href=\"mailto:Susan@bucksbeautiful.org\">Susan@bucksbeautiful.org</a>.<span class=\"Apple-converted-space\">  </span>Thank you for helping us grow!</span></p>\n<p class=\"p3\"><span class=\"s2\">Bucks Beautiful is a 501(c)3 non-profit organization that coordinates events, community projects and educational programs.<span class=\"Apple-converted-space\">  </span>We create partnerships with like-minded civic coalitions to develop attractive yet sustainable vistas to foster a healthier environment.<span class=\"Apple-converted-space\">  </span>Since 1991 we have worked to enhance the local landscape for residents and visitors alike by beautifying our towns, schools, parks, roadsides and pathways throughout Bucks County.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/03/Bulbs-for-Bucks.jpg"
}