{
  "id": 11161,
  "title": "Bucks County Classic: Return to Racing",
  "slug": "bucks-county-classic-return-to-racing",
  "date": "2021-07-19T22:42:49",
  "author": "Staff",
  "category": [
    "Fit",
    "Play"
  ],
  "tags": [
    "doylestown cardinal",
    "The Bucks County Classic",
    "univest grand prix"
  ],
  "excerpt": "<p>Join us on Sunday, September 12, 2021, when the USA Cycling Pro Tour races into Doylestown for the Thompson Bucks County Classic. Experience the high speed action of America’s best race in the heart of one of America’s best small towns. There’s a race for everyone at the Thompson Bucks County Classic. Pro men and [&hellip;]</p>\n",
  "content": "<p id=\"yui_3_17_2_1_1626748745969_285\" class=\"\">Join us on Sunday, September 12, 2021, when the USA Cycling Pro Tour races into Doylestown for the Thompson Bucks County Classic. Experience the high speed action of America’s best race in the heart of one of America’s best small towns. There’s a race for everyone at the Thompson Bucks County Classic. Pro men and women battling for championship points and their share of the $25,000 prize purse. Amateurs hammering for glory. Must-see children’s races. And the can’t-miss Lenape Scorcher high wheel extravaganza.</p>\n<p class=\"\"><strong>Schedule:</strong><br />\n8:30 AM | Cyclosportif<br />\n9:30 AM | Amateur Men<br />\n10:45 AM | Children’s Races &amp; High Wheelers<br />\n11:45 AM | Doylestown Health Pro Women<br />\n1:00 PM | Thompson Family Pro Men</p>\n<p>The Bucks County Classic criterium was founded in 2004 by two time American National Champion John Eustice as the second day of what was then the Univest Grand Prix. In 2014 the race expanded to include the Doylestown Health Pro Women’s race and an amateur men&#8217;s race in 2015. The race became a part of USA Cycling&#8217;s Pro Road Tour calendar in 2016. John Eustice retired in 2018 handing the race over to current director Laura Reppert. The race continues to be on the national calendar and in 2019 a women&#8217;s amateur race was added.</p>\n<p>The technical 1.4 mile loop with eight turns has attracted some of the best cyclists in the country and world as well as the up and coming stars. Many riders have gone on to compete in iconic races in the USA and abroad.</p>\n<p>The racecourse circles the <a href=\"https://dtownartsfestival.com/\">Doylestown Arts Festival</a> providing a unique chance to experience art and sport together.</p>\n<p>In addition to being home to a national race Doylestown is a certified bike friendly community with bike shops, clubs and a team, a pump track, bike racks throughout town and 25 miles of trails, shared roadways and side-paths that connect to the Pennsylvania system of trails.</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/07/image-asset.jpg"
}