{
  "id": 13798,
  "title": "Celebrating the Men in Your Life on Father’s Day",
  "slug": "celebrating-the-men-in-your-life-on-fathers-day",
  "date": "2022-06-19T10:39:17",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "Danielle Gannon",
    "doylestown cardinal",
    "father's day"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer June is the birth to warmer days, the end of the school year, the beginning of summer, and, of course, Father’s Day.  June marks a lot, and in this article, we want to focus on fathers. “I cannot think of any need in childhood as strong as [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Danielle Gannon • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><i>June is the birth to warmer days, the end of the school year, the beginning of summer, and, of course, Father’s Day.<span class=\"Apple-converted-space\">  </span>June marks a lot, and in this article, we want to focus on fathers.</i></p>\n<p class=\"p5\">“I cannot think of any need in childhood as strong as the need for a father’s protection.”<span class=\"Apple-converted-space\"> </span> &#8211; <strong>Sigmund Freud</strong></p>\n<p class=\"p6\"><span class=\"s2\">W</span><span class=\"s1\">e all have a variety of examples of men in our lives that we have looked up to. For many of us, those men have been our fathers. For others, it has been a grandfather, an uncle, a male family member, a neighbor, or a compilation of traits from different men that make up our ideal Father- figure to look up to.</span></p>\n<p class=\"p8\"><span class=\"s1\">This month, we thought it would be fun to highlight some of the local options to choose from to purchase gifts or to have experiences with the man in your life!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p8\"><span class=\"s1\">First up, <strong>Bucks County River Country</strong>. <a href=\"https://www.rivercountry.net\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.rivercountry.net</a> Located in Point Pleasant, they have tubing, kayaking, canoeing &amp; rafting. All easily accessible for river activities up the Delaware. Afterward, you can stop by <strong>Dilly’s Cafe</strong>’, an old-fashioned window-serve fast-food joint featuring classic American eats, ice cream &amp; a patio. <a href=\"https://www.dillysatcentrebridge.com\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.dillysatcentrebridge.com</a></span></p>\n<p class=\"p8\"><span class=\"s1\">Next up, we have the pond at <strong>Fanny Chapman Park</strong>, Located on Boro Mill Hill Road and East State Street, next to Fanny Chapman Pool. This pond is stocked with fish often. It’s a sweet place to bring your children, a picnic lunch, and some fishing rods. They ask that you keep it to 5 fish caught, so there’s enough for everyone!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p8\"><span class=\"s1\">If dad is a BBQ man, you can head over to Lahaska and get him some good ol’ bbq grub at <strong>Holy Que Smokehouse</strong>, 5788 Lower York Road in Lahaska (right outside of Peddler’s Village). They are an authentic wood-fired Texas bbq restaurant. They smoke brisket, pulled pork, turkey, brat, and steak daily. They start early and close when the food runs out daily! Check IG @holyquesmokes for updates!</span></p>\n<p class=\"p8\"><span class=\"s1\">If Dad is a beer guy, we have many breweries around Bucks County to choose from! One featured this month from Doylestown Boro Buzz is <strong>Warwick Brewing Company</strong>. They are located at 800 Almshouse Rd., Jamison, Pa. They have a beautiful outdoor space with picnic tables overlooking Bucks County, a tasting room, and a different food truck each day of the weekend. Check IG for the food truck of the day. @warwickfarmbrewing<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p8\"><span class=\"s1\">If you want to shop for dad, you can head into Doylestown Borough and head into <strong>Bike Works</strong>, 139 S Main Street, Doylestown, and shop for a new bike. Either he’s an active guy and has a nice bike but could use a tune-up or accessories, or likely he hasn’t had time or money to replace his bike since the 80s/90s when he was raising you. Stop in and ask for Brian; he will get you all taken care of. Then ride around town and cruise the streets, or pop your bike in the trunk and head to <strong>Peace Valley Park</strong> for a lovely day. Seven miles around Lake Galena!</span></p>\n<p class=\"p8\"><span class=\"s1\">If dad is an old skate head, you have to stop in <strong>Nomad</strong>, next door to BikeWorks., 137 S. Main Street. It’s where skateboarding, surfing, and art come together under one community shop. You can dress dad in the coolest gear and get him some new kicks, a sweet deck, and some axles. Maybe you want to suit him up with a new surfboard to surf the waves together down the Jersey Shore this summer.. whatever you had in mind; Nomad has it. If you ever heard dad speak of an Alley-Oop, this is where you want to shop for dad. IG@Nomad_supply_co</span></p>\n<p class=\"p8\"><span class=\"s1\">Another great option for dad is S<strong>omething Else Men’s</strong> at 31 State Street. They have a variety of men’s apparel, drink glasses, hats, swim trunks, and stone bracelets. Keep dad looking good!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p8\"><span class=\"s1\">If dad is more of a homebody, you can buy him a handmade hammer or a wooden spoon/spatula with little sentimental statements. Check out <strong>Wood Crafted Design at Makers off Main</strong> or see their IG for personalized orders. @woodcrafteddesigns<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p8\"><span class=\"s1\">Dads are many things: leaders, hard workers, confidantes, protectors, mechanics, plumbers, chefs, caretakers, providers, and more. Whatever the “father” in your life is to you, I hope you find the JOY in his presence and celebrate that every day, especially on the special day carved out for just that, Sunday, June 19th. Happy Father’s Day, Bucks County!</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/06/chapmanfishing.jpg"
}