{
  "id": 11259,
  "title": "Delaware Valley University Opens a Student-Run Farm Market",
  "slug": "delaware-valley-university-opens-a-student-run-farm-market",
  "date": "2021-08-22T15:29:13",
  "author": "Staff",
  "category": [
    "Live",
    "Taste"
  ],
  "tags": [
    "Delaware Valley University",
    "doylestown cardinal"
  ],
  "excerpt": "<p>Students working at the Roth Center for Sustainable Agriculture, a farm owned by Delaware Valley University, are gaining experience in agriculture while learning entrepreneurial skills. DelVal has opened a student-run farm and market in North Wales, Pennsylvania.  DelVal students produce and sell all items at the Roth Center including fruits and vegetables, pasture-raised eggs, leafy [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">S</span><span class=\"s2\">tudents working at the Roth Center for Sustainable Agriculture, a farm owned by Delaware Valley University, are gaining experience in agriculture while learning entrepreneurial skills. DelVal has opened a student-run farm and market in North Wales, Pennsylvania.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">DelVal students produce and sell all items at the Roth Center including fruits and vegetables, pasture-raised eggs, leafy greens, organic produce, beef, pork, lamb, pumpkins, flowers, and more. Students who work at the Roth Center staff and operate the farm market along with helping to maintain the property. They grow organic produce and row crops for livestock feed, and take care of cattle, goats and chickens and a donkey.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">“It is unique because it is a true student-run farm market,” said Bryce Cannon, Roth manager.<span class=\"Apple-converted-space\">  </span>“DelVal students are not only handling daily operations, but also making management decisions &#8211; calling on knowledge gained from class and learning through real-world trial and error. This type of project is exactly the kind of experience students come to DelVal for. They’re gaining relevant, real-world experience running a business.”</span></p>\n<p class=\"p3\"><span class=\"s2\">Students have been involved in all aspects of the operation from conceptualization and set up, to promotion, logistics, and sales.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">“While students are gaining experience in agriculture, they are also learning valuable skills in entrepreneurship,” said Cannon.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\">Visit the Student-Run Farm Market at Roth:</p>\n<p class=\"p3\"><span class=\"s2\">The Roth Center for Sustainable Agriculture is located on 502 Dekalb Pike in North Wales, PA, 19454. The student-run farm market is open on Fridays from noon to 7 p.m. and Saturdays from 8 a.m. to 2 p.m., June through October.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/08/DeVal-Farmers-Market.jpg"
}