{
  "id": 17021,
  "title": "Double Dribble: Twin Basketball Coaches",
  "slug": "double-dribble-twin-basketball-coaches",
  "date": "2023-03-06T18:19:35",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "Dan and Brian Loftus",
    "doylestown cardinal",
    "Nate Schneller",
    "Twin Basketball Coaches"
  ],
  "excerpt": "<p>By Nate Schneller • The Cardinal Editorial Intern Recently, I had the privilege of speaking with Doylestown locals Dan and Brian Loftus. Both Loftuses work in finance, but they are also basketball coaches in their spare time. They also happen to be identical twins, which I think is neat.  Native Doylestownians, Brian and Dan graduated [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Nate Schneller • </strong>The Cardinal Editorial Intern</p>\n<p class=\"p3\"><span class=\"s2\">R</span><span class=\"s3\">ecently, I had the privilege of speaking with Doylestown locals Dan and Brian Loftus. Both Loftuses work in finance, but they are also basketball coaches in their spare time. They also happen to be identical twins, which I think is neat.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Native Doylestownians, Brian and Dan graduated from Central Bucks West. While there, they both played on the basketball team. Basketball was a major part of family life for the Loftuses. “We’ve been playing all our lives,” Dan tells me. Their Dad was also a coach, and the rest of their family enjoyed the game as well.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Playing basketball was a slightly different experience for the Loftuses. There was some locking of horns between the brothers as they sometimes played on the same team. “Competition with a capital C,” Dan says. Brian adds, “our mother wouldn’t let us keep score in a 1v1 because there’d be a fight.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">While competitive, playing on the same team also gave the brothers an advantage. “Being able to trust a teammate who’s your brother is something not everyone experiences,” says Brian. Both did very well for themselves playing basketball.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">After playing together at West, the brothers continued to play in college. Dan played for the university of Scranton and Brain for Elizabethtown College. They both served as captains of their teams, and both scored “a thousand points.” For someone who can barely dribble the ball, I find that pretty impressive.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Eventually, the two stopped playing basketball, but that didn’t mean they were finished with the game. Once their children started to play, the brothers decided to become coaches. “It was a natural transition to teaching these kids these skills with 30 years of experience with practices,” says Dan. Over the years, Brian and Dan coached teams for the YMCA, DAA, and CYO.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The Loftuses love being able to teach basketball. They see it not only as a game but as a way to teach kids life skills. “When they’re young, skills and teamwork are what we work on,” says Dan. They then work on improving those skills and teach the kids how to be competitive, communicate, deal with adversity, and work as a team.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">It was a great opportunity to talk to Brian and Dan Loftus. I very much appreciate their approach to teaching basketball. They care greatly about the sport, and the people playing it. “We look forward to the boys and girls we coach to succeed in whatever activities they choose,” says Brian. “We love seeing the kids be active and succeed in the game we love.”</span></p>\n<p class=\"p7\"><i>“Brian and Dan coach my son Henry and I’m constantly in awe of their dedication and commitment to all the boys on the team. Henry has not only expanded his knowledge and skills this season, but consistently learns by example from their integrity. They are such kind and authentic guys and I feel very lucky Henry is a part of the team and is being coached by the best of the best!”<span class=\"Apple-converted-space\"> </span></i><span class=\"s4\"> –<span class=\"Apple-converted-space\">  </span>Meghan Kelly</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/03/Loftus-Dan-left-and-Brian-right.jpg"
}