{
  "id": 11535,
  "title": "Doylestown Haunts: Are Ghosts Real?",
  "slug": "doylestown-haunts-are-ghosts-real",
  "date": "2021-10-13T20:58:28",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live",
    "Stay",
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "Doylestown Haunts",
    "Doylestown Historical Society",
    "michelle wire",
    "Michener Art Museum"
  ],
  "excerpt": "<p>By Michelle Wire • Special to The Cardinal When we first moved to Doylestown almost a decade ago, we fell instantly in love with the unique and quirky shops and the vibrant people. We spent much time in the borough strolling through the neighborhoods taking in the architecture, the gardens and the cemetery, absorbing the [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Michelle Wire • </strong>Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">W</span><span class=\"s1\">hen we first moved to Doylestown almost a decade ago, we fell instantly in love with the unique and quirky shops and the vibrant people. We spent much time in the borough strolling through the neighborhoods taking in the architecture, the gardens and the cemetery, absorbing the long history and interesting characters resting there.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">We couldn’t help but wonder about the history that’s rarely spoken about or shared: the haunted history. After attending many walking tours, trolley tours and historic tours everywhere from Gettysburg to Salem, we were always curious of what other wonders Doylestown held. After a firsthand experience with a ghost right here in town, we decided that this was the year that we’d do some deep digging into our boroughs alternate history. It seemed long overdue for such a distinguished small town.</span></p>\n<p class=\"p5\"><span class=\"s1\">As soon as we started digging, we were delighted to find out what colorful history has peppered our town over the years and we’ve only just scratched the surface. Thomas Hargrave? Talented tombstone craftsman whose work graces not only Doylestown Cemetery but also Laurel Hill. Pearl S. Buck? Notable author, humanitarian and keeper of a haunted home. A twice buried accused murdered? Yes, we have one of those as well.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">We began to collect stories about some of the more well-known haunts: Mom’s, the Fountain House (Starbucks building) and the Doylestown Inn. But then more began to trickle in: people sharing stories of hauntings in their homes including phantom footsteps and disembodied voices. We discovered how the 1918 Pandemic impacted Doylestown and how Washington encamped here. We read about the Witch of the Woods near Fonthill, and another in Buckingham. Or perhaps it’s the very same one?<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">We’ve been fascinated to hear of how many people have seen and felt Laura of Fonthill, who passed away in the castle in 1975. For those who may not know, Fonthill was the home of Henry Chapman, and housed his extensive collection of artifacts collected along his travels across the world. Fonthill is an extensive concrete structure consisting of 44 rooms, over a dozen fireplaces and 10 bathrooms! The castle was eventually left to the housekeeper Laura and her husband Frank Swain after Henry Mercer passed on. While I haven’t heard as many stories of his presence in the castle (though there are some), I have heard repeatedly that she still roams the halls as if still tasked with leading tours and keeping the castle operations running smoothly. She even helps by turning on the lights.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Michener Art Museum was formerly a prison. As a child, I visited the prison when it closed and knew immediately that not every soul left that building quietly when it closed. It was host to two hangings, rife with illness and disease and mayhem prior to it eventually being “reformed” into what would become known as the Pine Street Hotel.<span class=\"Apple-converted-space\">  </span>But the stories have persisted long past its closure and new life as an art museum.<span class=\"Apple-converted-space\">   </span></span></p>\n<p class=\"p5\"><span class=\"s3\">While working with the Doylestown Historical Society, what we have found most amazing while digging up these stories is how many layers there are to our buildings and history here. Rarely was a building used for one simple purpose. Rather, it was a home, a shop, a practice, a shoe store, or a milliner or a garage. We have only started to peel back the layers of dozens and sometimes hundreds of years of Doylestown alternate history.</span></p>\n<p class=\"p5\"><span class=\"s1\">If ghost stories, untold history and a slight bend towards the macabre is what you’re looking for this Halloween season, please consider joining us on a haunted history tour. We’ve picked out the most interesting hauntings to share on our tours that begin this fall.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">Join us Friday or Saturday nights at 6:30. We will begin in the courtyard behind the Doylestown Historical Society at 56 South Main Street. We will visit various locations<span class=\"Apple-converted-space\">  </span>in town before ending at Hops/Scotch in the Main Street Marketplace. Please wear comfy shoes and expect to spend an hour with us.</span></p>\n<p class=\"p5\"><span class=\"s1\">Tickets will be posted through the Doylestown Historical Society’s website or visit us on our Facebook page under Doylestown Haunts. Tickets will be $10 with all proceeds going to the historical society.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">If you have your own ghost story to tell, please email us at <a href=\"mailto:doylestownhaunts@gmail.com\">doylestownhaunts@gmail.com</a>.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/10/Witches.jpg"
}