{
  "id": 17749,
  "title": "Doylestown Celebrates Juneteenth",
  "slug": "doylestown-celebrates-juneteenth",
  "date": "2023-06-16T16:52:34",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "Juneteenth",
    "Sheela Rai"
  ],
  "excerpt": "<p>By Sheela Rai  • The Cardinal Contributing Writer On Sunday, June 18th, 2023, Doylestown will celebrate its Second Annual Juneteenth Celebration at the Mercer Museum from 10:30am–4:00pm.  Juneteenth, a federal holiday, is a celebration of freedom and Black resilience. While enslaved African Americans had been emancipated in 1863, the practice of slavery continued in many [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><b><em>By Sheela Rai</em><span class=\"Apple-converted-space\">  • </span></b></span><span class=\"s1\">The Cardinal Contributing Writer</span></p>\n<p class=\"p3\">On Sunday, June 18th, 2023, Doylestown will celebrate its Second Annual Juneteenth Celebration at the Mercer Museum from 10:30am–4:00pm.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\">Juneteenth, a federal holiday, is a celebration of freedom and Black resilience. While enslaved African Americans had been emancipated in 1863, the practice of slavery continued in many states. It was not until two years later, on June 19, 1865, when Union soldiers arrived at Galveston, Texas, that Black residents learned of the abolishment of slavery and all those who were still enslaved went free. The year after, on June 19, 1866, the first official Juneteenth celebrations took place. It included prayers and celebrations. Despite political attempts to suppress the celebrations, that tradition continued.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\">Juneteenth saw its revival through the Civil Rights movement and leading up to 2021 when it was declared a federal holiday. Today, Juneteenth celebrations include prayer, services, speeches, education, music, food, art, and dancing. It is a day to celebrate for all Americans, for Juneteenth represents living up to our Constitution, and the ideals of liberty and justice for all.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\">Last June, Doylestown held its first Juneteenth celebration, hosting over 1,000 community members. To learn more about the event, I spoke with the lead organizers: Angela Nutter, lead of the Doylestown Juneteenth Organization, Kevin E Leven from Bucks County Anti-Racism Coalition (BCARC), and Adrienne King from the PairUP Society.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\">When Nutter, Leven, and King came together to plan the first celebration here in Doylestown, their goal was that education and representation would be cornerstones of the event. The three had all only learned of Juneteenth in adulthood. Education, about the history, triumphs, and progress Black Americans have made, is central to the celebration. <span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\">Reflecting on last year’s success, King shared that it was a surreal “pinch me” moment. People kept coming and coming. Black community members in their 60s, 70s, and 80s shared how grateful they were and how meaningful it was to have an event like this in their hometown.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\">Nutter shared that she had so much positive feedback for the event representation. A community member came up to her to share, “Never in my life did I expect something like this in Doylestown.” Folks had traveled hundreds of miles for the event. Many shared that they had moved from this area because it hadn’t felt like home, and this type of event showed what had been missing.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\">For Leven, the event meant presence. There were so many Black people, Black vendors, sharing in the experience in a place where they are so often underrepresented. It was an opportunity to share how Black Americans have shaped Bucks County historically and continue to shape our community today.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\">This year, the day will kick off with a service under the tent on Mercer Green, led by the Second Baptist Church of Doylestown. “Faith is a cornerstone of the event, as it holds great historical significance in Black Community,” Nutter says. Inside the museum, there will be two speakers. One will speak on Black emancipation. The other, from the Bucks County NAACP, will give a call to action, specifically around how current events, including suppression of Black History, impact us locally. <span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\">Outside on the Green, social events, music, the announcement of scholarship winners from Black organizations, vendors, food, and children’s activities will take place. You can look forward to an Underground Railroad scavenger hunt and an interactive art piece to connect the holiday with history. <span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\">If you are looking for some good reads leading up to the holiday, Leven recommends authors Isabel Wilkerson and Heather McGhee. Both have shaped his understanding of racism and inequality and their impact on all Americans.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\">As the Juneteenth organizers emphasized, the holiday is about Black joy and triumph. However Black history education remains equally important as well as the understanding of how that history remains part of our collective American history.<span class=\"Apple-converted-space\"> </span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/06/image5.jpeg"
}