{
  "id": 17461,
  "title": "Earth Day . . . Every Day",
  "slug": "earth-day-every-day",
  "date": "2023-04-16T15:07:46",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "Earth Day",
    "Gemma Scott",
    "Natalya Bucuy"
  ],
  "excerpt": "<p>By Natalya Bucuy • The Cardinal Managing Editor Take. Make. Throw.  The journey of a simple soda demonstrates the default linear path. We take aluminum out of the Earth, make it into a soda can, then throw it in the trash, often after only a single use. When it comes to our relationship with the [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><strong>By Natalya Bucuy</strong> • </span><span class=\"s1\">The Cardinal Managing Editor</span></p>\n<p class=\"p3\"><span class=\"s3\">Take. Make. Throw.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">The journey of a simple soda demonstrates the default linear path. We take aluminum out of the Earth, make it into a soda can, then throw it in the trash, often after only a single use. When it comes to our relationship with the environment, we can always do better. And not just on Earth Day, which we celebrate on April 22 this year, but every day.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">“To make us more sustainable, we need to move away from this take, make, throw economy to a more circular one,” says Gemma Scott, a Doylestown recycling and waste management expert. “We can prevent trash and pollution, keep products in use for longer, and restore nature, not just do less harm.”</span></p>\n<p class=\"p4\"><span class=\"s2\">Scott, who has worked in the recycling industry both locally and internationally, advocates small steps for business owners and consumers. Incorporating simple practices can help reduce waste as well as save costs for business owners, she says.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Strategic and efficient use of raw materials can help decrease waste and save money. For example, kitchens can save as much as 20 percent in food costs by not over-producing, Scott says. Removal of single-use packaging, utilizing e-receipts instead of paper ones, and double-siding printed business materials are all moves in the right direction.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">“Whilst some sustainable products, such as cleaning products, organic produce, and recycled paper are more expensive, a business’ use of these products can serve as a marketing tool to appeal to environmentally conscious customers,” Scott says.</span></p>\n<p class=\"p4\"><span class=\"s2\">Turns out, some local organizations and businesses already practice sustainability in unique and creative ways. Here are some examples.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><strong><span class=\"s5\">Doylestown Borough.</span></strong><span class=\"s2\"> Our town employs a number of green initiatives. In 2017, the Borough established a Green Building Incentive program. The program encourages cost-effective and sustainable building methods that conserve fossil fuels, water, and other natural resources. It also promotes the reuse and recycling of construction materials and reduces solid waste. Building permit applicants can receive Green Points for specific sustainable building practices and then use them to reduce permit fees.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">In December 2022, to reduce the impact of plastic waste the Borough Council passed an ordinance that prohibits single-use plastic bags at retail establishments and restaurants within the borough. The ordinance restrictions take effect on June 23, 2023.</span></p>\n<p class=\"p4\"><strong><span class=\"s5\">Bucks County Community College.</span></strong><span class=\"s2\"> The institution puts forth environmentally-friendly efforts in various areas of operation. Its campuses use large containers for single-stream recycling and compost tumblers that transform cafeteria food waste into mulch. The college’s </span><strong><span class=\"s5\">Printing Action Team</span></strong><span class=\"s2\"> assesses the environmental and financial impact of printing behaviors at the college and encourages double-sided printing. Recently, the college increased the use of video conferencing to reduce employee travel among three campuses. The Lower and Upper Bucks Campus facilities and the new Linksz Pavilion in Newtown use geothermal energy for heating and cooling. Some of the Upper Bucks Campus buildings have green roofs. Recently, the college also installed two solar-powered roof ventilators.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s5\"><strong>Nourish by Mama</strong>.</span><span class=\"s2\"> This local-favorite take-out eatery offers wholesome and nutritious breakfast and lunch selections. And its owner, Kendall Bajek, takes sustainability quite seriously.</span></p>\n<p class=\"p4\"><span class=\"s2\">Nourish uses local and organic ingredients whenever possible and does not use any GMO products. “We make sustainable business decisions that minimize our negative impact on the environment and also support other local businesses in the community,” Bajek writes on her website.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Smaller businesses in the community don’t fall short in their sustainability efforts. </span><strong><span class=\"s5\">In Full Swing </span></strong><span class=\"s1\">thrift shop sells and recycles donated clothes. The non-profit serves </span><strong><span class=\"s5\">A Woman’s Place</span></strong><span class=\"s1\">, the domestic violence organization, and keeps millions of pounds of textiles out of the landfill.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s5\">Spray Away Power Washing</span></strong><span class=\"s1\"> company deems chemicals unnecessary and does not use any in its operations. A Chalfont-base landscape firm </span><strong><span class=\"s5\">4B Landscape &amp; Construction</span></strong><span class=\"s1\"> has eliminated herbicide use in garden beds and along curb edges. A snow removal firm </span><strong><span class=\"s5\">Versatile Snow &amp; Ice Management</span></strong><span class=\"s1\"> has reduced the amount of chlorides used for snow and ice management by switching to brine, which reduces salt usage by 70%.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><strong><span class=\"s5\">Crossing Vineyards and Winery</span></strong><span class=\"s2\"> in Washington Crossing utilizes solar power, geothermal heating and cooling, and reusable bags for purchases. Guilt-free wine? Yes, please!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Local Stonemason, </span><strong><span class=\"s5\">Tony Dovidio</span></strong><span class=\"s2\">, says his company only uses reclaimed stone and bricks. “We typically only use lime mortars as they are carbon neutral and environmentally friendly for the home and the world,” Dovidio says. “We also use a carbon-negative insulation that’s been around for about 1000 years and will keep the home fireproof, draw carbons from the air, and is mold mildew and pest proof.”</span></p>\n<p class=\"p4\"><span class=\"s2\">Whatever businesses and individuals do to practice sustainability in everyday life can help our planet. Every little bit matters. So, let’s celebrate Earth Day not just on that one day in April, but every single day. What will you do with that soda can when you’re done with it?<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/Earth-Day-photo-illustration-e1681672061992.jpg"
}