{
  "id": 12748,
  "title": "Earth Day: 6 Little Ways to Make a Big Impact on our Planet",
  "slug": "earth-day-6-little-ways-to-make-a-big-impact-on-our-planet",
  "date": "2022-04-13T11:19:05",
  "author": "Staff",
  "category": [
    "Live",
    "Taste"
  ],
  "tags": [
    "BCS Compost",
    "Brian Schneider",
    "doylestown cardinal",
    "Earth Day",
    "jess ramoy",
    "kona compost"
  ],
  "excerpt": "<p>By Jess Ramoy • The Cardinal Contributing Writer In honor of Earth Day, the Cardinal thought it would be essential to feature a story about sustainable living. I started brainstorming about which of our fabulous writers would be a good fit for this article. Then, throughout the day, I started noticing all the minor sustainability [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><strong>By Jess Ramoy</strong> • </span><span class=\"s1\">The Cardinal Contributing Writer</span></p>\n<p class=\"p3\"><span class=\"s3\">In honor of Earth Day, the Cardinal thought it would be essential to feature a story about sustainable living. I started brainstorming about which of our fabulous writers would be a good fit for this article. Then, throughout the day, I started noticing all the minor sustainability changes I’ve made personally throughout my home.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">I realized I’ve been making small transitions to live more sustainably over the past several years after taking an Environmental Science class in college. The biggest arguments my husband and I have are when he doesn’t rinse out the recycling. This year, a counter-top compost bin was the only thing on my Christmas wish list.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">Needless to say, I realized that I should probably write this one myself. I still make mistakes, and there’s always room for improvement, but I’m hoping some of these tips will resonate with you and allow you to see how easy it can be to take a step into more sustainable living.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><strong><span class=\"s4\">1) Go Back to the Bar. </span></strong><span class=\"s5\">I don’t know about you, but bar soap was the only option in my bathroom when I was younger. Dove and Irish Spring bars were my family’s bars of choice. Many of us now gravitate toward plastic bottles of shower cleansers. This may seem easier and more enticing with the clever marketing on the bottles that claim they produce silky, hydrated, smooth, and soft skin.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">But what if we went back to the bar and eliminated all that plastic waste that we accumulate throughout the year, not to mention a lifetime. There are so many great all-natural bar options, including many at our very out Doylestown Farmers Market! If you want to take it a step further, they even make shampoo and conditioner bars.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><strong><span class=\"s6\">2) Treat your fanny right.</span></strong><span class=\"s7\"> America leads the world in toilet paper consumption. According to Word Count, 712,000,000 trees are cut down each year to produce toilet paper. There are a couple of options here to cut down on your impact. The first option is simple, use recycled toilet paper. You can find these at almost every grocery store.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">Another option is to switch to bamboo toilet paper, which is much more sustainable, as bamboo trees can be replenished in as little as three months versus up to 7-12 years with a typical hardwood or softwood typically used. I use Who Gives a Crap, a subscription-based company that delivers TP to your door each month.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s8\">Lastly, try a bidet. These toilet gadgets gained popularity back in 2020 during the toilet paper shortage, and for a good reason. Using a bidet can cut toilet paper use up to 75%. Or pair the bidet with reusable toilet paper and cut toilet paper waste by 100%! Plus… there’s no better feeling than a clean tush.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><strong><span class=\"s9\">3) Get into the Sheets.</span></strong><span class=\"s3\"> I’m referring to laundry sheets here! This is one of the most recent transitions I made, and my clothes and I feel great about it! It’s estimated that only about 30% of laundry detergent bottles are recycled correctly. That means 70% of our laundry detergent jugs are sitting in landfills, taking anywhere from 70 to 450 years to decompose!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">You can try to get every last drop of that sticky, soapy substance out of the bottle and hope for the best, or a more assuring way is to make the switch to a more sustainable option. I use Earth Breeze sheets, but there are plenty of options online for your specific laundry needs.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><strong><span class=\"s9\">4) Show up Prepared.</span></strong><span class=\"s3\"> This is probably the most well-known tip, yet it’s one that I occasionally struggle with. The advice is simply to show up prepared. Reusable coffee cups, bags, to-go containers, water bottles, silverware are all tools to help minimize your waste. It’s as simple as bringing your reusable coffee cup out with you for your latte downtown or keeping an extra water bottle in your car for that stop at the gym.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s5\">Be the weirdo and bring your Tupperware when you go out to eat. Pack your lunch to minimize to-go waste. This only takes a couple of extra minutes in your day to slow down and to make sure you’re showing up with everything you need to eliminate or at least minimize your usage of single-use products.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><strong><span class=\"s10\">5) Be a Snob at the Grocery Store.</span></strong><span class=\"s11\"> We have so many decisions to make each time we step foot into the grocery store. One of the most significant ways to make an impact at the grocery store is how we buy our meat. According to the EPA, conventionally raised meat causes about 14.5% of our overall greenhouse gas emissions. That’s why a new way of agriculture is making its way into our grocery stores. Regenerative agriculture encompasses organic farming, crop rotation, pasture-raised animals, composting, water conservation, and soil health. It removes carbon from our atmosphere rather than emitting it!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">Be an avid reader when it comes to the labels on your meat. Or, better yet, buy your meat at local farms that you trust, like Tussock Sedge Regenerative Farm in Perkasie. There are also delivery services with the highest quality meat, like Butcher Box. An alternative (less expensive) option is to skip the meat occasionally. A spicy bean chili, vegan Thai or sweet potato, and bean burritos are some of my family favorites.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><strong><span class=\"s6\">6) Lay off the Almond Milk, You Ignorant Hipsters</span></strong><span class=\"s7\"><strong>.</strong> This is the title of an article by reporter Tom Philpott. It caught my attention several years ago. This was hard for me, as I was one of those “ignorant hipsters” for years! According to the Office of Sustainability, it takes 15 gallons of water to produce just 16 almonds, and 80% of almonds are grown in drought-stricken California. Luckily now, there are several more sustainable dairy-alternative options available. Some of my family’s favorites are pea-protein milk, macadamia milk, and oat milk.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">You can make many more changes in your daily life to live more sustainably, including composting, growing a garden, switching to a greener energy source, shopping local, shopping second-hand, etc. But for the sake of word count, I’ll end it there and leave you with an Earth Day Quote. “You cannot get through a single day without having an impact on the world around you. What you do makes a difference, and you have to decide what kind of difference you want to make.” — </span><span class=\"s9\">Jane Goodall</span></p>\n<h2 class=\"p1\"><span style=\"color: #993300;\"><strong>Save our Soil</strong></span></h2>\n<p class=\"p1\"><b>By Brian Schneider • </b>Founder of BCS Compost</p>\n<p class=\"p3\"><span class=\"s2\">Ensuring that our soil is rich and healthy is key for a healthier planet. In the last 40 years, 40% of the worlds topsoil has been lost. Nearly the size of England of farmable land is degraded each year. Protecting our soil for future generations should be at the top of list of environmental disasters. This may sound overwhelming but with a strong community we can make a difference.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><b>What can we do to revitalize our soil?<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p5\"><span class=\"s2\">Compost is the return of organic materials to rich, stable humus like material. Composting is nature’s way to feed our starving soil and combat climate change. People have been tilling the same ground for generations adding nothing but chemical fertilizers slowly killing our soil. If you want to preserve soil, then we must add organic material back into the ground. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">We throw away vital organic materials every day that could be replenishing our soil. Composting food waste, cardboard, paper and other organics reduces landfill space by 50%. We decrease methane gases and regenerate a probiotic for the soil.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">By adding a few inches of humus to the soil, it helps increase carbon sequestration and plant production. Humus can capture carbon dioxide from the atmosphere and store it within the ecosystem. Soil is the most logical place for excess carbon.<span class=\"Apple-converted-space\"> </span></span></p>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2022/04/BCS-Compost.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-12750\" src=\"https://doylestowncardinal.com/wp-content/uploads/2022/04/BCS-Compost.jpg\" alt=\"\" width=\"526\" height=\"596\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2022/04/BCS-Compost.jpg 526w, https://doylestowncardinal.com/wp-content/uploads/2022/04/BCS-Compost-265x300.jpg 265w\" sizes=\"auto, (max-width: 526px) 100vw, 526px\" /></a></p>\n<p class=\"p4\"><b>Composting Tips</b></p>\n<p class=\"p5\"><span class=\"s2\">Whether you’re just starting out or have been composting for years there are common mistakes and how to fix them.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Composting involves 3 variables: oxygen, water, organic material.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\"><b>1) Balancing your browns and greens. </b></span><span class=\"s2\">When you compost, you need a balance of both brown and green materials. Brown materials are dry and rich in carbon. Think newspaper shreds, dried leaves, and twigs. Green materials are wet and rich in nitrogen, and include things such as kitchen scraps, grass clippings, coffee grounds, and fresh leaves.</span></p>\n<p class=\"p5\"><span class=\"s2\">If you have too many green materials in your compost, your compost could become too wet causing it to become anaerobic. Too many brown materials might be too drying and take a lot longer to break down. If you notice your compost is really mushy and smells foul, add more brown materials. If it looks dry, add more green materials and some water to moisten the mix.</span></p>\n<p class=\"p5\"><span class=\"s3\"><b>2) Aeration and agitation.</b></span><span class=\"s2\"> Consistent air and frequent agitation or turning are best management practices. Without a sufficient amount of oxygen, the process could slow down.</span></p>\n<p class=\"p5\"><span class=\"s3\"><b>3) Adding non-compostable materials to your compost. </b></span><span class=\"s2\">There are tons of materials that can be composted but also other materials that can’t. Throwing away fruits and vegetables, make sure you peel off stickers, labels and rubber bands. Make sure no plastics or “compostable” items such as utensils and cups. They require high industrial temperatures that home compost pile won’t be sufficient.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Whether you’re a farmer or home gardener humus is the solution to enhance our soils. Regenerative practices within our communities shows we have the power to take action and change our world.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">For more info:<span class=\"Apple-converted-space\">  </span><a href=\"https://bcscompost.com\" target=\"_blank\" rel=\"noopener noreferrer\">https://bcscompost.com</a></span></p>\n<h2 class=\"p1\"><span style=\"color: #993300;\"><b>Kona Compost Digs Right In!</b></span></h2>\n<p class=\"p1\"><b>What is composting?</b></p>\n<p class=\"p2\"><span class=\"s1\">You may have heard of composting, but what exactly is it? Simply put, composting is taking your organic waste (think food scraps &amp; yard trimmings) and transforming it to a usable soil amendment that adds nutrients to your plants, builds your soil and nourishes your gardens.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>Why is it so important?</b></p>\n<p class=\"p2\"><span class=\"s2\">An astounding 50% of what we throw away is compostable (according to the ILSR). What most people don’t realize is that your food scraps DO NOT breakdown in the landfill. In fact, they create methane gas which is harmful to our environment and overall wellbeing.<span class=\"Apple-converted-space\"> </span></span></p>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2022/04/KonaCompost_FinishedCompost.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-12751\" src=\"https://doylestowncardinal.com/wp-content/uploads/2022/04/KonaCompost_FinishedCompost.jpg\" alt=\"\" width=\"1470\" height=\"1103\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2022/04/KonaCompost_FinishedCompost.jpg 1470w, https://doylestowncardinal.com/wp-content/uploads/2022/04/KonaCompost_FinishedCompost-300x225.jpg 300w, https://doylestowncardinal.com/wp-content/uploads/2022/04/KonaCompost_FinishedCompost-768x576.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2022/04/KonaCompost_FinishedCompost-1024x768.jpg 1024w, https://doylestowncardinal.com/wp-content/uploads/2022/04/KonaCompost_FinishedCompost-74x55.jpg 74w, https://doylestowncardinal.com/wp-content/uploads/2022/04/KonaCompost_FinishedCompost-111x83.jpg 111w, https://doylestowncardinal.com/wp-content/uploads/2022/04/KonaCompost_FinishedCompost-215x161.jpg 215w, https://doylestowncardinal.com/wp-content/uploads/2022/04/KonaCompost_FinishedCompost-990x743.jpg 990w, https://doylestowncardinal.com/wp-content/uploads/2022/04/KonaCompost_FinishedCompost-1320x990.jpg 1320w\" sizes=\"auto, (max-width: 1470px) 100vw, 1470px\" /></a></p>\n<p class=\"p1\"><b>How do you do it?</b></p>\n<p class=\"p2\"><span class=\"s2\">Thankfully, anyone can compost whether you live in an apartment, townhome, single family home, etc. There are a number of options available, so depending on space &amp; desired level of effort, anyone can easily make a difference. Here are a few ways to compost:</span></p>\n<p class=\"p4\"><span style=\"color: #993300;\"><b>3-Bin System</b></span></p>\n<p class=\"p2\"><span class=\"s2\">This is great for someone with a yard &amp; who generates a moderate amount of waste. You will need to turn your compost pile occasionally to mix your ingredients (carbon &amp; nitrogen) so that everything breaks down quickly and effectively.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span style=\"color: #993300;\"><b>Tumbling Bin</b></span></p>\n<p class=\"p2\"><span class=\"s2\">If you have a smaller yard, or prefer to have a fully enclosed system, this option is for you. Add your food scraps &amp; carbon and give it a spin to mix everything together. There are various sizes of tumblers available but generally if you don’t produce a lot of waste consider going this route.</span></p>\n<p class=\"p4\"><span style=\"color: #993300;\"><b>Worms</b></span></p>\n<p class=\"p2\"><span class=\"s2\">Also known as vermicomposting, this method utilizes Red Wiggler worms in an enclosed bin to break down your food waste. Great for anyone, but especially for apartments. Don’t worry, your worms stay in their enclosure.</span></p>\n<p class=\"p4\"><span style=\"color: #993300;\"><b>Curbside Composting</b></span></p>\n<p class=\"p2\"><span class=\"s2\">Here’s where Kona Compost comes into play! You put your scraps in our bin &amp; we do the rest. We’re basically your organic trash service.</span></p>\n<p class=\"p2\"><span class=\"s2\">We all play a role in ensuring our communities and ecosystem are healthy. Whichever option you choose, know that your efforts are creating a sustainable future for yourselves and the next generation.</span></p>\n<p class=\"p1\"><b>A bit more about Kona Compost:</b></p>\n<p class=\"p2\"><span class=\"s2\">Kona Compost is a woman-owned company that’s here to make composting easy. We are a curbside pick-up service that gives everyone the opportunity to make a difference without getting dirty.</span></p>\n<p class=\"p1\"><b>Here’s how it works:</b></p>\n<p class=\"p5\"><b>1.</b> Register for service<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\"><a href=\"https://accounts.konacompost.com/create-account/\" target=\"_blank\" rel=\"noopener noreferrer\">https://accounts.konacompost.com/create-account/</a></p>\n<p class=\"p5\"><b>2.</b> Receive a 5-gallon bucket for your food scraps &amp; compostable waste</p>\n<p class=\"p5\"><b>3.</b> Put your bucket out by the curb &amp; we’ll empty it</p>\n<p class=\"p5\"><b>4.</b> Receive compost back for your garden or we’ll donate it on your behalf</p>\n<p class=\"p5\"><b>5.</b> Feel good about making our planet that much better!</p>\n<p class=\"p5\">Want to learn more or have questions?<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\">Visit us at <a href=\"http://www.konacompost.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.konacompost.com</a> &amp; give us a follow @konacompost</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/04/Earth-Day-Logo.jpg"
}