{
  "id": 12150,
  "title": "Embrace The Cold",
  "slug": "embrace-the-cold-2",
  "date": "2022-02-05T17:58:58",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "colin kirts",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Colin Kirts • The Cardinal Contributing Writer Every year, it’s the same thing. We rotate around the sun, spinning and tilting this way and that. The ground softens and hardens, and it rains and snows. This pattern is what makes it cold here right now. It’s partly an effect of the inevitable tilting away [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Colin Kirts • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">E</span><span class=\"s1\">very year, it’s the same thing. We rotate around the sun, spinning and tilting this way and that. The ground softens and hardens, and it rains and snows. This pattern is what makes it cold here right now. It’s partly an effect of the inevitable tilting away from the sun. It’s a predictable rhythm and cycle. As such, every year, we are faced with a choice of how to react. Do we like the cold? Do we fear it? Should we avoid it?</span></p>\n<p class=\"p5\"><span class=\"s1\">All extremes are dangerous, of course. Heat. Water. Heck, you can even have too much oxygen.</span></p>\n<p class=\"p5\"><span class=\"s1\">The extreme of avoidance is no less concerning, though. For thousands of years, we have had to figure out how to be with the cold. The bottom line is, despite our best efforts, we must deal with it. The question is, do we embrace it or not? Do we choose to welcome it or to avoid it? No matter what your answer is, just like there is no avoiding gravity and its effects, we must have a relationship with the cold.</span></p>\n<p class=\"p5\"><span class=\"s1\">I’ve personally been choosing to embrace the cold since 2009. I can attest to the many physiological benefits. The most “google-able” ones are, in short, circulation/blood-flow and mental health, vagus nerve/polyvagal theory, and the mammalian dive reflex. There’s also intriguing information about the effect of cold immersion on mitochondria and managing certain autoimmune disorders.</span></p>\n<p class=\"p6\">On that note, knowing this is a process for all of us, what do we do? How do we start?</p>\n<p class=\"p5\"><strong><span class=\"s3\">1st,</span></strong><span class=\"s1\"> as I just suggested, consider that your relationship with the cold is in part psychological. Yes, we feel the cold, but the meaning we project upon it is a choice. We all can choose to see the cold as an enemy or as a teacher. It can be dangerous, but it also can be revitalizing. It can kill you, but it may show you something necessary. Regardless, it’s a choice.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>2nd</strong>,</span><span class=\"s1\"> if you need to modify your beliefs in this regard, then start by going outside regularly with, yes, less clothing. No, not naked; you don’t need to embarrass your family and neighbors. Just find a private moment, perhaps at night, and give it a go.</span></p>\n<p class=\"p5\"><strong><span class=\"s4\">3rd,</span></strong><span class=\"s5\"> if that’s easy enough, take a cold shower. You can add cold water at the beginning or end of your regular shower, or you can take a cold shower. Yup, that’s a thing.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">4th,</span></strong><span class=\"s1\"> it’s ice bath time! How? Where? Well, at KORU, of course! Why at KORU? Right next to the baths, we have a 200-degree sauna to warm you back up, but mainly because we’ll safely guide you.</span></p>\n<p class=\"p5\"><span class=\"s1\">If you can’t tell, at KORU, the focus is context. Although they seem legitimate, we are not as focused on the physiological benefits. We are focused on the WHY. Why does cold immersion matter, and what does it mean for us as animals on this planet?</span></p>\n<p class=\"p5\"><span class=\"s5\">Again, we are all experiencing the same predictable cycles, rhythms, and patterns. Of course, we experience them in our unique ways. However, they are essentially the same.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">No matter, start with what’s simple. Don’t force yourself; force rarely works for creating a sustainable shift. If you genuinely want to embrace the cold and create an empowering—not forceful—relationship with it, even though you may resist it and it may be challenging, start with what’s easy.</span></p>\n<p class=\"p5\"><span class=\"s1\">Slow and deepen your breath. Relax your shoulders, your jaw, and your brow. Trust you that you can do it in your way. Then, when you feel ready, take a step, and go play in the cold!</span></p>\n<p class=\"p5\"><span class=\"s1\">Eventually, it may even be fun.</span></p>\n<p class=\"p7\"><i>KORU Real Wellness is a somatic education center, founded by Colin Kirts and Alex Siegel in 2018. It is home to the Movement Matters Podcast as well as the Real Wellness Education Model. As Alex and Colin like to say, “Be good, do your best, and have fun.” With this spirit, at the very least, KORU is a place where you can relearn to enjoy being yourself, and enjoy the never-ending process of growing into someone new. For more visit <a href=\"http://www.wearekoru.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.wearekoru.com</a> or call (215) 348-5977</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/02/embrace-the-cold.jpg"
}