{
  "id": 17709,
  "title": "Flip Dog Pilates Studio Announces New Owner",
  "slug": "flip-dog-pilates-studio-announces-new-owner",
  "date": "2023-06-16T16:38:16",
  "author": "Staff",
  "category": [
    "Fit"
  ],
  "tags": [
    "doylestown cardinal",
    "Flip Dog Pilates Studio",
    "Tricia Scheeler",
    "Vicki Cross"
  ],
  "excerpt": "<p>Flip Dog Pilates, a private Pilates studio serving Doylestown and Buckingham communities for more than 20 years, is celebrating a new owner. Doylestown native and 28-year Pilates instructor, Tricia Scheeler, is taking the reins from the studio’s founder, Vicki Cross, who is retiring to spend time with her growing family. “After five years of teaching [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">F</span><span class=\"s2\">lip Dog Pilates, a private Pilates studio serving Doylestown and Buckingham communities for more than 20 years, is celebrating a new owner. Doylestown native and 28-year Pilates instructor, Tricia Scheeler, is taking the reins from the studio’s founder, Vicki Cross, who is retiring to spend time with her growing family.</span></p>\n<p class=\"p3\"><span class=\"s2\">“After five years of teaching in the studio, I’m especially excited to be taking over Flip Dog,” said Tricia. “Vicki is an incredible teacher, motivator, and mentor who built a successful business.<span class=\"Apple-converted-space\">  </span>It’s a friendly, healthy, and supportive environment where you are sure to get an awesome workout! We’ll all miss her, and we’re happy for her as she moves on to the next phase of her life.”</span></p>\n<p class=\"p4\"><strong>The Pilates Method: Modern benefits from a century-old practice</strong></p>\n<p class=\"p3\"><span class=\"s2\">For those not yet familiar with Pilates, it is a 100-year-old practice created by Joseph Pilates. Originally designed to help to rehabilitate soldiers and then ballet dancers, Pilates movements focus on core activation and flexibility while strengthening the whole body. The signature workout, offered at the Flip Dog studio, utilizes the “Reformer” equipment which leverages springs, pulleys, and a moving platform to create resistance. It enables a head-to-toe workout, with an emphasis on postural alignment, core strength and flexibility.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">“Pilates is for people of all ages and all levels,” said Tricia. It is based on low-impact movement that can be beneficial through all stages of life. I am truly an advocate of the Pilates Method and love teaching it to others. I have taught classes and trained instructors all over the world, from New York city, to San Francisco, and Columbia. I want to continue building a health-focused community for a diversity of clients centered around Pilates workouts.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><strong>Flipping for full-body workouts</strong></p>\n<p class=\"p3\"><span class=\"s2\">Flip Dog Pilates is an intimate studio located on Taylor Ave, in Doylestown offering more than 20 Pilates-based classes per week. The workouts can be tailored to range of experience levels, and focus on integrating strength, balance, low impact movement, and flexibility training. Tricia said she’s working on plans to expand the class offering to include additional virtual classes and hybrid instruction comprising dance, barre, Pilates mat, yoga, and other Pilates equipment.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">“My mission is to create a variety of effective workouts that energize you, while you sculpt, tone, and tighten your whole body. I want my clients to leave each session feeling rejuvenated physically and mentally. I welcome new clients and hope to see a lot of new people giving Flip Dog a try.”</span></p>\n<p class=\"p4\"><strong>Look Who’s Flipping over Flip Dog</strong></p>\n<p class=\"p3\"><span class=\"s2\">“I’ve been taking Pilates reformer classes with Tricia for 4 years. She is an amazing instructor and has created a true sense of community at the studio. I get an intense workout each time, all while having fun.” –<span class=\"Apple-converted-space\">  </span><i>Jennie Arculin</i></span></p>\n<p class=\"p3\"><span class=\"s2\">“Tricia creates an inviting atmosphere for class, and I get an intense workout while having fun. I finally found a workout regimen I look forward to.”<span class=\"Apple-converted-space\">  </span>–<span class=\"Apple-converted-space\">  </span><i>Heather Olenski</i></span></p>\n<p class=\"p4\"><strong>Interested in checking out a Flip Dog class?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p3\"><span class=\"s2\">During the months of June – August, Flip Dog is running a special offer. New clients can purchase a drop-in class for $20 or schedule a 30-minute personal training session for $35. <a href=\"http://www.flipdogpilates.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.flipdogpilates.com</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/06/TriciaSheeler5.jpg"
}