{
  "id": 11520,
  "title": "Found, Gifted, Saved! The Mercer Museum Collects Local History",
  "slug": "found-gifted-saved-the-mercer-museum-collects-local-history",
  "date": "2021-10-13T20:46:24",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live",
    "Style"
  ],
  "tags": [
    "Bucks County Historical Society",
    "doylestown cardinal",
    "mercer museum"
  ],
  "excerpt": "<p>Exhibit Opens at the Mercer Museum October 15, 2021 The Mercer Museum, operated by the Bucks County Historical Society (BCHS), is pleased to announce its new major exhibit, open from Friday, October 15, 2021, through Sunday, April 10, 2022, entitled Found, Gifted, Saved! The Mercer Museum Collects Local History, opening in the Martin &amp; Warwick [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong><span class=\"s1\"><i>Exhibit Opens at the Mercer Museum October 15, 2021</i></span></strong></p>\n<p class=\"p3\"><span class=\"s3\">The Mercer Museum, operated by the Bucks County Historical Society (BCHS), is pleased to announce its new major exhibit, open from Friday, October 15, 2021, through Sunday, April 10, 2022, entitled <i>Found, Gifted, Saved! The Mercer Museum Collects Local History</i>, opening in the Martin &amp; Warwick Foundation Galleries at the museum.</span></p>\n<p class=\"p4\"><span class=\"s3\"><i>Found, Gifted, Saved! The Mercer Museum Collects Local History</i> displays a staggering array of artifacts collected by the Bucks County Historical Society between the years of 2000 and 2021. These objects, images, and documents help illuminate the people, history, and culture of Bucks County.</span></p>\n<p class=\"p4\"><span class=\"s3\">The exhibit consists of a series of thematic groupings that connect diverse objects, images, and documents in a meaningful and thought-provoking way. These groupings are intended to suggest themes that range chronologically and geographically across Bucks County’s past.</span></p>\n<p class=\"p5\"><span class=\"s1\">The themes on display in the <i>Found, Gifted, Saved!</i> exhibit are:</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">• </span><span class=\"s4\">Made in Bucks</span></strong><span class=\"s3\"> – Includes objects crafted, manufactured, and marketed in Bucks County, from the 18th through the 20th centuries.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">•</span><span class=\"s4\"> The Way We Played</span></strong><span class=\"s3\"> – Features artifacts from the 19th and 20th centuries related to sports, games, and children’s play in Bucks County.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">• </span><span class=\"s4\">The Times of Our Lives</span></strong><span class=\"s3\"> – Includes items that accompany the stages of life: infancy, childhood, adolescence, adulthood, and old age. This group also included important rites of passage and rituals such as baptism, marriage, and funeral customs.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">• </span><span class=\"s4\">A Diverse People</span></strong><span class=\"s3\"> – Features artifacts, documents, and images that illustrate Bucks County’s historical racial, ethnic, and gender diversity, as well as those that document the arrival of immigrants to Bucks County.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">• </span><span class=\"s4\">What We Wore</span></strong><span class=\"s3\"> – Includes a broad sampling of men’s and women’s head-, foot-, and outerwear from different periods in Bucks County’s past.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">• </span><span class=\"s4\">Thank You for Your Service</span></strong><span class=\"s3\"> – Displays objects, images, and documents representing Bucks County residents in service to their country and community.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">• </span><span class=\"s4\">Which Side Are You On? Politics &amp; Social Movements</span></strong><span class=\"s3\"> – Features political campaign and election materials, labor union artifacts, and items connected with various social or environmental movements.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">• </span><span class=\"s4\">The Way We Worked &amp; The Tools We Carried</span></strong><span class=\"s3\"> – Includes a variety of implements used or carried by local laborers, objects that represent various types of workplaces, and images depicting the working lives of Bucks County’s people.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">• </span><span class=\"s4\">It Pays to Advertise!</span></strong><span class=\"s3\"> – Features numerous examples of advertising and commercial ephemera created to promote local businesses and industries.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">• </span><span class=\"s4\">Going to School in Bucks County</span></strong><span class=\"s3\"> – Includes objects and images related to public and private education and students’ school day experiences in Bucks County.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">• </span><span class=\"s4\">Wish You Were Here: Visiting Bucks County</span></strong><span class=\"s3\"> – Exhibits materials related to Bucks County’s long history of attracting tourists, day-trippers, artists, celebrities, and seasonal visitors, especially in the 20th century.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">• </span><span class=\"s4\">Collecting the Now </span></strong><span class=\"s3\">– History continues to happen all around us. Materials in this segment reflect some contemporary events, issues, and concerns, collected while these events were happening.</span></p>\n<p class=\"p4\"><strong><span class=\"s5\">• </span><span class=\"s6\">Staff Picks </span></strong><span class=\"s5\">– Mercer Museum staff have their own ideas about what local materials BCHS should collect – and why. This regularly-changing segment of the exhibition will highlight artifacts or images that staff members find particularly interesting, relevant, or evocative. Get to know the staff and the connections that they make to the collection!</span></p>\n<p class=\"p4\"><span class=\"s3\">Highlighted artifacts on display include a Brewster F2A “Buffalo” Fighter Cockpit, a Joseph Ellicott Tall Case Clock, a Brashears Family Crazy Quilt, and a Graflex Press Camera of Gene Asro.</span></p>\n<p class=\"p4\"><span class=\"s3\">Bucks County Historical Society’s Vice President of Collections and Interpretation Cory Amsler states, “A huge challenge for museums collecting local history is to adequately represent &#8211; in objects, images, and documents &#8211; the full complexity of a community’s past and the diversity of its people. We hope this exhibit launches a conversation with visitors about what we have been able to capture, what we have missed, and whether the things we’ve acquired help tell the stories that are most important and relevant to us as Bucks County residents.”</span></p>\n<p class=\"p4\"><span class=\"s3\">Members of the Bucks County Historical Society are invited to preview the exhibit early at a dedicated Member Morning on Friday, October 15, 2021, with reserved timed-ticket entry exclusively offered for members online.</span></p>\n<p class=\"p4\"><span class=\"s3\"><i>Found, Gifted, Saved! The Mercer Museum Collects Local History</i> is sponsored by Tom Thomas, Jim and Kathy Morrison, Alice and Bob Vernon, Brian and Louise McLeod, Raphael Architects, Happ Contractors Inc., and Lower Bucks Hospital – Prime Healthcare.</span></p>\n<p class=\"p4\"><span class=\"s3\"><i>Found, Gifted, Saved! The Mercer Museum Collects Local History</i> is included with general Mercer Museum admission. In addition, the Mercer Museum will host a slate of community programs related to the exhibit throughout the season.</span></p>\n<p class=\"p4\"><span class=\"s3\">The Mercer Museum is open Tuesday &#8211; Sunday from 10:00 a.m. – 5:00 p.m. via timed-entry slots and closed on Thanksgiving Day, Christmas Day, and New Year’s Day. Advance tickets are highly recommended. To learn more, visit <a href=\"http://mercermuseum.org.\" target=\"_blank\" rel=\"noopener noreferrer\">mercermuseum.org.</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/10/Mercer-Museum-1021.jpg"
}