{
  "id": 17367,
  "title": "Free Appraisal Day 2023",
  "slug": "free-appraisal-day-2023",
  "date": "2023-04-15T15:32:40",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "Gratz Gallery &amp; Conservation Studio"
  ],
  "excerpt": "<p>It has been too long!!! But we are ready to return for another FREE Art Appraisal Day at Gratz Gallery &amp; Conservation Studio on Saturday, April 15, 2023 from 11 am to 5pm. We are located at 5230 Silo Hill Road, Doylestown, Pennsylvania, and parking is not a problem at our new location. Have you [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">I</span><span class=\"s2\">t has been too long!!! But we are ready to return for another FREE Art Appraisal Day at Gratz Gallery &amp; Conservation Studio on Saturday, April 15, 2023 from 11 am to 5pm. We are located at 5230 Silo Hill Road, Doylestown, Pennsylvania, and parking is not a problem at our new location.</span></p>\n<p class=\"p3\"><span class=\"s2\">Have you uncovered a long lost treasure while spring cleaning? Curious as to whether the painting you picked up at a local flea market has any value? Bring your fine art to Gratz Gallery &amp; Conservation Studio and we will provide you with a free value appraisal or free conservation estimate. Bring the landscape from over your couch for a fair-market appraisal; find out what’s underneath that dusty painting in your basement; bring your treasured family heirloom for a cleaning and repair estimate. Are you unsure of the origin of your artwork? Let our specialists take a look to see if we can uncover your mystery painting.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">This year the event will again feature Marge Gratz ISA AM, an accredited member of the International Society of Appraisers and longtime Gratz Gallery sales associate and our fine art specialist Paul Gratz, owner and head conservator at Gratz Gallery &amp; Conservation Studio for the past 40 years.</span></p>\n<p class=\"p3\"><span class=\"s3\">Due to the past popularity of this event, patrons are requested to limit their inquiries to two pieces per family.<span class=\"Apple-converted-space\">  </span>The appraisers will get to all the paintings they possibly can in one day.</span></p>\n<p class=\"p3\"><span class=\"s2\">Specializing in the conservation of oil paintings and gilded frames, Paul Gratz’s formal training began at the Pennsylvania Academy of the Fine Arts and was developed through various apprenticeships with some of the nation’s most respected art conservators. Today, Paul leads a team of skilled artisans in combining modern techniques with Old World craftsmanship to offer the finest in treatment for oil paintings, murals and gilt objects.<span class=\"Apple-converted-space\">  </span>Since 1982 Paul Gratz has provided his services to museums, historical societies, universities, churches and many private collections. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">“Truly skilled conservation of your art”, says Gratz, “preserves as much as is possible of the original art itself, and therefore preserves its utmost value.<span class=\"Apple-converted-space\">  </span>Conservation treatment restores original radiance, color and detail to your treasured oil paintings, adding years of life and maximum value to even the most damaged artwork. Our dedication to the quality of care for your investment is surpassed only, perhaps, by our passion for the beauty of the craft itself.” <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">The gallery is also actively expanding our inventory by buying and consigning complete art collections &amp; fine American paintings from The Pennsylvania Impressionists, Hudson River School, Old Masters, European Paintings, Abstract and Modern Art, Contemporary and Surrealist Art, American and European Impressionists.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">“Gratz Gallery has been a trusted representative for collectors in the expansion and upgrade of their fine American art collections for over 40 years”</span></p>\n<p class=\"p3\"><span class=\"s4\">Located at 5230 Silo Hill Road in Doylestown, the Gratz Gallery &amp; Conservation Studio specializes in 19th and 20th century American paintings, with a focus on painters from the New Hope School of Pennsylvania Impressionists, The Pennsylvania Academy of the Fine Arts, and members of the Philadelphia Ten. The gallery is open Wednesday through Saturday, 10:00 a.m. – 6:00 p.m. and Sunday, 12:00 – 5:00 p.m., as well as by appointment. For additional information, please visit our website at <a href=\"http://www.gratzgallery.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.gratzgallery.com</a> or call us at 215-348-2500.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/image1-1.jpeg"
}