{
  "id": 18643,
  "title": "Get To Know A Doylestonian: (Santa) John Stanojev",
  "slug": "get-to-know-a-doylestonian-santa-john-stanojev",
  "date": "2023-12-14T20:26:10",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "dana roberts",
    "doylestown cardinal",
    "John Stanojev"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer “Get to Know a Doylestownian” is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide; in any way they see fit. To embrace the holiday spirit this month, we turned to the [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Dana Roberts</strong></em> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><i>“Get to Know a Doylestownian” is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide; in any way they see fit. To embrace the holiday spirit this month, we turned to the jolliest person in town, Doylestown’s long-standing resident volunteer Santa Claus, John Stanojev. As Santa, John rings in the holiday season for Doylestown by riding in on a fire truck and lighting the tree for the 109th Annual Tree Lighting on November 24th. John is also one of the Santas who man Doylestown Santa’s House, located at the Hamilton Lot on Hamilton and State Streets. Guests (including well-behaved pets!) can visit Santa’s House on Thursdays and Fridays from 6-8 pm, on Saturdays from 11am-1:30pm and 2-4pm, and on Christmas Eve from 11am-1pm. Remember: pictures with Santa are free, but donations are always welcome! Read on to learn how John got into the Santa gig, the items he gets asked for the most, and the mottos he lives by to abide a jolly personality all year round.<span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p5\"><strong><span class=\"s2\">I started dressing up as Santa</span></strong><span class=\"s1\">… in my early twenties. My wife and I lived in an apartment complex. We didn’t have children yet. They needed a Santa for the children in the complex. I went out and rented a suit, and afterwards my wife said, “Don’t you have to return that suit?” but I kept the suit because it was cheaper to own it than it was to pay for the rental. I didn’t play Santa regularly for a while, but then I started to think, “Well you have a Santa suit, why don’t you play Santa?”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">I decided to be Santa at my office</span></strong><span class=\"s1\">… to spread cheer to all of the employees and their kids. I worked for a company in the city. Some of the secretaries would get gifts, but some people didn’t get anything, so I would buy gifts and play Santa and deliver them to make sure everyone had something on their desk. I ended up taking the role of Senior Executive Vice President at the insurance company I worked for. I convinced the general manager to have a Christmas party for all the employees and their children and have a half day of work, hire a clown and babysitters, have a nice luncheon, then take everyone down to the lobby, where there would be a beautiful throne-like chair. Then, while the children were singing “Jingle Bells,” I would come down the fire escape stairs as Santa while the children were singing. I would give out all the toys as Santa, with my boss behind me, and the administrative assistants helping to hand out the gifts. We did this for 11 of the 13 years I was there.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">Are the beard and belly real? </span></strong><span class=\"s1\">No, not now, because I lost 70 pounds. For a long time, the belly was real. I purchased the beard though. My Santa suit came from Western Pennsylvania. It’s probably about 21 years old. It is very well cared for by a dry cleaner in Dublin. I know a few other Santas who get their suits cleaned there, at Green’s in the Dublin Shopping Center.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">Being a Santa walking through neighborhoods</span></strong><span class=\"s1\">…involves toughing it out through the elements to bring joy to all. When I lived in Pittsburgh, I was Santa in the neighborhood for the 5-6 weeks leading up to Christmas. Neighbors would drop off gifts for their children, and I would walk three neighborhoods, so I could go house to house during the weekday evenings and make a brief visit. I had written notes on every child, so I knew them by name and could say something personal, so they thought I was the real Santa. When I moved back to Plumsteadville in 2000, I walked the Landis Greene neighborhood as Santa. I would drag myself up and down the street even in wind and snow.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">I became Santa in Doylestown</span></strong><span class=\"s1\">… in 2003, because that’s when I opened up my office, Capital Insurance and Investment Planning, on Court Street. That office has now moved and relocated to New Britain. I took over the Santa duties of riding the fire truck throughout the community, along with several other Santas. The fire company and the local police here couldn’t be more accommodating and are wonderful supporters of Santa.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">When I dress up as Santa for the Tree Lighting in Doylestown</span></strong><span class=\"s1\">…I ride the Old Fox from the Fire Company to Central Bucks West, and we start from there and then do the parade into town for the tree lighting. I’ve done this every year since 2001. It took a little persuasion to get Santa to go up in a boom truck because of his fear of heights, but it’s a lot better than the original suggestion to have Santa climb a fire ladder.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">Last year</span></strong><span class=\"s1\">… I ended up being Santa for almost 45 hours over a 5-6 week period. I was Santa at the Mercer Museum, at the Doylestown Inn, and in the Santa House. That was a little bit challenging. This year we have a pretty hefty schedule, with Santa available on Thursday, Friday and Saturday. I share the duties at Santa’s house with another experienced Santa. I purposefully make sure that I’m Santa on Christmas Eve. I will stay in the Santa house until every child who wants to see Santa sees him. I have been in the Santa house until 7pm on Christmas Eve before.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My off-duty time has been spent</span></strong><span class=\"s1\">… in a community and family-oriented way. I was the fundraising chairman for the Doylestown Rotary for nine years and we raised the money for the clock in town to be installed in 2003. I was the president of the Rotary in 2007. I am a Rainmaker for the Mercer Museum. Rainmakers are a group of people who support the museum and help promote a business relationship to keep the community aligned with the museum. I was on the Development Committee for the Pearl Buck Foundation. I was on the committee of what is now called Discover Doylestown (the Doylestown Community Business Alliance) and at the same time I was an ambassador for the Chamber of Commerce and was on the entrepreneurial committee for the Chamber of Commerce. At this stage of my career, I’m concentrating more on my family, and I’ve dropped off some of the boards. The time that I was dedicating to the community I now dedicate to my family.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My Mrs. Claus is</span></strong><span class=\"s1\">… Lynne Anne Donchez. She is a hairstylist and had her own firm on State Street and a large client list. She is a very, very good Mrs. Claus who has handled all the costumes and makeup for Town and Country players for more than 20 years. She is a very active, community-aligned woman. She will be Mrs. Claus for the tree lighting. On the 9th of December, she, Frosty, Rudolph and myself will visit an orphanage in the Lehigh Valley.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My wife and real-life Mrs. Clause is</span></strong><span class=\"s1\">… Patricia, and she has never dressed up as Mrs. Claus. She is very supportive though and loves seeing all of the kids. I married my wife at the end of my first year in the military, when I was 20 and she was only 18 at the time. We will be married 52 years this coming May.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">A fun fact about my pre-Santa time is that</span></strong><span class=\"s1\">….I was a professional entertainer and a musician, and my band was the opening act in 1976 for Kiss at the Civic Center in Philadelphia. I made my very first record when I was 13 years old, in 1964. My brother and I became professional entertainers and did gigs seven nights a week. I played music for almost 50 years, starting in USO shows when I was only 11 or 12 years old. I played at the Philadelphia Naval Hospital for all of the veterans returning from Vietnam.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">A cause that is very important to me is</span></strong><span class=\"s1\">…supporting veterans. I am a disabled Veteran and was in Vietnam during the 70’s. I was an Underwater Weapons Specialist in the U.S. Naval Reserves. I was injured in the military and went through some surgery and am able to live a much more normal life than many other veterans.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My favorite Christmas movie is</span></strong><span class=\"s1\">…the Tim Allen Santa Claus movie.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My favorite part of the job is</span></strong><span class=\"s1\">…the time I spend listening to the kids and watching them when they first see Santa and their reaction. I have more fun than the children doing this job.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">The most memorable item a child or visitor has asked me for</span></strong><span class=\"s1\">…. was when I played Santa Claus in Pittsburgh for a group called PAAR (Pittsburgh Action Against Rape). The children I was seeing had been through trauma, and most did not want to sit on Santa’s lap or be touched. When I asked one child, “What can Santa do to make your Christmas nice?” he said, “Get me my father back.” That was the hardest thing I ever had to deal with. It was tough that night because the kids were so afraid of Santa and didn’t know how to deal with him. I love to try and help the children enjoy the holidays and enjoy Christmastime. I want them to be happy and know that Santa loves all the children.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">The item Santa is asked for most often is</span></strong><span class=\"s1\">… a Nintendo Switch in the past few years. A lot of children ask for animals, like a cat or a dog. Even a horse. Kids even as young as 8 or 9 will ask for cell phones, iPads, computers. There was a long period of time when they asked for Transformers. Bikes and skateboards are very popular too.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My favorite Christmas carol is</span></strong><span class=\"s1\">…“The Christmas Song,” by Nat King Cole.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">The mottos that I live by are</span></strong><span class=\"s1\">… that people should be better off knowing you, or you should leave them alone, and that the road to a friend’s house is never too long. And that there are no do-overs in life, all you have is the time you have. Time goes so quickly, and you’re not always able to control when you can do certain things.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">I plan to dress up as Santa as long as</span></strong><span class=\"s1\">… I am physically able to do it, until I have a real white beard! I have more fun as Santa than the kids do. It’s a joy to watch their faces see Santa, especially when for many of them it’s for the first time.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/IMG_0651-e1702603553116.jpeg"
}