{
  "id": 14875,
  "title": "Get to Know a Doylestownian:  Tabitha Dell’Angelo",
  "slug": "get-to-know-a-doylestownian-tabitha-dellangelo",
  "date": "2022-09-13T16:58:57",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live"
  ],
  "tags": [
    "Central Bucks School Board",
    "doylestown cardinal",
    "Tabitha Dell’Angelo"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer Get to Know a Doylestownian is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide, in any way they see fit. For September, back-to-school month, we interviewed Tabitha Dell’Angelo, member of the [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><b>By Dana Roberts • </b></span><span class=\"s1\">The Cardinal Contributing Writer</span></p>\n<p class=\"p3\"><strong><span class=\"s3\">G</span><span class=\"s4\">et to Know a Doylestownian </span></strong><span class=\"s3\"><i>is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide, in any way they see fit. For September, back-to-school month, we interviewed Tabitha Dell’Angelo, member of the Central Bucks School Board, Doylestown Borough resident, and mother of two children who attend school in the district. Read on to learn all about her, including her fun nickname, what it’s like to be on the School Board, and her favorite spot in town.</i></span></p>\n<p class=\"p5\"><span class=\"s6\"><b>My full name is</b></span><span class=\"s7\"><b>…</b>Tabitha Dell’Angelo.</span></p>\n<p class=\"p5\"><span class=\"s6\"><b>My nicknames are</b></span><span class=\"s7\"><b>… </b>Tabby, Tab, Taboo.</span></p>\n<p class=\"p5\"><span class=\"s6\"><b>I grew up in</b></span><span class=\"s7\"><b>… </b>South Philadelphia and South Jersey.</span></p>\n<p class=\"p5\"><span class=\"s6\"><b>My first job was</b></span><span class=\"s7\"><b>… </b>waitressing in a Bingo Hall at age 12.</span></p>\n<p class=\"p5\"><span class=\"s6\"><b>I graduated from</b></span><span class=\"s7\"><b>…</b> Paul VI High School in Haddonfield, NJ, Rowan University for Special Education and University of Pennsylvania in Applied Psychology and Human Development.</span></p>\n<p class=\"p1\"><b>I’ve lived in Doylestown</b><span class=\"s7\"><b>…</b> for 16 years.</span></p>\n<p class=\"p5\"><span class=\"s6\"><b>My family includes</b></span><span class=\"s7\"><b>… </b>a lot of people, I am Italian! But my immediate family includes my husband, my two boys and my fur babies.</span></p>\n<p class=\"p5\"><span class=\"s6\"><b>I met my husband</b></span><span class=\"s7\"><b>… </b>on-line! Aren’t we so 21st century? One of our first dates was to see the movie Shadow of a Vampire. Our mutual love of movies and Charles Nelson Reilly connected us right away.</span></p>\n<p class=\"p5\"><span class=\"s6\"><b>Our favorite thing to do as a couple is</b></span><span class=\"s7\"><b>… </b>talk, travel, or just hang out. He really is my best friend.</span></p>\n<p class=\"p5\"><span class=\"s6\"><b>Adopting our son from Thailand at age 6</b></span><span class=\"s7\"><b>… </b>was a whirlwind. We were matched with him when he was 4 years old. I got to visit him in Thailand twice while traveling for work. But we waited 2 years to bring him home. Now it feels like he was always part of our family.</span></p>\n<p class=\"p5\"><span class=\"s6\"><b>Being the parent of teenagers is</b></span><span class=\"s7\"><b>… </b>such a gift but also anxiety producing. </span></p>\n<p class=\"p5\"><span class=\"s6\"><b>We chose to settle in Doylestown because</b></span><span class=\"s7\"><b>… </b>we moved from Philly and really wanted to be in a place where we could walk places and know our neighbors. </span></p>\n<p class=\"p5\"><span class=\"s6\"><b>Our house is</b></span><span class=\"s7\"><b>… </b>on a vibrant block with amazing neighbors. We are also close enough to school so our children can walk to school.</span></p>\n<p class=\"p5\"><span class=\"s6\"><b>My full-time job is</b></span><span class=\"s7\"><b>… </b>professor of education at The College of New Jersey. I teach courses in Child &amp; Adolescent Development, Research, Educational Foundations, and specialized courses on incorporating the arts and play into teaching to meet the needs of all students. </span></p>\n<p class=\"p5\"><span class=\"s8\"><b>I decided to run for school board because</b></span><span class=\"s9\"><b>… </b>I saw an opportunity to use my background and knowledge to amplify the voices and needs of students and teachers in authentic ways. </span></p>\n<p class=\"p1\"><span class=\"s10\"><b>The campaign process for school board was</b></span><span class=\"s9\"><b>… </b>a huge learning experience.</span></p>\n<p class=\"p5\"><span class=\"s8\"><b>My school board term</b></span><span class=\"s9\"><b>&#8230; </b>started in November 2021 and lasts until November 2023.</span></p>\n<p class=\"p5\"><span class=\"s8\"><b>The area I represent for school board is</b></span><span class=\"s9\"><b>… </b>Region 8, which includes Doylestown Borough and Doylestown Township 3 &amp; 6.</span></p>\n<p class=\"p5\"><span class=\"s8\"><b>Most people might not know that</b></span><span class=\"s9\"><b>… </b>the school board directors run by region but serve at large. Also, we are a collective, so majority rules.</span></p>\n<p class=\"p1\"><span class=\"s10\"><b>If I could pick a song to play right before the school board meetings, it would be</b></span><span class=\"s9\"><b>&#8230; </b>either “You Gotta Be” by Des’ree or the theme song to the Benny Hill Show.</span></p>\n<p class=\"p5\"><span class=\"s6\"><b>Being on school board requires</b></span><span class=\"s7\"><b>…</b> patience, a willingness to collaborate, acceptance that decisions will not always go your way, the ability to handle the feeling of letting people down but the resilience to keep working for what I believe is right, and between 5-20 hours of unpaid work per week that includes reading legislative briefs, policy, curriculum, emails, and participating in professional development webinars when I have time. </span></p>\n<p class=\"p5\"><span class=\"s4\"><b>My favorite part of being on school board is</b></span><span class=\"s5\"><b>… </b>learning about the amazing work that many of our teachers are doing, the accomplishments of our students and meeting so many people from the community and hearing what is important to them. </span></p>\n<p class=\"p1\"><b>The most challenging part of being on school board is</b><span class=\"s7\"><b>…</b> knowing when to step up and when to step back. </span></p>\n<p class=\"p1\"><b>Being featured in major news publications and magazines because of the issues going on in the school board and in Central Bucks has been</b><span class=\"s7\"><b>… </b>a little bit unnerving. Being the center of attention is not the most comfortable spot for me. </span></p>\n<p class=\"p5\"><span class=\"s6\"><b>After school board meetings</b></span><span class=\"s7\"><b>&#8230; </b>I usually try to watch a funny show to clear my head, take some deep breaths and try to get some sleep. </span></p>\n<p class=\"p5\"><span class=\"s6\"><b>The TV shows I’m watching right now are</b></span><span class=\"s7\"><b>… </b>I Love That For You, Loot, Stranger Things, and Uncoupled. I am dying for The Great and the next season of The Great British Baking show to come back too. </span></p>\n<p class=\"p5\"><span class=\"s6\"><b>Old favorite TV shows I always return to include</b></span><span class=\"s7\"><b>… </b>I Love Lucy, Arrested Development, and the old Looney Toons cartoons. </span></p>\n<p class=\"p5\"><span class=\"s6\"><b>My favorite way to unwind is</b></span><span class=\"s7\"><b>… </b>watching great TV, playing card games with my kids, walking or running outside.</span></p>\n<p class=\"p5\"><span class=\"s11\"><b>Right now, I’m reading</b></span><span class=\"s2\"><b>… </b>The Leavers by Lisa Ko and listening to A Woman is No Man by Etaf Rum. I am usually reading one thing and listening to another at any given time. </span></p>\n<p class=\"p5\"><span class=\"s4\"><b>My favorite books are</b></span><span class=\"s5\"><b>&#8230; </b>Homegoing by Yaa Gyasi, Their Eyes Were Watching God by Zora Neale Hurston, The Strange and Beautiful Sorrows of Ava Lavender by Leslye Walton and a new elementary novel called The Care and Feeding of a Pet Black Hole by Michelle Cuevas. This list could just go on and on. If you want to do an entire issue of books, I’m in!</span></p>\n<p class=\"p5\"><span class=\"s6\"><b>I typically wake up</b></span><span class=\"s7\"><b>… </b>at around 6:30 am and go to bed around 10:30 pm.</span></p>\n<p class=\"p5\"><span class=\"s6\"><b>Our family’s go-to restaurant in town is</b></span><span class=\"s7\"><b>&#8230; </b>Lovebird in a pinch, Genevieve’s if we can spring for a special meal, and Native for coffee and yummy Thai breakfast. </span></p>\n<p class=\"p5\"><span class=\"s6\"><b>My favorite place in Doylestown is</b></span><span class=\"s7\"><b>… </b>my front porch. I couldn’t possibly pick one store or park or spot.</span></p>\n<p class=\"p5\"><span class=\"s6\"><b>Doylestown, for me, is</b></span><span class=\"s7\"><b>… </b>a community filled with loving kindness. </span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/09/Tabitha.jpg"
}