{
  "id": 15207,
  "title": "Get to Know a Doylestownian: Jasmine Craig",
  "slug": "get-to-know-a-doylestownian-jasmine-craig",
  "date": "2022-10-07T16:37:28",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "a woman's place",
    "dana roberts",
    "doylestown cardinal",
    "jasmine craig"
  ],
  "excerpt": "<p>“Get to Know a Doylestownian” is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide, in any way they see fit. In recognition of October being Domestic Violence Awareness Month, we interviewed Jasmine Craig (she/her), Community Educator at A Woman’s [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><i>“Get to Know a Doylestownian” is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide, in any way they see fit. In recognition of October being Domestic Violence Awareness Month, we interviewed Jasmine Craig (she/her), Community Educator at A Woman’s Place, Bucks County’s community-based social change organization committed to the empowerment of women and to ending intimate and domestic violence for all. A Woman’s Place (AWP) started as a storefront, drop-in domestic violence counseling center in Sellersville, PA in 1976. Above that storefront center was AWP’s first shelter for women seeking safety from abuse. The first woman seeking safety arrived safely with her two children at the tiny, one-room shelter apartment on Christmas Eve 1976.</i></p>\n<p class=\"p1\"><i>Read on to learn more about Jasmine’s role at A Woman’s Place, how domestic violence impacts us individually and as a community, the many ways AWP serves us all, and Jasmine’s experiences and heartfelt perspective.</i></p>\n<p class=\"p1\"><b>I&#8217;ve lived in the Doylestown area for&#8230;</b> 13 years. I grew up in the Philadelphia area, so I have lived locally my whole life.</p>\n<p class=\"p1\"><b>My favorite thing about my home is&#8230; </b>that it reflects my husband and I so perfectly.</p>\n<p class=\"p1\"><b>My household includes&#8230;</b> my husband, my two middle school-aged children, my three cats and my dog.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>I met my husband&#8230; </b>while volunteering on the Obama campaign in Doylestown! Jesse followed the campaign down to North Carolina, but I had to stay local since I was at Temple and had an infant. I didn’t realize he was gone until I called him to go on a date and he was out of state! We had our first date when he got back, and got married 6 months later. We will be celebrating our 14<span class=\"s1\"><sup>th</sup></span> wedding anniversary in November.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>The best thing we do for our relationship is&#8230;</b> stay curious. We let each other be individuals and are genuinely curious and excited about seeing new progress, changes, and interests that the other is experiencing. We also hold curiosity about our seasons of life. We are constantly ready to adjust household roles, how we support each other and the kids, if we want to try new things together, or if we need consistency. Curiosity allows us to remain fluid as we travel the journey of life together, instead of becoming stagnant.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>Our favorite spot in Doylestown to go to is&#8230; </b>Hopscotch! The vibe is chill, the people are marvelous, and we always feel welcome. Living with multiple identity intersections can sometimes feel challenging when wanting safe spaces to feel relaxed and authentic. Our family’s intersectional identities include being interracial, muti-ethnic, inter-faith, queer, neurodiverse and mental disability. We value spaces that engender a genuine feeling of welcome and inclusion.</p>\n<p class=\"p1\"><b>The shows I am watching right now are&#8230; </b>Hallmark fall movies! It’s my guilty pleasure and I am a romantic! Also, living with PTSD means that it can be very difficult to watch shows and movies because I am easily activated by unexpected content. Even commercials can be difficult. So, I stick to my Hallmark movies and the Food Network (and always recorded).<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>My favorite thing to do with my kids right now is&#8230;</b> anything! Since they’re teens, I’ll take whatever time they give me! I enjoy being active, so my youngest is teaching me to skateboard with them. My oldest enjoys hiking and swimming so we do that together. They are both constantly listening to music too, so we have impromptu dance and singing moments. I appreciate that they keep me experiencing new things.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>I graduated from&#8230; </b>Temple University, where I majored in organizational communication and management and minored in Political Science.</p>\n<p class=\"p1\"><b>I&#8217;ve worn many different hats in my career, which have… </b>brought me to see myself as a community educator and social change advocate. All the positions I’ve held have been rooted in these identities. I have a passion for early childhood education and development, and for individual and community flourishing. I have worked in the Youth Development department of the YMCA of Bucks &amp; Hunterdon Counties, Doylestown branch, and was the Director of Youth Education at the YMCA Doylestown Preschool. I worked as the Children’s Ministry Associate at a local church, and as the Community Coordinator in Bucks and Montgomery Counties for a cyber charter school. Currently, I am a Community Educator for A Woman’s Place. Perhaps my favorite positions have been engaging in community advocacy and activism. I have led numerous faith-based racial reconciliation community groups. I have spoken at community vigils, rallies, and protests. I have been an anti-racism facilitator with the Peace Center of Bucks County (and even spent a moment on their board). I find most fulfillment when I am partnering with our community to learn how to build systems, attitudes, structures, and norms that are life-giving and lead to community flourishing.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>At the end of the workday, I&#8230;</b> grab a glass of white wine and sit outside with my dog. I do some yoga, some meditation, and spend quality time with the family. Then I grab a book for the evening.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>Right now, I am reading&#8230;.</b> I have such a list that I am trying to work through! I am always reading two books: a romance and a book for personal growth and development. I usually go through my romance books in a few days, so I’m constantly reading new ones. I also collect diverse children’s books and have begun a small collection of diverse YA books. There are just so many great authors and books being written! I’m enjoying reading through Thich Nhat Hanh’s works. Currently I’m reading “The Heart of the Buddha’s Teachings.” Some books on my reading list are: <i>The Intersectional Environmentalist</i> by Leah Thomas, <i>All About Love</i> by Bell Hooks, <i>Body Becoming: A path to our liberation </i>by Robyn Henderson-Espinoza, and <i>The Book of Joy</i> by the Dalai Lama.</p>\n<p class=\"p1\"><b>A book I would recommend everyone should read is&#8230;</b>There is absolutely no way I could pick just one! Books and the literary arts have always been essential and beloved companions in my life. Read it all! Read everything you can get your hands on! Read everything that invites us to live more expansively and creatively and wisely and kindly and purposefully.</p>\n<p class=\"p1\"><b>My favorite form of self-care is&#8230;</b> reading, hot baths, time with my dog, and being active in nature. My family knows that if they need me, they can find me outside! On the weekends I’m usually running, hiking, kayaking, visiting orchards, nature centers, or doing outdoor yoga or meditation. My daily morning and evening time outside is essential to my mental health.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>I came to my current position at A Woman&#8217;s Place after&#8230;</b> I experienced an acute trauma, developed PTSD, and was irrevocably changed. After spending a year immersed in intensive therapies, I realized that I needed to adjust my professional career path. I couldn’t go back to spending 8 hours a day, 5 days a week in an early childhood environment. Fortunately, I had the experience of volunteering at In Full Swing, the thrift store of A Woman’s Place. I was able to build my capacity again, my professional self-confidence, and continue to invest in a community-based organization. Through my personal experience with PTSD, I wanted to work in a trauma-informed environment where I was still rooted in my passions of community education and social change. A Woman’s Place allows me to do all those things in a way that feels empowering and important.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>My current role is&#8230;.</b> a community educator. My role is focused on abuse prevention through educating students, educators, and caregivers about unhealthy and healthy behaviors in relationships, the prevalence of domestic violence in our community, and the intersection of domestic violence and other forms of social oppression and violence. I create our youth programming and facilitate workshops in classrooms and other community education spaces throughout Bucks County.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>Community outreach is so important because&#8230;</b>that’s how change happens. When we are able to un-learn harmful ways of doing and being and re-learn healthy ways of doing and being, we become a community of individuals who are empowered to deconstruct harmful systems and norms and reconstruct healthy systems and norms. One of my favorite sayings is “collective liberation requires collective care.” As we collectively care for each other, we collectively liberate each other.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>When facilitating workshops and programs, I&#8230; </b>engage with my audience in a relevant and meaningful way that is focused on empowerment and awareness. Relational violence is a community issue that impacts everyone, so it’s important that I help dismantle stereotypes or biases about domestic violence while focusing on the interpersonal and intrapersonal skills that nurture healthy relationships. On any given day, I can be facilitating workshops with 4<span class=\"s1\"><sup>th</sup></span> grade students, 11<span class=\"s1\"><sup>th</sup></span> graders, adult guidance counselors, or parents.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>My favorite thing about my job is&#8230;</b> figuring out how to create, structure, organize, and educate in a creative and motivational way across many different audiences. It’s a huge win when students say “Oh, I never thought about it that way before.” I enjoy when connections are made, when people start to critically think, when they are now fully aware of an issue that they have always been surrounded by and never knew. The fulfillment I get when people feel inspired, motivated, and empowered to advocate for relationships that are equal and safe is amazing! Intimate partner, domestic, and community violence don’t have to be a part of our community narrative. We all have a choice to show up in a way that reduces relational harm. It’s exciting when that message is embraced and people feel empowered to prevent future violence, and advocate for survivors.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>Most people don&#8217;t know that A Woman&#8217;s Place&#8230;.</b> isn’t just an emergency hotline or organization. We offer a variety of services free and open to any qualifying community member including trauma-informed counseling, group therapy, empowerment programs, legal support, temporary and transitional housing, safety and goal planning, and more! We even offer some retail therapy with our thrift store In Full Swing!</p>\n<p class=\"p1\"><b>The emergency shelter for women experiencing domestic violence in Bucks County&#8230;</b> is in a secure and confidential location. It can house about 7 families at a time, which includes woman-identifying adults and their children. Currently, we have separate funds to accommodate emergency housing for anyone who is not woman-identifying. Our safe house residents have access to free toiletries and hygiene items, children’s items, food, and can shop for free at our thrift store. The focus for our safe house residents, and all our clients, is to regain a sense of safety, empowerment, autonomy, and justice in their lives.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>The hotline for A Woman&#8217;s Place&#8230;</b> is the organization’s main hub. If you need help, or someone you know needs help, you can call the hotline at 1-800-220-8116.<span class=\"Apple-converted-space\">  </span>Unlike other hotline numbers, this isn’t just an emergency number. The hotline is staffed 24/7 so at any time on any day a caller will have advocacy support. Our hotline can assist with general questions about who we are and what we do, can direct individuals to the department that might support their needs, help with safety planning, or connect with other community resources.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>During Domestic Violence Awareness Month, one thing that people should know is&#8230;</b> domestic violence is prolific. Since we are all relational beings, we all have the potential to experience relational violence- no matter racial identity, ethnicity, age, gender, sexual orientation, socio-economic status, geographic location, or ability. Also, domestic violence isn’t just physical! Abusers use many different forms of control to reduce power and security. Domestic violence includes emotional abuse, mental/psychological abuse, financial/material abuse, sexual abuse, technological abuse, and verbal abuse. Part of awareness and prevention is understanding unhealthy red flag behaviors and how to respond to them before they progress into a cycle of abuse. Once in the cycle, it becomes increasingly unsafe to exit. A Woman’s Place is here to support any and all survivors of domestic violence in all of the forms that it takes, not just physical.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>The most important message parents, caregivers, and adults should convey to children, teenagers, and young adults regarding domestic violence is&#8230;</b> that anyone can experience it. We can all do our best to be in healthy, equal, consenting, and safe relationships with open communication about behaviors that are unhealthy or not constructive. Learning personal boundaries, how to express them, and how to respond when they are crossed is empowering. However, abuse is never the survivor’s fault. Encourage youth and teens to know their non-negotiables (what is never ok in a relationship) and where to get help. Teens can get Protection from Abuse (or restraining) orders against ex-partners. A Woman’s Place can help with that. Youth and teens are navigating life at top-speed while still developing their sense of self, where they fit in, and how relationships work. That’s a lot. Adults can make sure to model healthy relationships, interactions, and conflict resolution. Make sure that youth and teens know that their mental, emotional, and physical safety is important, and that it is a priority of the adults in their lives to support them in protecting that safety.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>If a person is concerned that someone they know is experiencing domestic violence of any kind, they can&#8230;</b> speak up with compassion and curiosity. Show genuine concern, listen without judgement, avoid demands or controlling how the person should behave next. Call our hotline and encourage them to do so as well! Use the resources available on our website. Most importantly, focus on the strength and bravery of the survivor and avoid victim blaming or shaming.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>For those looking to get involved or support A Woman&#8217;s Place, the biggest need right now is&#8230;</b> donations and volunteer hours. We are a small and mighty non-profit and rely so much on community support and dedicated volunteers! Monetary donations are always welcome, and there is a donation list for our safe house and thrift store on our website. We have volunteer opportunities in every part of our organization, and an amazing volunteer coordinator! Check out our website and fill out a volunteer application to get started.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>During my lifetime, I….</b> have a travel bucket-list that I hope I can accomplish! I also am excited to see how we will continue to dismantle the effects of oppression, violence, and abuse on a social and systemic level. I want to see us undoing environmental harm and exploitation. I want less geographic and social segregation so Black and Brown people can feel like they can travel and live wherever they want in safety and flourish.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>An area where Doylestown could grow is&#8230;</b> in diversity. Sometimes Doylestown feels content to stay its own isolated little bubble, but I would like to see it embracing social relevance, inclusivity, and being willing to evolve. More economically accessible housing and opportunities can also increase socio-economic diversity. <span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>One of the things I love about Doylestown is&#8230;</b> I always thought I was a city girl, but I can definitely admit that Doylestown has made me a ‘townie!’ I love all the cultural and community offerings. I love the natural beauty and outdoor spaces. I love that there are community members who have a passion for progress, flourishing, and activism.<span class=\"Apple-converted-space\"> </span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/10/Jasmine-Craig.jpg"
}