{
  "id": 12241,
  "title": "Get to Know a Doylestownian: Britt Around Town",
  "slug": "get-to-know-a-doylestownian-britt-around-town",
  "date": "2022-02-08T11:02:18",
  "author": "Staff",
  "category": [
    "Live",
    "Play",
    "Stay",
    "Style",
    "Taste"
  ],
  "tags": [
    "Britt Around Town",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer Get to Know a Doylestownian is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide, in any way they see fit. For this month’s edition, we chatted with Brittany Brown, 31, a [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Dana Roberts • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\">G<span class=\"s2\">et to Know a Doylestownian </span><i>is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide, in any way they see fit. For this month’s edition, we chatted with Brittany Brown, 31, a local social media personality and creator of Britt Around Town. Her website and Instagram pay homage to Bucks County historic sites and attractions, entertainment venues, restaurants, and treasured outdoor spaces. Read on to find out all about Britt, including the best hidden gem she’s found in Bucks County.<span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p5\"><strong><span class=\"s3\">I grew up in</span></strong><span class=\"s4\">&#8230;.Warrington and Levittown. I am proud to be Bucks County born and raised.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">I’ve always loved Bucks County because</span></strong><span class=\"s1\">&#8230;.If I had to be completely honest, I’d have to say that I never truly appreciated the beauty of Bucks County until I got older. It wasn’t until I started spending time exploring Bucks County’s parks and towns and digging into our area’s history that I began to fall in love with our community and its culture.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">I created Britt Around Town</span></strong><span class=\"s4\">&#8230;.out of a passion for taking photos and a love of my community. For as long as I can remember, I have had a camera in my hand documenting life as I lived it. It has been such a dream to be able to use that passion to help others along the way.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My passion for supporting local businesses</span></strong><span class=\"s1\">&#8230;began when I first started volunteering with Pine2Pink in 2018. Through the foundation, I had the pleasure of discovering new places around the county via their scavenger hunt. I got to know the business owners and hear their stories, and I felt a calling to promote them and help them grow.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My Instagram posts</span></strong><span class=\"s1\">&#8230;. aim to be diverse, fun and informative. I’ve covered all sorts of topics, from local travel, to shopping, health, fitness, beauty, food and more. The goal of my posts is to always remain authentic and give my followers recommendations through my personal experiences, just as I would give to my family and friends.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">To choose a new business to feature or a town to explore</span></strong><span class=\"s1\">…I either plan on spending a day in a town and go into places as I walk around or skim local hashtags on Instagram to see what’s new and exciting. This accounts for about 70% of the posts I generate; the other 30% comes from business requests or from recommendations from my followers.</span></p>\n<p class=\"p5\"><strong><span class=\"s5\">My full-time job is</span></strong><span class=\"s6\">&#8230;administrative assistant in the marketing department at a local engineering firm. People are always shocked to find out that Britt Around Town isn’t my full-time job.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">If I need a really good cup of coffee I head to</span></strong><span class=\"s1\">…. Stella’s House Blend in Sellersville, Brig O’ Doon Coffee in Ottsville or Homestead Coffee Roasters in Upper Black Eddy.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My favorite place to go out to dinner is</span></strong><span class=\"s1\">&#8230;just north of Doylestown – The Gardenville Hotel in Plumsteadville. My husband and I have made so many wonderful memories there, from countless nights playing pool on the APA league, date nights, anniversaries and birthdays. The Gardenville is so close to our heart that we even rented out the entire restaurant for our wedding reception in their banquet room. You are likely to find me ordering the same thing every time… Honey Garlic BBQ Wings (a combo you will not find on the menu) and mashed potatoes. Delicious!</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My favorite thing to photograph is</span></strong><span class=\"s1\">&#8230;food, probably to no one’s surprise. It’s what I post the most. I love when a photo looks so scrumptious that you can taste it just by looking at it.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">On my bedside table, you’ll find</span></strong><span class=\"s1\">&#8230;headphones to listen to music or podcasts before bed. I love local podcasts such as Visit Bucks County’s “From The Locals” podcast, Rotated Views, Bucks County Bytes, Cut the Karma, and After Five Media’s “No Prisoners” podcast.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My favorite thing to do in the winter in Bucks County is</span></strong><span class=\"s1\">&#8230;check out all the museums and historical locations in our area, including the Bucks County Children’s Museum, Fonthill Castle, Pearl S. Buck House and the Michener Art Museum. I also love visiting the local breweries along the Bucks County Ale Trail, dining in one of Bucks County’s fantastic restaurants and, of course, shopping!</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">On Valentine’s Day, I am</span></strong><span class=\"s4\">… looking forward to a date night and dinner with my husband. Where that will be is yet to be decided, but I’m hoping it’s someplace we haven’t yet experienced.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">The best hidden gem I’ve found through my blog/Instagram is</span></strong><span class=\"s1\">&#8230;Arielle’s Country Inn in Sellersville. This adorable restaurant is in a historic stone building that at one time served as a stagecoach stop. Their menu includes a selection of delicious cuisine that exceeds all expectations – my favorite menu item was the grilled bratwurst appetizer wrapped in a puff pastry.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">I would like to travel to</span></strong><span class=\"s1\">&#8230;small towns across the United States. As a huge lover of Disney history, it is also a dream to visit Walt Disney’s hometown of Marceline, Missouri that served as the inspiration behind Main Street USA in Disneyland.</span></p>\n<p class=\"p5\"><span class=\"s2\"><strong>I always tell people to visit Doylestown because</strong>.</span><span class=\"s1\">.. of the wide variety of things there are to do. There’s something here for everyone!  Dozens of highly recommended restaurants, plenty of historical places, Kid’s Castle, shops and more!</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">The most rewarding part of operating Britt Around Town</span></strong><span class=\"s1\">…is hearing businesses tell me when others have visited based on my recommendation and to have my followers reach out and tell me that they never knew a place existed until I posted about it. I also get so excited when visitors planning a trip to Bucks County reach out to me for suggestions. Finally, I am so honored to have been voted the winner of the 2021 Bucks Happening List’s Best in Bucks County Social Media Personality and to have been nominated once again for the current 2022 voting season!</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">You can follow me</span></strong><span class=\"s1\">&#8230;. @brittaroundtown on social media. While Instagram and Facebook remain the platforms that I update most frequently, you can find me occasionally posting on Tiktok, Twitter and LinkedIN. You can also head on over to <a href=\"http://www.brittaroundtown.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.brittaroundtown.com</a> for some fun discounts, blog articles, a business directory and more!</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/02/Britt.jpg"
}