{
  "id": 13652,
  "title": "Get to Know a Doylestownian: The Simek Family",
  "slug": "get-to-know-a-doylestownian-the-simek-family",
  "date": "2022-06-14T15:50:45",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "dana roberts",
    "doylestown cardinal",
    "Get to Know a Doylestownian: The Simek Family"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer Get to Know a Doylestownian is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide, in any way they see fit. In honor of May being National Foster Care month, we wanted [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><strong>By Dana Roberts</strong> • </span><span class=\"s1\">The Cardinal Contributing Writer</span></p>\n<p class=\"p3\"><strong><span class=\"s1\">G</span><span class=\"s3\">et to Know a Doylestownian </span></strong><span class=\"s1\"><i>is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide, in any way they see fit. In honor of May being National Foster Care month, we wanted to feature a family in Doylestown who has gone through the process of fostering, and who have advocated immensely for foster care themselves. We had the honor of chatting with Alexis Ridge-Simek and Joe Simek, parents to two daughters, one of whom they adopted through fostering. Alexis and Joe founded their non-profit, The Fiaria Project, Inc., in 2016, which is dedicated to supporting foster families through transitions. In addition, Alexis and Joe also own Dragonfly Yoga, a well-known yoga studio in the borough which closed its brick-and-mortar location and went mainly virtual during the pandemic but will be reopening this month at 164 Green Street! Here’s what the couple had to say:</i></span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>We met</strong>&#8230;.</span><span class=\"s2\"> way back in 1999 at Arizona State University, where it took a while for Joe to get the hint that he should ask Alexis out. We graduated in December 2001 and moved to Chicago.</span></p>\n<p class=\"p5\"><span class=\"s4\"><strong>We knew we were each other’s “person” because</strong>&#8230;.</span><span class=\"s5\"> on one of our first dates, we both discussed how we wanted to adopt children and save the world. We fell into complete truth with each other: no games, no hidden agendas; it was if we had been together for lifetimes and were just catching back up and ready to move forward yet again.</span></p>\n<p class=\"p5\"><span class=\"s4\"><strong>We settled in Doylestown because</strong>&#8230;</span><span class=\"s5\"> Alexis is originally from Bucks County, having grown up in Newportville, at the lower end of the county. Once we decided to begin our family and settle somewhere, we knew we wanted to be around family and Alexis has a large web of relatives in the area. We often travel back to Phoenix to visit Joe’s family.</span></p>\n<p class=\"p5\"><span class=\"s4\"><strong>We decided to open our yoga studio, Dragonfly Yoga</strong>…</span><span class=\"s5\"> right after we got married in 2005. Joe was working at the Intelligencer and Alexis was set on opening a studio. Since we graduated right after 9/11, Alexis’s hopes for working for the tourism industry were dashed, so she enrolled in a yoga certification program at Eight Limbs Yoga in Chicago. After years of back pain, Alexis had found relief from yoga, which she had started practicing at the age of 17.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>After 2 years of mainly virtual yoga classes, our studio will re-open</strong>…</span><span class=\"s2\"> this month! We are elated to have been able to watch the universe unfold its plan. We often discuss the yogic philosophy of creation and destruction, and with our yoga studio, we have been able to see this cycle manifest. Our studio rent increased during the pandemic, and we knew we could not support such a high rent while many people were not comfortable practicing yoga indoors. We pivoted to online classes and eventually added outdoor classes at Bucks County Audubon and the Michener Art Museum. All the while, we were searching for a place to call home for Dragonfly and our nonprofit, The Fiaria Project. The space we settled on is right next door to the old yoga studio space! After zoning hearings, architects, plumbers, electricians, builders, masons and inspectors, we are finally ready to open. We were carried through the past two years by the support of our outstanding yoga community and friends and family in the area.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>Our favorite thing to do as a family is</strong>…</span><span class=\"s2\"> travel. We are so fortunate to have traveled extensively before the pandemic. During the pandemic, we took the yoga show on the road and taught from the Florida Keys, Chicago, Denver, Phoenix, Santa Fe and more. The kids have always been great travelers and we do it on a budget, staying with friends and family, renting rooms from locals and knowing how to pack everything we need into one backpack.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s6\"><strong>After having our biological daughter in 2008, we decided to foster in 2011 because</strong>…</span><span class=\"s7\"> we always knew we wanted to adopt, but after meeting with multiple adoption agencies, we were disheartened. Adoption was very expensive— at the time, over $50,000. We learned that if you adopted a child that was Black, the adoption would be less, more like $35,000. There was literally a value being assigned to different races of children. We could not play any part in this, so we researched foster-to-adopt programs through Bucks and Philadelphia Counties. We learned so much! Not only was adoption essentially free; there were no “sliding fee scales.” Instead, it was simply children who wanted and needed to be cared for. It became the obvious choice for our family. We wish more people would consider fostering-to-adopt.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>Having Aria placed with us initially was</strong>&#8230;</span><span class=\"s2\"> the result of one fateful phone call. I was running out the door on my way to teach an evening yoga class. “Hi, this is DHS. We have a two-week-old premature newborn — can you take her tonight?” They offered no other details. “Can I speak with my husband?,” I asked. “You have one minute,” they replied. I yelled down the stairs to Joe, who was playing with Fiona: “Joe, do you want to have a baby tonight?” “Sure, why not,” he joked. “Fiona, you’re about to be a big sister,” he told our older daughter. It was a “you have to laugh” sort of situation.</span></p>\n<p class=\"p5\"><span class=\"s5\">Aria showed up three hours later. We had been scrambling. It was like a bat signal went out over our house. Neighbors showed up with bassinets, car seats for a premature child, diapers, and formula. Friends even offered to wet nurse. It was absolute love coming from every direction.</span></p>\n<p class=\"p5\"><span class=\"s5\">And there she was — all four pounds of her. The social worker stood outside and handed her to us. She was wrapped in so many blankets. As I pulled back the blankets to see her face, we all gasped. Fiona spoke first: “She is so beautiful.” And she was, but she was also small, really small, like should still be in a hospital small. I am sure now looking back, that had she been born to white parents with health insurance, she would have been in the hospital for many more weeks.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s5\">But we stayed up all night, every night, making sure she was breathing, holding her against our bare chests so she could gain weight. We did the best we knew how.</span></p>\n<p class=\"p5\"><span class=\"s6\"><strong>The process of adopting Aria from fostering took</strong>&#8230;.</span><span class=\"s7\"> two and a half years. I do not want to dissuade anyone from ever fostering-to-adopt, but it is not for the faint of heart. We have many stories to tell, from parent training classes to courtroom appearances, to prison visits to see biological mom. The caseworkers, lawyers, and judges do the best they can with limited resources and in difficult situations, but it’s an emotional rollercoaster for everyone involved. Still, we would have waited twice as long if that’s what it took.</span></p>\n<p class=\"p5\"><span class=\"s6\"><strong>One of the most surprising things about fostering for us was</strong>&#8230;.</span><span class=\"s7\"> all of the awesome foster parents out there. On the news, you hear these terrible stories about foster parents, but never do you read about all the great foster parents. For example, over the last two weeks, we have seen two foster families take in sibling groups of four. Could you imagine taking in four children? That’s amazing generosity and caring. There are so many stories that need to be heard, so that more of us will decide to become foster parents and any negative stigma will wear away. BUCKS COUNTY NEEDS MORE FOSTER FAMILIES.</span></p>\n<p class=\"p5\"><span class=\"s6\"><strong>The most rewarding thing about fostering has been</strong>&#8230;</span><span class=\"s7\"> the same as anyone would think of the rewards of parenting. There is absolutely no difference in our minds between how we feel about our two children. They are both gifts. One was hard to birth and one was hard to adopt, but both are the loves of our lives.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>We got the idea for the Fiaria Project because</strong>&#8230;.</span><span class=\"s2\"> we knew we needed to do something! We knew the outpouring of love from our community was not what the foster parents in the rest of the county and surrounding areas were feeling. Often children are dropped off to a home with only the clothes on their backs: no PJ’s, no socks, no clean clothes or hairbrushes or toothbrushes for the next day. And these kids might have to go to school the next day, often borrowing clothes or making do with what they could grab. After meeting with foster parents and social workers, we designed our kits.</span></p>\n<p class=\"p5\"><span class=\"s2\">Don’t get us wrong, we would love to solve all the problems of the foster care system, but we don’t have the bandwidth or the financial and social pull to make this happen. We saw this as a problem, which we knew we could help fix. We were inspired by an organization called Arizona Helping Hands, which has a similar mission. We have been able to work with them annually to see what improvements we can make and aspire to work at their level of service. They currently serve the entire state of AZ.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\"><strong>The name “Fiaria” comes from</strong>&#8230;</span><span class=\"s5\"> a blend of our daughter’s names, Fiona and Aria. They inspire us to do more and be better humans for our community.</span></p>\n<p class=\"p5\"><span class=\"s4\"><strong>Managing a yoga studio and non-profit together and raising a family</strong>&#8230;</span><span class=\"s5\"> requires an all-hands-on-deck family. Luckily, our schedules are somewhat flexible. We are grateful that service and yoga are the foundation of our lives. Before we walk out the door each morning, we breathe and OM together. It’s important to stop for one moment, remember that we love each other, and that each day holds a great opportunity for us and for our community, nation and planet.</span></p>\n<p class=\"p5\"><span class=\"s4\"><strong>The Fiaria Project “Transition Kits”</strong>&#8230;</span><span class=\"s5\"> consist of five new outfits, socks, underwear, pajamas, toiletries, a backpack, a book and a handmade blanket or quilt, along with additional items of comfort and care. We sometimes will get requests for specific items and work to make that happen as well.</span></p>\n<p class=\"p5\"><span class=\"s4\"><strong>We store all the supplies for the transition kits</strong>&#8230;</span><span class=\"s5\"> in our soon-to-be open space in Doylestown. That’s why we are running our “Forever Home” Capital Campaign. Here, we will have a permanent space for an office and warehouse. So many details have gone into creating this space. Having one office to work out of will be much better than the makeshift places we are using now.</span></p>\n<p class=\"p5\"><span class=\"s4\"><strong>If a family is considering fostering, we would tell them</strong>&#8230;</span><span class=\"s5\"> go for it! Get support from friends and community, call Bucks County Children and Youth. Maybe start as a respite care parent, who just watches foster children for weekends or in placement emergencies. Email us if you like, as we are happy to share suggestions.</span></p>\n<p class=\"p5\"><span class=\"s4\"><strong>There are many ways to give back to the fostering community and support the Fiaria project, including</strong>…</span><span class=\"s5\">supporting our “Forever Home” Capital Campaign. Beyond creating a space for our organization, we will also be launching wellness programs for foster children. Phase one of the program will include “Wellness Kits” which will be distributed to foster families.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s5\">These will include interactive books on mindfulness and breathing, ways to balance anxiety and anger, yoga mats, free classes at Dragonfly Yoga Studio, access to wellness apps, and more. In our second phase, we will begin to research how we can create a therapeutic program for foster children, parents and social workers who are all traumatized by the foster care system.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\"><i>To find out more about The Fiaria Project or to donate or learn about ways to give, please visit <a href=\"http://fiaria.org\" target=\"_blank\" rel=\"noopener noreferrer\">fiaria.org</a>, or email at <a href=\"mailto:fiariaproject@gmail.com\">fiariaproject@gmail.com</a>. To learn more about Dragonfly Yoga, please visit <a href=\"http://dragonflyyogastudio.com\" target=\"_blank\" rel=\"noopener noreferrer\">dragonflyyogastudio.com</a>.<span class=\"Apple-converted-space\"> </span></i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/06/Fiaria.jpg"
}