{
  "id": 18538,
  "title": "Get To Know Lambertville Mayor Andrew Nowick",
  "slug": "get-to-know-lambertville-mayor-andrew-nowick",
  "date": "2023-12-14T17:17:18",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "Andrew Nowick",
    "doylestown cardinal",
    "Mayor of Lambertville"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer “Get to Know a Doylestownian” is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide; in any way they see fit. This month, we extended this feature’s residency “parameters” and chatted with [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Dana Roberts • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><i>“Get to Know a Doylestownian” is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide; in any way they see fit. This month, we extended this feature’s residency “parameters” and chatted with Andrew Nowick, the Mayor of Lambertville, the charming town across the river. Nowick took the oath of office in January 2022 and will serve through December 31, 2024. Nowick came into the position of Mayor during one of the most difficult times in Lambertville’s history: in the aftermath of Hurricane Ida, which damaged over 400 residences. He’s worked hard throughout his term thus far to make necessary repairs to the city’s infrastructure, all the while championing Lambertville as a highly desirable place to live. He notes that it’s routinely voted among the 10 prettiest towns in the country; but more importantly, is a place where community is deeply fostered. During the month in which we are reminded to give thanks, Nowick’s view that his mayorship is a way to give back to the community that has been so welcoming to his own family is an astute reminder for us all to be grateful for the town we live in.</i></p>\n<p class=\"p5\"><b>I’ve lived in Lambertville…</b><span class=\"s1\"> since 2011.</span></p>\n<p class=\"p6\"><span class=\"s2\"><b>I grew up in…</b></span><span class=\"s1\"> an old farmhouse in western Massachusetts.</span></p>\n<p class=\"p6\"><span class=\"s2\"><b>My professional background is…</b></span><span class=\"s1\"> very varied. I’ve worked as a waiter, a gardener, a hotel concierge, a manager at Ralph Lauren, and a personal assistant in France.</span></p>\n<p class=\"p6\"><span class=\"s2\"><b>My family includes:</b></span><span class=\"s1\"> my husband of twenty years, our three sons, and a rascally border terrier called Archer.</span></p>\n<p class=\"p6\"><span class=\"s2\"><b>I always tell people to visit Lambertville because…</b></span><span class=\"s1\"> it’s the best place I have ever lived, and I know they’ll find lots to enjoy.</span></p>\n<p class=\"p6\"><span class=\"s2\"><b>I decided to get involved in local government…</b></span><span class=\"s1\"><b> t</b>o give back to the community I love so much.</span></p>\n<p class=\"p6\"><span class=\"s2\"><b>I decided to run for mayor because…</b></span><span class=\"s1\"> I thought the city needed a full-time mayor who could devote more energy and time to what is a surprisingly complex organization.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><b>When I learned I won the mayoral election, I…</b><span class=\"s1\"> was absolutely delighted. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\"><b>During my term so far, I have…</b></span><span class=\"s1\"> become acquainted with many of our wonderful residents and business owners. Being a mayor who can be out and about every day is great fun, and when I need a break from administrative work, I go right out in the streets. Following a year’s work of recovery from Hurricane Ida, my most important and ongoing policy initiatives are centered around climate resilience and flood preparedness and mitigation.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><b>People would be surprised to know that…</b><span class=\"s1\"> the mayor is an introvert.</span></p>\n<p class=\"p6\"><span class=\"s2\"><b>My kids’ reaction to me being elected mayor was:</b></span><span class=\"s1\"> Does this mean we have to walk the dog more often?</span></p>\n<p class=\"p6\"><span class=\"s2\"><b>If I need a really good cup of coffee I…</b></span><span class=\"s1\"> head to my own kitchen or any of our terrific coffee shops in town. This mayor has no favorites, only a happy rotation of coffee shops, restaurants, and local businesses.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\"><b>The quality that sets Lambertville apart from Doylestown and New Hope is…</b></span><span class=\"s1\"> our community’s deep appreciation of its history and small-town culture.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\"><b>I am really good at&#8230;</b></span><span class=\"s1\">taking fifteen-minute naps while sitting in my office chair.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\"><b>Right now, I’m reading…</b></span><span class=\"s1\">This is Happiness, by Niall Williams.</span></p>\n<p class=\"p6\"><span class=\"s2\"><b>My favorite spot in Lambertville is…</b></span><span class=\"s1\"> the front room in the historic Holcombe house at Holcombe Park.</span></p>\n<p class=\"p6\"><span class=\"s2\"><b>If I need to get a gift for someone, I…</b> </span><span class=\"s1\">love to go to the Central Business District, where I might buy a rare book, a tin of Portuguese sardines, some small antiques, or a bottle of wine. The last gift I got for someone was a pot scrubber from Foxy Reds, which was a big success.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\"><b>My favorite place to walk our dog Archer…</b></span><span class=\"s1\"> is from our house on N. Union Street to Goat Hill Overlook.</span></p>\n<p class=\"p6\"><span class=\"s2\"><b>I hope that my 3-year term…</b></span><span class=\"s1\"> reminds people that to be a part of a community, you need to volunteer, you need to be of use, and that local politics doesn’t have to be divisive or uncaring. The mayor sets the tone and, together, we do the work. It’s our City and it is what we make it.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/Mayor-Andrew-Nowick.jpg"
}