{
  "id": 11798,
  "title": "High School Sweethearts Bring Love and Affection to Doylestown Inn",
  "slug": "high-school-sweethearts-bring-love-and-affection-to-doylestown-inn",
  "date": "2021-12-10T14:42:22",
  "author": "Staff",
  "category": [
    "Stay",
    "Style",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "doylestown inn",
    "hattery stove and still restaurant",
    "jody quigley",
    "john lund",
    "susan smith",
    "Todd and Samantha (Sam) McCarty"
  ],
  "excerpt": "<p>By John Lund and Susan Smith • @DoylestownBoroBuzz • The Cardinal Contributing Writers If you’ve visited Doylestown, but have not stayed at the Doylestown Inn, then you missed one of the greatest gems of this town. The building that currently holds The Doylestown Inn was built in 1871 and began its long tenure in 1902 [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By John Lund and Susan Smith</strong> • @DoylestownBoroBuzz • The Cardinal Contributing Writers</p>\n<p class=\"p3\"><i>I</i><i>f you’ve visited Doylestown, but have not stayed at the Doylestown Inn, then you missed one of the greatest gems of this town. The building that currently holds The Doylestown Inn was built in 1871 and began its long tenure in 1902 as Hotel Pollock. This original inn sat in proximity to a small hat factory and a cigar store. The, now connected, two buildings gave birth to what we are familiar with today, The Doylestown Inn and The Hattery Stove &amp; Still restaurant.<span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p5\"><i>In late 2012, the husband-and-wife team of Todd and Samantha (Sam) McCarty, along with their partner Jody Quigley, bought The Doylestown Inn and The Hattery. We sat down with Todd and Sam to learn more about their story.</i></p>\n<p class=\"p7\"><strong>Labor of Love</strong></p>\n<p class=\"p8\"><span class=\"s1\">In the early 2000’s, Todd and Sam were looking for a new business venture, and they stumbled across an opportunity in the heart of Doylestown. Todd, a veteran in the real estate industry, was working on a purchase deal for a client to buy the inn, then bank owned. The inn, after a few years of receiving limited attention, needed new owners to inject some love back into the business.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p8\"><span class=\"s1\">After a few months of working on the deal, it fell through, and Todd was starting from scratch. After another group of investors couldn’t get over the finish line, Todd and Sam took a leap of faith and purchased the building. The time they spent working on the property to sell it, became the time they spent falling in love with it!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p8\"><span class=\"s1\">Todd and Sam, married over twenty-years, are high school sweethearts and they previously had no experience in hotel management, nor, in restaurant management. Todd, as mentioned, was in real estate and Sam had a background in accounting. Lack of experience in the hospitality industry was not a deterrent; it was exactly what they were looking for to challenge their lives, and their growing family of three girls of ages, 17, 13 and 8.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><strong>The Doylestown Inn</strong></p>\n<p class=\"p8\"><span class=\"s1\">When the McCarty’s took over the hotel in 2012, it had 11 rooms and a block of offices. The offices, despite providing consistent revenue, did not fit the heart of the inn. So, in 2019, they joined forces with Daryl Rost, from Rost Artisan Design Build, and renovated the inn and restaurant.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p8\"><span class=\"s1\">The renovation consisted of removing the offices and adding 6 more rooms and a banquet space for up to 80 people. The renovation also provided the opportunity to enhance much of the innate character of the building by exposing brick walls and ceiling joists. Daryl also had the opportunity to use his creativity in a sustainability piece called the “Hat Tree”.<span class=\"Apple-converted-space\">  </span>He used much of the old wood and sculpted a tree inside the inn.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p8\"><span class=\"s1\">By the time the full renovation was completed in 2020, they faced the universal struggle of a global pandemic. As many people struggled through the pandemic, the hotel and restaurant industry were hit especially hard. At the time of our interview however, Todd believed that the business was almost back to pre-pandemic occupancy rates.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p8\"><span class=\"s1\">Today The Doylestown Inn is listed on the National Register of Historic Places. Some notable guests of the Inn include Henry Ford, Pearl S. Buck, Dorothy Parker, Henry Fonda and James Michener. Legend has it that Oscar Hammerstein II composed the lyrics for the Broadway musical South Pacific during a stay at the inn.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><strong>The Hattery Stove &amp; Still</strong></p>\n<p class=\"p8\"><span class=\"s1\">The initial plan, with the acquired restaurant, was to lease the business to “restaurant people.” After some discussions, the McCarty’s decided to develop and run the restaurant themselves. The restaurant’s history, previously a hat factory in the late 1800’s and early 1900’, was the inspiration for the name, The Hattery Stove &amp; Still…commonly known by locals as The Hattery.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p8\"><span class=\"s1\">Throughout the building, the McCarty’s strove to pay tribute to the heritage of the building through their style and décor choices. This is very apparent when sitting at the upstairs bar at The Hattery and seeing the derby hats, transformed into pendant lights, just over the bar counter. In addition, if you visit the basement portion of The Hattery, you will – one day soon – find a jug built into the wall to pay homage to the original name of the restaurant, Jug in the Wall, from 1902 to the late 1990’s.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p8\"><span class=\"s1\">The basement of the Hattery was also known to be a speakeasy during the period of prohibition in the early 1900’s. Bright, cheerful windows cast light into the dining area and fully stocked bar, which features a multitude of seasonal, rotating taps, as well as cutting edge cocktails and artisan wines. If stopping in for lunch or dinner, you must try the Open-Faced Pulled Pork Sandwich. You likely have not tasted one as good as Chef Bill Gilbo’s at The Hattery!</span></p>\n<p class=\"p7\"><strong>Holiday Events to Stay at The Doylestown Inn</strong></p>\n<p class=\"p8\"><span class=\"s1\">Guests of the inn are within minutes of dozens of restaurants, cafes, museums and an array of different shopping experiences. During the Christmas Season, think about coming into town to do Christmas shopping, have dinner, and just relax at the inn for the night.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p8\"><span class=\"s1\">Santa Clause will be at the inn on December 11th from 9am to 12pm. Also check out Holiday Lights Meander event during the month of December at Fonthill Castle.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p8\"><span class=\"s1\">In January, the McCarty’s will host an open house at the inn for the community to come in and explore on January 20th from 5:00pm to 7:00pm. Light refreshments with complimentary beer and wine will be served as you explore all the fabulous rooms. Check the inn’s website for more details at <a href=\"http://www.hatterydoylestown.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.hatterydoylestown.com</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/12/Todd-Sam.png"
}