{
  "id": 17018,
  "title": "Hugs and Love Are For Everyone",
  "slug": "hugs-and-love-are-for-everyone",
  "date": "2023-03-06T18:15:22",
  "author": "Staff",
  "category": [
    "Play"
  ],
  "tags": [
    "doylestown cardinal",
    "Edie Weinstein"
  ],
  "excerpt": "<p>By Edie Weinstein • Special to The Cardinal Once upon a time, a woman decided to make the world a more welcoming, embracing place, since she saw that often, people felt alone and disconnected from those around them. They didn’t always know how to ask for the nurturing, platonic touch, by consent that they desired. [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong><span class=\"s1\">By Edie Weinstein • </span></strong><span class=\"s1\">Special to The Cardinal</span></p>\n<p class=\"p3\"><span class=\"s3\">O</span><span class=\"s2\">nce upon a time, a woman decided to make the world a more welcoming, embracing place, since she saw that often, people felt alone and disconnected from those around them. They didn’t always know how to ask for the nurturing, platonic touch, by consent that they desired. She pondered how she might help meet that need since for many people, throughout their lives, touch was either sexual, abusive, coercive, limited, or non-existent.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">An idea came to her that she would gather a group of playful and kind friends at 30th Street Station in Philadelphia which is known as ‘The City of Brotherly Love and Sisterly Affection’. They would carry with them signs that let passengers know that they were offering hugs.</span></p>\n<p class=\"p5\"><span class=\"s2\">Amazingly, a majority of the people accepted the hugs and love they were sharing on a cold weekend in February of 2014. She smiled as she imagined that they carried that energy with them back into their daily lives. She chose that particular day, the 15th of February since she wanted people to understand that hugs and love are to be shared every day and that love is for everyone and not just celebrated by couples on Valentine’s Day.</span></p>\n<p class=\"p5\"><span class=\"s2\">Because it was a FREE HUGS Flash mob, friends began to refer to them as Hugmobsters. She added the tagline. ‘armed with love,’ so it counteracted the violent image of mobsters. She estimates that she/they have hugged thousands of people in the interceding nine years. It warms her heart, and she has been told that it does the same for those at the receiving end, although, she realizes that the hugs are mutual.</span></p>\n<p class=\"p5\"><span class=\"s2\">I am that woman. Connecting with people heart to heart and hug to hug is one of my greatest joys. Hugs bring people together across all divides. When I hug people, I don’t always know their religion, gender, sexual orientation, or political views, unless they tell me.</span></p>\n<p class=\"p5\"><span class=\"s2\"><span class=\"Apple-converted-space\"> </span>I have a few rules around hugging. I always ask first and get a verbal yes, or the other person opens their arms. I hug heart to heart if they are comfortable with it. I let them be the first one to let go. If the other person is a child, I say to the adult with them, “If it’s okay with you and okay with the child may I hug them?” If the adult says yes, but the child says no, either verbally, or non-verbally, then I respect that. I remind them that their body is their own and hugs are an option.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Even with my grandson, I offer the option to hug, high five, blow kisses or virtual hugs, where he can hug himself. He usually opts for hugs.</span></p>\n<p class=\"p5\"><span class=\"s2\">Since the pandemic began, I have offered that same hug menu to strangers on the street of Doylestown. People seem to be more comfortable with those choices. I remind them that even though we may not hug, we can still love.</span></p>\n<p class=\"p5\"><span class=\"s2\">I have also donned a t-shirt that reads, “FREE MOM HUGS” and offered them at Pride festivals and parades in the area. People have cried in my arms, telling me that their parents didn’t hug them when they came out to them. I was grateful to be a surrogate mom at that moment.</span></p>\n<p class=\"p5\"><span class=\"s2\">Psychologist Virginia Satir, who died in 1988 said, “We need four hugs a day to survive, eight hugs a day for maintenance and 12 hugs a day for growth.” Humans have skin hunger that is essential to meet, just as is food hunger. Without it, we fail to thrive.</span></p>\n<p class=\"p5\"><span class=\"s2\">On October 1st, 2022, I offered my first TEDx talk called Overcoming the Taboo of Touch which focuses on the amazing power of safe, nurturing, platonic touch by consent. <a href=\"https://www.youtube.com/watch?v=kZQGcp7zf64\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.youtube.com/watch?v=kZQGcp7zf64</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/03/ediefreckleshugs.jpg"
}