{
  "id": 19890,
  "title": "JIGJAM Brings Irish Americana to Sellersville Theater’s Stage",
  "slug": "jigjam-brings-irish-americana-to-sellersville-theaters-stage",
  "date": "2024-06-20T20:18:17",
  "author": "Staff",
  "category": [
    "Play"
  ],
  "tags": [],
  "excerpt": "<p>By Jamie Bucuy • Special for the Cardinal In May, in celebration of international talent and musical prowess, Sellersville Theater welcomed the beloved Irish Blue Grass fusion band JIGJAM for a night of unforgettable entertainment. With a repertoire that blends traditional Irish melodies with contemporary blue grass flair, JIGJAM took the stage with an electrifying energy [&hellip;]</p>\n",
  "content": "<p><b>By Jamie Bucuy <em>• </em></b>Special for the Cardinal</p>\n<p><span style=\"font-weight: 400;\">In May, in celebration of international talent and musical prowess, Sellersville Theater welcomed the beloved Irish Blue Grass fusion band JIGJAM for a night of unforgettable entertainment. With a repertoire that blends traditional Irish melodies with contemporary blue grass flair, JIGJAM took the stage with an electrifying energy that immediately captivated the audience. </span></p>\n<p><span style=\"font-weight: 400;\">JigJam entered the scene in Nashville in March 2023 to critical acclaim. In the heart of country music, the band played alongside country stars like Garth Brooks and Lauren Alaina. &#8220;We&#8217;re using our traditional Irish roots and heritage, and blending that music with bluegrass music, and finding that crossover,” said band leader Jamie McKeogh. “We&#8217;re putting our own stamp and a modern-day twist on it.&#8221; From the first strum of the guitar to the final flourish of the fiddle, the band&#8217;s infectious enthusiasm was impossible to resist.</span></p>\n<p><span style=\"font-weight: 400;\">Nestled in the picturesque landscape of Bucks County, the Sellersville Theater is a hidden gem that marries artistry and culinary excellence. This historic mainstay offers an unforgettable experience that tantalizes the senses and celebrates the richness of culture found in this region.</span></p>\n<p><span style=\"font-weight: 400;\">Since its inception, the theater has been a gathering place for artists and audiences alike, and hosts a diverse array of performances spanning music, theater, and comedy. Its stage has been graced by renowned acts from around the globe and draws patrons from far and wide to bask in the magic of live entertainment. Originally built in 1894 as the Odd Fellows Hall, the theater has undergone several transformations over the years, evolving into the beloved cultural hub it is today.</span></p>\n<p><span style=\"font-weight: 400;\">Adjacent to the theater stands the Washington House, a meticulously restored 19th-century building. This now esteemed restaurant exudes old-world charm while embracing modern culinary sensibilities. With a commitment to locally sourced ingredients and artisanal craftsmanship, the Washington House elevates dining to an art form and offers a menu that pays homage to the rich agricultural heritage of Bucks County.</span></p>\n<p><span style=\"font-weight: 400;\">What truly sets the Sellersville Theater and Washington House apart is their closely woven relationship&#8211;each enhancing the other to create a truly immersive experience for patrons. Whether enjoying a pre-show dinner at the Washington House or unwinding with post-show drinks at the theater&#8217;s bar, guests are invited to savor every moment and embrace the magic of local, national, and international performing arts.</span></p>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/06/Sellerville-Thater.png"
}