{
  "id": 19425,
  "title": "Joy and Bananas: Go with YoYo",
  "slug": "joy-and-bananas-go-with-yoyo",
  "date": "2024-04-22T05:26:17",
  "author": "Staff",
  "category": [
    "Fit"
  ],
  "tags": [
    "doylestown cardinal",
    "Go With YoYo",
    "julie jules",
    "Yvonne “YoYo” Kusters"
  ],
  "excerpt": "<p>By Julie Jules @ForTheLoveOfDoylestown • The Cardinal Contributing Writer Bucks County native and Doylestown resident Yvonne “YoYo” Kusters is the creator and founder of Go With YoYo, a fitness program for children. Well-known in the youth fitness community, her work is featured on outlets such as Amazon Prime, YouTube, GoZone, Epic, Sensical, and others. Yvonne [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong><span class=\"s1\">By Julie Jules @ForTheLoveOfDoylestown • </span></strong></em>The Cardinal Contributing Writer</p>\n<p class=\"p4\"><span class=\"s3\">B</span><span class=\"s2\">ucks County native and Doylestown resident Yvonne “YoYo” Kusters is the creator and founder of Go With YoYo, a fitness program for children. Well-known in the youth fitness community, her work is featured on outlets such as Amazon Prime, YouTube, GoZone, Epic, Sensical, and others. Yvonne has authored a fitness curriculum that is used by fitness instructors, parents, and YMCA directors across the world. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\">In her videos, Yvonne is known for wearing banana shirts. “One of the biggest questions from my friends is how many banana shirts I own,” she smiles. “The answer is a lot! I like to tell the kids that bananas are always smiling, they hang out in bunches, and are also healthy and<span class=\"Apple-converted-space\">  </span>delicious.” (Her son’s first word was banana!) Yvonne adds that yellow is the color of sunshine, happiness, and positivity, which is clearly what she represents. Talking with her felt like sitting in the sun. She’s full of positivity and joy. Her happiness is contagious.<span class=\"Apple-converted-space\">   </span></span></p>\n<p class=\"p6\"><span class=\"s4\">Yvonne shares the experience of making her first video with me. After completing it she was so happy with how it felt, that she wanted to celebrate and went out to dinner. While editing the next day, she realized that her banana shirt had some green in it, which due to the green screen she used to record the video, created the illusion that she was hearing a shirt full of holes. Yvonne tells kids about this experience when she speaks to them at assemblies: “What do you think I did when I realized my shirt was full of holes for my first video?” she asks. The kids often respond with “You deleted it.” She then tells them no, the video was posted and is still up. “I’m still proud of it,” Yvonne says. “Nothing will be perfect<span class=\"Apple-converted-space\">  </span>Fail forward. To be successful, you will have to deal with a lot of failures. Just do it anyway and learn from it.”<span class=\"Apple-converted-space\">   </span></span></p>\n<p class=\"p6\"><span class=\"s2\">Growing up with a psychologist mother and an RN father, health and wellness were a constant theme in the house. Yvonne feels strongly that attitude, outlook, and perspective truly matter. “People need to change their mindset. Instead of dreading the gym, see going to the gym as a gift,” she says. Every time Yvonne goes to the gym, she puts her hand on her heart and says an inward thank you for the opportunity. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s5\">Yvonne also stresses this message to the kids. “Give yourself a hug for being here, say positive words to yourself, and keep your muscles and your mind strong.”<span class=\"Apple-converted-space\">  </span>The children are also invited to email her video clips of them exercising so that she can include them in her future videos. She receives videos from children all over the world. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\">Yvonne didn’t always plan on being in the fitness industry. She has a degree in architecture. But while in college, she became certified in fitness and created her first LLC. She taught kickboxing, weightlifting, and dance classes to sorority girls. She charged $1 per person for each class and 40-50 girls would show up for each class.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\">Working in an architecture firm, one of her jobs was to measure a boys’ bathroom for renovation. While on the ground measuring the bathroom floor, she found herself thinking “I’d rather crawl around on the floor of a boys’ bathroom than be stuck in an office.” This was when she began to realize that architecture was probably not for her. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\">Yvonne soon followed her passion: health, wellness, and fitness. She began teaching children, doing live entertainment, co-authored a book “Move” and eventually wrote a fitness curriculum. YouTube loved her mission and message so much, the platform contacted her and flew her out to Los Angeles. She is now part of a YouTube kid creator group that meets often to discuss ideas. Walmart also partnered with Yvonne and uses her original contact on its app, GoZone. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\">Yvonne’s future goal is simple: to try and get a bigger audience to help more kids, teachers, and parents. The world needs more smiling bananas in their life, and YoYo is sure to bring them. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\">To learn more about Yvonne, visit <a href=\"http://gowithyoyo.com\" target=\"_blank\" rel=\"noopener noreferrer\">gowithyoyo.com</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/04/Go-with-Yo-Yo.jpeg"
}