{
  "id": 12684,
  "title": "Keith Haring: A Radiant Legacy is On View at the Michener Art Museum",
  "slug": "keith-haring-a-radiant-legacy-is-on-view-at-the-michener-art-museum",
  "date": "2022-04-08T14:57:56",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "Keith Haring",
    "The James A. Michener Museum"
  ],
  "excerpt": "<p>The James A. Michener Museum presents Keith Haring: A Radiant Legacy, an exhibition of more than 100 unique and notable works from a private collection, on view through July 31, 2022. Among the works featured are two rare Subway drawings, complete suites of many of Haring’s icon print series, and “Medusa Head” (1986), the largest [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">T</span><span class=\"s2\">he James A. Michener Museum presents Keith Haring: A Radiant Legacy, an exhibition of more than 100 unique and notable works from a private collection, on view through July 31, 2022. Among the works featured are two rare Subway drawings, complete suites of many of Haring’s icon print series, and “Medusa Head” (1986), the largest print in the artist’s oeuvre.</span></p>\n<p class=\"p3\"><span class=\"s3\">Born in Reading, Pennsylvania, and raised in Kutztown, Keith Haring (1958–1990) was arguably one of the most accomplished and prominent American artists of the 1980s. Working across a variety of mediums including painting, print, posters, drawing, sculpture, and street art, he developed a style that was instantly recognizable. Through his friendships with artists Kenny Scharf and Jean-Michel Basquiat, he became interested in the colorful graffiti art that peppered city streets, which would become a major influence on his meteoric rise.</span></p>\n<p class=\"p3\"><span class=\"s4\">During his brief 10-year career, Haring rewrote the rulebook for contemporary art, integrating the seemingly discrete arenas of New York City’s gritty downtown counterculture and uptown art aristocracy. A friend of Andy Warhol’s, he unabashedly developed and promoted his brand through commercial partnerships, mass-market products, and even his own storefront.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s4\">Throughout his career, Haring was featured in more than 100 solo and group exhibitions and produced over 50 public works of art in cities around the world. Many of his works were designed for charities, hospitals, daycare centers, and orphanages.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s4\">For more information, visit <a href=\"http://michenerartmuseum.org\" target=\"_blank\" rel=\"noopener noreferrer\">michenerartmuseum.org</a>.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/04/Keith_Haring_Studio-1.jpg"
}