{
  "id": 15414,
  "title": "Kindness Korner",
  "slug": "kindness-korner-2",
  "date": "2022-10-25T23:29:08",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "Joanne Petrun and Edie Weinstein",
    "kindness korner"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer “Kindness costs nothing; generosity of spirit is as free as the wind.” Joanne Petrun and Edie Weinstein truly embody that statement. The two women partnered to create Bucks County Kind, an organization that focuses on spreading kindness throughout the community.  Petrun, a clinical supply program manager and [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Dana Roberts • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><strong><span class=\"s2\">“</span><span class=\"s3\">Kindness costs nothing; generosity of spirit is as free as the wind.”</span></strong></p>\n<p class=\"p6\"><span class=\"s5\">J</span><span class=\"s4\">oanne Petrun and Edie Weinstein truly embody that statement. The two women partnered to create Bucks County Kind, an organization that focuses on spreading kindness throughout the community. </span></p>\n<p class=\"p8\"><span class=\"s4\">Petrun, a clinical supply program manager and a mother of three from Buckingham, experienced the power of kindness after the birth of one of her children, when someone brought her an elaborate  meal. Petrun believes that kindness can inspire people to feel differently and to pay it forward. She has seen the faces of strangers light up with gratitude at the smallest acts of kindness, such as paying for someone’s order at a bagel shop or paying a compliment to a passerby. </span></p>\n<p class=\"p8\"><span class=\"s4\">Weinstein, of Dublin, collaborated with Petrun to create Bucks County Kind earlier this year. For her, a memorable act of kindness occurred when a friend dropped off a 20-pack of toilet paper during the height of the pandemic. She’d never owned that much toilet paper at once, but appreciated the gesture.</span></p>\n<p class=\"p8\"><span class=\"s4\">Together, Petrun and Weinstein started a Facebook group to spread the message of kindness. A local graphic designer made cards for the organization to hand out and leave at various businesses. </span></p>\n<p class=\"p8\"><span class=\"s4\">The goal of Bucks County Kind, as well as the cards that are its signature, is multifold: to encourage members of the community to join the Facebook group, to post to the page any acts of kindness witnessed, to encourage a receiver of a card to perform a random act of kindness, and to share locations to see where the cards and their resulting kindnesses have spread. </span></p>\n<p class=\"p8\"><span class=\"s4\">Weinstein, a grandmother of two and a full-time psychotherapist by trade, finds joy and fulfillment from the movement Bucks County Kind is creating. Prior to the pandemic, she was involved in a free hug project. She finds Bucks County Kind’s method to be even more successful. “Nobody says no to the cards. Plus, the cards help promote local businesses,” she says. The women have handed out about 5,000 cards now, and their Facebook group hit over 1,000 members on August 15th. The 6ABC Action News featured the organization as part of its Be Kind series. </span></p>\n<p class=\"p8\"><span class=\"s4\">For those looking for a way to share small kindnesses, Petrun and Weinstein have some ideas. Keep it simple &#8211; say hello or thank you, smile at someone, talk to a cashier at the checkout line, give a compliment to a passerby, put coins in a meter that’s about to run out, double a recipe and give half to a friend or tired parent. Both women emphasize that kindnesses don’t have to be big to make a difference. </span></p>\n<p class=\"p8\"><span class=\"s4\">To get on board with the movement, join the Facebook group by searching “Bucks County Kind.” To get cards to share with others, visit local businesses or request some from the group. In the meantime, be kind, for, as they say, everyone you meet is fighting a battle you know nothing about.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/10/buckscountrykindjoanneandediecloseup.jpg"
}