{
  "id": 17903,
  "title": "LBK Design Build Gives Back to Community",
  "slug": "lbk-design-build-gives-back-to-community",
  "date": "2023-08-05T21:46:15",
  "author": "Staff",
  "category": [
    "Live",
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "LBK Design Build Gives Back to Community",
    "Natalya Bucuy"
  ],
  "excerpt": "<p>By Natalya Bucuy • The Cardinal Managing Editor When they say they can design and build, they mean business. And “they” is the LBK Design Build, an architectural renovation company with its new location in Doylestown. And for that, it has a showroom to show. The group, originally founded in 2014, recently moved to its [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong><span class=\"s1\">By Natalya Bucuy • </span></strong></em><span class=\"s1\">The Cardinal Managing Editor</span></p>\n<p class=\"p3\"><span class=\"s3\">When they say they can design and build, they mean business. And “they” is the LBK Design Build, an architectural renovation company with its new location in Doylestown. And for that, it has a showroom to show. The group, originally founded in 2014, recently moved to its new location at 4814 York Road. The building, an eye sore for years, got the much-needed refresh. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">The new headquarters move came with a rebrand and additional designers on staff at LBK Design Build. And it also brought the spirit of giving back to the community.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">At the debut of the new showroom, the company hosted a fundraising campaign with a goal to reach $10K. Associates reached out to clients, guests, and members as part of the donation drive. In-person donations were added to the funds. Currently, the campaign collected $3K and has expanded its reach. The raised funds go to childhood cancer research and benefit St. Jude’s Children’s Research Hospital. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">The group continues its fundraising efforts and is looking for more causes to which to contribute. It welcomes feedback from the community about new charity support opportunities.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">“Childhood cancer bothers me the most,” said Nick Kornea, the president of LBK Design Build. “We’d like to continue and grow the outreach in the community. Doylestown is a perfect American town with not too many corporate influences. I love the small business presence in town. We’re very happy to be in the area and we’re looking forward to becoming a staple in the community.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">LBK Design Build completely renovated the 1800s creamery and gave it a new life. The building stood vacant for a decade. “The upstairs and the downstairs have all been redone and updated,” said Jordyn Gaber, LBK Design Build Office Manager. A former chiropractic office, the building needed a facelift, and the firm got to work. The result is a state-of-the-art showroom, that kept the historically important elements, such as the original stonework, interior walls, brickwork, and the building’s layout.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">“We’ve always had a presence in the area,” Gaber says. “And now we can be closer to our community with a central location in Doylestown.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\"><i>Natalya Bucuy is a journalist, fiction, and non-fiction writer and the managing editor of the Cardinal. You can often find her roaming the streets of her beloved Doylestown in search of writing material, adventure, or both. To view more of her work, visit her website, <a href=\"http://nowwehaveastory.com\" target=\"_blank\" rel=\"noopener noreferrer\">nowwehaveastory.com</a></i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/08/PXL_20230503_164053429.jpg"
}