{
  "id": 13926,
  "title": "Local Spotlight with Danielle: Intrigue Fine Apparel",
  "slug": "local-spotlight-with-danielle-intrigue-fine-apparel",
  "date": "2022-06-26T15:42:57",
  "author": "Staff",
  "category": [
    "Style"
  ],
  "tags": [
    "Buckingham Green",
    "Danielle Gannon",
    "doylestown cardinal",
    "Intrigue Fine Apparel",
    "Local Spotlight with Danielle"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer Sisters Debbie &amp; Annette attribute their love for fashion to their mother, who made most of the girls’ clothes growing up. She would sew and piece together fabrics and create various outfits for the girls. This forced them to be creative with style and figure out ways [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Danielle Gannon</strong> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">S</span><span class=\"s1\">isters Debbie &amp; Annette attribute their love for fashion to their mother, who made most of the girls’ clothes growing up. She would sew and piece together fabrics and create various outfits for the girls. This forced them to be creative with style and figure out ways of dressing themselves to be on-trend.</span></p>\n<p class=\"p5\"><span class=\"s1\">When college years came around, Debbie went to the International Fine Arts, and Annette went to Philadelphia Textile. Shortly after that, they decided to go into business together. They found the space in Buckingham, and the rest is history!</span></p>\n<p class=\"p5\"><span class=\"s1\">Buckingham Green is the sweet shopping center that nests between 413 and Peddlers Village on York Rd. Here you’ll find a pizza shop, wine and spirits, a juice shop, old fashioned pharmacy, a deli, a nail place, Thai food, and a ladies’ boutique. Intrigue Fine Apparel. Intrigue has been here for 35 years. The sisters Annette &amp; Debbie opened in 1987 with the idea in mind to dress women of all shapes and sizes, making them feel good about themselves.</span></p>\n<p class=\"p5\"><span class=\"s1\">They began going to fashion shows and trade shows, handpicking all the pieces for their shop. They both were committed to being at the establishment daily to build and create the community they would be dressing. As time went on, they hired passionate staff that focused on building relationships. Many people can own a business, but it’s cultivating the community that makes the good ones stick around.</span></p>\n<p class=\"p5\"><span class=\"s1\">They host 8-12 events per year revolving around holidays, women, and local artists. They carry a variety of designers, and with each season, they introduce a new one. They have everything you need to feel like a million bucks! Bags, shoes, jeans, dresses, undergarments, jackets, and jewelry. They stand true to their mission of making fashion approachable and style attainable. They understand that trends are not for everyone, and they won’t let you leave with just anything. Debbie &amp; Annette want each person that leaves to feel dressed and beautiful.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The pieces they have are one of a kind! They are so perfectly chosen and merchandised. The one thing that stands out the most is the approach they have. You walk in, the space is impeccable, and the energy is so pure. You can walk around and “window shop” without feeling pressured. They are there for you to piece outfits together you wouldn’t have chosen on your own. They will tell you what looks good and what to leave behind. It feels calm and trusting.</span></p>\n<p class=\"p5\"><span class=\"s1\">“We are sisters and partners in crime. We both wear many hats being a small business, and we each share our gifts and have each other’s back. It is a blessing to work with my sister, and we would have it no other way.” Says Annette &amp; Debbie.</span></p>\n<p class=\"p5\"><span class=\"s1\">Whenever I need that “it” outfit, a statement piece, or a dress to attend an event, I head right to Intrigue. Not only are the options top of the line, but so are the owners.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">You can find them at <a href=\"http://www.intriguefineapparel.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.intriguefineapparel.com<span class=\"Apple-converted-space\"> </span></a></span></p>\n<p class=\"p4\"><span class=\"s1\">or IG: @intriguefineappareal</span></p>\n<p class=\"p4\"><span class=\"s1\">4920 York Road Unit #1120, Buckingham, PA, 18912</span></p>\n<p class=\"p4\"><span class=\"s1\"><a href=\"mailto:intrigueinfo1@aol.com\">intrigueinfo1@aol.com</a> <span class=\"Apple-converted-space\">  </span>• <span class=\"Apple-converted-space\">  </span>(215) 794-0422<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><span class=\"s3\"><i>Danielle Gannon is a local Bucks County entrepreneur. Mom to three, she is an English teacher at RedBarn Homeschool (a local co-op she co-founded), co-owner of Organnons Natural Market and Founder &amp; Managing Director of Local Spotlight with Danielle. Her passion is connecting people and creating community. She graduated with a degree in Journalism from Penn State University, went into real estate and sales, then business ownership. Residing in Ivyland, writing has always been a passion of hers. Find her on IG @localspotlightwithdanielle</i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/06/intrigueladies.jpg"
}