{
  "id": 20281,
  "title": "Local Detective Publishes Memoir and Airs True Crime Show This Fall",
  "slug": "local-detective-publishes-memoir-and-airs-true-crime-show-this-fall",
  "date": "2024-09-15T18:11:06",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [],
  "excerpt": "<p>By Dana Roberts • Cardinal Contributing Writer If you’re looking for a fast-paced book to cap off your summer reading list, add “3 Decades Cold”, by Chris McMullin, to your Amazon cart. This memoir tells the story of Detective McMullin’s impressive career, with a focus on his 30 years in the Bensalem Police Department, where [&hellip;]</p>\n",
  "content": "<p><b><em>By Dana Roberts </em><em>• </em></b>Cardinal Contributing Writer</p>\n<p><span style=\"font-weight: 400;\">If you’re looking for a fast-paced book to cap off your summer reading list, add “3 Decades Cold”, by Chris McMullin, to your Amazon cart. This memoir tells the story of Detective McMullin’s impressive career, with a focus on his 30 years in the Bensalem Police Department, where he became a detective in the Special Victims Unit, handling cases involving murderers, sexual predators, and violent criminals.</span></p>\n<p><span style=\"font-weight: 400;\">McMullin, 54, now works as a Lieutenant for the Bucks County Sheriff’s Office. He and his wife, Heather Hines, a local attorney who practices family law, live in Doylestown. McMullin chatted with us about his career, the inspiration behind his book, and his non-profit, Cold Case Initiative (www.coldcaseinitiative.org). He is also involved in a new true crime show that will premiere this fall (details still pending investigation).</span></p>\n<p><b>Q: Tell us about your career and background. </b></p>\n<p><b>A:</b><span style=\"font-weight: 400;\"> I began my career in North Wildwood, NJ in 1989 as a dispatcher and Class II Seasonal Officer and worked there until 1990. I was a patrol officer in Philadelphia from 1990-92. I was a Bensalem Police officer for 30 years, 23 of which I worked as a Detective. I grew up in the Mayfair section of Philadelphia and went to Father Judge High School. </span></p>\n<p><b>Q: How did you get the idea for your book?</b></p>\n<p><b>A:</b><span style=\"font-weight: 400;\"> I got the idea in 2017, after Geroge Shaw was convicted for the murder of Barbara Rowan, a 14-year-old girl who was murdered in 1984 and whose case wasn’t solved for 31 years. I worked on helping solve that case. My mentor, Frank Friel, who was the Chief of Police in Bensalem in the early 90&#8217;s, had written a book about his experiences investigating the Mafia. I always hoped that my career would contain something worthy of writing about. </span></p>\n<p><b>What was the process of writing like?</b></p>\n<p><span style=\"font-weight: 400;\">I began writing in 2018 and had a lot of difficulty getting traction. Eventually writing started to flow, and my friend Maria Viola Jefferson agreed to co-write with me. It was fun, but also frustrating at times because we had to omit a lot to keep it flowing and not too long.</span></p>\n<p><b>How was the Barbara Rowan case solved?</b></p>\n<p><span style=\"font-weight: 400;\">The Rowan case was solved through relentless police work by the Bensalem PD and County Detectives. Dep. Chief Mike Mosiniak (retired) was my partner, and DA Jennifer Schorn was the prosecutor. Without the two of them, the case would not have been solved. We used an investigating Grand Jury, a method that DA Schorn is an expert at, in my opinion. Upon conviction, I was relieved and a bit disappointed because Shaw was found guilty of third degree murder and not first degree. However, it was still a conviction. </span></p>\n<p><b>What was something interesting you learned when investigating Barbara Rowan’s case? </b></p>\n<p><span style=\"font-weight: 400;\">When I was 14 years old, in the summer of 1984, I attended Cherokee Day Camp in Bensalem. I had heard about the case back then because others at camp knew the Rowan family and one of the staff wound up being a witness as to Barbara&#8217;s whereabouts shortly before she disappeared. Decades later, when I read the case file, I remembered hearing about it as a teen. </span></p>\n<p><b>What is the mission of your non-profit, Cold Case Initiative? </b></p>\n<p><span style=\"font-weight: 400;\">Cold Case Initiative’s mission is to assist agencies in the United States by providing funding to offset the cost of scientific and investigative techniques being used to solve cold-case homicides and violent crimes, identify missing persons, and give names back to unidentified decedents.</span></p>\n<p><b>Where can readers get a copy of your book?</b></p>\n<p><span style=\"font-weight: 400;\">The book is available on Amazon and Genius Book Publishing. </span></p>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/09/Chris-McMullin-with-co-author-Maria-Viola-Jefferson.jpeg"
}