{
  "id": 17315,
  "title": "Local Spotlight with Danielle: Meet Gym Owner Mike Sobczak of Training For Warriors",
  "slug": "local-spotlight-with-danielle-meet-gym-owner-mike-sobczak-of-training-for-warriors",
  "date": "2023-04-12T14:24:20",
  "author": "Staff",
  "category": [
    "Fit"
  ],
  "tags": [
    "Danielle Gannon",
    "doylestown cardinal",
    "mike sobczak",
    "TRAINING FOR WARRIORS"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer I would like to introduce to you Training for Warriors, aka TFW owned and operated by Mike Sobczak.  TFW is a local gym right outside of Doylestown in a little shopping center in Plumsteadville. Sure, you may be thinking to yourself.. ok, there are a lot of gyms. [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Danielle Gannon • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">I</span><span class=\"s1\"><span class=\"Apple-converted-space\"> </span>would like to introduce to you Training for Warriors, aka TFW owned and operated by Mike Sobczak.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">TFW is a local gym right outside of Doylestown in a little shopping center in Plumsteadville. Sure, you may be thinking to yourself.. ok, there are a lot of gyms. Cross training, weight resistance, circuit training, hot yoga, dance gyms, etc… and there certainly are! However, do you know the person behind it all? If so, do they have the tenacity, stride, and spirit that you want to lead you?</span></p>\n<p class=\"p4\"><span class=\"s3\">I always felt that energy flows from the top down. Any corporate job or small business I have worked for, to the stores I shop in. it’s the leader who sets the tone. Typically this is the owner. Especially in our small mom and pop land of Bucks County. The owner is likely the one there every day, opening the door and running the show.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">When I walked into TFW, I met Mike. Mike, husband to Krista and father to Luca, 7 and Olivia, 2 is full of passion. His energy just lights up the entire space. I opened the door and he was “on”! Mike greeted me in a very authentic manner. He was happy to discuss what he did and more importantly, happy to engage and truly listen to what I had to say. He was present. He was kind, compassionate, and strong-willed.</span></p>\n<p class=\"p4\"><span class=\"s4\">“Culture and coaching is what makes this gym different,” states Sobczak. The 5,000-sq-ft space was lined with all you would expect to see in a functioning gym. Weights, bands, benches, and pull-up bars. What it had that I found unique was soul. I felt the true soul of the people that worked out there when I looked at the pictures of team events. When I observed the little “gifts” clients had handmade Mike over the years gracing the shelf. When I saw the little journals that they fill out each day when they come in.</span></p>\n<p class=\"p4\"><span class=\"s1\">Growing up in Morris County, New Jersey, Mike always dreamed of getting into law enforcement. Generations before him took this path and Mike felt the calling to do so as well. He went to Del Val for Criminal Justice, graduated, and had plans to take this path. An injury set him back and added a staggering amount of weight to his body. Sobczak was deflated. He was forced to take a different career path in behavioral health and turned to other forms of inspiration. Through a turn of events, Mike found the TSW brand. He relied on it for inspiration and was at the time working PT as a trainer at a gym. He wasn’t surrounded by who he needed to be to let this fire out. So, as any man with a true passion for life does, he went out and created it on his own.</span></p>\n<p class=\"p4\"><span class=\"s1\">Nine years ago, in March 2014, he opened in a firehouse. He went all in and rented a 2500-sq-ft space, working full time at his other job, but feeling this was his true calling. A year later, he moved into a warehouse and in 2018, he moved to Plumsteadville.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Check his website out— I was truly impressed. It is full of inspiring photos and blogs, written by Mike himself. I love how he spotlights his clients. Telling their story, in how anyone, at any age, can do whatever they want to do. Limits are mindset. Open your mind and your life will follow. Mike and I had some awesome ah-ha moments and I felt the connection of like minds growing and expanding. Life is what you make of it. Mike is a prime example of this. His life took a turn for what some could have said was for the worst, but he took that turn and made a whole new path. Who’s to say this wasn’t the intention of the highest power all along?<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">“I want to be a role model. Not a copy,” Mike Sobczak.</span></p>\n<p class=\"p6\">You can connect with Mike at:</p>\n<p class=\"p7\"><span class=\"s1\">Visit him on IG @tfwdoylestown    </span><a href=\"https://tfw-doylestown.com\" target=\"_blank\" rel=\"noopener noreferrer\"><span class=\"s1\">https://tfw-doylestown.com</span></a></p>\n<p class=\"p7\"><span class=\"s1\">5776 Easton Road in Plumsteadville</span></p>\n<p class=\"p8\"><span class=\"s1\">He’s the real deal! I was incredibly inspired, and not on a superficial body level. On a whole life level. I wish you and your family all the best Mike.</span></p>\n<p class=\"p10\"><i>Danielle Gannon is a local Bucks County entrepreneur. Mom to three, she is co-owner of Organnons Natural Market and Founder &amp; Managing Director of Local Spotlight with Danielle. Her passion is connecting people and creating community. Residing in Ivyland, writing has always been a passion of hers. Find her on IG @localspotlightwithdanielle</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/mikeTFW.jpg"
}