{
  "id": 19224,
  "title": "Locally Owned FYZICAL Therapy &#038; Balance Center Opens in Doylestown",
  "slug": "locally-owned-fyzical-therapy-balance-center-opens-in-doylestown",
  "date": "2024-03-17T21:02:25",
  "author": "Staff",
  "category": [
    "Fit"
  ],
  "tags": [
    "doylestown cardinal",
    "FYZICAL Therapy &amp; Balance Center"
  ],
  "excerpt": "<p>FYZICAL Therapy &amp; Balance Centers Doylestown opened on January 15, 2024, at 99 Lantern Drive, Suite 001, Doylestown. The clinic is just off Broad Street and adjacent to the Doylestown Shopping Center.  Offering a holistic approach to wellness, FYZICAL not only helps clients recover from injuries and surgeries but also helps them achieve better overall [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">F</span><span class=\"s2\">YZICAL Therapy &amp; Balance Centers Doylestown opened on January 15, 2024, at 99 Lantern Drive, Suite 001, Doylestown. The clinic is just off Broad Street and adjacent to the Doylestown Shopping Center.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Offering a holistic approach to wellness, FYZICAL not only helps clients recover from injuries and surgeries but also helps them achieve better overall health and wellness. With its Balance Therapy Program, FYZICAL helps treat the vast and complex range of issues that can cause balance disorders in a safe and challenging environment.</span></p>\n<p class=\"p3\"><span class=\"s2\">Current residents of New Hope, Megan and Jason have called Bucks County home for over 12 years. They have been seeking an opportunity to become business owners for many years and after a careful and thorough search, found FYZICAL to be a perfect fit for their interests.</span></p>\n<p class=\"p3\"><span class=\"s2\">“Both Megan and I are passionate about helping people become their best selves, and we were immediately drawn to the FYZICAL franchise and its mission,” Jason said. “In particular, FYZICAL’s focus on balance therapy, combined with their ‘best in class’ support as a franchise partner made this a unique opportunity we couldn’t pass up. We also think that being one of the very few locally owned and operated physical therapy clinics in the region gives us a direct connection to our patients, and we are confident that we will serve them with the highest quality of care.”</span></p>\n<p class=\"p3\"><span class=\"s2\">To that end, Megan and Jason have hired Jessica Matthews, MPT to serve as the clinic’s Lead Therapist and Area Manager. “Jessica is the perfect person to help us succeed, and we are very fortunate to add her to the team,” Megan said. “She has many years of experience in this region and in addition to being a great therapist, is also an excellent leader. She will be crucial to helping us grow across Bucks County in the coming years.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Doylestown’s new FYZICAL Therapy &amp; Balance Centers’ Clinic, FYZICAL Doylestown, offers a wide variety of services designed to address a broad range of diagnoses, conditions, and concerns, vestibular dysfunction, balance dysfunction, neurologic issues, and pelvic floor training. The center also offers an orthopedic rehabilitation program that helps patients reduce and reverse orthopedic pain or immobility.</span></p>\n<p class=\"p3\"><span class=\"s2\">To learn more, call (484) 793-6900 or visit them at <a href=\"http://fyzical.com/Doylestown-pa\" target=\"_blank\" rel=\"noopener noreferrer\">fyzical.com/Doylestown-pa</a>.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/03/Fyzical-Therapy-Center.jpg"
}