{
  "id": 12165,
  "title": "Meet The Little Red Rooster Blues Band",
  "slug": "meet-the-little-red-rooster-blues-band",
  "date": "2022-02-05T18:21:38",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "Bob Holden",
    "Central Bucks West High School",
    "Dave Holtzman",
    "Jeff Michael",
    "pots and pan show",
    "The Little Red Rooster Blues Band",
    "villa capri. Kevin McCann"
  ],
  "excerpt": "<p>Tell us about yourself and your music. When and how did you get started? We formed the band in 1988. A group of guys that went to Central Bucks West High School in Doylestown got together and focused on a harp-driven Blues sound. We played as the original band for roughly six years.   Dave Holtzman [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>Tell us about yourself and your music. When and how did you get started?</strong></p>\n<p class=\"p2\"><span class=\"s1\">We formed the band in 1988. A group of guys that went to Central Bucks West High School in Doylestown got together and focused on a harp-driven Blues sound. We played as the original band for roughly six years.  </span></p>\n<p class=\"p2\"><span class=\"s1\">Dave Holtzman joined the band in 1996 on the harmonica. We shared leadership responsibilities for the band for many years. We have produced eight CDs over the years, seven of them all original material. Our Lock Up the Liquor release won the 2019 International Blues Challenge by the Blues Foundation in Memphis for the Best Self Produced CD category.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">The harmonica and guitar interplay has always been an integral part of our sound, and we have been extremely fortunate to have a great rhythm section which includes Bob Holden on drums (9 years) and Jeff Michael on bass (7 years). The rhythm section is truly the engine that drives the band. They create a rock-solid foundation for the guitar and harp to lock into. Bob and Jeff are two of the best!</span></p>\n<p class=\"p1\"><strong>Who/What is your inspiration? </strong></p>\n<p class=\"p2\"><span class=\"s1\">Like many musicians, I think the power of music inspires us. Blues music touches people. I am inspired when I hear great musicians giving it all they have on the bandstand, night after night, year after year, and only get stronger and better at it! Energy is created both by the band and the audience. That is magic and the most natural high in the world. It keeps you coming back.</span></p>\n<p class=\"p1\"><strong>Describe your favorite and least favorite part about being a musician.</strong></p>\n<p class=\"p2\"><span class=\"s1\">The best part of being a working musician is never being bored. There is never a time when something isn’t at the front of your mind&#8230;learning a new tune, booking a new room, working on the next recording project, and performing. Music has been a gift that has brought us together with so many great people. It’s amazing! The worst part is missing out on the many events that we can’t attend because of our commitments to music, weddings, anniversaries, etc.</span></p>\n<p class=\"p1\"><strong>Tell us about your favorite performance of your career. </strong></p>\n<p class=\"p2\"><span class=\"s1\">I don’t know if there is one in particular. Having had the opportunity to perform in the UK several times stands out. Winning the IBC award by the Blues Foundation was a stand-out moment.</span></p>\n<p class=\"p1\"><strong>Do you have any hobbies or interests outside of music? </strong></p>\n<p class=\"p2\"><span class=\"s1\">To be honest not really, I play video games and hang out with my friends, but I just live and breathe music. It’s everything I do. </span></p>\n<p class=\"p1\"><strong>How do you like being a musician in Doylestown? Where else can people find you singing?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s1\">Doylestown is a great town for music. There are many venues and many great people that truly support live music. We have been very fortunate to become friends with many people in Doylestown through the music. It truly is a special place! Every Tuesday night, we have been hosting a Blues Jam at Villa Capri for over five years. It’s an excellent opportunity for players to meet other players, learn, network, and have fun! We perform all over the region. Our website is <a href=\"http://www.littleredrooster.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.littleredrooster.com</a>. Hope to see you out there!</span></p>\n<p class=\"p1\"><em>The “Pots and Pans Show” section of The Cardinal, brought to you by Villa Capri, highlights local musicians and the restaurants that host their live music. Please send your music lineups and news to <a href=\"mailto:villacapripizza@aol.com\">villacapripizza@aol.com</a></em></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/02/Red-Rooster.jpg"
}