{
  "id": 12066,
  "title": "Mercantile at Doylestown",
  "slug": "mercantile-at-doylestown",
  "date": "2022-01-12T14:47:55",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live",
    "Style",
    "Taste"
  ],
  "tags": [
    "Brooke Henningsen",
    "doylestown cardinal",
    "john lund",
    "Mercantile at Doylestown",
    "Nick Henningsen",
    "susan smith"
  ],
  "excerpt": "<p>By John Lund and Susan Smith • @DoylestownBoroBuzz • The Cardinal Contributing Writers The best hidden gem in Doylestown could very well be Mercantile at Doylestown. Mercantile is located at 444 N Main Street in the Doylestown Shopping Center, in the “old” Bon Ton building. We sat down with Brooke Henningsen, the Founder, and husband [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By John Lund and Susan Smith</strong> • <em>@DoylestownBoroBuzz</em> • The Cardinal Contributing Writers</p>\n<p class=\"p3\"><i>T</i><i>he best hidden gem in Doylestown could very well be Mercantile at Doylestown. Mercantile is located at 444 N Main Street in the Doylestown Shopping Center, in the “old” Bon Ton building. We sat down with Brooke Henningsen, the Founder, and husband Nick Henningsen, the General Manager, to learn more about Mercantile and what inspired them to start the business.</i></p>\n<p class=\"p6\"><strong>What is Mercantile?</strong></p>\n<p class=\"p7\"><span class=\"s2\">If you haven’t shopped Mercantile before, and you are walking through the doors for the first time, you might realize that you’re going to need about an hour to go through the sprawling twenty-five thousand square feet of retail store space. The store is neatly carved out into 140 vendor spaces selling everything from clothing, jewelry, art, accessories, furniture and even health and beauty. Local artists and small businesses use the centralized model of Mercantile to cost effectively display their crafts and products while a small team of people manage the store operations. In the back of the store, you can sit and relax in their beautiful bar/lounge area named “A Taste of Bucks and Beyond”.<span class=\"Apple-converted-space\">  </span>Here, Triple Sun Spirits, a local distillery, offers their artisanal cocktails that are created from the highest quality spirits. They also offer specialty coffees, cupcakes, and many other fresh food options from local vendors. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong>Inspiration</strong></p>\n<p class=\"p7\"><span class=\"s3\">Brooke Henningsen and her husband Nick have now been married for 13 years and have a 5-year-old son. Brooke, who was a commercial real estate agent before opening Mercantile, had the idea to open a collaborative space for makers and vendors several years ago. It wasn’t until 2020 that the stars aligned in such a way that this idea could become a reality.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><span class=\"s3\">Due to the pandemic, they had the space and now also the demand with small businesses feeling the pinch of the pandemic. So, in early 2020, they opened their doors with approximately 70 vendors enrolled. The business model took off, and today, there are 140 vendors on-site at Mercantile. Approximately 70% of the small businesses at Mercantile use the store as their primary business location. The other 30% have a retail presence in Doylestown, or in a neighboring community, and use the Mercantile as an additional store front to reach more customers. According to Nick, the most rewarding part of the business is when one of the 70% end up leaving Mercantile, because they gain so much success, that they decided to open their own retail shop. The business model does not require the vendors to be present at their booths; however, it does require them to volunteer their time (8 Hours) each month to assist in store operations. Much of the store operation is executed with volunteer help.</span></p>\n<p class=\"p6\"><strong>Doylestown Farmer’s Market &amp; More</strong></p>\n<p class=\"p7\"><span class=\"s1\">There are so many different events going on at Mercantile from classes to fashion shows, to live music, to guys nights out. Check out the website at www.mercantiledoylestown.com for more information. The types of classes you will be able to find range from pottery to yoga, to knitting, to floral arrangement classes. A huge new addition this year is the addition of the Doylestown Farmer’s Market running every other weekend in January and February in 2022. Many of the same vendors you are familiar with at the outside Farmer’s Market location on Hamilton Street will be setting up shop inside at the Mercantile. According to Brooke, the early response to the Farmer’s Market has been a resounding success. They initially planned for 17 spaces for “Farmer” vendors, but quickly had to adjust to find space for 29 vendors as demand quickly shot up. Check out the website for updated dates for the Doylestown Farmer’s Market at Mercantile. As you begin your 2022, and look to shift more and more of your shopping dollars to “Shop Small” and support local businesses, please consider supporting all of the great businesses at Mercantile at Doylestown.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/01/Mercantile-Landscape.jpg"
}