{
  "id": 12488,
  "title": "Mountains We Climb Premiers as Part  of the International Bicycle Film Festival",
  "slug": "mountains-we-climb-premiers-as-part-of-the-international-bicycle-film-festival",
  "date": "2022-03-02T20:38:50",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Fit"
  ],
  "tags": [
    "Christopher Baccash",
    "doylestown cardinal",
    "mountains we climb"
  ],
  "excerpt": "<p>Mountains We Climb has been selected as part of the International Bicycle Film Festival and will be premiering at the County Theater in Doylestown, Pennsylvania on Thursday, April 28, 2022. The film follows the journey of Doylestown native and Central Bucks East graduate, Christopher Baccash after he received a life-changing cancer diagnosis, having just come [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><i>M</i><span class=\"s1\"><i>ountains We Climb</i> has been selected as part of the International Bicycle Film Festival and will be premiering at the County Theater in Doylestown, Pennsylvania on Thursday, April 28, 2022. The film follows the journey of Doylestown native and Central Bucks East graduate, Christopher Baccash after he received a life-changing cancer diagnosis, having just come off a personal best performance at the 2019 Bucks County Classic Pro Cycling Race.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\"><i>Mountains We Climb</i> brings audiences along with Chris on his medical and physical journey of racing the Leadville 100 MTB, a 100 mile high-altitude extreme terrain race through the Colorado Rockies with the support of his family, friends, and community.</span></p>\n<p class=\"p3\"><span class=\"s1\">Filmmaker Ryan Canney of Riverbank Creative and Brian Boger of Bike Works came together in 2019 to begin a film project centered around the Bike Works p/b Fred Beans elite team, however, when Chris received his diagnosis, the project’s subject shifted rapidly resulting in the upcoming <i>Mountains We Climb</i> short film. The film spans three years of Chris’s life through multiple surgeries, recoveries, a global pandemic, and training for arguably one of the hardest mountain bike races in the world.</span></p>\n<p class=\"p3\"><span class=\"s1\">Today, in addition to his ongoing medical procedures and racing calendar, Chris is pursuing a Master’s Degree in Applied Positive Psychology at the University of Pennsylvania. <i>Mountains We Climb</i> is being entered into additional film festivals throughout 2022 and the filmmakers intend to continue documenting Chris’s journey and create a feature-length documentary. Tickets are expected to go on sale for the screening at the County Theater in March.</span></p>\n<p class=\"p3\"><span class=\"s2\"><i>Mountains We Climb</i> has been made possible by the generous support of Bike Works PA, Giant Bicycles, and our community partners. For more information about the film, upcoming screenings, sponsors, filmmakers, and how to support the film, please visit <a href=\"https://mountainsweclimb.com\" target=\"_blank\" rel=\"noopener noreferrer\">https://mountainsweclimb.com</a>.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/03/MWC.jpg"
}