{
  "id": 11744,
  "title": "Oldestone Restaurant Makes Grand Debut In New Hope Inside 1800’S Old Stone Church",
  "slug": "oldestone-restaurant-makes-grand-debut-in-new-hope-inside-1800s-old-stone-church",
  "date": "2021-12-09T15:46:32",
  "author": "Staff",
  "category": [
    "Style",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Gaspar Ferrara",
    "Michael Sklar",
    "New Hope",
    "Oldestone Restaurant",
    "Vincent Ferrara",
    "Wilfer Naranjo"
  ],
  "excerpt": "<p>New Hope, PA &#8211; Owners Wilfer Naranjo, Michael Sklar, Gaspar Ferrara and Vincent Ferrara announce the grand opening of Oldestone restaurant at 15 S. Main Street, New Hope, in the internationally recognized 1872 old stone church.  The space was the former home of Marsha Brown’s restaurant, which closed at the start of the pandemic. Marsha [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">N</span><span class=\"s2\">ew Hope, PA &#8211; Owners Wilfer Naranjo, Michael Sklar, Gaspar Ferrara and Vincent Ferrara announce the grand opening of Oldestone restaurant at 15 S. Main Street, New Hope, in the internationally recognized 1872 old stone church.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">The space was the former home of Marsha Brown’s restaurant, which closed at the start of the pandemic. Marsha Brown herself passed the baton and her legacy to the new owners, that include Naranjo who worked for her in 2003 as a food runner.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Naranjo’s story comes full circle from food runner to restaurant owner, as he and the new owners debut their new concept for the iconic space. Oldestone is an elegant and refined steak and seafood restaurant, featuring New American Cuisine by Executive Chef Seth Wheeler. Oldestone will also feature several signature creole dishes from Marsha Brown’s recipe collection.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">The 9,000 square foot space features a main bar, lounge and private dining room on the first floor, a grand dining room on the second level, and a third level in the former balcony overlooking the dining room that is now a speakeasy, bar and lounge with a stage for live music. The stunning space can seat over 250 guests at one time, and features 1950s art deco stylings from top to bottom.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Unique design elements include an authentic jazz age bar on the third floor, a speakeasy stage with vintage style microphone, chandeliers seen in the Keanu Reeves movie (and poster) for John Wick 3, church stained glass windows, original church pews and a church pulpit, the 30 foot tall mural called Redemption, working church bells, crystal chandelier, original brick work, and much more.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">The church tower bells ring every fifteen minutes and on the hour, and after Thanksgiving they will play Christmas music to welcome holiday visitors. Oldestone features valet parking seven days a week. Starting services include dinner, bar, late night, happy hour and live music. Opening hours are seven days a week, 5:30pm to 11:00pm for kitchen and dining, and 5:30pm to 2:00am nightly for bar service. </span></p>\n<p class=\"p3\"><span class=\"s2\">For reservations, visit <a href=\"http://www.oldestonenewhope.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.oldestonenewhope.com</a>, visit Open Table, or call 215-862-7044. Please follow Oldestone on social media at @oldestonenewhope.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/12/Oldstone-Restaurant.jpg"
}