{
  "id": 11146,
  "title": "Operation Doylestown Pedestrian Zone",
  "slug": "operation-doylestown-pedestrian-zone",
  "date": "2021-07-19T22:34:02",
  "author": "Staff",
  "category": [
    "Play",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "operation doylestown",
    "pedestrian zone 2021"
  ],
  "excerpt": "<p>Doylestown Borough is organizing a series of street closures to support local shops and restaurants that will run weekly through September 2021. As the town shakes off the last of the winter months Operation Doylestown’s Pedestrian Zones make a much-anticipated return this Spring. On Friday and Saturday nights portions of the downtown area will close [&hellip;]</p>\n",
  "content": "<p class=\"\">Doylestown Borough is organizing a series of street closures to support local shops and restaurants that will run weekly through September 2021.</p>\n<p class=\"\">As the town shakes off the last of the winter months Operation Doylestown’s Pedestrian Zones make a much-anticipated return this Spring. On Friday and Saturday nights portions of the downtown area will close to traffic, allowing shops and restaurants to expand their operations into the streets. With more space to socially distance, this provides our business community with a unique opportunity in the midst of a very difficult time. Every weekend through September Pedestrian Zones will rotate throughout the downtown, with a few exceptions for holidays and town-wide events.</p>\n<p class=\"\">The first Pedestrian Zone of 2021 is scheduled for April 9-10. A portion of W. State Street, fondly known by locals as Restaurant Row, will be converted into an outdoor shopping and dining space. Temporary detours will be in place for traffic through town. Parking will be available at the new County Parking Facility at Broad and Court Streets for a modest fee in addition to street parking throughout town.</p>\n<p class=\"\">Each week pedestrian zones will alternate between locations including W. State Street, E. State Street, and Main Street. The scheduled zones will close to vehicular traffic from 5:00 PM &#8211; 11 PM each weekend. Sidewalks will be closed to pedestrians and reserved for neighboring businesses to expand dining and shopping setups. The street will be reserved for pedestrian traffic and additional expansions based on the location. Alcohol sales must coincide with dining and any outdoor entertainment must be approved by the Borough in advance. Businesses with questions or requests should contact John Davis at <a href=\"mailto:jdavis@doylestownborough.net\" target=\"_blank\" rel=\"noopener noreferrer\">jdavis@doylestownborough.net</a>.</p>\n<p class=\"\">Social distancing remains critical in our efforts to prevent the spread of COVID-19 and pedestrians will be expected to maintain a safe distance between one another. Masking is strongly encouraged when visitors are moving throughout the zone.Our local businesses and government officials are working hard to ensure that these efforts remain safe to the community and do not create unnecessary risk.</p>\n<p class=\"\">Our local shops, restaurants, services, and cultural destinations still need your support &#8211; the challenges we faced in 2020 continue to threaten our local community and neighbors. We invite you to explore Doylestown and discover what makes our small town so special. To learn more about Operation Doylestown, Pedestrian Zone schedules, and supporting local businesses, please visit <a href=\"http://operationdoylestown.com/\" target=\"_blank\" rel=\"noopener noreferrer\">operationdoylestown.com</a>.</p>\n<p class=\"\">\n<strong>PEDESTRIAN ZONE SCHEDULE SPRING/SUMMER 2021</strong></p>\n<p class=\"\"><strong><em>5 PM TO 11 PM</em></strong></p>\n<p class=\"\">July 23-24, East State Street (Pine to Main)</p>\n<p class=\"\">July 30-31, West State Street (Hamilton to Clinton)</p>\n<p class=\"\">August 6-7, Main Street (Court to Oakland)</p>\n<p class=\"\">August 13-14, East State Street (Pine to Main)</p>\n<p class=\"\">August 20-21, West State Street (Hamilton to Clinton)</p>\n<p class=\"\">August 27-28, Main Street (Court to Oakland)</p>\n<p class=\"\">September 3-4, NO ZONE (Labor Day Weekend)</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/07/2021PedestrianZonesB.png"
}