{
  "id": 17312,
  "title": "Peddler’s Village Announces 2023 Festivals and Events",
  "slug": "peddlers-village-announces-2023-festivals-and-events",
  "date": "2023-04-12T12:31:19",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live",
    "Style",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "peddlers village"
  ],
  "excerpt": "<p>Peddler’s Village, a countryside shopping, dining, lodging, and family entertainment destination in the heart of historic Bucks County, PA, that is widely recognized for its popular festivals and events, will be presenting a wide range of year-round events in 2023. Created in 1962 and now named as the region’s number-one tourist destination*, Peddler’s Village is [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">P</span><span class=\"s2\">eddler’s Village, a countryside shopping, dining, lodging, and family entertainment destination in the heart of historic Bucks County, PA, that is widely recognized for its popular festivals and events, will be presenting a wide range of year-round events in 2023. Created in 1962 and now named as the region’s number-one tourist destination*, Peddler’s Village is a thriving attraction that welcomes more than two million visitors from around the globe each year.</span></p>\n<p class=\"p3\"><span class=\"s2\">In keeping with decades-old traditions, Peddler’s Village will host in 2023 a number of annual festivals and events that include the Apple Festival, Grand Illumination, Scarecrows in the Village and the Gingerbread Competition and Display. It will also revive month-long Village themes that feature weekend entertainment and daily restaurant specials: Strawberry Month in May, Bluegrass and Blueberries Month in July, and Peach Month in August. Additionally, this year will re-introduce a major summer long event that made its debut in 2022: a Village-wide display of sand sculptures that this year will be called Stories in Sand. The popular PEEPS in the Village display will return in March, and traditional tastes—in both food and beverage form—will take center stage during the Red, White &amp; Blue BBQ Bash on July 4 and OctoberFeast in the fall. In the summer, we are introducing a new annual photo contest and display. Murder mystery dinners return this year, starting with a series kickoff in February of “Houdini’s Whodunit” presented by the Riddlesbrood Theater Company.</span></p>\n<p class=\"p3\"><span class=\"s3\">Admission to all weekend festivals and displays is free and open to the public. Murder mystery and comedy events require tickets that can be purchased via <a href=\"http://PeddlersVillage.com.\" target=\"_blank\" rel=\"noopener noreferrer\">PeddlersVillage.com.</a></span></p>\n<p class=\"p4\"><span class=\"s2\"><b><span class=\"Apple-converted-space\"> </span></b></span></p>\n<p class=\"p5\"><b>Festivals and events in 2023 will include:</b></p>\n<p class=\"p7\"><span style=\"color: #993300;\"><b>SPRING</b></span></p>\n<p class=\"p8\"><b>Comedy in the Village</b> (Fridays, April 21, and May 19) – Leading comedians in the region take the stage during this ticketed event.</p>\n<p class=\"p8\"><b>Spring FunFest</b> (Saturday, April 22 and Sunday, April 23) – Two fun-filled days for the whole family starting with a morning Family Fun Walk (ticketed; proceeds benefit charity), followed by free story times, crafts, and live entertainment.</p>\n<p class=\"p8\"><b>Cupcake Decorating Competition</b> (May 3-20) – Compete in a contest for cash prizes and/or view the creative entries. The winning cupcakes will be on public display in the Visitor and Event Center from May 3 through May 20.</p>\n<p class=\"p8\"><b>Strawberry Month Kickoff Weekend </b>(Saturday, May 6 and Sunday, May 7) – Taste a wide variety of strawberry treats, savor strawberry-inspired specials, and enjoy live entertainment and family activities as Peddler’s Village kicks off Strawberry Month.</p>\n<p class=\"p8\"><b>Food Truck Thursdays</b> (May 25 and June 15)</p>\n<p class=\"p7\"><span style=\"color: #993300;\"><b>SUMMER</b></span></p>\n<p class=\"p8\"><b>Stories in Sand </b>(June 1 through August 31) – Enjoy summer beach vibes as you view larger-than-life sand sculptures featuring favorite story characters. A special Stories in Sand Kickoff Weekend on June 3 and 4 will include live entertainment and sand sculpting workshops. Stories in Sand is partially funded by the Bucks County Tourism Grant Program.</p>\n<p class=\"p8\"><b>Photography Competition and Exhibit</b> (June 12 through July 30) – Budding photographers and seasoned pros can showcase their photographic talent, have their photos exhibited and win an array of prizes. The inaugural photo theme in 2023 is pets. <span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p8\"><b>Comedy in the Village</b> (Fridays, June 23, July 21, and August 25) – Leading comedians in the region take the stage during this ticketed event.</p>\n<p class=\"p8\"><b>Outdoor Movie Night</b> (Saturdays, June 24; July 29; and August 26) – Enjoy an under-the-stars screening of a popular movie. Bring your blankets and lawn chairs.</p>\n<p class=\"p8\"><b>Red, White, &amp; Blue BBQ Bash</b> (Tuesday, July 4) &#8211; A classic all-American barbecue picnic with live entertainment, delicious food, and family activities.</p>\n<p class=\"p8\"><b>Bluegrass and Blueberries Month Kickoff Weekend</b> (Saturday, July 8 and Sunday, July 9) &#8211; Taste a wide variety of blueberry treats, savor blueberry-inspired specials, and enjoy live entertainment and family activities as Peddler’s Village kicks off Bluegrass and Blueberries Month.</p>\n<p class=\"p8\"><b>Food Truck Thursday</b> (July 13 and August 17)</p>\n<p class=\"p8\"><span class=\"s4\"><b>Peach Month Kickoff Weekend </b>(Saturday, August 5 and Sunday, August 6) &#8211; Taste a wide variety of peach treats, savor peach-inspired specials, and enjoy live entertainment and family activities as Peddler’s Village kicks off Peach Month.</span></p>\n<p class=\"p7\"><span style=\"color: #993300;\"><b>FALL</b></span></p>\n<p class=\"p8\"><b>Autumn Wedding Show</b> (Sunday, September 10) – Engaged couples in search of the perfect wedding venue can sample hors d’oeuvres and wedding cake, tour event spaces and bridal suites, and get to know local vendors, from florists to DJs and musicians.</p>\n<p class=\"p8\"><span class=\"s4\"><b>Scarecrows in the Village</b> (September 11-October 31) – Stroll the Village to see a hundred creative, colorful, and spooky scarecrows created by Philadelphia-area residents and organizations. Guests are encouraged to vote for their favorites, with cash prizes offered to winners. Scarecrow-making workshops on select weekends, including during the Scarecrows in the Village Kickoff Weekend on September 16 and 17 that will include live entertainment and other family activities.</span></p>\n<p class=\"p8\"><b>Food Truck Thursday </b>(September 14)</p>\n<p class=\"p8\"><b>Outdoor Movie Night</b> (Saturdays, September 30 and October 21) – Enjoy an under-the-stars screening of a popular movie. Bring your blankets and lawn chairs.</p>\n<p class=\"p8\"><b>OctoberFeast</b> (Saturday, October 14 and Sunday, October 15) – A Village spin on the traditional German festival with a beer and food garden, wine and spirits, live music, and family activities.</p>\n<p class=\"p8\"><b>Comedy in the Village</b> (Fridays, September 22 and October 20) – Leading comedians in the region take the stage during this ticketed event.</p>\n<p class=\"p8\"><b>Apple Festival</b> (Saturday, November 4 and Sunday, November 5) &#8211; Get your fill of apple treats and take home a bushel fresh from local orchards at our annual Apple Festival. Enjoy live entertainment, food specials, and family activities all weekend long.</p>\n<p class=\"p4\"><span class=\"s2\"><b><span class=\"Apple-converted-space\"> </span></b></span></p>\n<p class=\"p7\"><span style=\"color: #993300;\"><b>HOLIDAY SEASON</b></span></p>\n<p class=\"p8\"><b>Grand Illumination Celebration </b>(Friday, November 17) &#8211; The Village lights up at 6:15 p.m. sharp! Watch as Santa and his helpers flip the switch to illuminate a million holiday lights during an evening of holiday celebration, local entertainment, and more.</p>\n<p class=\"p8\"><b>Merchants Open House </b>(November 17-19) Preview our merchants’ holiday gift-giving ideas.</p>\n<p class=\"p8\"><b>Gingerbread House Competition and Display</b> (November 17-January 14, 2024) More than one hundred gingerbread masterpieces, including contest winners, are on public display in the festively adorned Visitor and Event Center.</p>\n<p class=\"p8\"><b>Small Business Saturday</b> (Saturday, November 25) –Find the perfect holiday gift at one of over 60 locally owned shops and businesses at Peddler’s Village.</p>\n<p class=\"p8\"><b>Holly Jolly Weekend</b> (Saturday, December 2 and Sunday, December 3) – Celebrate the holiday season at Peddler’s Village with all-day festivities and Santa Parades beginning both days at 1:30 p.m.</p>\n<p class=\"p8\"><span class=\"Apple-converted-space\"> </span>For more information, visit <a href=\"http://PeddlersVillage.com\" target=\"_blank\" rel=\"noopener noreferrer\">PeddlersVillage.com</a> or call 215-794-4000.</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/Spring_FunFest_PV_3_by_Paul_Boger-e1681317062847.jpg"
}