{
  "id": 19161,
  "title": "Peddler’s Village to Present Fifth Annual “PEEPS® in the Village” Event",
  "slug": "peddlers-village-to-present-fifth-annual-peeps-in-the-village-event",
  "date": "2024-03-15T15:25:06",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Play",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "peddlers village"
  ],
  "excerpt": "<p>Peddler’s Village, a countryside shopping, dining, lodging, and family entertainment destination in the heart of historic Bucks County, PA, will be presenting its fifth annual PEEPS in the Village competition and display beginning on March 11, 2024. The popular free event, which continues through April 14, showcases a hundred handmade sculptures, dioramas, and wall art [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">P</span><span class=\"s2\">eddler’s Village, a countryside shopping, dining, lodging, and family entertainment destination in the heart of historic Bucks County, PA, will be presenting its fifth annual PEEPS in the Village competition and display beginning on March 11, 2024. The popular free event, which continues through April 14, showcases a hundred handmade sculptures, dioramas, and wall art created with PEEPS® marshmallow candies. Cash prizes are awarded to winners.</span></p>\n<p class=\"p3\"><span class=\"s3\">All members of the public are invited to participate and can register to enter their creation by March 1 for a chance to win cash prizes. Entries must be dropped off to the Visitor &amp; Event Center by March 10. The public display begins on March 11; through March 31, guests can vote for their favorites using paper ballots or the free Peddler’s Village mobile app. In 2023, Peddler’s Village welcomed more than 20,000 visitors to the display.</span></p>\n<p class=\"p3\"><span class=\"s3\">Spring is a popular time to visit Peddler’s Village. In April, colorful tulips line the brick walkways of the 18th century-style shopping hamlet. PEEPS® in the Village is free and open to the public each day, with the exception of March 31, Easter Sunday.</span></p>\n<p class=\"p3\"><span class=\"s3\">On Sunday, April 14, Cock ‘n Bull, the flagship restaurant of Peddler’s Village, will present a PEEPS®-Tacular Family Brunch featuring buffet-style dining, live entertainment, and take-home crafts for children. For overnight stays between March 11 and April 14, the on-site hotel at Peddler’s Village, the Golden Plough Inn, is offering a PEEPS® in the Village package that includes breakfast for four at Buttonwood Grill, a $20 food voucher that can be used at any of our Peddler’s Village-owned restaurants, two activity passes for Giggleberry Fair, and a voucher for a PEEPS® product from the Village General Store.</span></p>\n<p class=\"p3\"><span class=\"s3\">Other spring events at Peddler’s Village include an old-fashioned egg hunt and Easter dining during the weekend of March 30-31; Best of the Nest Birdhouse Competition and Display from April 13 through May 19; a Cupcake Decorating Competition from April 29 through May 12; the annual Strawberry Festival on May 4 and 5; Food Truck Thursdays on May 23 and June 20; and the Bucks Fever Art &amp; Sculpture Exhibition from June 15 through June 30.</span></p>\n<p class=\"p3\"><span class=\"s3\">For more information about other upcoming festivals and events, visit <a href=\"http://PeddlersVillage.com\" target=\"_blank\" rel=\"noopener noreferrer\">PeddlersVillage.com</a> or call the Peddler’s Village Hospitality Center at 215-794-4051.</span></p>\n<p class=\"p3\"><span class=\"s3\">To inquire about events sponsorship, contact Justin Seery at <a href=\"mailto:justins@peddlersvillage.com\">justins@peddlersvillage.com</a>.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/03/Peeps-at-Peddlers-Village-e1710530699841.jpg"
}