{
  "id": 11616,
  "title": "Pumpkin and Spice, Nice!",
  "slug": "pumpkin-and-spice-nice",
  "date": "2021-11-13T12:13:11",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "aillinn brennan",
    "doylestown cardinal",
    "pumpkin pie",
    "thanksgiving"
  ],
  "excerpt": "<p>By Aillinn Brennan • Special to The Cardinal Pumpkins were likely around 7,500 years ago and originated from Central America. The original pumpkins were not the pretty orange ones we love bake and decorate with, but were likely more gourd like and not sweet at all. In North America, pumpkins were one of the first [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Aillinn Brennan • </b>Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">P</span><span class=\"s3\">umpkins were likely around 7,500 years ago and originated from Central America. The original pumpkins were not the pretty orange ones we love bake and decorate with, but were likely more gourd like and not sweet at all. In North America, pumpkins were one of the first crops grown for human consumption because they stored well and kept during wintertime when food may have been scarce.</span></p>\n<p class=\"p5\"><span class=\"s3\">John Josselyn’s, <i>New-England’s Rarities Discovered</i>, 1672 had a <i>pompion</i> (what pumpkin was called in those days) recipe. “The housewife’s manner is to slice them when ripe, and cut them into dice….and stew them upon a gentle fire the whole day… and as they sink add fresh pompion….” And then finish by “putting<span class=\"Apple-converted-space\">  </span>butter to it, with some spice.” It’s a lot like how we do sweet potatoes for Thanksgiving. Authors NOTE: “It provokes urine extremely and is very windy.”</span></p>\n<p class=\"p6\"><strong><span class=\"s1\">Why Pumpkin Pie?</span></strong></p>\n<p class=\"p5\"><span class=\"s3\">In the 18th century sweet pumpkin dishes became popular for holiday meals. <span class=\"Apple-converted-space\">  </span>One of the first sweet recipes was pie-like, but without the crust. They scooped out a pumpkin and filled the shell with a ginger-spiced milk and then slow roasted in a fire. Our current custard and crust version is from our first American Cookbook. Amelia Simmons, <i>American Cookery</i>, 1795. It is one of the most important documents of American culinary history.<span class=\"Apple-converted-space\">  </span>It’s both poignant and inspiring to look at the first leaf, “By Amelia Simmons, an American orphan.”</span></p>\n<p class=\"p5\"><span class=\"s3\">We love the convenience of canned pumpkin for making our holiday delights. In Circleville, Ohio, E. Sears Canning would receive farmers with wagon loads of pumpkins. It was such an event that in 1903 the Circleville mayor George Haswell started a pumpkin festival, which is still a tradition to this day. Unfortunately, last year’s “Pumpkin Show” had to be cancelled due to the pandemic. The only three other times it was cancelled was during the World Wars. This year’s festivities are in the works!</span></p>\n<p class=\"p6\"><strong><span class=\"s1\">Spice is Nice!<span class=\"Apple-converted-space\"> </span></span><span class=\"s1\">Cinnamon, Nutmeg and Allspice</span></strong></p>\n<p class=\"p5\"><span class=\"s3\">Cinnamon comes from the bark of a large evergreen tree found in the tropical forests of Sri Lanka. The bark is stripped to many layers and left to dry, as it dries it curls up. It’s a cinnamon stick! Nutmeg also comes from an evergreen, which grows in the Banda Islands, or “Spice Islands,” a province of Indonesia. Nutmeg is not from the bark, instead from the fruit, which opens when ripe where the seed or “nut” within it is harvested. The nut is surrounded by a red membrane from which the spice <i>mace</i> is made.</span></p>\n<p class=\"p5\"><span class=\"s3\">Allspice is NOT all spices! It is its own spice and mostly comes from Jamaica these days. It originated from Central and South American rainforests where the trees were sadly cut down to harvest the berries leaving the native trees almost extinct. In Jamaica, the trees grow in “walks” which is like an orchard. The allspice tree can have a canopy up to 30 feet in diameter which produces masses of tiny berries.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The tree is ready to produce it’s first harvest in about five years and can continue to produce for up to 20 years. The harvested berries are dried for two weeks, and then it’s pie time!</span></p>\n<p class=\"p5\"><span class=\"s3\">Thank you Lydia Maria Child for “Over the river and through the wood…” which ends “Hurra for the pumpkin pie!” Let’s gather the apron, the spices and the pumpkins that delight us and give thanks to all that is good!</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/11/recipe-pumpkin_pie.jpg"
}