{
  "id": 18769,
  "title": "Reading to the Dogs Begins 2024 Season",
  "slug": "reading-to-the-dogs-begins-2024-season",
  "date": "2024-01-19T16:59:58",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "Friends of the Doylestown Library"
  ],
  "excerpt": "<p>Reading is ‘going to the dogs’ again in Doylestown in 2024. Beginning January 6, the Friends of the Doylestown Library will host the popular Reading to the Dogs program, in partnership with Comfort Caring Canines and Roxy Therapy Dogs. The program will be held from 10 a.m. to 11:30 a.m., the first Saturday of each [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">R</span><span class=\"s2\">eading is ‘going to the dogs’ again in Doylestown in 2024. Beginning January 6, the Friends of the Doylestown Library will host the popular Reading to the Dogs program, in partnership with Comfort Caring Canines and Roxy Therapy Dogs. The program will be held from 10 a.m. to 11:30 a.m., the first Saturday of each month (January through June), at the Doylestown Library, 150 S. Pine St., Doylestown.</span></p>\n<p class=\"p3\"><span class=\"s3\">“Certified canines provide a calming effect by acting as a nonjudgmental audience when a story is read out loud to them,” explained Steve Schreiner, president of the Friends of the Doylestown Library. “This confidence booster can make all the difference to a beginning reader.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Children must be accompanied by an adult, and preregistration is recommended – send an email to:<span class=\"Apple-converted-space\">  </span>friendsofdoylestownlibrary@gmail.com and request one of four times: 10:00, 10:20, 10:40, or 11:00.<span class=\"Apple-converted-space\">  </span>(Walks-in will be admitted while space is available.)</span></p>\n<p class=\"p3\"><span class=\"s2\">Each person who attends gets the opportunity to choose a book from a collection provided by the Friends, read the book to one or more dogs, and then take the book home.</span></p>\n<p class=\"p3\"><span class=\"s2\">“This continues to be such a popular program that we’ve asked our partners to bring in more dogs,” said Kathy MacLean, program chairperson, Friends of the Doylestown Library. “We’re grateful to have such helpful partners, and of course such cooperative canines.”</span></p>\n<p class=\"p3\"><span class=\"s2\">The Friends of the Doylestown Library is a non-profit organization supporting the Doylestown Library.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/01/Friends-of-Library.jpeg"
}