{
  "id": 13679,
  "title": "Servis Events &#8211; Bucks County’s Favorite Twin Brother Chefs!",
  "slug": "servis-events-bucks-countys-favorite-twin-brother-chefs",
  "date": "2022-06-14T16:14:39",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "brittany brown",
    "doylestown cardinal",
    "Nicolas and Stephen Servis",
    "Servis Events"
  ],
  "excerpt": "<p>By Britt Around Town • Special to The Cardinal Welcome to an interview with Nicolas and Stephen Servis of Servis Events &#8211; Bucks County’s favorite twin brother chefs! I have had the pleasure of  photographing and enjoying one of Servis Event’s meals and their passion and love for their art truly shines through &#8211; from [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Britt Around Town</strong> • Special to The Cardinal</p>\n<p class=\"p3\"><i>Welcome to an interview with Nicolas and Stephen Servis of Servis Events &#8211; Bucks County’s favorite twin brother chefs! I have had the pleasure of<span class=\"Apple-converted-space\">  </span>photographing and enjoying one of Servis Event’s meals and their passion and love for their art truly shines through &#8211; from their tasty and creative dishes to watching them prepare the meals.<span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p1\"><strong>Tell Me A Little About Yourself and Your Business:</strong></p>\n<p class=\"p5\"><span class=\"s1\">My name is Stephen Servis. I have an identical twin brother (Nicolas Servis) who happens to be my business partner and Co-owner of Servis Events. We are very passionate people about all things nature and food related. We offer a seven course tasting menu where we source all of our ingredients as locally and seasonal as possible. We come into peoples homes and turn it into a full service restaurant providing all necessary equipment for a restaurant type of experience.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>When Did You Start Your Business:</strong></p>\n<p class=\"p5\"><span class=\"s1\">We started this business in October of 2020 after spending a summer living on an organic vegetable farm in Vienna, Maine. (Flying Pond Farm)</span></p>\n<p class=\"p1\"><strong>What Made You Decide to Start Your Business:</strong></p>\n<p class=\"p5\"><span class=\"s1\">We decided to start this business because covid completely destroyed the restaurant industry and killed all of the culture we fell so much in love with. We did a few of these events for some close friends and our grandparents and sort of felt like we had something special to offer.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>What is Your Mission Statement or Objective:</strong></p>\n<p class=\"p5\"><span class=\"s1\">Our objective is to create awareness of all of the local food selections and artisan people around us. We believe food is medicine and knowing how your food is grown, what is on it, the farming practices, how far it is coming from, etc. is the most important thing people can care about right now. Covid has shown us how supply chains are very fragile and one glitch in the system really throws it all off. Guess what, the farmers never skipped a beat. We provide healthy foods from local farms, and present it in a very beautiful and provocative type of way. On top of all of that, we take very strict protocol in the way we clean our produce. Using very alkaline water (11.5ph produced from our Kangen Machine) takes away any type of pesticide residue that is most likely sprayed on everything that we eat. It’s a nightmare when we really dive in and learn about it.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Please Provide an Overview of Key Products or Services:</strong></p>\n<p class=\"p5\"><span class=\"s1\">We offer a 7 course sit down chef’s tasting menu. Wine pairings with Common Road Wine are also now available, as well as pasta making classes.</span></p>\n<p class=\"p1\"><strong>What is Your Favorite Thing About What You Do?</strong></p>\n<p class=\"p5\"><span class=\"s1\">Our favorite thing about what we do is getting this extremely gratifying connection with our community. We go and meet the farmers and suppliers. We do all of the serving and cooking at our events which leads into building wonderful relationships with our guests. Its something truly special that we never got to experience being restaurant chefs.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>What is the Most Rewarding Thing About What You Do?</strong></p>\n<p class=\"p5\"><span class=\"s1\">The most rewarding thing about what we do may be two things. The first is, we see how we help other businesses grow. Whether that be through a partnership or collaboration, or from us physically giving them our money. We know when we buy from these small farms and businesses, it is directly benefiting those who need and deserve it. The second may be that we really change and open peoples minds to trying vegetables and products they otherwise would usually turn their noses up at. I can’t even begin to tell you how many peoples paradigms we have changed about beets!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>What’s the Best Thing About Operating Your Business in Bucks County?</strong></p>\n<p class=\"p5\"><span class=\"s1\">The best thing about operating our business in Bucks County is that there is agriculture everywhere!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>What are Your Goals for the Future?</strong></p>\n<p class=\"p5\"><span class=\"s1\">Our goals for the future are to eventually own our own farm property where we do everything on site. All of our own gardening, animal husbandry, inspected kitchen to cook and experiment in, and a barn or farm house to host these intimate dining events in.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Where Can People Go to Find Out More?</strong></p>\n<p class=\"p5\"><span class=\"s2\">We can find us on most platforms. Our website is, <a href=\"http://www.servis-events.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.servis-events.com</a>. Instagram @servisevents. Facebook.com/servistwinsevents. Or our favorite way, on the streets of Doylestown.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Any Fun or Memorable Stories?</strong></p>\n<p class=\"p5\"><span class=\"s1\">Way to many to type out here. Book an event with us, or stop us if you see us around and we can get into all of that.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Anything Else You Would Like to Share?</strong></p>\n<p class=\"p5\"><span class=\"s1\">I would like to share how grateful we are for the acceptance and support our community has had for us. We had a major loss in a credit card scam, and within 48 hours the community donated to us and we made all of our money back. People are always telling us how much they enjoy seeing our food posts and really resonate with what we doing. We truly feel apart of something that is much bigger than us, and we believe if we all work together and push each other up, we will all succeed!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><i>For more info on Nicolas and Stephen and Servis Events visit <a href=\"http://www.servis-events.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.servis-events.com</a></i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/06/Servis-Brothers.jpg"
}