{
  "id": 13804,
  "title": "Spotlight: Area Dads Reflect on Father’s Day",
  "slug": "spotlight-area-dads-reflect-on-fathers-day",
  "date": "2022-06-19T10:51:08",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "dana roberts",
    "doylestown cardinal",
    "father's day"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer During the month in which we honor fathers, we thought it’d be fun to learn a bit about some of the fathers living in or hailing from Doylestown! Happy Father’s Day to all of the Dads and Dad figures out there. We appreciate you all! JAY (owner [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><b>By Dana Roberts • </b></span><span class=\"s1\">The Cardinal Contributing Writer</span></p>\n<p class=\"p3\"><span class=\"s1\"><i>During the month in which we honor fathers, we thought it’d be fun to learn a bit about some of the fathers living in or hailing from Doylestown! Happy Father’s Day to all of the Dads and Dad figures out there. We appreciate you all!</i></span></p>\n<p class=\"p5\"><span class=\"s1\" style=\"color: #993300;\"><b>JAY (owner of Native Cafe!) and his daughter June</b></span></p>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2022/06/image1.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-13810\" src=\"https://doylestowncardinal.com/wp-content/uploads/2022/06/image1.jpg\" alt=\"\" width=\"240\" height=\"320\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2022/06/image1.jpg 240w, https://doylestowncardinal.com/wp-content/uploads/2022/06/image1-225x300.jpg 225w\" sizes=\"auto, (max-width: 240px) 100vw, 240px\" /></a></p>\n<p class=\"p6\"><span class=\"s1\"><b>Age he was when he became a dad: </b>31</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Daughter’s name and age: </b>June Elizabeth, 4 months</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>A little intel on June’s birthday: </b>“It was a week before her due date and Kate (Jay’s wife) wasn’t feeling well. She thought it was heartburn, but it seemed really uncomfortable. It was a Monday and Native was closed on Mondays at the time, but I usually had administrative duties and errands like grocery shopping to do. We deep clean the kitchen and prep food after the busy weekend. We’re always selling out of holy basil burritos and avocado toast. So, I stayed home to take care of Kate and figured I’d do the shopping the next day after work. Well, she tried to go to bed around 11:30 but couldn’t sleep and called the doctor, who said to go to the emergency room. We drove from Ottsville to Doylestown on 611 and got there after midnight. They did some tests and found out she had dangerously high blood pressure and low platelets and the baby would have to be delivered ASAP. I was not prepared at all to spend the next few days at the hospital, but there was no turning back. June was born by C-section later that Tuesday morning. It was the scariest and most amazing day of my life.”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Length of his wife’s labor and the special role he played: </b>“Since she had low platelets, there was a risk for bleeding, and she had to go completely under anesthesia. So, I got to be the first to see June and hold her for skin-to-skin for an hour or so while Kate was waking up.”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Keeping her gender a surprise until she was born was… </b>“Confession&#8230;.we found out we were having a girl but kept it a secret between us until she was born. A surprise would have been so much fun but in the end we couldn’t resist finding out.”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Favorite thing June does these days: </b>She has a contagious belly laugh and pokes her little triangle tongue out when she smiles.</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>What the nights look like right now: </b>“I get almost a full night of sleep. June is a good sleeper and only gets up two or three times for snacks. Kate says she goes back to sleep pretty easily during the night.”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Most surprising thing about fatherhood: </b>“How quickly you adjust to having life revolve around entertaining a little human. I’m pretty creative at using whatever is around to keep her happy.”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Favorite part of being a dad: </b>“I love making my wife coffee in bed first thing in the morning while June is waking up. June wakes up shy and blushing and all cuddly. It’s the hardest to leave them.”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>What you hope to do on your first Father’s Day: </b>“Just to go for a family walk with our dog Sadie and June in the stroller. It’s the best to be together.”</span></p>\n<p class=\"p5\"><span class=\"s1\" style=\"color: #993300;\"><b>BRIAN (6th grade teacher at Linden Elementary School, and former Linden student as well!)</b></span></p>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2022/06/image2.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-13809\" src=\"https://doylestowncardinal.com/wp-content/uploads/2022/06/image2.jpeg\" alt=\"\" width=\"1019\" height=\"765\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2022/06/image2.jpeg 1019w, https://doylestowncardinal.com/wp-content/uploads/2022/06/image2-300x225.jpeg 300w, https://doylestowncardinal.com/wp-content/uploads/2022/06/image2-768x577.jpeg 768w, https://doylestowncardinal.com/wp-content/uploads/2022/06/image2-74x55.jpeg 74w, https://doylestowncardinal.com/wp-content/uploads/2022/06/image2-111x83.jpeg 111w, https://doylestowncardinal.com/wp-content/uploads/2022/06/image2-215x161.jpeg 215w, https://doylestowncardinal.com/wp-content/uploads/2022/06/image2-990x743.jpeg 990w\" sizes=\"auto, (max-width: 1019px) 100vw, 1019px\" /></a></p>\n<p class=\"p6\"><span class=\"s1\"><b>Kids’ names and ages: </b>Olivia, 9, Tyler, 6, and Boomer, 3</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Age he was when he became a dad: </b>28</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Biggest adjustment/change in life since having kids: </b>Work/Life/Family balance</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Favorite family trip they’ve taken: </b>Summer trips to LBI</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Favorite activity he does with his kids right now: </b>Play sports and coach their teams</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Doylestown spot he likes to take his kids: </b>Annie’s Water Ice</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Something funny his kids have said or done lately: </b>Boomer went upstairs and got dressed in Tyler’s baseball uniform all by himself and came back down and said, “Put me in, coach!”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Best parenting/fatherhood advice you’ve been given: E</b>njoy each stage with your child</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>What he’d like to do on Father’s Day: </b>Go to a Phillies game with his family</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Favorite thing about being a dad: </b>“Hearing my kids laugh and watching them grow and experience new things.”</span></p>\n<p class=\"p5\"><span class=\"s1\" style=\"color: #993300;\"><b>HARDEEP, and his sons Jairam, age 8, and Dillan, age 2</b></span></p>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2022/06/image3.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-13808\" src=\"https://doylestowncardinal.com/wp-content/uploads/2022/06/image3.jpg\" alt=\"\" width=\"309\" height=\"354\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2022/06/image3.jpg 309w, https://doylestowncardinal.com/wp-content/uploads/2022/06/image3-262x300.jpg 262w\" sizes=\"auto, (max-width: 309px) 100vw, 309px\" /></a></p>\n<p class=\"p6\"><span class=\"s1\"><b>Age he was when he became a dad: </b>32</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>His reaction when he found out he was having boys:</b> “I think I went outside the house and screamed both times, embarrassing my wife!”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Favorite activity he does with his sons right now:</b> “I enjoy practicing soccer with Jairam in the backyard or at the local park. With Dillan, I enjoy taking walks with him in the evenings and visiting War Memorial Park.”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Something funny his kids have done lately: </b>“Dillan picks up everything we say. He likes to yell at Jairam to ‘pinch in’ during soccer games, or tell Jairam, ‘Stop it, I’m just a baby.’”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Favorite trip they’ve taken as a family: </b>“Savannah, Georgia. Such a lovely city. There are parks on every corner, and playing soccer with Jairam at Forsyth Park was amazing.”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Best parenting advice he’s received: </b>Take things as they come.</span></p>\n<p class=\"p6\"><span class=\"s3\"><b>Favorite thing about being a dad:</b> Seeing the boys happy, and making them laugh.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\" style=\"color: #993300;\"><b>MICHAEL (Volunteer firefighter with Doylestown Fire Company), with his daughter Taylor and son Michael II</b></span></p>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2022/06/image4.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-13807\" src=\"https://doylestowncardinal.com/wp-content/uploads/2022/06/image4.jpg\" alt=\"\" width=\"1021\" height=\"662\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2022/06/image4.jpg 1021w, https://doylestowncardinal.com/wp-content/uploads/2022/06/image4-300x195.jpg 300w, https://doylestowncardinal.com/wp-content/uploads/2022/06/image4-768x498.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2022/06/image4-990x642.jpg 990w\" sizes=\"auto, (max-width: 1021px) 100vw, 1021px\" /></a></p>\n<p class=\"p6\"><span class=\"s1\"><b>His kids’ ages: </b>Taylor is 27 and Michael is 25</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Age he was when he became a dad: </b>29</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Any nicknames he has for his kids: </b>Taylor’s nickname is “Noodle” and Michael’s nickname was “Ant”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Favorite activity he does with his kids right now: </b>“Taylor lives in Sonoma, California, so talking on the phone and FaceTime are the current activities. Michael and I play golf.”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Doylestown spot he likes to take his kids: </b>86 West</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Funny memory from when his kids were little: </b>“I was ‘teaching’ Taylor to ride a bike and fell. When I fell Taylor and the bike crashed on top of me.”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Favorite trip he’s taken with his family: </b>“We spent most summers at the beach, but the trips to Disney when they were younger were a lot of fun.”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Best parenthood advice he’s been given: </b>“A friend once told me, ‘No matter what, do not put the kids in the middle.’”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Something he’s looking forward to doing with his kids: </b>“Taylor is getting married in July 2023, and I’m looking forward to spending time in California with the entire family.”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>What he’d like to do on Father’s Day: </b>Relax and spend time with family.</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Favorite thing about being a dad: </b>“I enjoy sharing life and career advice with both of them. I love laughing about memorable events in our past, and I cherish the times we are together.”</span></p>\n<p class=\"p5\"><span class=\"s1\" style=\"color: #993300;\"><b>BOB, and his daughters Erin, Donielle, and Nicole</b></span></p>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2022/06/image5.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-13806\" src=\"https://doylestowncardinal.com/wp-content/uploads/2022/06/image5.jpg\" alt=\"\" width=\"734\" height=\"557\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2022/06/image5.jpg 734w, https://doylestowncardinal.com/wp-content/uploads/2022/06/image5-300x228.jpg 300w, https://doylestowncardinal.com/wp-content/uploads/2022/06/image5-74x55.jpg 74w, https://doylestowncardinal.com/wp-content/uploads/2022/06/image5-111x83.jpg 111w\" sizes=\"auto, (max-width: 734px) 100vw, 734px\" /></a></p>\n<p class=\"p6\"><span class=\"s1\"><b>His age when he had his daughters: </b>19 with Erin, 21 with Donielle, and 24 with Nicole</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>When not on dad duty (or grandpa duty):<span class=\"Apple-converted-space\">  </span></b>Bob is a Corrections Officer, and Former Chief in the United States Navy.</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Something funny he said growing up: </b>“That’s not proper foot attire!” He hated when we wore flip flops in high school! (Erin) “Take good care of your teeth.”<b> </b>(Donielle) “You’ll eat it and you’ll like it.” Followed by, “Oh, Kel, this is so good!”<span class=\"Apple-converted-space\">  </span>Literally what he said every night at dinner. (Nicole)</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Best lesson his daughters have learned from him: </b>Work hard and make good choices. (Erin) Respect your elders. (Donielle) Practice makes perfect.<span class=\"Apple-converted-space\">  </span>Look people in the eyes when you are speaking to them. (Nicole)</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Funny dad faux pas moments: </b>Erin: “When he dressed up as a woman and went trick or treating with us when I was in elementary school.<span class=\"Apple-converted-space\">  </span>He asked everyone who opened the door if he could come in for tea!” Donielle: “When Dad took us (without Mom) to Fenway Park on the subway.<span class=\"Apple-converted-space\">  </span>While he was buying tokens, I was running down the up escalator and my shoe got stuck.<span class=\"Apple-converted-space\">  </span>My shoe had to be cut off.<span class=\"Apple-converted-space\">  </span>Did we go home?<span class=\"Apple-converted-space\">  </span>Nope! I went to the game with one and a half shoes!” Nicole: “Driving to the middle of the woods in his old hunk of junk ’63 Ford truck to cut down a Christmas tree.<span class=\"Apple-converted-space\">  </span>Then the truck went up in flames and we were stranded (before cell phones).”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Interesting/memorable family trip: </b>Erin: “When we traveled cross country and didn’t know there would be a biker rally in North Dakota.<span class=\"Apple-converted-space\">  </span>We couldn’t find a hotel with any vacancy so we slept in our minivan until a hotel room was available!” Donielle: “Driving with Dad in our underwear during our cross-country trip because his car didn’t have air conditioning!” Nicole: “Traveling cross country and seeing Mount Rushmore and The Mall of America.<span class=\"Apple-converted-space\">  </span>We also went to Disney World and the entire family got on the Jurassic Park log flume ride!”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Favorite activity they did growing up: Erin: </b>“When he got home from work, Dad would spend hours with me practicing softball.<span class=\"Apple-converted-space\">  </span>Even though he raised three girls, we all participated in punt pass and kick.<span class=\"Apple-converted-space\">  </span>Watching our Detroit sports teams together was another big part of my childhood.” Donielle: “He always let me paint his nails!” Nicole: “Practicing at the ball field with the entire family.”</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>How many states they’ve lived in: </b>Bob and his wife Kelly were born and raised in Michigan.<span class=\"Apple-converted-space\">  </span>They lived there until Bob graduated from college.<span class=\"Apple-converted-space\">  </span>Then he joined the Navy and they lived in Georgia for 3 years, 1 year back in Michigan while Bob completed flight school, 5 years in Massachusetts, 5 years in Washington state and now 21 years here in PA.</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Reasons he’s the best dad: Erin: </b>“He worked so hard so my sisters and I could have the best and most fun childhood.<span class=\"Apple-converted-space\">  </span>He’s so funny and simply put- he’s the best!” Donielle: “There is no one else I can count on or trust more.” Nicole: “There’s nothing he wouldn’t do for us.<span class=\"Apple-converted-space\">  </span>He always brings the fun to every adventure we go on.<span class=\"Apple-converted-space\">  </span>He loves his family so much!”</span></p>\n<p class=\"p5\"><span class=\"s1\" style=\"color: #993300;\"><b>ROBERT RAMOY (far right), with his family</b></span></p>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2022/06/image6.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-13805\" src=\"https://doylestowncardinal.com/wp-content/uploads/2022/06/image6.jpeg\" alt=\"\" width=\"717\" height=\"697\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2022/06/image6.jpeg 717w, https://doylestowncardinal.com/wp-content/uploads/2022/06/image6-300x292.jpeg 300w\" sizes=\"auto, (max-width: 717px) 100vw, 717px\" /></a></p>\n<p class=\"p6\"><span class=\"s1\"><b>Age: </b>79</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Nickname: H</b>aha, dubbed by his grandkids, because he’s always making them laugh</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Children’s Names: </b>Joanne, Richie, and David</span></p>\n<p class=\"p6\"><b>Fun Fact: </b>Robert is the father of David Ramoy, the co-creator of the Cardinal! Robert is a new Doylestown resident too, so give him a hearty welcome if you see him.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Previous Occupation: </b>Owner of a construction business.</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Where he raised his family: </b>Staten Island, New York</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Something he always loved to do with his kids when they were young: </b>Take them to the toy store and buy them everything they could carry out of the store.</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>Something he loves to do with his kids right now: </b>Spend time with them and tell them stories of his past- his time in California, how he was the one who made bellbottoms trendy, how he almost hosted the second annual Bohemian Festival in Seattle (there wasn’t a first).</span></p>\n<p class=\"p6\"><span class=\"s1\"><b>He always laughs when his kids (or grandkids)…</b>tickle him! He is the most ticklish man alive. Even if you show him your “tickle finger,” he can’t help but giggle.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\"><b>What he’ll do on Father’s Day: </b>Spend time with his kids and grandkids and go out to lunch.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/06/image.jpg"
}