{
  "id": 11997,
  "title": "The &#8220;Pots &#038; Pans&#8221; Show: Skylar Love",
  "slug": "the-pots-pans-show-skylar-love",
  "date": "2022-01-11T12:12:27",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "Skylar Love",
    "Villa Capri"
  ],
  "excerpt": "<p>The Cardinal had the pleasure of interviewing 16-year-old Skylar Love for this month’s musician spotlight.  She started her career at six, performing live shows for her stuffed animals in her bedroom.  She has now traveled across the country performing her own music for crowds over 400,000 people! Find her on Instagram at @officialskylarlove Tell us [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><i>The Cardinal had the pleasure of interviewing 16-year-old Skylar Love for this month’s musician spotlight.<span class=\"Apple-converted-space\">  </span>She started her career at six, performing live shows for her stuffed animals in her bedroom.<span class=\"Apple-converted-space\">  </span>She has now traveled across the country performing her own music for crowds over 400,000 people! Find her on Instagram at @officialskylarlove</i></span></p>\n<p class=\"p3\"><strong>Tell us about yourself and your music. When and how did you get started?</strong></p>\n<p class=\"p4\"><span class=\"s2\">I thought about an answer for “tell us about yourself,” for hours and if I’m honest, all I can say is I’m Skylar Love. I’m me and that’s that. I feel that the best way to describe my music is feeling. Me and everyone else have always had a hard time trying to place me in some type of genre of music but I think that what’s my music is, just making people feel something is always my goal.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Singing about things that make the average person feel uncomfortable is one of my favorite things because deep and meaningful conversations are very uncomfortable, difficult conversations to have, so why not sing about them and make you feel something you haven’t felt yet.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">I got started when I was 11 with playing open mics but I’ve been singing and writing for a long time before that. It just started getting serious August of 2020.</span></p>\n<p class=\"p3\"><strong><span class=\"s3\">Who/What is your inspiration? </span></strong></p>\n<p class=\"p4\"><span class=\"s2\">I have lots of people I’m inspired by for example, Panic! at the Disco, Billie Eilish, Melanie Martinez, Queen, Willow Smith, and so many more artists. The “what,” for my inspiration would be everything bad that happens to me.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">It’s funny because usually when something bad happens to yourself you react in a normal way, the way I react is just saying thank you to the person who wronged me for great song inspiration. </span></p>\n<p class=\"p3\"><strong>Describe your favorite and least favorite part about being a musician.</strong></p>\n<p class=\"p4\"><span class=\"s4\">My favorite part is doing the shows and I just can’t wait for the shows to only get bigger. My least favorite thing is when we get back in the car from a gig and are heading home and it hits me that we just can’t keep driving to another gig. I hate not performing. </span></p>\n<p class=\"p3\"><strong>Tell us about your favorite performance of your career. </strong></p>\n<p class=\"p4\"><span class=\"s2\">I played Summerfest which was the biggest festival I’ve played and that was just the most amazing experience I’ve ever had.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><strong>Do you have any hobbies or interests outside of music? </strong></p>\n<p class=\"p4\"><span class=\"s2\">To be honest not really, I play video games and hang out with my friends, but I just live and breathe music. It’s everything I do. </span></p>\n<p class=\"p3\"><strong>How do you like being a musician in Doylestown? Where else can people find you singing?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p4\"><span class=\"s2\">I don’t ever really play in Doylestown, except occasionally at Villa Capri when I’m not traveling (January 14th!). I play all over the country which is so insane that I get the pleasure of doing so at such a young age. </span></p>\n<p class=\"p1\"><em><span class=\"s1\"><b>The “Pots and Pans Show” section of The Cardinal, brought to you by Villa Capri, highlights local musicians and the restaurants that host their live music. Please send your music lineups and news to <a href=\"mailto:villacapripizza@aol.com\">villacapripizza@aol.com</a></b></span></em></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/01/Skylar-Love.jpg"
}