{
  "id": 17054,
  "title": "The Next Step Programs Fosters Success and Happiness in Young Adults with Disabilities",
  "slug": "the-next-step-programs-fosters-success-and-happiness-in-young-adults-with-disabilities",
  "date": "2023-03-06T18:38:53",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "Josh Fields",
    "Next Step Programs (TNS)",
    "sarah peters"
  ],
  "excerpt": "<p>By Sarah Peters • Special to The Cardinal At age 16, Central Bucks South student Josh Fields was thinking about college and his life’s potential. He wondered what would happen to his friends once they graduated high school, including his close friend with Down Syndrome. That’s when he recognized the lack of opportunities available to [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><strong>By Sarah Peters</strong> • </span><span class=\"s1\">Special to The Cardinal</span></p>\n<p class=\"p3\"><span class=\"s3\">A</span><span class=\"s2\">t age 16, Central Bucks South student Josh Fields was thinking about college and his life’s potential. He wondered what would happen to his friends once they graduated high school, including his close friend with Down Syndrome. That’s when he recognized the lack of opportunities available to his peers with disabilities. Fields felt that it wasn’t right that some young adults remained limited. He believed that “everyone deserves to reach for their dreams and find opportunities to be successful.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">Fields met Richard Price, a fellow volunteer at a summer camp for young adults with Down syndrome. Together, their passion to make a difference grew into the Next Step Programs (TNS), a non-profit organization that creates opportunities for young adults with disabilities, as they transition out of high school and into the real world.</span></p>\n<p class=\"p6\"><strong>What is the mission of the Next Step Programs?</strong></p>\n<p class=\"p5\"><span class=\"s2\">Fields, who is now 25 years old, has become the CEO of the organization. He grew it into a network for “employment, education, social opportunities, and access to the community.”</span></p>\n<p class=\"p5\"><span class=\"s2\">When many local non-profits had closed their doors during the pandemic, TNS began hosting 11 families together in a local church each week. Enthusiastically, these families spread the word, recruiting many more participants to join. The group now serves more than 80 families. These young adults represent over 15 different diagnoses, including intellectual disabilities, Williams syndrome, Jacobsen syndrome, Fragile X syndrome, Down syndrome, and others.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">TNS partners with school districts and supports coordinator agencies that help connect families with potential resources. The organization has grown rapidly and is already expanding into other communities across Pennsylvania. Its innovative approach fulfills a great need, offering opportunities that wouldn’t otherwise exist.</span></p>\n<p class=\"p6\"><strong>How Does TNS Support Young Adults with Disabilities?</strong></p>\n<p class=\"p5\"><span class=\"s2\">There is significant diversity within the TNS population. Participants represent a broad spectrum of abilities. The mission of TNS is “greater than autism, greater than Down Syndrome, and greater than any one disability,” Fields says. He envisions a world that’s more “universally designed” so that everyone can live a more equitable life, regardless of any limitations.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Thoughtful and strategic decisions go into every TNS opportunity to make all activities meaningful for the participants. The programming aims to promote healthy living and soft skills, including teamwork, decision-making, and self-advocacy.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s5\">Evening group events combine social settings with various activities.<span class=\"Apple-converted-space\">  </span>Young adults can learn to become entrepreneurs, learning the process from creating a concept to marketing, designing business cards, and running social media. Exploring cinematic themes is a movie class that inspires friendships, as the participants practice identifying emotions, thinking critically, and honing other interpersonal skills. Intro to cooking is comprised of learning about the food pyramid, healthy portions, meal prep, and kitchen safety. Other classes teach consumer math, employment skills, and fitness. The very popular Friends Night Out brings families together for bowling, rock climbing, paint nights, holiday dances, and scavenger hunts.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong>How Can I Get Involved?</strong></p>\n<p class=\"p5\"><span class=\"s2\">As these young adults age out of the public school systems, you can help them grow into new relationships with the Next Steps Programs. TNS is always looking for volunteers, product donations, contributions, and corporate partners.</span></p>\n<p class=\"p5\"><span class=\"s2\">Since employment opportunities are so critical to the success of some participants, TNS is always seeking small businesses that might consider training and hiring new employees in the Doylestown area.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Visit their website at <a href=\"http://www.tnsprograms.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.tnsprograms.org</a> or follow @tnsprograms on Instagram.</span></p>\n<p class=\"p7\"><span class=\"s6\"><i>Sarah Peters is a top-producing Realtor, leader of the Sarah Peters Team, ALC board member at Keller Williams Doylestown, and mother of three. She’s passionate about serving others and helping people find themselves right at home in greater Bucks County. For more details, visit <a href=\"http://www.sarahpetersteam.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.sarahpetersteam.com</a>, Instagram @sarahpetersteam, or call her at (484) 459-9944.<span class=\"Apple-converted-space\"> </span></i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/03/image0-e1678145915315.jpeg"
}