{
  "id": 16243,
  "title": "“The Forgotten Ones”:  EMTs Face Funding and Staffing Shortages",
  "slug": "the-forgotten-ones-emts-face-funding-and-staffing-shortages",
  "date": "2023-01-09T23:42:48",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "Central Bucks Emergency Medical Services",
    "Charles “Chuck” Pressler",
    "doylestown cardinal",
    "Natalya Bucuy"
  ],
  "excerpt": "<p>By Natalya Bucuy • The Cardinal Contributing Writer “Where there is chaos, you will find clarity” is a quote written in blue marker on the whiteboard on the office wall. It’s simple and fitting for the office of Charles “Chuck” Pressler, the Chief of Central Bucks Emergency Medical Services (EMS). Here, with a staff of 80 [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Natalya Bucuy<span class=\"Apple-converted-space\"> • </span></strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">“Where there is chaos, you will find clarity”</span><span class=\"s3\"> is a quote written in blue marker on the whiteboard on the office wall. It’s simple and fitting for the office of Charles “Chuck” Pressler, the Chief of Central Bucks Emergency Medical Services (EMS). Here, with a staff of 80 members, both full and part-time, who receive 30 to 40 dispatches every 24 hours, chaos is a constant.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">The dispatches come from Bucks County Dispatch, the 911 call center. Established in 1951 as a non-profit volunteer ambulance squad, the Central Bucks EMS department serves over 150,000 residents in its surrounding communities. The Doylestown station is one of five in the Central Bucks EMS Department. Other branches serve the Wrightstown, Warwick, Warminster, and New Hope communities.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Incidents such as road accidents, fires, drug overdose cases, heart problems, and falls make up these emergency responders’ workdays. “It’s my job to ensure the machine is up and running,” Pressler says about his daily tasks. “It also involves grant writing, fundraising, and working with municipalities and other parties.”</span></p>\n<p class=\"p4\"><span class=\"s1\">Pressler has done more than his fair share of dispatches. A 32-year veteran of the Emergency Services, he still rides in the ambulance to help at a scene every so often. On his very first call as a volunteer more than three decades ago, Pressler encountered a dead body at the scene. Nevertheless, he continued on and made EMS his career. His favorite parts of the job always include helping and meeting new people. “Being a paramedic is very satisfying,” he says. The job also comes with one of the hardest parts &#8211; witnessing human tragedy on a regular basis. “It stays with you,” Pressler says. “You don’t forget it.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2023/01/IMG_4990.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-16245\" src=\"https://doylestowncardinal.com/wp-content/uploads/2023/01/IMG_4990.jpg\" alt=\"\" width=\"1470\" height=\"1103\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2023/01/IMG_4990.jpg 1470w, https://doylestowncardinal.com/wp-content/uploads/2023/01/IMG_4990-300x225.jpg 300w, https://doylestowncardinal.com/wp-content/uploads/2023/01/IMG_4990-768x576.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2023/01/IMG_4990-1024x768.jpg 1024w, https://doylestowncardinal.com/wp-content/uploads/2023/01/IMG_4990-74x55.jpg 74w, https://doylestowncardinal.com/wp-content/uploads/2023/01/IMG_4990-111x83.jpg 111w, https://doylestowncardinal.com/wp-content/uploads/2023/01/IMG_4990-215x161.jpg 215w, https://doylestowncardinal.com/wp-content/uploads/2023/01/IMG_4990-990x743.jpg 990w, https://doylestowncardinal.com/wp-content/uploads/2023/01/IMG_4990-1320x990.jpg 1320w\" sizes=\"auto, (max-width: 1470px) 100vw, 1470px\" /></a></p>\n<p class=\"p4\"><span class=\"s1\">As a long-term leader in the organization, Pressler gets to see the growth of his EMTs. “Some see this field as a stepping stone into the medical field,” Presses says. “They go on to become doctors. It’s rewarding to see them grow and continue with their careers.”</span></p>\n<p class=\"p4\"><span class=\"s1\">As far as operational challenges, Pressler said funding is always an issue. The monthly operating costs of the station average $450,000. The money comes from billing the insurance companies for ambulance requests, receiving small tax subsidies from municipalities, and private and public fundraising. “EMTs are often the forgotten ones,” Pressler says. “We’re not the firemen, and we’re not the people showing up with guns. We’re often not given the credit even though we’re the first ones on the scene.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">The EMS industry as a whole is facing funding challenges, non-cooperative insurance companies, and cases of patients not paying their bills. The organization is underfunded on the state and federal levels, and private funding runs low. But emergencies still happen, and the department makes it work to keep the lights on. “We don’t answer the calls based on anyone’s ability to pay,” Pressler says, forced to find funding elsewhere or make unfortunate cuts. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">With funding diminishing, the organization’s ability to pay non-volunteer EMTs well also suffers. That leads to a lack of interest in these positions, which, in turn, means fewer EMTs to serve the community. If this trend continues, in a few years, Doylestown area residents might not have anyone to answer their emergency calls.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">To help, readers can participate in the EMT’s bi-annual subscription drive that takes place in October and May. Donations in any amount also help. “We have to raise money to come to save you,” Pressler says. Joining the EMS force is another way to contribute. As part of an EMT training course, the department offers paid internships with career prospects.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">For more information, to learn how to help or get involved, to donate, or if you may be interested in pursuing a career as an EMT, visit the unit’s website: <a href=\"http://cbems.org\" target=\"_blank\" rel=\"noopener noreferrer\">cbems.org</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/01/IMG_4991.jpg"
}