{
  "id": 11415,
  "title": "The Doylestown Arts Festival Returns with Art and Music for All",
  "slug": "the-doylestown-arts-festival-returns-with-art-and-music-for-all",
  "date": "2021-09-10T15:35:37",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live",
    "Play",
    "Style",
    "Taste"
  ],
  "tags": [
    "Doylestown Arts Festival",
    "doylestown cardinal",
    "paul boger"
  ],
  "excerpt": "<p>30th Year of Iconic Festival is Set for September 11-12, 2021 On September 11 and 12, the Doylestown Arts Festival returns for its 30th anniversary. With art and music lining the streets, the festival will continue its mission to highlight independent creators, support small businesses, and raise awareness of the local cultural scene. The highly [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong><span class=\"s1\"><i>30th Year of Iconic Festival is Set for September 11-12, 2021</i></span></strong></p>\n<p class=\"p1\"><span class=\"s1\">O</span><span class=\"s2\">n September 11 and 12, the Doylestown Arts Festival returns for its 30th anniversary. With art and music lining the streets, the festival will continue its mission to highlight independent creators, support small businesses, and raise awareness of the local cultural scene. The highly celebrated event is planned to take place in person in a safe and responsible manner. Free to the public, the festival will run daily from 10am until 5pm.</span></p>\n<p class=\"p3\"><span class=\"s2\">“We are quite excited to be back,” says festival director Paul Boger. “As a group we felt it was important not only to our participants but to our community at large to ensure that art and music fill our historic streets once more.”</span></p>\n<p class=\"p3\"><span class=\"s2\">This year’s festival features over 120 independent artists who have been selected by an all-volunteer jury. Art lovers and buyers alike can expect a wide range of styles and mediums ranging from fine art and photography to pottery, woodwork, glass, and more. In addition, a selection of live art and interactive activities will illuminate the streets.</span></p>\n<p class=\"p3\"><span class=\"s2\">While exploring, visitors can enjoy a diverse selection of music with 32 acts across 5 stages throughout the weekend.</span></p>\n<p class=\"p3\"><span class=\"s2\">Organizers are taking public safety seriously with changes geared to create space and reduce crowding. This year’s festival will not feature a food court, instead driving that business entirely to the local restaurants. While there are fewer overall vendors than in past years, the festival will still cover the same grounds.</span></p>\n<p class=\"p3\"><span class=\"s2\">The Doylestown Arts Festival will be held on Doylestown’s quaint downtown streets—converted to lively pedestrian-only avenues during the event. For locals and visitors alike, this immersive experience is designed to celebrate the joy that art, music, and community bring to our daily lives.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">2021 LINEUP</span></strong></p>\n<p class=\"p3\"><span class=\"s2\">Artists span a variety of styles and mediums &#8211; including a mix of interactive arts and demonstrations. Explore the categories below for a full preview of the festival. For more activities and events, check out the Event Schedule.</span></p>\n<p class=\"p3\"><span class=\"s2\">Various mediums include: Fine Art, Glass, Illustration, Photography, Jewelry, Metal, Mixed Media, Pottery, Printmaking, Recycled Art, Textiles and Wood</span></p>\n<p class=\"p4\"><strong><span class=\"s4\">LIVE MUSIC</span></strong></p>\n<p class=\"p3\"><span class=\"s2\">The festival features 5 stages of live music varying from classic rock and jazz to alternative and folk. There’s a little something for everyone. View our festival map to see stage locations or see the schedule for our full lineup.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">DEMONSTRATIONS</span></strong></p>\n<p class=\"p3\"><span class=\"s2\">We are pleased to offer a growing selection of live demonstrations and interactive arts at the Doylestown Arts Festival. Featuring scarf dying, pottery demos, face painting, tin type photography, and more!</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">PRO CYCLING</span></strong></p>\n<p class=\"p3\"><span class=\"s2\">Experience the speed of pro cycling around the borders of the festival with our friends at the Thompson Bucks County Classic! On Sunday pro men, pro women, amateur men, kids, and highwheel bicycles will hit the streets.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">FESTIVAL PARKING</span></strong></p>\n<p class=\"p3\"><span class=\"s2\">During the festival a large portion of downtown Doylestown is closed to traffic and parking can be difficult. We recommend locals walk or bike to the event when possible. If you’re coming from out of town, please see our recommendations below. Street parking is available outside of the festival grounds but fills up quickly. Please be sure to check parking rules, rates, and limits wherever you park to avoid tickets or towing. The festival is also accessible via the Doylestown Dart and Septa Regional Rail.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">DOYLESTOWN, PA</span></strong></p>\n<p class=\"p3\"><span class=\"s2\">Home to over 8,000 residents as well as the James A. Michener Art Museum, the Mercer Museum and Fonthill Castle, the TileWorks, the County Theater, and a robust array of galleries, restaurants, and locally-owned shops and boutiques, Doylestown is nationally recognized as a destination town. The Doylestown Arts Festival is made possible by a small volunteer committee of Discover Doylestown and is presented by the Thompson Organization. For more information about this year’s festival, please visit <a href=\"http://dtownartsfestival.com\" target=\"_blank\" rel=\"noopener noreferrer\">dtownartsfestival.com</a>.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/09/daf-6.jpg"
}