{
  "id": 18564,
  "title": "The Board Housewife",
  "slug": "the-board-housewife",
  "date": "2023-12-14T17:33:02",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Taste"
  ],
  "tags": [
    "Coterie Commons",
    "dana roberts",
    "doylestown cardinal",
    "Emily Keane"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer There’s a new place in town to grab a quick yet indulgent lunch or pick up a unique, crowd-pleasing treat for an after-work gathering: The Board Housewife’s pop-up shop in Coterie Commons, on 72 North Main Street, right across the street from the Courthouse.  Patrons can visit [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Dana Roberts</strong></em> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">There’s a new place in town to grab a quick yet indulgent lunch or pick up a unique, crowd-pleasing treat for an after-work gathering: The Board Housewife’s pop-up shop in Coterie Commons, on 72 North Main Street, right across the street from the Courthouse.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Patrons can visit the shop from Wed. to Fri. from 11-5 p.m., or on Sat from 10-4 p.m. to pick up a delicious lunch charcuterie box (priced at $15) or a pre-assembled box to bring for a gathering. The shop also offers retail items, cheese, olives, grab n’ go items, and makes made-to-order charcuterie boards. It is open by appointment on Sunday &#8211; Tuesday.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">The shop, which opened to the public on Oct. 7 and will run as a six-month pop-up through Jan, shares space in the female-driven collective known as Coterie Commons. The Commons’ purpose focuses on creating community and encouraging women-owned businesses.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Businesses currently located in the Commons include photographers Kristin Moore and Taylor Cotilla, and Wildbird Flowers, a shop owned by floral artist Annie Pertes. Coterie Commons also offers workshops and classes from a curated team of instructors, as well as a beautiful studio space, available for said workshops and private events.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">The Commons hosts a monthly book club, a “Girls Create and Connect” crafting and friendship-creating experience for young girls, and fun, seasonal events such as October’s Witches Night Out. The Board Housewife pop-up shop is the latest addition to Coterie Commons’ ever-expanding, magnetic space—now made all the more so by delicious fare to nosh on.</span></p>\n<p class=\"p4\"><span class=\"s2\">The shop’s owner, Emily Keane, aka The Board Housewife herself, has been a local favorite in Doylestown since she started her business in October 2020, offering made-to-order, artfully curated cheese and charcuterie boards, as well as workshops, in and around the Doylestown area.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Keane, 40, a native of upstate New York, met her husband while at college in Vermont, and spent time in San Francisco and New Jersey before they settled in Doylestown in 2013 with their daughter and dogs. Keane started The Board Housewife as a creative outlet when her daughter was in elementary school.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Her background in restaurants and corporate retail, as well as her love of food (with her own food blog, Pretty in Pork, as a testament), was the perfect recipe for her business to be a success. And it was from the start. She quickly started offering workshops and became a well-known name in the community.</span></p>\n<p class=\"p4\"><span class=\"s2\">However, the catalyst that spurred her to open the pop-up shop was unexpected, and a bit more personal. In January 2023, two months after turning 40, Keane had her first mammogram, which revealed that she had cancer.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">Keane had a unilateral mastectomy at the end of March, followed by months of recovery, including reconstructive surgery in August. The experience left Keane, who is open with the public about her diagnosis, unsure of whether she wanted to return to The Board Housewife. She had taken a break from the business during her cancer care.</span><span class=\"s2\"><span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">By the summer, she felt uninspired and hesitant to return to the rented kitchen space she’d been using. But then she was approached by her friends Kristin Moore and Taylor Cotilla, the women behind Coterie Commons, to see if she wanted to rent space in their collective. The move was the exact change Keane needed. She’d always had a dream of owning a shop in town, and being able to do so was, as Keane says, “such a happy ending.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Being a part of Coterie Commons, a space founded on the idea of a community for all, seems all the more fitting for Keane, whose story has already touched women in the community. After sharing her diagnosis on social media, Keane was contacted by many people, including some women who shared that she inspired them to do something they’d been putting off, prompting them to get their own mammograms scheduled.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Keane never could have imagined what a nourishing and inspirational role she’d take in the community. She reminds others of the importance of being vulnerable with your story, because of its ability to impact others.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/The-Board-Housewife-Emily-Keane-e1702593169928.jpeg"
}