{
  "id": 18604,
  "title": "The PairUp Society Hosts  Second Annual Kwanzaa Celebration",
  "slug": "the-pairup-society-hosts-second-annual-kwanzaa-celebration",
  "date": "2023-12-14T18:09:25",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "kwanzaa",
    "Sheela Rai"
  ],
  "excerpt": "<p>By Sheela Rai • The Cardinal Contributing Writer On Dec. 27th, join The PairUp Society for its 2nd Annual Kwanzaa Celebration. The family-friendly celebration, centered around learning the origins of Kwanzaa and African American culture, will take place at the Mercer Museum beginning at 4 pm.  Kwanzaa originated in 1966 with Professor Maulana Karenga, coinciding [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Sheela Rai</strong></em> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">On Dec. 27th, join The PairUp Society for its 2nd Annual Kwanzaa Celebration. The family-friendly celebration, centered around learning the origins of Kwanzaa and African American culture, will take place at the Mercer Museum beginning at 4 pm.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Kwanzaa originated in 1966 with Professor Maulana Karenga, coinciding with the Civil Rights Movement and the Watts Riots.<span class=\"Apple-converted-space\">  </span>PairUp Society’s Adrienne King shared that the principles that Professor Karenga used in the creation of Kwanzaa helped ground the Black community and link them back to the values and traditions of their African roots.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">The name of the holiday, Kwanzaa, originates from the Swahili phrase “matunda ya kwanza,” meaning “first fruits,” and is rooted in first fruits celebrations found in cultures throughout Africa.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">The Nguzo Saba, or seven principles, are Umoja (unity), Kujichagulia (self-determination), Ujima (collective work and responsibility), Ujamaa (cooperative economics), Nia (purpose), Kuumba (creativity), and Imani (faith).<span class=\"Apple-converted-space\">  </span>For King’s family, Kwanzaa is an intentional time to reflect on accomplishments, refocus, and set goals in preparation for the New Year as they connect to their roots and community.</span></p>\n<p class=\"p4\"><span class=\"s2\">Since its creation, the celebration of Kwanzaa has continued to grow among the Black Community. While King had not learned or seen celebrations of Kwanzaa in Bucks County growing up, she learned about them in college and began incorporating it into her family’s celebrations once she had children. She saw how cultural celebrations like Kwanzaa unify community members around a collective purpose.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">For example, the goals of Central and Upper Bucks, where the Black community is smaller in number, differ from the goals of Lower Bucks, where the Black community is larger. Black Community leaders, like King, have seen the power of the principles of Kwanzaa and how they empower, grow, and unite the Black community as well as educate allies on how they can put allyship into action.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">The celebration at the Mercer Museum is thoughtfully created to weave in the principles of Kwanzaa. In the great room, Dr. Wanda Lewis Cambell, a retired University Dean and Professor and current School Board member teaches the history and significance of the holiday. Her dynamic presentation is designed to be interactive with participants, specifically with children of all ages.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">The first floor of the museum will be filled with African music and children’s activities. Last year Kevin E. Leven of Bucks County Anti Racism Coalition created a beautiful Kwanzaa Kinara made from plastic and metal mediums. This year the organizers hope to see that return. As celebrants move into the museum, they can see Ujaama, or cooperative economics, on display with a marketplace of local vendors. Crafted products for sale include art, accessories, facial products, kitchen tools, and more.</span></p>\n<p class=\"p4\"><span class=\"s2\">PairUp Society looks forward to having the community of Bucks County join them in celebrating and learning about the holiday of Kwanzaa. I wish the community a Joyous Kwanzaa.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/127eefd3-f2d7-4331-b061-f45afc45f3e3.jpg"
}