{
  "id": 11431,
  "title": "Thompson Partners with Pine2Pink",
  "slug": "thompson-partners-with-pine2pink",
  "date": "2021-09-28T22:09:12",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "breast cancer awareness month. thompson auto",
    "doylestown cardinal",
    "pine2pink"
  ],
  "excerpt": "<p>October is Breast Cancer Awareness month, and to show support, Thompson is once again partnering with Pine2Pink: a Doylestown-based, non-profit organization helping breast cancer patients in our community. This year, Thompson will donate $25 for every new or pre-owned vehicle sold during October. To add to the excitement, throughout the month of October, all of [&hellip;]</p>\n",
  "content": "<p class=\"p1\">October is Breast Cancer Awareness month, and to show support, Thompson is once again partnering with Pine2Pink: a Doylestown-based, non-profit organization helping breast cancer patients in our community. This year, Thompson will donate $25 for every new or pre-owned vehicle sold during October.</p>\n<p class=\"p1\">To add to the excitement, throughout the month of October, all of Thompson’s dealerships will be bathed in bright pink lights. At Thompson Toyota, all are invited to sign the pink panels located outside the front entrance of the dealership. These panels will serve as a “hero wall”, a visual celebration of survivors, encouragement for those in recovery, as well as to memorialize loved ones lost.</p>\n<p class=\"p1\">To help Thompson reach their goal of selling 500 vehicles, visit any of Thompson’s Doylestown locations, including Thompson Toyota, Thompson BMW, or Thompson Lexus Doylestown, or Thompson’s Willow Grove location, Thompson Lexus Willow Grove. For more information, <span class=\"s1\">visit </span><a href=\"https://www.1800thompson.com\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.1800thompson.com</a><span class=\"s1\">.</span></p>\n<p class=\"p1\">Pine2Pink is a charitable, 501(c)(3) non-profit Foundation. It was established in 2018. P2P&#8217;s core mission is to raise money from local communities that will benefit local breast cancer patients in treatment and recovery. For more information, and to learn about the origin of Pine2Pink visit the Foundation’s website at: <a href=\"http://www.pine2pink.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.pine2pink.org</a> You can also visit Pine2Pink on Facebook and Instagram: @Pine2Pink</p>\n<p class=\"p1\"><strong>About The Thompson Organization:</strong></p>\n<p class=\"p1\">In business since 1969, The family-owned Thompson Organization includes Thompson Toyota, Lexus, and BMW, all located at Routes 313 and 611 in Doylestown. The organization also includes Thompson Lexus Willow Grove, located right off Route 611 and the PA Turnpike, as well as the Thompson Detail Center on North Broad Street in Doylestown and the Thompson Collision Center on Route 611 in Plumsteadville. For more about the Thompson automotive dealerships, visit <a href=\"http://1800thompson.com\" target=\"_blank\" rel=\"noopener noreferrer\">1800thompson.com</a> or on Facebook @thompsonorganization</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/09/pine2pink.jpeg"
}