{
  "id": 14828,
  "title": "What’s New In Town: Dumpling Mama",
  "slug": "whats-new-in-town-dumpling-mama",
  "date": "2022-09-12T23:18:32",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "dumpling mama",
    "julie jules",
    "Meaghan Dunn"
  ],
  "excerpt": "<p>By Julie Jules • Jules from @FortheLoveofDoylestown Imagine being homeless on the streets of South Korea at four years old and running around with a gang of other homeless children, trying to survive. That’s what Meaghan’s childhood was like until people from an orphanage helped her get adopted. A year later, she was living with [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Julie Jules</strong> • Jules from @FortheLoveofDoylestown</p>\n<p class=\"p3\"><span class=\"s2\">Imagine being homeless on the streets of South Korea at four years old and running around with a gang of other homeless children, trying to survive. That’s what Meaghan’s childhood was like until people from an orphanage helped her get adopted. A year later, she was living with her new family, the Dunns, in the small town of, you guessed it, Doylestown. Quite a start! And trust me, Meaghan is not nearly done wowing us.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">I walked in to interview Meaghan at the old Nellie Rae’s (8826 Easton Road) in Ottsville and instantly felt at ease. The space felt welcoming and full of unique artwork by the building’s owner, Kenoka Wagner.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Welcome to Dumpling Mama Kitchen and Market.</span></p>\n<p class=\"p4\"><span class=\"s2\">As a little girl, Meaghan learned to cook from her Ukrainian great-grandmother, Bubby. Unknowingly, this act of love would shape Meaghan’s future.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">They say having a child will change your life. When Meaghan had Nari, things really changed. Nari had extreme food allergies, sometimes so severe that they caused her to be unable to breathe. An EpiPen was an essential survival tool as the list of foods she was allergic to increased over time. Meaghan knows how terrifying food allergies can be. Going out to eat isn’t at all fun when you’re terrified an unmentioned ingredient could send you or your sweet child to the hospital or even worse.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">This is why Dunn started cooking her own foods, specifically gluten-free dumplings. First, they were just for Nari, and then as time went on, for others. While she is still a professor of Animation at the University of the Arts, Ms. Dunn left her successful job as an animator in the corporate world in January of 2022. She then started her own business, Dumpling Mama.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Meaghan can modify her food to fit nearly anyone’s dietary needs. If a family of four walked into Dumpling Mama Kitchen and Market and each member had a different allergy/diet, Ms. Dunn would ensure they were deliciously and safely fed.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Meaghan’s goal for the store is that it’s a one-stop shop for gluten-free products such as frozen dumplings, quiches, pot pies, pastries, pop tarts, pasta, croissants, bagels, baguettes, and even candy. Local honey from Ottsville and farm-fresh eggs will also be available. Her long-term goals include opening more locations and selling frozen dumplings in stores nationally.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Dunn also plans to host live music, concerts, and evening events. The restaurant will be a BYOB. Seed is currently being planted so that the lawn can accommodate more guests and music lovers.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">But wait, there’s more! If you enjoy art, the second floor is a must-see. Talented local artists display their work in this beautiful little gallery. Some artists include Eric Fausnacht, Rachel Isaac, Kenoka Wagner, and Gail Troutman.</span></p>\n<p class=\"p4\"><span class=\"s2\">As if I wasn’t wowed enough, Ms. Dunn mentioned that she would be featured on an upcoming reality show on the Magnolia network (Discovery +), where she and her daughter will undergo a renovation of their apartment.</span></p>\n<p class=\"p4\"><span class=\"s2\">Meaghan Dunn seems to conjure up magic in almost an effortless way. I think she will become quite a shining star in our Bucks County community! She will be opening Dumpling Mama Kitchen and Market sometime this month.<span class=\"Apple-converted-space\">  </span>Follow her on social media at @dumplingmamakitchenandmarket or check out her website (<a href=\"http://dumplingmama.com\" target=\"_blank\" rel=\"noopener noreferrer\">dumplingmama.com</a>) to make your first order today. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><i>Julie lives in Doylestown with her husband, son and two rescue dogs.<span class=\"Apple-converted-space\">  </span>In her spare time, she enjoys performing with her improv troupe The Department of Lost Socks, singing for the Bucks County Choral Society and acting in local shows.<span class=\"Apple-converted-space\"> </span></i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/09/Dumpling-Mama.jpg"
}