{
  "id": 19143,
  "title": "What The Locals Do: St. Patrick’s Day",
  "slug": "what-the-locals-do-st-patricks-day",
  "date": "2024-03-11T18:12:15",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Play",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "St. Patrick’s Day"
  ],
  "excerpt": "<p>By Meghan Budden  •  The Cardinal Contributing Writer Irish Wannabe Although I am of English and Scottish descent, I like to think that I am secretly part Irish due to my love of all things St. Patrick’s Day. I moved to the burbs of Bucks County from Hoboken, NJ which is famously known for its [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Meghan Budden<span class=\"Apple-converted-space\">  •  </span></strong></em>The Cardinal Contributing Writer</p>\n<p class=\"p1\"><strong>Irish Wannabe</strong></p>\n<p class=\"p3\"><span class=\"s1\">Although I am of English and Scottish descent, I like to think that I am secretly part Irish due to my love of all things St. Patrick’s Day. I moved to the burbs of Bucks County from Hoboken, NJ which is famously known for its round-the-clock St. Patrick’s Day celebrations. I was pretty sure my days of over-the-top Irish fun were through but as the luck of the Irish would have it, the fun was just beginning.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">For starters, we did decide to move to Doylestown which was named after Irish immigrant William Doyle who opened a public house in 1745 known as “Doyle’s Tavern.” Now home to many other taverns, bars, and restaurants, Doylestown is a perfect place for pub crawling, dining, and plenty of other Irish shenanigan’ing. Then there’s the Green Parrot in Newtown which throws a 10-day Irish Festival packed with Irish bands, dancers, and food (Mar 10-17). Or take a gander over to Shadybrook Farms in Yardley for its three-day Irish UnWINEd Irish Festival with locally crafted brews, wines, live music, and even a playground for the kids (Mar 15-17). Neighboring towns such as New Hope, Ambler, and Dublin all have their fair share of pub crawls, specials, and music for one of my favorite days of the year—making my Irish-wannabe heart oh-so-very-happy.</span></p>\n<p class=\"p5\"><strong>Erin Go Sellersville<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p4\"><span class=\"s1\">If you’re looking for a little history, live music, and an Irish dinner complete with beer and wine tastings, look no further than Sellersville, PA. I discovered the Sellersville Theatre when one of my favorite Indie artists came to play and my husband and I made a night of it with dinner beforehand at the historic Washington House. We enjoyed a delicious meal, great wines, and loved the ambiance.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">We wandered next door to the quaint, historic theatre and sat in our practically front-row seats for an incredible show. Since then I have become obsessed with checking the upcoming events and acts (afternoon magic shows for the kids, too!) On Friday, March 1, enjoy a Celtic Brew Pairing, complete with English, Irish, and Scottish beers alongside St. Patrick’s Day menu specials at the Washington House. Afterwards, pop into the Sellersville Theatre to catch a Fleetwood Mac cover band or come back on Sunday, March 3, to discover Celtic supergroup, Dahim with Seasons—known for its Irish ballads, bagpipe and fiddle renditions.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><i>Washington House<span class=\"Apple-converted-space\">  </span>and Sellersville Theatre • 136 N Main St., Sellersville, PA</i></p>\n<p class=\"p5\"><strong>Lions and Tigers and Whiskey—Oh My!<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p6\"><i>Philadelphia Zoo Whiskey Walk • Saturday, March 2, 11 am-6 pm</i></p>\n<p class=\"p6\"><i>Philadelphia Zoo, 3400 W Girard Ave, Philadelphia, PA</i></p>\n<p class=\"p4\"><span class=\"s1\">After a month filled with snow, there’s nothing that I look forward to more than getting outside on a gorgeous Spring Day, driving into the city with my family, and walking around one of the best zoos in America. What could make that better? Sipping whiskey, of course! To kick off St. Patrick’s Day, the Philadelphia Zoo is hosting its 11th annual Whiskey Walk.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">A ticket gains you entrance into the zoo with eight fun stops throughout where you can sip and enjoy different kinds of Irish whiskeys. You’ll also gain admission to Thomas Dambo’s TROLLS: Save the Humans exhibit, which features six enormous trolls created from repurposed wood by one of the world’s leading recycling artists. Animal, troll, and whiskey lovers welcome!</span></p>\n<p class=\"p5\"><strong>Shake Your Shamrock</strong></p>\n<p class=\"p4\"><span class=\"s1\">I don’t know about you but if I’m going to exercise, I want it to be fun. This is why I always love a Scoogie Event—themed races for a great cause with high-energy music, tons of people, and of course, ridiculous costumes. And on March 17, Scoogie will be throwing its 11th annual Shake Your Shamrock Fun Run/Walk in idyllic Peddler’s Village. This Irish-clad event has a race for leprechauns big and small, from an 8K, 5K, 2-mile run/walk, all the way to down to a 1/3-mile Kid’s Run. And in typical Irish fashion, the race is just the beginning—Scoogie will be hosting a St. Paddy’s Day after-party in the heart of Peddler’s complete with hot cocoa, an official Scoogie medal for all, and prizes for best dressed.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><i>11th Annual Shake Your Shamrock Fun Run/Walk and After Party on March 17</i></p>\n<p class=\"p6\"><i>Peddler’s Village, Lahaska, PA</i></p>\n<p class=\"p5\"><strong>Bring On Ye Green Bagels!</strong></p>\n<p class=\"p6\"><i>Borough Bagels • 132 Veterans Lane, Doylestown, PA<span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p4\"><span class=\"s2\">One of my family’s favorite spots is Borough Bagels in Doylestown. The shop not only has an assortment of the most delicious, freshly made bagels every day but also my kids’ absolute favorite—the rainbow bagel! From March 6 to March 17, pop into Borough Bagels and your Irish eyes (and belly) will be smiling at some of the yummiest, greenest bagels in town.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Don’t forget to top ‘ye ole bagel with one of the amazing, homemade cream cheeses—like scallion, olive, jalapeño cheddar, strawberry, walnut raisin, apple cinnamon, or of course your standard plain and veggie. Borough Bagels is also one of the few bagel shops in the area that serves LaColombe coffee on tap, so be sure to have them pour you a hot one to make your St. Paddy’s Day breakfast a true top of the morning.</span></p>\n<p class=\"p9\"><i>Meghan Budden is a Creative Director, writer, and mom who is of English and Scottish descent but likes to think she is part Irish based on her love of all things St. Paddy’s Day. She lives in Doylestown with her family and enjoys discovering hidden gems in and around Bucks County as she continues her quest to find that pot of gold at the end of the rainbow—especially in March. <span class=\"Apple-converted-space\"> </span></i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/03/image2.jpg"
}