{
  "id": 12225,
  "title": "What’s New in Town?",
  "slug": "whats-new-in-town",
  "date": "2022-02-07T14:26:59",
  "author": "Staff",
  "category": [
    "Fit",
    "Style",
    "Taste"
  ],
  "tags": [
    "Danielle Gannon",
    "doylestown cardinal",
    "Emily Cradic",
    "Market Way Alley"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer Have you strolled down Market Way Alley, the little strip off of State Street with the string lights? Perhaps you have stumbled upon the sweet little shop next to Classic Games Revisited, a door down from The Salt Cave and across from Rakki Raman? Well, when you [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Danielle Gannon</strong> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">H</span><span class=\"s3\">ave you strolled down Market Way Alley, the little strip off of State Street with the string lights? Perhaps you have stumbled upon the sweet little shop next to Classic Games Revisited, a door down from The Salt Cave and across from Rakki Raman? Well, when you do, you will be met with delight when you peek into Doylestown’s newest, sweetest little flower shop, “Greer’s Garden”.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Owned and operated by Doylestown native Emily Cradic, this magical place has quite a story. Greer’s Garden began as a blog initiated by Emily to support families going through loss during pregnancy or infancy. Emily started the blog after going through her own loss of daughter Greer at 20 weeks in utero. She took the pain and grief and turned it into something beautiful by hosting a support system for families to connect. This gave her and her followers the peace and connectivity they were so desperately in need of.</span></p>\n<p class=\"p5\"><span class=\"s3\">Emily has always loved flowers. She has always felt the love and beauty surrounding her, and these live plants were a beautiful reminder of it. During the pandemic., Emily decided to take up a course on floral design. She committed to six months of training and became certified. She had a hobby of making arrangements for friends and family for baby showers, parties, and events in the past, and this just felt like the next step.</span></p>\n<p class=\"p5\"><span class=\"s4\">Emily was always inspired by her grandmother Elsie, who was second mother to her growing up. Elsie was always there for Emily, getting her off to dance class as a young girl, and was just a “cool and inspiring” woman. She, too, also loved flowers and always had them around. Emily attributes her grandmother to her early inspiration in floral design.</span></p>\n<p class=\"p5\"><span class=\"s3\">Emily, a former K-1 school teacher, has done many things in life… however, when given the certification for floral design and her drive to create community locally… Emily decided to open a shop in her hometown and throw all of her love and creative energy into it.</span></p>\n<p class=\"p5\"><span class=\"s3\">“It was a little sooner than I had anticipated, but I took a leap, and I am so glad I did!”<span class=\"Apple-converted-space\">  </span>November 20, 2021, Greer’s Garden became so much more than an online community. It became a local retail establishment with breathtaking floral arrangements and thoughtfully appointed gifts.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Emily’s style is very hip, unique, young, and fresh. Her floral creations are whimsical, eclectic, and intentional. She does not follow floral “recipes” or use foam. Each bouquet &amp; arrangement is one of a kind. She pours intention into every piece, and it shows!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The big difference you feel when walking into Greer’s Garden is a sense of calm and community. Community is the center of her business, and she will only grow well because of it. When asked what community meant to her, Cradic stated, “community to me means support. Coming together, aligned goals, open &amp; friendly conversation, a hub.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">This shop is open Tuesday &#8211; Saturday, hours posted on her website at www.shopgreersgarden.com. You can follow her IG @greers_garden for daily updated photos of her work.</span></p>\n<p class=\"p5\"><span class=\"s3\">The future for Emily looks bright. She is a wife to Josh, a mother to three beautiful girls: Stella, Greer &amp; Tatum, a thoughtful entrepreneur, and a blessing to Doylestown.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Have you ever wanted to design your own flower arrangements or have your kids take some hands-on workshops? Stay tuned… Emily has much more up her sleeve.</span></p>\n<p class=\"p6\"><i>Danielle Gannon is a local Bucks County entrepreneur. Mom to three, she is an English teacher at RedBarn Homeschool (a local co-op she co-founded), co-owner of Organnons Natural Market and Founder &amp; Managing Director of Local Spotlight with Danielle. Her passion is connecting people and creating community. She graduated with a degree in Journalism from Penn State University, went into real estate and sales, then business ownership. Residing in Ivyland, writing has always been a passion of hers, and this opportunity with The Cardinal has allowed her life to truly come full circle. Find her on IG @localspotlightwithdanielle</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/02/Emily-Cradic.jpg"
}