{
  "id": 17438,
  "title": "What is it Like to Live with Autism?",
  "slug": "what-is-it-like-to-live-with-autism",
  "date": "2023-04-16T14:20:55",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "autism awareness month",
    "doylestown cardinal"
  ],
  "excerpt": "<p>I n honor of Autism Awareness Month, we got a first-person perspective from two Central Bucks students, currently enrolled in the Connections Program. We’re grateful to Max and Lucas for sharing their experience of living with autism.  Max Austin  A little bit of my background is that I have a twin sister. We were born [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><i>I</i></p>\n<p class=\"p2\"><i>n honor of Autism Awareness Month, we got a first-person perspective from two Central Bucks students, currently enrolled in the Connections Program. We’re grateful to Max and Lucas for sharing their experience of living with autism.<span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p4\"><strong>Max Austin<span class=\"Apple-converted-space\"> </span></strong></p>\n<figure id=\"attachment_17439\" aria-describedby=\"caption-attachment-17439\" style=\"width: 256px\" class=\"wp-caption alignleft\"><a href=\"https://doylestowncardinal.com/wp-content/uploads/2023/04/6b7bcfdd-8fe5-464a-b1f5-285af99ba375.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-17439\" src=\"https://doylestowncardinal.com/wp-content/uploads/2023/04/6b7bcfdd-8fe5-464a-b1f5-285af99ba375.jpeg\" alt=\"\" width=\"256\" height=\"320\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2023/04/6b7bcfdd-8fe5-464a-b1f5-285af99ba375.jpeg 256w, https://doylestowncardinal.com/wp-content/uploads/2023/04/6b7bcfdd-8fe5-464a-b1f5-285af99ba375-240x300.jpeg 240w\" sizes=\"auto, (max-width: 256px) 100vw, 256px\" /></a><figcaption id=\"caption-attachment-17439\" class=\"wp-caption-text\">Max Austin</figcaption></figure>\n<p class=\"p7\"><span class=\"s1\">A little bit of my background is that I have a twin sister. We were born premature and spent five weeks in the neonatal intensive care unit. I experienced some developmental delays growing up and received occupational and speech therapy when I was younger. When I was about five years old, my parents noticed some differences between my sister and me and had me see a developmental pediatrician.<span class=\"Apple-converted-space\">  </span>I was diagnosed with Non-Verbal Learning Disorder which is a form of Autism.</span></p>\n<p class=\"p7\"><span class=\"s1\">Growing up, I never realized any differences between myself and other kids.<span class=\"Apple-converted-space\">  </span>However, as I got older, it was important for me to “blend in” and not be seen as different. In my experience, I’m told that I might miss social cues and I may need things explained to me more than once. I am grateful for all the help I received in Elementary through High School and as well as being in the Connections program. Ever since I joined Connections, I am grateful for all the friends that I have made.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><span class=\"s3\">Right now, I hold a job at a local grocery store. I’m also studying for my permit, and I am hoping soon I will be able to drive. I’m going to be doing some different job shadowing to learn about different careers. I want to use this time in Connections to figure out what I want my career to be. I also have a goal of living on my own or with a roommate. I am truly grateful to Connections for helping me achieve my goals.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><span class=\"s1\">Here are some of the experiences that Connections has taught me and living with my disability. One of the big experiences I have learned is disclosing my disability at work. At first, I didn’t know if I wanted to because I didn’t know if my coworkers and boss would treat me differently. After talking to my boss and telling him about my disability, he said that he doesn’t treat me differently than my coworkers and he would help me along the way.<span class=\"Apple-converted-space\">  </span>It felt good to disclose my disability and know that no one would treat me differently.<span class=\"Apple-converted-space\">  </span>Another big experience is that we’ve learned about renting an apartment and what you need to have and buy when you move into one. We took a roommate quiz and when I got the results there were some things I could improve on and some good things, too. After taking that quiz, I know<span class=\"Apple-converted-space\">  </span>I still need to learn what responsibilities come along the way of having a roommate.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><span class=\"s4\">Living with my disability has been a challenge but it’s also been a gift. I sometimes wonder if I didn’t have a disability would my life have been the same? My life has taken me in a new direction and I’m glad that I have a disability because of all the support I get and how it’s helping me move on with my life in a new direction. I also like to think of Autism as not a disability but as a different ability.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><strong>Lucas Kuriger</strong></p>\n<figure id=\"attachment_17440\" aria-describedby=\"caption-attachment-17440\" style=\"width: 322px\" class=\"wp-caption alignleft\"><a href=\"https://doylestowncardinal.com/wp-content/uploads/2023/04/IMG_9606.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\" wp-image-17440\" src=\"https://doylestowncardinal.com/wp-content/uploads/2023/04/IMG_9606-768x1024.jpeg\" alt=\"\" width=\"322\" height=\"429\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2023/04/IMG_9606-768x1024.jpeg 768w, https://doylestowncardinal.com/wp-content/uploads/2023/04/IMG_9606-225x300.jpeg 225w, https://doylestowncardinal.com/wp-content/uploads/2023/04/IMG_9606-990x1320.jpeg 990w, https://doylestowncardinal.com/wp-content/uploads/2023/04/IMG_9606-1320x1760.jpeg 1320w, https://doylestowncardinal.com/wp-content/uploads/2023/04/IMG_9606.jpeg 1470w\" sizes=\"auto, (max-width: 322px) 100vw, 322px\" /></a><figcaption id=\"caption-attachment-17440\" class=\"wp-caption-text\">Lucas Kuriger</figcaption></figure>\n<p class=\"p5\"><span class=\"s2\">H</span><span class=\"s1\">ello, Doylestown! My name is Lucas Kuriger, and I live in the Doylestown area. I was in the class of 2020, and I graduated from Central Bucks West. I am currently in a transition program at CB that is for students with disabilities and helps us transition from high school into the real world. I have a desk job as a Logistics coordinator, at a company named Jillamy and I am currently taking a few classes at Bucks County Community College. I am also good at magic, and enjoy running, and walking. I was diagnosed with Autism when I was only twenty-seven months, and my diagnosis was PDD/NOS. Overall, even though having Autism can be challenging, not everything about having it is bad.</span></p>\n<p class=\"p7\"><span class=\"s1\">One thing that I have struggled with as an autistic, and still do, is that I have a hard time understanding what people say if they talk too quickly. This can be really stressful at times, especially if the nature of the situation I’m in is rushed. This can be frustrating for me also because I want to understand what the person is saying, but I cannot. I may have to ask the person to repeat the statement a few times, or to better clarify the statement. Even though this is one thing I struggle with in day-to-day life, I do not let it stop me from doing my best every day.</span></p>\n<p class=\"p7\"><span class=\"s1\">Another thing I always struggled with when I was a young kid and in my early teens was socializing. This included knowing how to make small talk with people I didn’t know, and sometimes people that I did know. I would always freeze up and would often get more stressed out than I needed to be. I sometimes might even only give one-word answers, because I just wouldn’t know how to continue the conversation. However, over the years I did practice this skill a lot, and have become way better with it, with lots of practicing, and help from my parents and teachers.</span></p>\n<p class=\"p7\"><span class=\"s1\">One ability that I have always been proud to have as someone who is Autistic, is to remember things I did on specific calendar dates. I know both personal things I would do on specific dates and big events that almost everyone would know about. For example, I know that on Saturday, July 10, 2021, I saw Marvel’s “Black Widow” in theaters. I also know that the Eagles won Super Bowl LII on Sunday, Feb. 4, 2018. Even though I have a good memory with dates, that doesn’t mean I will remember every little thing that I do or learn in life. I may still forget some things about different subjects.</span></p>\n<p class=\"p7\"><span class=\"s1\">Overall, having Autism definitely does have its ups and downs. With this condition, the main thing to remember is to just take it one day at a time and not let life get the best of you. Just because this is how it is for me, that does not mean it is like that for all other people with Autism. I do not let my disability define who I am as a person. Rather, I let my good actions and hard work define who I am.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/Autism-awareness-month.jpg"
}