{
  "id": 12004,
  "title": "Who’s the Man Behind “Pots and Pans”",
  "slug": "whos-the-man-behind-pots-and-pans",
  "date": "2022-01-11T12:18:26",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Matt Mannino",
    "Villa Capri"
  ],
  "excerpt": "<p>A Closer Look at Owner of Villa Capri and Founder of “The Pots and Pans Show” Matt Mannino  Background I graduated from Temple university and have a passion for music, soccer, and pizza. Villa Capri was founded by my parents Frank and Josephine in 1968 and was originally named Dominick’s.  It’s the oldest pizzeria in [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong><i>A Closer Look at Owner of Villa Capri and Founder of “The Pots and Pans Show” Matt Mannino<span class=\"Apple-converted-space\"> </span></i></strong></p>\n<p class=\"p1\"><strong><span class=\"s1\">Background</span></strong></p>\n<p class=\"p2\"><span class=\"s2\">I graduated from Temple university and have a passion for music, soccer, and pizza. Villa Capri was founded by my parents Frank and Josephine in 1968 and was originally named Dominick’s.<span class=\"Apple-converted-space\">  </span>It’s the oldest pizzeria in town. About 7 years ago, I rebranded Villa Capri as a gastropub/soccer pub/music venue.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong><span class=\"s1\">Music</span></strong></p>\n<p class=\"p2\"><span class=\"s2\">Music has always been a part of my life as it connects me to the present, past, and future.<span class=\"Apple-converted-space\">  </span>It enhances and supports my emotions in a positive light and gives me spiritual, mental, and physical support. This passion grew so strong that it motivated me to start to play the guitar to be a part of the music and not just receive the music. </span></p>\n<p class=\"p1\"><strong><span class=\"s1\">Pots and Pans</span></strong></p>\n<p class=\"p2\"><span class=\"s2\">“Pots and Pans” is an old expression that me and my soccer teammates at Temple used jokingly and quite often. I made a connection to the expression “Pots and Pans” to the art of music and to the art of food because they could be used to make both food and music. Like our logo, imagine a toddler bagging on pots and pans singing. I thought the Pots and Pans Show would be a fun and lighthearted way to promote our music and enhance our brand at Villa while also connecting to our community and musicians.  </span></p>\n<p class=\"p1\"><strong><span class=\"s1\">Promotion</span></strong></p>\n<p class=\"p2\"><span class=\"s2\">The Pots and Pans Show Facebook page is a platform where local musicians and local venues can post their shows.<span class=\"Apple-converted-space\">  </span>With over 1000 members, this is a way to self-promote and get more involved in the music community around town. Now, partnering with the <i>Doylestown Cardinal</i>, we can help the local restaurants and musicians reach a broader audience. If you’re a musician or venue, please post on our Facebook page, or email <a href=\"mailto:villacapripizza@aol.com\">villacapripizza@aol.com</a>.</span></p>\n<p class=\"p1\"><strong><span class=\"s1\">Vision</span></strong></p>\n<p class=\"p2\"><span class=\"s3\">The vision is to continue to keep it fun and light and maybe over time carrying it over to other categories such as sports, religion, and more with the connection of music and food. I foresee it on many platforms such as an app, podcast, magazine but all in good fun to help the community connect through music and food.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/01/Matt-Mannino.jpg"
}