{
  "id": 18610,
  "title": "Window of Opportunity",
  "slug": "window-of-opportunity",
  "date": "2023-12-14T18:23:47",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "Ayala Shimelman",
    "doylestown cardinal",
    "jay garrison",
    "SiriOm Singh"
  ],
  "excerpt": "<p>By Jay Garrison • The Cardinal Contributing Writer On most days in Lambertville you’ll find SiriOm Singh working on his latest project in front of his gallery on North Union Street.  In the high heat of the summer or the frigid temperatures of the winter, you are more likely to find him than not.   [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Jay Garrison</strong></em> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">O</span><span class=\"s3\">n most days in Lambertville you’ll find SiriOm Singh working on his latest project in front of his gallery on North Union Street.<span class=\"Apple-converted-space\">  </span>In the high heat of the summer or the frigid temperatures of the winter, you are more likely to find him than not. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">An abstract impressionist utilizing special layering technique, primarily with a pallet knife, SiriOm has become a part of the fabric of what makes Lambertville special.<span class=\"Apple-converted-space\">  </span>Opening his first gallery 5 years ago on Bridge Street, SiriOm moved to a larger location just a few years later. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Working as an Occupational Therapist working with youth for most of his adult life, SiriOm retired from his passion of helping others to his passion of creating art on canvas. <span class=\"Apple-converted-space\">  </span>But that isn’t the only art he is known for as he is a well respected percussionist in the local music scene.<span class=\"Apple-converted-space\">  </span>Early evening jam sessions can often be seen and enjoyed early evenings inside his gallery. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Cross Pollination, open Thursday through Sunday, is located at 3 N. Union Street in downtown Lambertville.<span class=\"Apple-converted-space\">  </span>In addition to his work, his wife and fiber artist Ayala Shimelman has many of her unique pieces on display as well. <span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/SiriOm-Singh.png"
}