{
  "id": 19048,
  "title": "YWCA of Bucks County Continues to Empower Women in 21st Century",
  "slug": "ywca-of-bucks-county-continues-to-empower-women-in-21st-century",
  "date": "2024-02-27T15:48:35",
  "author": "Staff",
  "category": [
    "Fit",
    "Play"
  ],
  "tags": [
    "doylestown cardinal",
    "sarah peters",
    "YWCA of Bucks County"
  ],
  "excerpt": "<p>By Sarah Peters  • The Cardinal Contributing Writer One of the lesser-known non-profit organizations in our area is the YWCA Bucks County. With over 200 locations throughout the United States serving over 1 million women and communities of color, the organization focuses on eliminating racism, empowering women, and promoting peace, justice, freedom, and dignity for [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Sarah Peters</strong></em>  • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">O</span><span class=\"s1\">ne of the lesser-known non-profit organizations in our area is the YWCA Bucks County. With over 200 locations throughout the United States serving over 1 million women and communities of color, the organization focuses on eliminating racism, empowering women, and promoting peace, justice, freedom, and dignity for all. </span></p>\n<p class=\"p5\"><span class=\"s1\">The first YWCA was founded in 1858 as part of the movement to advance the empowerment of women, race relations, and labor union representation. Today, the executive director, Guillaume Stewart of the Bucks County branch, founded in 1954, is proud of the YWCA’s “rich history related to social justice, including women’s rights and empowerment as well as racial justice.”</span></p>\n<p class=\"p5\"><span class=\"s1\">The YWCA Bucks County offers vital programs and services to support over three thousand vulnerable people in our local community, including individuals who are homeless, those searching for employment, community members with food insecurity, adults building literacy skills, technology assistance for seniors, and much more. There are community centers throughout the county established to help with these diverse goals.</span></p>\n<p class=\"p5\"><span class=\"s1\">“We believe in inclusivity – having all people from all backgrounds as part of the work we do and the people we serve,” Stewart says. The organization has ongoing opportunities for people to help in various areas of interest. There are after-school programs and summer programs for children. Professionals with experience in the workforce might choose to volunteer to help a community member write their resume during a job application process. .</span></p>\n<p class=\"p5\"><span class=\"s3\">The YWCA Bucks County hosts an annual gala called the Salute to Women Who Make a Difference, where the chapter recognizes women leaders in their fields through the community with an attendance of over 300 people. Highlighting the mission to empower women in our community, the YWCA gives out multiple awards to people who make meaningful accomplishments around our area, including the youth “Girl Power Award.” Other events include designer bag bingo and this May the YWCA is hosting the first annual Women’s Wellness RefresHER at Bucks County Community College. </span></p>\n<p class=\"p5\"><span class=\"s1\">Stewart contributes much of the organization’s success to their collaborations with other non-profits around Bucks County as they work to advance social justice, assist with housing services, and promote youth and family services. Working hand in hand with others, like Code Blue Shelters, Hunger Nutrition Coalition of Bucks County, Bucks County Opportunity Council, and others, helps them have an even more impactful reach. In the past year, over two thousand local families have been supported through these efforts. </span></p>\n<p class=\"p5\"><span class=\"s1\">The organization’s board of directors, which is composed of all women, dedicates its time and talents to engage in the numerous projects and initiatives. The women volunteer with after-school activities, help out at the food pantry, and more. </span></p>\n<p class=\"p5\"><span class=\"s1\">The YWCA Bucks County is also involved in legislation for empowering women, including lobbying for increased funding for Head Start, among other programs. This powerhouse of a non-profit is always looking for donations, volunteers, event participants, and members. Visit ywcabucks.org to learn more about how you can get involved. </span></p>\n<p class=\"p7\"><span class=\"s4\"><i>Sarah Peters is a top-producing Realtor, leader of the Sarah Peters Team at Keller Williams Doylestown, and mother of three. She’s passionate about serving others and helping people find themselves right at home in greater Bucks County. For more details, visit <a href=\"http://sarahpetersteam.com\" target=\"_blank\" rel=\"noopener noreferrer\">sarahpetersteam.com</a>, Instagram @sarahpetersteam, or call her at (484) 459-9944.</i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/02/DSC00146.jpg"
}