{
  "id": 19488,
  "title": "4-Year-Old Ballerina Follows Her Passion to the Professional Stage",
  "slug": "4-year-old-ballerina-follows-her-passion-to-the-professional-stage",
  "date": "2024-04-24T22:22:53",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Fit"
  ],
  "tags": [
    "Darby and Bradley Birenbaum",
    "Debra Sparks studio",
    "doylestown cardinal",
    "Georgia “Peach” Birenbaum",
    "Natalya Bucuy"
  ],
  "excerpt": "<p>By Natalya Bucuy • The Cardinal Managing Editor She extends her perfectly straight leg to the side, stretching out her arm, her wrist folding into an elegant curve. She balances on her toes like a seasoned ballerina. It’s hard to believe, based on her tall height and ballet skills, that she is only four years [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Natalya Bucuy</strong></em> • The Cardinal Managing Editor</p>\n<p class=\"p3\"><span class=\"s2\">S</span><span class=\"s1\">he extends her perfectly straight leg to the side, stretching out her arm, her wrist folding into an elegant curve. She balances on her toes like a seasoned ballerina. It’s hard to believe, based on her tall height and ballet skills, that she is only four years old.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Georgia “Peach” never crawled, her parents Darby and Bradley Birenbaum of Doylestown recall. At the age of eight months, she simply stood up, walked, and soon danced. “She’d place these play cups on her feet and walk around like a ballerina in pointe shoes,” Darby remembers. “She has always been very balanced. It’s like she was a ballerina in her previous life. ” At 18 months, the couple took Georgia to her first ballet class. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Since then, Georgia fully dove into her passion for ballet. At age three, Georgia performed in three recitals. Her training schedule takes her to ballet classes at Debra Sparks studio in Newtown, the School of American Ballet in New York City, and Princeton Ballet School. The past holiday season, Georgia made her debut with a professional dance company, Roxey Ballet of New Hope. She performed on stage as the youngest dancer, portraying one of the mice in The Nutcracker.</span></p>\n<p class=\"p5\"><span class=\"s1\">“She really comes out on stage. She comes alive and goes serious,” says Melissa Byrd, Georgia’s ballet teacher at Debra Sparks studio from the start. “She is passionate. It’s amazing to see her growth. She now attends the class with 6-10 year olds, way above her age level. She puts in a lot of work at home and at the studio.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Bradley sports a “My favorite ballerina calls me Dad,” t-shirt during our interview. “You spend your entire life looking for a passion,” he says. “She has it. Why not hold on to it.” Bradley didn’t expect Georgia to find such a narrow specialization at such a young age, but he is happy to support her in her passion. He admires the mental discipline it takes his daughter to grow in the art.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The training schedule across three states keeps Georgia and her parents busy.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">“My wife keeps everyone sane, ” Bradley says. “She goes everywhere, she volunteers behind the scenes, and is a great stage mom.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">“I love seeing her smile,” Darby says as we watch Peach make faces in the mirror while practicing her plies. “The passion and how she lights up on stage bring me joy.” Darby runs Peach’s instagram page, @ballerinapeach, a verified account with over 16K followers. There, she documents Georgia’s journey through ballet. Through social media, Georgia became a well-known figure in the tightly-knit ballet community, gaining fans across the country, Darby says.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Peach’s favorite ballet is Swan Lake, and her music preferences revolve around classical music, primarily, that of Peter Tsachovski (with some sprinkling of Taylor Swift in the mix, of course.) She loves to dress up and do arts and crafts. Her favorite foods are oranges and broccoli, Georgia tells me as she attempts a cartwheel.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">“Why do you like ballet, Georgia?” I ask. Her pink tutu stops mid-run and her hands cuddle on her chest. I can see the answer shining in her eyes as she says, “Because it’s in my heart.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Georgia will join the Roxey Ballet company on stage on April 20 and 21 at 2 p.m. with the Carnival of the Animals performance. For more info, visit <a href=\"http://roxeyballet.org/childrenclassicstories\" target=\"_blank\" rel=\"noopener noreferrer\">roxeyballet.org/childrenclassicstories</a>.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/04/IMG_8086-e1714011755476.jpg"
}