{
  "id": 19215,
  "title": "An Evening with Anthony Green and Baron Tiger &#8211; In a Skate Shop",
  "slug": "an-evening-with-anthony-green-and-baron-tiger-in-a-skate-shop",
  "date": "2024-03-17T20:57:53",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live"
  ],
  "tags": [
    "anthony green",
    "baron tiger",
    "doylestown cardinal",
    "paul boger"
  ],
  "excerpt": "<p>By Paul Boger • Special to The Cardinal The transcendent nature of live music, in part, derives from the unique ability of a performer to return listeners to memories of a shared past while allowing them to create new ones in the same moment.  This spirit was alive and well one Saturday night in Doylestown. [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Paul Boger • </b>Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">T</span><span class=\"s1\">he transcendent nature of live music, in part, derives from the unique ability of a performer to return listeners to memories of a shared past while allowing them to create new ones in the same moment.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">This spirit was alive and well one Saturday night in Doylestown. Hidden away in a skate shop, an intimate stage, and a wall-to-wall crowd welcomed an all-local lineup showcasing Anthony Green and Baron Tiger for a special evening of acoustic performances.</span></p>\n<p class=\"p5\"><span class=\"s1\">The line outside rolled smoothly through the doors of Nomad Supply Company with excitement and quickly gathered around a tiny and welcoming stage custom-built for the occasion. With just enough room for three musicians to perform, fans had a rare opportunity to experience a shared intimacy, regardless of where they stood in the crowd.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The room, typically utilized for retail activity, easily adapted to accommodate over 50 local fans, friends, and family of the performers. Nomad’s well-curated space, featuring a prominent flag reading “Give a Damn,” neatly added to the experience. Friends and neighbors spotted one another in the crowd, reminding everyone in attendance that they were being treated to a special hometown night.</span></p>\n<p class=\"p5\"><span class=\"s1\">Baron Tiger took the stage as the crowd finished filtering in, featuring the talented duo Larissa Hopwood on guitar and vocals and Melissa Del Rinker on cello and vocals. The pair delivered nothing less than their promise of “dreamy cello-drenched, harmony-laden music”. Their unique sound was perfectly in sync with the mood and warmth of the space, and it was clear the audience could feel it as they swayed, sang, and &#8211; at times &#8211; cried with the duo. Baron Tiger led us gently through a delicate, and at times heartbreaking, set of original songs. By the time their set concluded the cello had certainly won a new group of admirers among the all-ages crowd.</span></p>\n<p class=\"p5\"><span class=\"s1\">As Anthony Green took the stage, he welcomed Baron Tiger back to join him. Anthony’s vocals and guitar melded with Baron Tiger to create something audiences have never heard, anywhere, other than last night &#8211; in their shared hometown.</span></p>\n<p class=\"p5\"><span class=\"s1\">Between songs, the trio told stories of writing and bouncing ideas off one another in a shared living space years ago. Local student and musician Rowan Hopwood also made a surprise appearance for two songs with Anthony, adding yet another delightful layer with their remarkably talented performance.</span></p>\n<p class=\"p5\"><span class=\"s1\">Anthony continued his set, treating fans to a handful of unexpected covers and familiar favorites including Vera Lynn, I Don’t Want To Die Tonight, East Coast Winters, You’ll Be Fine, and Frozen Creek. Scaled to meet the room, while still showcasing every inch of his diverse range, Anthony brought an incredible presence to the stage. Engaged with the crowd, deeply invested in his songs, and repeatedly grateful for the opportunity to perform in such a comforting setting; he brought all the energy he has become known for to Doylestown’s smallest venue. He closed his performance with two more songs alongside Baron Tiger and a final hard-hitting rendition of When You Sang to Me.</span></p>\n<p class=\"p5\"><span class=\"s1\">Music is nourishment for the soul. The discovery and celebration of local-made music is a treasure like no other. In Doylestown, owner Chris Blackway of Nomad Supply Company is creating yet another outlet for it to thrive and be appreciated by a passionate audience. This is community building at its finest.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/03/Anthony-Green.jpg"
}