{
  "id": 20469,
  "title": "BC Cares Showcases Young Talents at Pumpkinfest ",
  "slug": "bc-cares-pumpkinfest",
  "date": "2024-10-27T13:53:41",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Play"
  ],
  "tags": [],
  "excerpt": "<p>By Natalya Bucuy &#8211; Cardinal Managing Editor Go big or go home, the saying goes, and at Pumpkinfest, no one goes home. The annual tradition continues at Tile Works on Oct. 26 and 27. The fall festival features unique oversized pumpkin art, showcases young people’s music and art talent, and serves as a major fundraiser [&hellip;]</p>\n",
  "content": "<p><b>By Natalya Bucuy &#8211; Cardinal Managing Editor</b></p>\n<p><span style=\"font-weight: 400;\">Go big or go home, the saying goes, and at Pumpkinfest, no one goes home. The annual tradition continues at Tile Works on Oct. 26 and 27. The fall festival features unique oversized pumpkin art, showcases young people’s music and art talent, and serves as a major fundraiser for its host, the non-profit, <a href=\"https://bc-cares.org/\" target=\"_blank\" rel=\"noopener noreferrer\">BC Cares Educational Foundation</a>. </span></p>\n<p><span style=\"font-weight: 400;\">On Saturday, from 1 p.m. to 8 p.m., carvers from eastern Pennsylvania and New Jersey demonstrate their skills by carving jack-o-lantern masterpieces out of prize-winning pumpkins. The large variety of the guard, grown locally at Eastburn Farm in Newtown, provides plenty of canvas to the artists.  </span></p>\n<p><span style=\"font-weight: 400;\">Youth music groups from all over Bucks County provide the soundtrack for the day with live performances all day long. While guests watch the pumpkin carvers at work, art vendors &#8211; all youths, college-age or younger &#8211; provide plenty of entertainment options including face painting, balloon twisting, and arts and crafts. TileWorks offers tours, trinkets, and spooky surprises, while food and drinks from local eateries complete the picture. The festivities continue on Sunday, from 4 p.m. to 8 p.m., with the finished pumpkin art on display. Attendees can vote for their favorite pumpkin, with prizes announced at the end of the day. </span></p>\n<p><span style=\"font-weight: 400;\">Seeing people having a good time is the highlight of the event for Ashley Crowell.  “I love watching people’s faces,” she says. “The musicians are proud of themselves. The artists are delighted to sell their art. People are snacking on their food and drinks. It’s the kind of thing that we should be doing with our communities.”</span></p>\n<p><span style=\"font-weight: 400;\">Crowell serves as the Executive Director of BC Cares Educational Foundation, formerly known as CB Cares and the organizer of the annual Pumpkinfest. Working closely with Tile Works, local vendors, student and community organizations, and school boards, she organizes the festival to raise money for the Foundation’s multitude of programs. </span></p>\n<p><span style=\"font-weight: 400;\">CB Cares Foundation started its mission to support the Central Bucks youth community in 1996 and eventually directed its reach to the rest of Bucks County, reemerging as BC Cares. Since then, it has empowered the county’s students through various initiatives and developmental programs, while promoting educational success and community involvement. </span></p>\n<p><span style=\"font-weight: 400;\">The organization’s Boomerang Awards offer scholarships and networking tools. This spring, it recognized five students with $1000 scholarships for educational and vocational purposes. Other initiatives include the Youth Council, where high school and college students serve on a board of directors, and free afterschool programs for students whose districts do not have such offerings. The Foundation also gives grants to Central Bucks School District clubs. The annual fundraising at Pumpkinfest supports all these initiatives, with more in the plans to help students across the county. </span></p>\n<p><span style=\"font-weight: 400;\">General Admission: $15, Family Pass (up to five people), $25, kids 4-12, seniors, veterans, and active duty service persons, first responders, nurses, and teachers with ID, $5. For more information, visit bc-cares.org/pumpkinfest. </span></p>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/10/Cardinal-Cover-October-2024.jpg"
}