{
  "id": 19446,
  "title": "BC Cares Recognizes Local Youth",
  "slug": "bc-cares-recognizes-local-youth",
  "date": "2024-04-22T05:38:07",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "bc cares",
    "Danielle Gannon",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer Have you heard of BC Cares? This special organization formerly known as CB Cares, started in 1996, by forming a “teen task force.” That initiative set out to create action plans and committees to make an impact on our local community which then led to raising the [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Danielle Gannon • </strong></em>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">H</span><span class=\"s3\">ave you heard of BC Cares? This special organization formerly known as CB Cares, started in 1996, by forming a “teen task force.” That initiative set out to create action plans and committees to make an impact on our local community which then led to raising the funds to build the teen center at the local YMCA.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Since then, the organization has awarded more than $25,000 in scholarships, and $100,000 in grants directly impacting the 12 schools and 38,000 families in the Central Bucks School District. I had the pleasure of meeting Ashley Crowell, the Executive Director this month. She explained all the wonderful things this organization is doing.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong><span class=\"s4\">Boomerang Award</span></strong></p>\n<p class=\"p5\"><span class=\"s3\">The Boomerang Award is a youth recognition program that has honored thousands of students through the years. BC Cares is looking for nominations. Nominate a student K-12 that exemplifies positive values, commitment to learning, stewardship of school and community, and high integrity. Imagine how it would make a child’s day, to be featured and awarded for doing good things.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">This award is truly to shine the light on the youth in our area, recognize them for their amazing attributes, and inspire others to do the same. All nominees then have the opportunity to be chosen for a college or trade school scholarship.</span></p>\n<p class=\"p5\"><span class=\"s3\">Nominations close at midnight on April 30th, 2024. The Award ceremony will be on May 29th, 2024 at the Bucks County Seat, Doylestown Borough Hall. To nominate, visit <a href=\"http://forms.gle/1XYpfdJKMn2bmVrdA\" target=\"_blank\" rel=\"noopener noreferrer\">forms.gle/1XYpfdJKMn2bmVrdA</a>.<span class=\"Apple-converted-space\">  </span></span></p>\n<p class=\"p6\"><strong><span class=\"s4\">Pumpkin Fest<span class=\"Apple-converted-space\"> </span></span></strong></p>\n<p class=\"p5\"><span class=\"s3\">BC Cares hosts a Pumpkin Fest in October at Tileworks. It is an awesome community event with music, art, and vendors that ties the area together for a beautiful fall season.</span></p>\n<p class=\"p5\"><span class=\"s3\">“It has been an exciting adventure to learn about the culture of Bucks County through the lenses of the folks I work with and meet,” Ashley states. “BC Cares has a history of positive impact in the community and I am excited to see what lies ahead.”</span></p>\n<p class=\"p5\"><span class=\"s3\">Visit <a href=\"http://bc-cares.org\" target=\"_blank\" rel=\"noopener noreferrer\">bc-cares.org</a> for more details</span></p>\n<p class=\"p8\"><i>Danielle Gannon is a local Bucks County entrepreneur. Mom to three, she is co-owner of Organnons Natural Market and Founder &amp; Managing Director of Local Spotlight with Danielle. Her passion is connecting people and creating community. Residing in Ivyland, writing has always been a passion of hers. Find her on IG @localspotlightwithdanielle</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/04/BCCares2023Honorees.jpg"
}