{
  "id": 14406,
  "title": "Bedminster Traditional Artisan Show  Set for August 27-28",
  "slug": "bedminster-traditional-artisan-show-set-for-august-27-28",
  "date": "2022-08-23T16:19:01",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "Bedminster Traditional Artisan Show",
    "Delaware Valley University",
    "doylestown cardinal"
  ],
  "excerpt": "<p>A small but skillful group of craftspeople dedicated to preserving the artistic skills of early America will show the fruits of their labors Aug. 27-28 at the Bedminster Traditional Artisan Show, slated for Delaware Valley University in Doylestown. More than 30 invited artisans from all over the eastern and mid-western United States are scheduled to attend [&hellip;]</p>\n",
  "content": "<p class=\"p1\">A<span class=\"Apple-converted-space\"> </span>small but skillful group of craftspeople dedicated to preserving the artistic skills of early America will show the fruits of their labors Aug. 27-28 at the Bedminster Traditional Artisan Show, slated for Delaware Valley University in Doylestown.</p>\n<p class=\"p3\">More than 30 invited artisans from all over the eastern and mid-western United States are scheduled to attend the show, exhibiting handcrafted furniture, paintings, textiles, carving, pottery, metal work and other treasures, all created using a traditional sensibility and time-honored techniques.</p>\n<p class=\"p3\">“All the artisans are doing their work primarily by hand,” said Justin Kauffman, president of the three-person committee which is producing the show this year. “I think people will be impressed with the range of work. It’s a small show that allows us to really put on display the art and craft of the best artisans working in their field.”</p>\n<p class=\"p3\">The show dates from a small exhibit staged by Leonard Marschark, a maker of 18th-century-style clocks, and his wife Eve, who created replicas of 19th-century “schoolgirl art” paintings, said Kauffman. The Marscharks invited some fellow craftspeople to show their work at their Bedminster Township home, starting about 17 years ago. After a few successful years, they moved the show to Bucks County Vocational Technical School, then to Delaware Valley University.</p>\n<p class=\"p3\">“They kept the name because that’s how people knew it,” said Kauffman, who is himself a maker of fine colonial-style furniture. Along with Bill Rosier, who manages the show’s online presence, and graphic designer and traditional sign-maker Jackson Foster, he has invited new artists and managed the logistics of what he calls “the only indoor show that focuses primarily on traditional American art and craft.”</p>\n<p class=\"p3\">Traditional crafts – the making of fine functional or decorative objects, such as were made in America from the late 1700s to the early 1800s – maintain a relevance in the contemporary world, said Kauffman. “I think people will always be drawn to period art and craft because it has a timeless design, because they value the historical precedent and they value craftsmanship,” he said. The show will be a treasure-trove for those people wishing to authentically furnish a historic home, he said.</p>\n<p class=\"p3\">Previous show-goers will see some new faces at this year’s edition. Among the new exhibits are:<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p3\">• Handwoven textiles by Susan Withnel</p>\n<p class=\"p3\">• Redware pottery by Erich and Janice Steinhagen of Steinhagen Pottery</p>\n<p class=\"p3\">• Tatted lace by Elaine O’Donel</p>\n<p class=\"p3\">• A variety of folk art by Valerie Skinner</p>\n<p class=\"p3\">• Period handmade candles and soaps by Jenny Slover</p>\n<p class=\"p3\">The craftspeople will be available throughout the show to discuss their work, and a few will also be demonstrating their creative process, said Kauffman. The exhibitors are “a very friendly crowd. Any artist will be eager to explain what they do,” he said. Questions about the materials, process and history of the various crafts are encouraged.</p>\n<p class=\"p3\">Hours for the show, which takes place at the university’s Moumgis Auditorium, are 10-5 on Saturday, and 10-3 on Sunday. Admission is $8, with a discount card available at <a href=\"http://www.traditionalartisanshow.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.traditionalartisanshow.com</a>. Parking is free, the auditorium is handicap-accessible, and no pets are permitted inside the auditorium.</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/08/Bedminster-Artisan-Show-0822-e1661285931488.jpg"
}