{
  "id": 17030,
  "title": "Bridge Acupuncture: East Meets West On West State Street",
  "slug": "bridge-acupuncture-east-meets-west-on-west-state-street",
  "date": "2023-03-06T18:27:38",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "Bridge Acupuncture",
    "doylestown cardinal",
    "Grace Rollins",
    "Richard Sirico"
  ],
  "excerpt": "<p>By Richard Sirico • Special to The Cardinal During the early pandemic, a silent revolution took place on West State Street in Doylestown. A neglected podiatrist’s office changed hands and underwent a dramatic renovation. The old cream-colored stucco gave way to a bold gray and raw wood facade, encompassing a beautiful vaulted waiting room. This [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Richard Sirico</strong> • Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">D</span><span class=\"s1\">uring the early pandemic, a silent revolution took place on West State Street in Doylestown. A neglected podiatrist’s office changed hands and underwent a dramatic renovation. The old cream-colored stucco gave way to a bold gray and raw wood facade, encompassing a beautiful vaulted waiting room. This became the new home of Bridge Acupuncture, which had already been serving Doylestown since 2009. Now, on a main thoroughfare in the medical district, Bridge is ready to take Doylestown’s health to the next level.</span></p>\n<p class=\"p5\"><span class=\"s1\">Bridge Acupuncture’s expansion is emblematic of its inspiring success as a woman-owned small business and medical practice. It also signals the emerging role of complementary therapies like acupuncture in our local health care. Rooted in ancient Chinese philosophy that emphasizes the close relationship between human beings and the natural world, acupuncture is also highly modern in its current practice. Many conventional medical settings incorporate evidence-based acupuncture to help patients manage common conditions like pain, infertility, neurological issues, even anxiety, and addiction.</span></p>\n<p class=\"p5\"><span class=\"s1\">Upon stepping into Bridge’s new office one can observe the merging of these two worlds: it has a uniquely modern yet serene aesthetic, falling somewhere between a Japanese Zen temple and a high-end medical office. In discussion with Grace Rollins, MS, LAc, founder and owner of Bridge Acupuncture, we learned more about her vision for acupuncture’s role in the health of our community:</span></p>\n<p class=\"p6\"><strong>Q: Can you tell us what led your interest in acupuncture?</strong></p>\n<p class=\"p5\"><strong><span class=\"s3\">Grace Rollins:</span></strong><span class=\"s1\"> I first received acupuncture when I was in my early twenties. Right away, I felt improvement in my back, wrist pain I was experiencing, complexion, and overall emotional state. I was overwhelmed that this completely natural medicine could help me feel better than I had in years. The experience opened my eyes to the ability of the body to self-heal when given the right stimulation. The mystery of it was so compelling, I had to learn more. Acupuncture also fits well with my other interests in meditation and the martial arts-these all share important roots and philosophies.</span></p>\n<p class=\"p6\"><strong>Q: What brought you to Doylestown?</strong></p>\n<p class=\"p5\"><strong><span class=\"s3\">GR:</span></strong><span class=\"s1\"> I completed my graduate training in acupuncture, and began my practice in Brooklyn, NY in 2008. Because my location was close to both the Manhattan and Brooklyn bridges, I called my practice “Bridge”. My partner Eric (whom I met through the martial arts community) was already based here in Bucks County. I have grown so much here in Doylestown over the years. Looking at how far I’ve come, it’s really been a dream come true. Having an established practice in such a nurturing community, with a team of incredible practitioners and staff, not to mention an outstanding facility, is amazing.</span></p>\n<p class=\"p6\"><strong>Q: Please discuss acupuncture vs. conventional care-prescription drugs and surgical treatments.</strong></p>\n<p class=\"p5\"><strong><span class=\"s3\">GR:</span></strong><span class=\"s1\"><span class=\"Apple-converted-space\">  </span>feel we need a better balance in our medical care. In the US, we spend far more on health care than any other country, yet our outcomes are worse than dozens of other wealthy nations. We also lag far behind in terms of access to care. Many of our chronic, lifestyle-related illnesses are treated with medication and surgery when there are natural interventions that have been proven to work out at least as well, if not better.</span></p>\n<p class=\"p5\"><span class=\"s1\">Most people feel there are other answers but don’t know where to start. It is truly great for us here to be part of that newfound realization. That’s why I love the metaphor of “Bridge”. As acupuncturists, we get to help so many people gain a sense of control over their health again. When patients feel empowered, all you get are healthy side effects!</span></p>\n<p class=\"p5\"><span class=\"s1\">That being said, we take pride in working side by side with other medical professionals, consulting their expertise when advanced diagnosis and complex care are required. We can, and should, have access to the best of both worlds.</span></p>\n<p class=\"p6\"><strong>Q: What do you feel lies ahead for acupuncture?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p5\"><strong><span class=\"s3\">GR:</span></strong><span class=\"s1\"> Acupuncture is in an amazing phase right now. I’m currently studying for my doctorate where I’m learning about the research being done into acupuncture physiological mechanisms and what we know so far about the most effective treatment strategies. It is an informative practice also used to strengthen communications between acupuncturists and other medical professionals. Much more than when I first began, we receive referrals from family doctors, neurologists, and dermatologists.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">As the Eastern arts become more understood, other medical professionals are becoming interested in our techniques. Physical therapists now use intramuscular acupuncture techniques (aka dry needling.) Massage therapist practice cupping. And even some medical doctors and chiropractors practice acupuncture. I can not stress the importance of proper training for those offering these services. It is good for the public to know that a fully licensed acupuncturist is always your best resource for these treatment methods.</span></p>\n<p class=\"p6\"><strong>Q: What is next for Bridge?</strong></p>\n<p class=\"p5\"><strong><span class=\"s4\">GR:</span></strong><span class=\"s5\"> Paolo Propato, LAc, joined the practice in 2014. He is a compassionate and highly skilled practitioner with growing popularity. We underwent an expansion in 2021 due to overflowing waitlists and moved to our newly renovated location on West State Street. During this time Misook Lee, LAc, joined us full-time. She is a specialist in Korean Facial Rejuvenation using acupuncture and is accomplished in treating pain and women’s health issues.</span></p>\n<p class=\"p5\"><span class=\"s1\">In 2022 we further expanded treatment options with Chinese Herbal Medicine, as well as movement therapies such as posture, core, and mobility training. Our movement coach is Acacia Noel. We kicked this year off with a lecture on nutrition which was a great success, and are in the process of adding a breath coach. It is a truly exciting time of expansion for Bridge.</span></p>\n<p class=\"p5\"><span class=\"s1\">I am dedicated to shaping our practice toward the diverse health challenges of our community. Equally, I take a great personal interest in treating more advanced neurological disorders. Acupuncture can be truly life-changing for those suffering from migraine, concussions, neuropathy, and neurodegenerative disease. Recently I’ve been getting fantastic results with post-COVID and post-chemotherapy loss of taste. It can be so rewarding to help patients fully recover from issues like these.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/03/8374C0EE-5FB6-490F-A723-2E8797F0B480-e1678145238711.jpeg"
}