{
  "id": 17452,
  "title": "Brixxy &#038; Co: Adding Color and Joy to Everyday Life",
  "slug": "brixxy-co-adding-color-and-joy-to-everyday-life",
  "date": "2023-04-16T15:01:27",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "Alissa Abba",
    "Brixxy &amp; Co",
    "doylestown cardinal"
  ],
  "excerpt": "<p>Brixxy &amp; Co. is a black women-owned handmade pet bandana company. “We have a passion for bright, fun, and bold prints,” says owner, Alissa Abba. “We love to mix together various patterns and designs, adding bursts of joy to everyday life. These are not your average pet bandanas, these are bandanas for the cool pups [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><span class=\"s1\">B</span><span class=\"s1\">rixxy &amp; Co. is a black women-owned handmade pet bandana company. “We have a passion for bright, fun, and bold prints,” says owner, Alissa Abba. “We love to mix together various patterns and designs, adding bursts of joy to everyday life. These are not your average pet bandanas, these are bandanas for the cool pups on the block.”</span></em></p>\n<p class=\"p3\"><span class=\"s1\"><b>Tell us about yourself. When did your journey with art begin?</b></span></p>\n<p class=\"p4\"><span class=\"s2\">I’ve always been super creative. Growing up while kids attended sports camps during the summer, I would attend art camps, exploring painting and ceramics. While I loved using those mediums I quickly learned that the passion far outweighed the talent. I always enjoyed sewing, first learning how to use a sewing machine during home economics class in middle school. Fast forward to adulthood, I became an educator who specialized in working with students on the autism spectrum. During the nationwide shutdown during Covid, I found myself with idle time. I dusted off the sewing machine and made my first pet bandana for my own pup Brixxy Bordeaux.</span></p>\n<p class=\"p3\"><span class=\"s1\"><b>Tell us about your art. What is your creative process like?</b></span></p>\n<p class=\"p4\"><span class=\"s2\">I love scouring online and in-store for unique fabrics. Anytime I travel, I visit the local fabric stores to see what they have to offer. This helps create amazing bandanas for my clients, but can also be tricky because I can’t get my hands on some fabrics again. For the most part, our bandanas are truly small batch and unique creations. Once I find the main print, the next step is to match it with a fun and vibrant reverse side. After that, we hit the sewing machine, and viola…a reversible pet bandana is created.</span></p>\n<p class=\"p3\"><span class=\"s1\"><b>Who or what is a big inspiration for you?</b></span></p>\n<p class=\"p4\"><span class=\"s2\">My grandmother is and has always been a big inspiration for me. Always fashionable, always wearing and mixing together the boldest prints. I love her super-fun style. Also, pop culture is a big inspiration for our brand. We love to bring in prints with fun, witty catchphrases that make our clients literally laugh out loud.</span></p>\n<p class=\"p3\"><span class=\"s1\"><b>Where can we find your work?</b></span></p>\n<p class=\"p4\"><span class=\"s3\">Obviously at Makers Off Main as well as Cool Dog Gear in Warrington, Ruh Ro’s, City of Paws, Vault &amp; Vine, and The Corner Stoop in Philly. We also plan to expand to Kimberton Whole Foods in Phoenixville soon.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/image0-1.jpeg"
}