{
  "id": 17379,
  "title": "Bucks Beautiful",
  "slug": "bucks-beautiful",
  "date": "2023-04-15T15:41:50",
  "author": "Staff",
  "category": [
    "Style",
    "Taste"
  ],
  "tags": [
    "bucks beautiful",
    "Byers' Choice",
    "doylestown cardinal",
    "laurie to",
    "sarah peters"
  ],
  "excerpt": "<p>By Sarah Peters • The Cardinal Contributing Writer You might know the founders of Byers Choice, Robert and Joyce Byers, for the collectible carolers, handcrafted in Chalfont. But you might not know that the Byers started Bucks Beautiful after being inspired by the beauty of European gardens and the sense of community that blossomed from [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong><span class=\"s1\">By Sarah Peters • </span></strong><span class=\"s1\">The Cardinal Contributing Writer</span></p>\n<p class=\"p3\"><span class=\"s3\">Y</span><span class=\"s2\">ou might know the founders of Byers Choice, Robert and Joyce Byers, for the collectible carolers, handcrafted in Chalfont. But you might not know that the Byers started Bucks Beautiful after being inspired by the beauty of European gardens and the sense of community that blossomed from them.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">According to Bucks Beautiful’s Communications Director, Laurie To, the Byers felt these gardens “accentuated the communities and they wanted to bring that aesthetic to Bucks County. This was how the concept was conceived.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">The Byers and their friends started this non-profit to bring spectacular gardens to our landscape here in Bucks County. Today, there are four part-time staff members and a talented board of directors who continue the Bucks Beautiful vision.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">The organization takes great pride in making Bucks County an even more beautiful and sustainable place to live and visit, as well as educating the community through various programs.</span></p>\n<p class=\"p6\"><strong>Bulbs for Bucks</strong></p>\n<p class=\"p5\"><span class=\"s4\">While driving around town, you’ve likely seen their daffodil displays. In 2010, the organization began this initiative to plant daffodil bulbs in strategic locations around the County, including over 1.7 million bulbs to date. Bucks Beautiful provides a Daffodil Tour Map on its website so you can see the flowers yourself. These include locations such as Moravian Tile Works, Pine Run, Mercer Museum, Bush Park, the 611 and 202 bypasses, and more.</span></p>\n<p class=\"p6\"><strong>RePlant Bucks</strong></p>\n<p class=\"p5\"><span class=\"s2\">In 2018, the organization began a new initiative to replace trees impacted by storms and invasive species. They’re well on their way to reaching the lofty goal of over 10,000 trees planted. They’ve scouted many locations for this reforestation, including schools, parks, and museums. Several local landscaping companies have generously donated trees to make these plantings possible, including native species such as oaks, tulips, hickories, sycamores, red maples, and chestnuts.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong>Other Projects</strong></p>\n<p class=\"p5\"><span class=\"s2\">Not only does the organization invest in local gardens, but it supports local Bucks County students. Buck Beautiful offers scholarships to college students majoring in horticulture and related studies. They also sponsor lecture series at Delaware Valley University.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong>Save the Date for the Kitchen and Garden Tour</strong></p>\n<p class=\"p5\"><span class=\"s2\">Set aside Saturday, June 11th to visit various homes around greater Doylestown, learning from talented master gardeners. This 28th annual Bucks Beautiful Kitchen and Garden Tour will take place rain or shine. Reach out if you’d like to offer your home for this year’s tour, as Bucks Beautiful always looks for more picturesque properties to feature.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong>How Can We Support Bucks Beautiful’s Efforts?</strong></p>\n<p class=\"p5\"><span class=\"s2\">Laurie To pointed out that “Bucks Beautiful is only funded by private donations, grants we apply for, our membership program, and two annual fundraisers &#8211; which include the Spring Fling Gala in April and the Kitchen and Garden Tour in June.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Become a member of Bucks Beautiful, volunteer with one of their many initiatives, sponsor a gift, or purchase tickets to any of the upcoming events. You can donate daffodil bulbs in memory of a loved one, or in honor of someone special. Visit <a href=\"http://www.bucksbeautiful.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.bucksbeautiful.org</a> to learn more about their offerings and to get involved in beautifying our local landscape.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p8\"><i>Sarah Peters is a top-producing Realtor, leader of the Sarah Peters Team, ALC board member at Keller Williams Doylestown, and mother of three. She’s passionate about serving others and helping people find themselves right at home in greater Bucks County. For more details, visit <a href=\"http://sarahpetersteam.com\" target=\"_blank\" rel=\"noopener noreferrer\">sarahpetersteam.com</a>, Instagram @sarahpetersteam or call her at (484) 459-9944.</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/TileworksDaffodils.jpeg"
}