{
  "id": 16994,
  "title": "Cookier Ali Taylor Shares Her Passion for Cookie Decorating",
  "slug": "cookier-ali-taylor-shares-her-passion-for-cookie-decorating",
  "date": "2023-03-06T17:59:08",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "ali taylor",
    "doylestown cardinal"
  ],
  "excerpt": "<p>Ali Taylor of Keystone Cookie Company is a local cottage food baker. She lives in Buckingham with her husband and three children.  Tell us about yourself. When did your journey with art begin? It sounds silly, but for years I’ve tried to master the art of the decorated sugar cookie. In my opinion, a custom-decorated [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><span class=\"s1\">A</span><span class=\"s1\">li Taylor of Keystone Cookie Company is a local cottage food baker. She lives in Buckingham with her husband and three children.<span class=\"Apple-converted-space\"> </span></span></em></p>\n<p class=\"p4\"><strong>Tell us about yourself. When did your journey with art begin?</strong></p>\n<p class=\"p5\"><span class=\"s2\">It sounds silly, but for years I’ve tried to master the art of the decorated sugar cookie. In my opinion, a custom-decorated sugar cookie is the perfect party favor: practical, clever, and delicious.<span class=\"Apple-converted-space\">  </span>As a DIYer by nature, I thought I can make a decorated sugar cookie, how hard can it be? So, I tried, and I tried and I tried, for years, each time failing a little less but still no shot. Frustrated, I wondered why it was so hard.</span></p>\n<p class=\"p6\"><span class=\"s2\">Then, one early February morning in 2021, I was scrolling through Facebook.<span class=\"Apple-converted-space\">  </span>I came across an ad for tools that aid cookiers. “What?” I thought. “There’s a name for people who decorate cookies and they have specific tools?” Well, that was all it took. I fell deep down the rabbit hole and never looked back. Within weeks, I obsessively learned the importance of royal icing consistency, no-spread sugar cookies, the best type of food coloring, unique decorating tools, and much more.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\">Then, I immersed myself in the business side of cookies: creating an LLC, getting licensed by the State and County, building a website, and pursuing social media marketing. Five months after discovering that Facebook ad, I<span class=\"Apple-converted-space\">  </span>announced to my family that I was starting a cookie business.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><strong>Tell us about your art. What is your creative process like?</strong></p>\n<p class=\"p5\"><span class=\"s2\">With inspirational sites like Etsy and Pinterest, my customers have a good idea of the style of cookies they want before they contact me. Decorating cookies takes patience and a lot of time. The cookies are decorated in stages and depending on the complexity of the design, may take a few days to complete. After about 24 hours of drying, the cookies are ready for packaging and delivery.<span class=\"Apple-converted-space\">  </span>I find the whole process to be very relaxing and rewarding.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><strong>Who or what is a big inspiration for you?</strong></p>\n<p class=\"p5\"><span class=\"s2\">There is a whole world of cookiers out there who inspire me to be better. I’ve joined virtual groups and I’m amazed at people’s kindness and willingness to share. We inspire and encourage each other to do more in terms of improving our skills and marketing our products. In May, I will attend my first Cookie Con where I will spend three days sharing my passion with like-minded cookie friends.</span></p>\n<p class=\"p4\"><strong>How do you like being a local artist in Doylestown?</strong></p>\n<p class=\"p5\"><span class=\"s2\">Being a respected small business in my community means the world to me. I’m grateful to my customers, students, and local business owners like Caitlin, Wendy, and Donna who have been so generous and kind. For me, it’s a dream come true.</span></p>\n<p class=\"p4\"><strong>Where can we find your work?</strong></p>\n<p class=\"p5\"><span class=\"s2\">Find me teaching the most comprehensive cookie decorating classes at Makers Off Main and Allora Gifts &amp; Home. Teaching others the art of cookie decorating brings me a deep sense of joy and accomplishment.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\">In the summer, I sell freshly baked jumbo drop cookies and sugar cookies at the New Britain and Warrington Farmers Markets. Continue following my journey on Instagram, Facebook, and Tik Tok (@keystonecookiecomapny). Inquire about custom orders on my website <a href=\"http://www.keystonecookiecompany.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.keystonecookiecompany.com</a>. <span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/03/Ali-Taylor-of-Keystone-Cookie-Company.jpg"
}