{
  "id": 12452,
  "title": "Coping With Cabin Fever: 5 Things to Do Around Doylestown to Get You Out of the Cooped-Up Rut",
  "slug": "coping-with-cabin-fever-5-things-to-do-around-doylestown-to-get-you-out-of-the-cooped-up-rut",
  "date": "2022-03-01T23:24:52",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Fit",
    "Play",
    "Style",
    "Taste"
  ],
  "tags": [
    "Art Department Studios Doylestown-Paint N’ Pottery",
    "Covered Bridge Park",
    "dana roberts",
    "doylestown airport",
    "doylestown cardinal",
    "S",
    "Sky Zone Trampoline Park",
    "The Square",
    "Wilma Quinlan Nature Preserve"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer March is historically known as the month that roars like a lion and out like a lamb. Personally, I find it to be the month in which I feel like an angry lion roaring all day, every day as I try and cope with the dreary weather [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Dana Roberts • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s1\">M</span><span class=\"s2\">arch is historically known as the month that roars like a lion and out like a lamb. Personally, I find it to be the month in which I feel like an angry lion roaring all day, every day as I try and cope with the dreary weather while eagerly awaiting spring and try to keep my young children occupied and all of us semi-sane.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">After four months of cold temperatures and long, gray days, by March, most of us are tapped out of ideas for things to do to keep our days filled and give in to cabin fever. This year that doesn’t have to be the case. Rather than zoning out to more Netflix until the temperatures warm and the daffodils poke their heads out, read on for some different ideas to beat back your cabin fever and make the most of the month.</span></p>\n<p class=\"p6\"><span style=\"color: #993300;\"><strong>Head to the Doylestown Airport for a Different Perspective<span class=\"Apple-converted-space\"> </span></strong></span></p>\n<p class=\"p5\"><span class=\"s4\">The Doylestown Airport is a little-known gem that offers flying lessons and flight experiences and provides free, wondrous entertainment for kids and adults alike. Watching planes take off and land is a magical, captivating experience for any age. The airport conveniently has picnic tables set up right by the runway for excellent viewing purposes.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Bundle up, pick up something delicious from Crossroads Bake Shop or Altomonte’s (both a few minutes from the airport), and have a picnic while admiring the planes do their thing. If you’re feeling adventurous, the airport also offers Adventure Flights for $150, a one-on-one experience with a flight instructor that provides the participant one hour of flight time in a single-engine, propellor-driven aircraft, plus a pre-flight and post-flight discussion. This is a small price to pay for an experience you’re unlikely to forget.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Seeing Doylestown and the surrounding area from high up in the sky is an excellent way to shake you out of the doldrums and let you admire the beauty of where we live from a whole new perspective.</span></p>\n<p class=\"p7\"><i>Doylestown Airport Leading Edge Aviation</i></p>\n<p class=\"p7\"><i>3879 Old Easton Road in Doylestown<span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p7\"><i>215-340-0707, <a href=\"http://doylestownairport.com\" target=\"_blank\" rel=\"noopener noreferrer\">doylestownairport.com</a></i></p>\n<p class=\"p6\"><span style=\"color: #993300;\"><strong>Take a Hike in a Lesser-Known Spot</strong></span></p>\n<p class=\"p5\"><span class=\"s4\">Even when the weather is fussy, getting outside is one of the best things you can do for your mental and physical health. Even on a March day that is blustery and cold, breathing in the fresh air and being in nature do wonders for the soul. Exploring an outdoor space unfamiliar to you brings in a whole new element of rejuvenation for the mind.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Most everyone in the Doylestown area knows about Peace Valley Park/Lake Galena and Central Park, but have you ever visited the Wilma Quinlan Nature Preserve or the Covered Bridge Park? Both are located in New Britain and served as two reasons our family successfully survived the initial stages of 2020’s pandemic lockdown, providing extraordinary outdoor spaces to roam.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">The Wilma Quinlan Nature Preserve (a stone’s throw from the New Britain train station) is a lush, lovely web of trails and meadows, with a creek running through it. It’s the perfect place to take your children or pet and let them burn some energy while admiring nature’s beauty. Head here on a relatively dry day or wear boots, as the trails are grass.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Covered Bridge Park, off Keeley Avenue, is another wonderful place to explore. There’s a path with a bridge that leads parallel to the historic Covered Bridge, a large playground, and a paved trail that winds through the park to the reservoir at the park’s far end. If you climb to the top of the hill on that path, you’re in for one of the most beautiful views in the county, as you can admire the reservoir before you and fields all around you. You can also bring bikes and ride through the park or take an even lengthier ride if you’d like since the path connects to the Doylestown Bike and Hike Trail.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><i>Wilma Quinlan Nature Preserve<span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p7\"><i>Mathews Avenue in New Britain</i></p>\n<p class=\"p7\"><i>Covered Bridge Park<span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p7\"><i>229 Keeley Avenue in New Britain</i></p>\n<p class=\"p6\"><strong><span style=\"color: #993300;\">Spark Your Creativity and Make Something with Your Hands</span></strong></p>\n<p class=\"p5\"><span class=\"s2\">Another well-recommended way to break free from cabin fever is to tap into your creative side. Paint N’ Pottery, an art studio in the center of town on Oakland Avenue, is the perfect place to get rid of your stresses by sinking your hands into some clay or painting away.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">The studio offers something for everyone: an adult or children’s 4- week Wheel Class, 1-time wheel classes for up to 6 students, clay memberships for open pottery wheel time, art parties and events, and adult BYOB classes. Fused glass, canvas painting, clay sculpting, and mosaics are also available.</span></p>\n<p class=\"p7\"><i>Art Department Studios Doylestown-Paint N’ Pottery, 15 West Oakland Avenue in </i><span class=\"s5\"><i>Doylestown 215-348-9003, <a href=\"http://artdeptstudios.com\" target=\"_blank\" rel=\"noopener noreferrer\">artdeptstudios.com</a></i></span></p>\n<p class=\"p6\"><strong><span style=\"color: #993300;\">Jump It Out</span></strong></p>\n<p class=\"p5\"><span class=\"s2\">When cabin fever has you going bonkers, what better way to express that than by jumping your stresses away? Sky Zone Trampoline Park in Chalfont is the perfect place to take your rammy children and even the edgy adults in your life to “blow the stink off,” as my mom would say.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Buy one-time tickets and jump on the court for your age group (starting from walking to 4 years, running up to 16+ years), or get a membership since you will likely want to head back again and again. SkyZone’s basic membership is $22.99 a month and allots you a 90-minute jump each day.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">SkyZone also has a climbing wall, a Ninja Warrior Course, a Foam Zone, Ultimate Dodgeball, and a Toddler Zone and offers birthday parties and events. On Friday and Saturday nights from 7-10, go and get your GLOW on, like lasers, music, and blacklight transform the whole park into a crazy jumping dance club.</span></p>\n<p class=\"p7\"><span class=\"s6\"><i>Sky Zone Trampoline Park, 145 Liberty Lane in Chalfont 215-642-8777, <a href=\"http://skyzone.com\" target=\"_blank\" rel=\"noopener noreferrer\">skyzone.com</a></i></span></p>\n<p class=\"p6\"><span style=\"color: #993300;\"><strong>Eat Something Yummy and Browse Somewhere New</strong></span></p>\n<p class=\"p5\"><span class=\"s2\">Ten minutes north of Doylestown in Dublin, The Square is the perfect place to go on a gray March day when you are in need of something tasty to eat and somewhere lovely to browse. The Square is an old, restored factory that brings back the “Town Square” mentality with quality food and drink, local makers and retailers, and health and wellness experts. There’s a yoga studio, karate, dance studio, and Curves to get your health on.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Also, there are lovely boutiques to wander through for delightful gifts and treat yo’self gems, delicious food to be eaten at Farm to Toast and the Novel Baker, and drinks to imbibe at the Boiler Room by Crossing Vineyards. On a day when you need a pick-me-up, head here, and you will not be disappointed.</span></p>\n<p class=\"p7\"><i>The Square, 123 North Main Street in Dublin, <a href=\"http://thesquarepa.com\" target=\"_blank\" rel=\"noopener noreferrer\">thesquarepa.com</a></i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/03/Sky-Zone-Trampoline-Park.jpg"
}