{
  "id": 12513,
  "title": "Couples Therapy: The Best Thing You Can Do for Your Relationship",
  "slug": "couples-therapy-the-best-thing-you-can-do-for-your-relationship",
  "date": "2022-03-02T20:56:38",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "couples therapy",
    "dana roberts",
    "doylestown cardinal",
    "Dr. Chad Coren"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer An article on couples therapy? Right after February, the month of love? Before you balk at the thought and breeze past this, let me argue the case for couples therapy by sharing my husband’s and my story.  It was fall of 2017, and we’d been married for [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Dana Roberts • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">An article on couples therapy? Right after February, the month of love? Before you balk at the thought and breeze past this, let me argue the case for couples therapy by sharing my husband’s and my story.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">It was fall of 2017, and we’d been married for one year, tying the knot in September of 2016 after meeting at MOM’s in Doylestown in 2012. Our first year of marriage was not at all the “honeymoon period” that many refer to, unless you count what a honeymoon would be like for two billy goats if they wed and got a thrill from constantly butting heads.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">We had just moved in together after renovating a house in the borough, and we were learning to navigate the challenges of sharing the same space, especially when one member of the couple is very, very Type A and into cleaning and organization (me) and the other is more laidback and uses Windex to clean a toilet (him).<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Coupled with other life issues—a sick parent, confronting an unhealthy relationship with alcohol (me again), and renting our house on AirBNB to generate some extra money—and the very different ways in which we looked at these issues, we were quite the volatile pair. I remember that year as being marked by a LOT of bickering and many fights, often ending with one of us storming out of the room, usually after making a highly dramatic statement (me again, are you surprised?).<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Eventually, I cried “uncle” and told my husband that we needed to go see a counselor or else I feared we’d be heading for divorce court. My husband was a bit taken aback (in his more laidback nature, I don’t think our problems ever seemed as doomsday-ish to him), but agreed.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">And thus, we found ourselves in a lovely office, sharing the intimate details of our relationship and our disagreements with our therapist. There were some tense moments during that first session, but we also had our own personal referee to navigate them with us and to help us unpack why we were the way we were, why we reacted the way we did, and how to better respond to each other.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">We learned a lot about each other and what we each needed in a space that felt safe and open, and where hard conversations became much more manageable. We learned that timing of tough conversations is everything (does anyone else find themselves in the fun habit of bringing up a sore subject at 10:30pm, right before bed? No? Just us?), and we also learned how to de-escalate conversations when they became heated.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">One of the most useful tools we took away from therapy was finding a code word to use to break the stalemates that often arise after bickering. Beforehand, one of us might do something to annoy the other, and we’d retreat into separate corners, being short with each other or snapping at each other for far too long to admit.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Now, when we get into a little tiff that doesn’t warrant a huge discussion but both parties still feel miffed, we take a few minutes separately and then one of us will approach the other using our code word that signals, “I’m sorry, let’s not fight anymore, but let’s also not have a huge recap on why we were fighting; let’s just move on.” We use an animal sound, because there’s definitely humor in approaching your partner and meow-ing to clear the air.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">We wound up only going to see our therapist for 3 or 4 sessions initially but have since gone to therapy about twice a year, when we need a “tune-up” (our larger scale fights seem to occur in a bi-annual fashion, along the lines of your recommended dental cleanings, though probably even less fun). I have and will continue to sing the praises of couples counseling from the rooftops to anyone and everyone.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">However, to provide a better idea of the benefits of couples therapy from someone with an insider’s perspective, I sat down with Dr. Chad Coren, licensed clinical psychologist and founder of Bucks County Psychological, and a practicing therapist in the area. Here’s what he had to share:</span></p>\n<p class=\"p5\"><strong>How did you decide to become a psychologist?</strong></p>\n<p class=\"p4\"><span class=\"s2\">Some psychologists are made and some are born. I’ve been interested in this field since day one and have always found a connection with talking with people and solving problems with them. My education helped provide me with skills to help others achieve their potential.</span></p>\n<p class=\"p5\"><strong>What sparks your interest in couples therapy?</strong></p>\n<p class=\"p4\"><span class=\"s2\">There’s something very dynamic about working with couples. Emphasizing the term “dynamite” because things can get explosive. When you can help two people who have struggled with one another, it’s an incredible experience to see what happens as love can unfold again.</span></p>\n<p class=\"p5\"><strong>When should a couple consider couples therapy?</strong></p>\n<p class=\"p4\"><span class=\"s2\">The best time to reach out is whenever it becomes evident that you can’t resolve a problem on your own. When it’s hard to interact without tempers flaring or when you’re not talking at all, it’s time to reach out for help. That being said, I’ve also had couples come in at any time. I’ve had experience with couples who came to me once they were engaged to make sure they were right for each other.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong>What tips or suggestions do you find yourself giving to almost all couples who come to you for therapy?</strong></p>\n<p class=\"p4\"><span class=\"s2\">I always talk to them about the importance of three main things: knowledge, mutuality, and self-regulation. Knowledge refers to knowing who you are and who your partner is and being able to convey that to each other. Mutuality means recognizing the importance of each person’s needs and working towards optimizing each other’s needs. Self-regulation is the ability to regulate ourselves and soothe ourselves in discussions so that the conversation can be productive.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong>Best suggestion to diffuse a fight for any couple?</strong></p>\n<p class=\"p4\"><span class=\"s2\">An agreed-upon time-out. If things are getting heated, you should call a time-out and come back to the issue once calm. People tend to not calm down and instead heat up and the conversation becomes a vicious downward spiral. A time-out is a disruption in that vicious spiral.</span></p>\n<p class=\"p5\"><strong>What is one question you’d suggest partners in a couple ask each other?</strong></p>\n<p class=\"p4\"><span class=\"s2\">“What is it that you think you need? Because I want to do that for you.” For someone to ask what our needs are, it shows that they care about what’s important to us and what we’re going through and how they can be of help. Do they need to be alone? A cup of Earl Grey? To sleep because they have young children and are sleep-deprived? I myself ask this question about 10 times a day. I want to be the person to help people identify what they need and how they can achieve it.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong>Any parting words on therapy?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p4\"><span class=\"s2\">You don’t have to fear the process. If you’re struggling with a heart problem, you go to a cardiologist. If you have a tooth issue, you go to the dentist. If you have a legal issue, you go to a lawyer. If you have a relationship issue, go to a therapist. If you’re struggling right now, trust that there are experts out there who want to help you overcome your challenges.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><i>Dr. Chad Coren, PsyD, Med, MA, CAADC, is a psychologist and the owner of Bucks County Psychological, a premier psychology practice located in Doylestown and Washington Crossing. The practice offers one-on-one therapy, counseling and addiction consultation services to the Bucks County community. The therapy staff is comprised of psychologists, counselors, and therapists whose role is to partner with you in whatever change you’re seeking and to customize a plan to see it through. Give a call at 215-817-0190 for a free 10-minute phone consultation or email at <a href=\"mailto:DrCoren@BucksPsych.com\">DrCoren@BucksPsych.com</a> to see if it’s the right fit. Visit on the web at <a href=\"https://drchadcoren.com/\" target=\"_blank\" rel=\"noopener noreferrer\">buckspsych.com</a>.</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/03/Chad-Coren.jpg"
}