{
  "id": 17289,
  "title": "Doodle Jawnz: Fun, Washable Coloring Dolls for Kids",
  "slug": "doodle-jawnz-fun-washable-coloring-dolls-for-kids",
  "date": "2023-04-12T12:11:22",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "Doodle Jawnz",
    "doylestown cardinal"
  ],
  "excerpt": "<p>We are Caitlin and Nick, the creators of Doodle Jawnz. We started creating our washable coloring dolls in 2019 as a way to entertain our kids while out and about. Nearly four years later, we’re selling our products in over a dozen stores in the greater Philadelphia area! When did your journey with art begin? [&hellip;]</p>\n",
  "content": "<p class=\"p1\">We are Caitlin and Nick, the creators of Doodle Jawnz. We started creating our washable coloring dolls in 2019 as a way to entertain our kids while out and about. Nearly four years later, we’re selling our products in over a dozen stores in the greater Philadelphia area!</p>\n<p class=\"p4\"><b>When did your journey with art begin?</b></p>\n<p class=\"p5\"><span class=\"s1\">Nick has been drawing since he was a kid and has a passion for illustrative art. Caitlin’s crafting journey began when she was eight years old when her grandmother taught her to crochet.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><b>Tell us about your art. What is your creative process like?</b></p>\n<p class=\"p5\"><span class=\"s2\">Nick draws the designs for our character dolls and Caitlin screen prints, sews, and stuffs them. We usually let our children decide what characters we should make next.</span></p>\n<p class=\"p4\"><b>Who or what is a big inspiration for you?</b></p>\n<p class=\"p5\"><span class=\"s1\">Doodle Jawnz were inspired by the dream of having peaceful dinners and quiet long car rides. But really, our kids were our inspiration and they still enjoy coloring their dolls after all this time.</span></p>\n<p class=\"p4\"><b>How do you like being a local artist in Doylestown?</b></p>\n<p class=\"p5\"><span class=\"s1\">Doylestown is such a special community and we are so happy to live here. We were lucky enough to be accepted as vendors for the last Doylestown Arts Festival. The community really showed up &#8211; even in the rain &#8211; to support local artists. We feel very grateful for this supportive town.</span></p>\n<p class=\"p4\"><b>Where can we find your work?</b></p>\n<p class=\"p5\"><span class=\"s1\">You can find Doodle Jawnz at Makers Off Main, Philadelphia Independents, Ali’s Wagon, the PA General Store, Nice Things Hand Made, Earth and State, and a handful of other stores in Philly.<span class=\"Apple-converted-space\"> </span></span></p>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2023/04/Doodle-Jahns-1.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-17291\" src=\"https://doylestowncardinal.com/wp-content/uploads/2023/04/Doodle-Jahns-1.jpg\" alt=\"\" width=\"1280\" height=\"1342\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2023/04/Doodle-Jahns-1.jpg 1280w, https://doylestowncardinal.com/wp-content/uploads/2023/04/Doodle-Jahns-1-286x300.jpg 286w, https://doylestowncardinal.com/wp-content/uploads/2023/04/Doodle-Jahns-1-768x805.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2023/04/Doodle-Jahns-1-977x1024.jpg 977w, https://doylestowncardinal.com/wp-content/uploads/2023/04/Doodle-Jahns-1-990x1038.jpg 990w\" sizes=\"auto, (max-width: 1280px) 100vw, 1280px\" /></a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/Makers-Off-Main.jpg"
}