{
  "id": 11991,
  "title": "Doylestown Mixed Media Artist Announces Partnership with Pine2pink Foundation",
  "slug": "doylestown-mixed-media-artist-announces-partnership-with-pine2pink-foundation",
  "date": "2022-01-11T12:01:53",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "Keith Fenimore",
    "Kelly Forte",
    "pine2pink"
  ],
  "excerpt": "<p>Watercolor and mixed media artist Kelly Forte’ is proud to announce her partnership with the Pine2Pink Foundation. Forte’ is releasing a commemorative print and will donate 20% of each sale back to the Pine2Pink Foundation. “My mother was fortunate in that she fought and won her battle with breast cancer at Doylestown Hospital, and this [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">W</span><span class=\"s2\">atercolor and mixed media artist Kelly Forte’ is proud to announce her partnership with the Pine2Pink Foundation. Forte’ is releasing a commemorative print and will donate 20% of each sale back to the Pine2Pink Foundation. “My mother was fortunate in that she fought and won her battle with breast cancer at Doylestown Hospital, and this is a perfect way for me to honor her and everyone out there fighting this terrible disease,” said Forte’.</span></p>\n<p class=\"p3\"><span class=\"s2\">Keith Fenimore founded Pine2Pink in 2018 and started Pine2Pink to pay tribute to his Grandmother, who passed from breast cancer and to honor his mother, a breast cancer survivor.</span></p>\n<p class=\"p3\"><span class=\"s2\">“As Pine2Pink grows and continues to inspire and empower communities to engage in unique ways and donate, we hold to our founding tenets to keep all funds local, to give 100% to breast cancer patients, and to be transparent about all financial giving,” said Fenimore.</span></p>\n<p class=\"p3\"><span class=\"s2\">The non-profit has raised a quarter of a million dollars, created and funded ten programs to help local patients, helped over 1000 breast cancer patients in Bucks County. To learn more about Pine2Pink, visit their website at <a href=\"http://www.pine2pink.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.pine2pink.org</a>.</span></p>\n<p class=\"p3\"><span class=\"s2\">“I love that donations from Pine2Pink and are used to help people here in Doylestown and surrounding communities. I saw the type of care that my mother received during her battle with<span class=\"Apple-converted-space\">  </span>breast cancer, and this is a perfect way for me to use my talent to help others in the community,” said Forte’</span></p>\n<p class=\"p3\"><span class=\"s2\">Forte, a lifelong Doylestown native, studied at the University of The Arts in Philadelphia and graduated with a BFA in ceramics from Syracuse University. She did her graduate work at the University of Colorado and completed one year of a Master’s Degree in fine art. The Pine2Pink print can is available for purchase at <a href=\"https://www.theartofkellyforte.com\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.theartofkellyforte.com</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/01/Kelly-Forte.jpg"
}