{
  "id": 13977,
  "title": "Doylestown Community Pedestrian Zones Summer Schedule",
  "slug": "doylestown-community-pedestrian-zones-summer-schedule",
  "date": "2022-06-30T17:55:07",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "Doylestown Community Pedestrian Zones Summer Schedule"
  ],
  "excerpt": "<p>Pedestrian Zones The Borough of Doylestown launched a pedestrian zone pilot program starting on June 26, 2020. The primary goal of the program is to allow outdoor dining and shopping to have a larger footprint and a safer experience for all. We are pleased to announce that this program will continue through 2022. View the [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>Pedestrian Zones</strong></p>\n<p class=\"p2\"><span class=\"s1\">The Borough of Doylestown launched a pedestrian zone pilot program starting on June 26, 2020. The primary goal of the program is to allow outdoor dining and shopping to have a larger footprint and a safer experience for all. We are pleased to announce that this program will continue through 2022. View the current schedule below.</span></p>\n<p class=\"p1\"><strong>What to expect</strong></p>\n<p class=\"p2\"><span class=\"s1\">Locals and visitors can expect to see increased outdoor seating at restaurants, additional outdoor shopping, and the rare experience to walk down historic Doylestown streets, free of vehicles. Outdoor dining and shopping will continue in tandem throughout town with the street closure pilot program.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>How it works</strong></p>\n<p class=\"p2\"><span class=\"s1\">Throughout the program designated areas will close to vehicular traffic, while sidewalks and parking lanes will be closed to pedestrians and will be reserved for neighboring businesses to expand dining and shopping setups. The center of the street will be reserved for pedestrian traffic.</span></p>\n<p class=\"p1\"><strong>Safety &amp; Guidelines</strong></p>\n<p class=\"p2\"><span class=\"s1\">Social distancing remains critical in our efforts to prevent the spread of COVID-19. While visiting the Pedestrian Areas and exploring town, please maintain a safe distance between one another. Masks are strongly encouraged when not seated. Alcohol sales must coincide with dining and any outdoor entertainment must be approved by the Borough in advance. Businesses with questions or requests should contact John Davis.</span></p>\n<p class=\"p2\"><span class=\"s1\">Sign up for Dmail to receive live updates from the Borough. Follow us on Facebook or Twitter for additional news and resources.</span></p>\n<p class=\"p1\"><strong>Upcoming Zones</strong></p>\n<p class=\"p2\"><span class=\"s1\">All 2022 dates are scheduled for Friday and Saturday from 5 PM &#8211; 11 PM unless otherwise noted.</span></p>\n<p class=\"p1\"><strong>July 8-9</strong></p>\n<p class=\"p1\">E. State Street | Pine to Main</p>\n<p class=\"p1\"><strong>July 29-30</strong></p>\n<p class=\"p1\">W. State Street | Hamilton to Clinton</p>\n<p class=\"p1\"><strong>August 12-13</strong></p>\n<p class=\"p1\">N. Main Street | Court to State</p>\n<p class=\"p1\"><strong>August 26-27</strong></p>\n<p class=\"p1\">E. State Street | Pine to Main</p>\n<p class=\"p1\"><strong>September 23-24</strong></p>\n<p class=\"p1\">W. State Street | Hamilton to Clinton</p>\n<p class=\"p1\"><strong>October 7-8</strong></p>\n<p class=\"p1\">N. Main Street | Court to State</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/06/street-closures.jpg"
}