{
  "id": 11233,
  "title": "Doylestown Healthy Kids Running Series Aims To Help Children Maintain An Active Healthy Lifestyle",
  "slug": "doylestown-healthy-kids-running-series-aims-to-help-children-maintain-an-active-healthy-lifestyle",
  "date": "2021-08-22T15:05:27",
  "author": "Staff",
  "category": [
    "Fit",
    "Play"
  ],
  "tags": [
    "doylestown cardinal",
    "Doylestown Healthy Kids Running Series"
  ],
  "excerpt": "<p>Healthy Kids Running Series, a national inclusive and fun youth running experience, inspiring kids (ages 2-14) to believe in themselves and lead an active healthy lifestyle, is conducting a safe, five-week in-person Fall running series featuring once-a-week racing at Camp Curiosity in Doylestown with 4 PM start times.  “The community has really embraced Healthy Kids [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">H</span><span class=\"s2\">ealthy Kids Running Series, a national inclusive and fun youth running experience, inspiring kids (ages 2-14) to believe in themselves and lead an active healthy lifestyle, is conducting a safe, five-week in-person Fall running series featuring once-a-week racing at Camp Curiosity in Doylestown with 4 PM start times.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s3\">“The community has really embraced Healthy Kids Running Series and our goal of leading children toward healthy and active lifestyle. We had an incredible level of participation in the spring with almost 350 registrations and hosting one of the largest series in the country” said Ryan Wantz, community coordinator of the Doylestown Healthy Kids Running Series.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s3\">Healthy Kids Running Series is a five-week program with races on Sundays, that began on August 12 with age-appropriate race distances. Kids compete each week in their designated age or grade level division. Every participant will receive a T-Shirt and Medal. Registration is $40 for the five-week Series and is open now at HealthyKidsRunningSeries.org.<span class=\"Apple-converted-space\">  </span>Healthy Kids Running Series programming is supported by Stride Rite, Doylestown Health, Camp Curiosity and Bright Eyes Vision. </span></p>\n<p class=\"p3\"><span class=\"s3\">“We are closely following the guidelines as suggested by the CDC and implementing many new measures to ensure we protect our runners and their families from becoming ill,” said Jeff Long, founder, Healthy Kids Running Series. “We recognize and understand these are challenging times, but we are offering our runners and their families a safe experience while social distancing to teach kids effort, perseverance, persistence, sportsmanship, independence and grit.”</span></p>\n<p class=\"p3\"><span class=\"s3\">For a complete list of Healthy Kids Running Series’ safety measures and precautions, please visit their website.</span></p>\n<p class=\"p3\"><span class=\"s4\">Healthy Kids Running Series is also offering a virtual alternative, the Virtual World Race, a five-week Series for families not yet ready to gather with other families in their neighborhood with all of the same benefits and features as the in-person Series. Details are available at <a href=\"http://HealthyKidsRunningSeries.org.\" target=\"_blank\" rel=\"noopener noreferrer\">HealthyKidsRunningSeries.org.</a></span></p>\n<p class=\"p3\"><span class=\"s3\">Healthy Kids Running Series impacts more than 60,000 youth runners in 300+ communities across the United States. Healthy Kids Running Series engages communities and families by providing an inclusive youth running experience, inspiring kids to believe in themselves and lead active healthy lifestyles. Learn more at <a href=\"http://www.HealthyKidsRunningSeries.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.HealthyKidsRunningSeries.org</a>.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/08/Healthy-Kids-Running-Series.jpg"
}