{
  "id": 18554,
  "title": "Exploring Pennsylvania Mills",
  "slug": "exploring-pennsylvania-mills",
  "date": "2023-12-14T17:27:28",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live",
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "Jill Sonlin",
    "pennsylvania mills"
  ],
  "excerpt": "<p>By Jill Sonlin • Special to The Cardinal We often hear about covered bridges in Bucks County, but did you know about the historic richness of the many fascinating mills in the area? For centuries, countless mills lined the water’s edge of the Delaware River and other local creeks and waterways. These multi-level magnificent structures [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Jill Sonlin</strong></em> • Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">W</span><span class=\"s1\">e often hear about covered bridges in Bucks County, but did you know about the historic richness of the many fascinating mills in the area? For centuries, countless mills lined the water’s edge of the Delaware River and other local creeks and waterways. These multi-level magnificent structures have unique stories to tell.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Major producers of essential materials like flour, grain, paper, cotton, silk, wood, metal, and more, these stone structures had an immense impact on the nearby towns and local economy. Local residents worked the mills for generations, bringing prosperity to the area. Even George Washington spent some time at the local mills with his Continental Army where they rested and restocked many much-needed supplies during the Revolutionary War. Today, many surviving mills are still standing and open for tours as museums for all ages to enjoy.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">New Hope Silk and Cotton Mill</span></strong><span class=\"s1\">, built in 1813 by William Maris, was a cotton spinning and weaving mill, and in its prime had fifty employees making it one of New Hope’s largest economic contributors from 1864-1887.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">In 1936, it sustained a tragic fire. This vibrant mill of the past lay for years in broken remains amidst the woods in New Hope. Almost fifty years later, a family saw the ruins as a thing of beauty with much potential, bought the land and mill, and used the original stone walls for the structure of a newly built modern home within the mill’s remains.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s5\">Located on a beautiful winding road along the Delaware River—find it just off Route 202 and drive down Sugan Rd for 0.2 miles. You’ll see the mill in all of its beauty on the left side of the road, with the historical landmark sign adjacent to it. Please remember it is a private residence and not open to the public, so do a drive-by to see it.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><i>Sugan Rd, New Hope</i></p>\n<p class=\"p5\"><strong><span class=\"s3\">Bucks County Playhouse</span></strong><span class=\"s1\">, formerly called New Hope Mills, suffered a fire and burned down in 1790. A successful Bucks County entrepreneur, Benjamin Parry, rebuilt the grist mill and renamed it New Hope Mills, with the desire to foster “new hope” in the people of the town. Soon after, the town was referred to as New Hope and remains that name to this day.</span></p>\n<p class=\"p5\"><span class=\"s1\">In 1939 a group of theater professionals saved the old historic mill from demolition and turned it into a theater for Broadway-bound plays to have a first run before heading to NYC. Adn so, the Bucks County Playhouse was born. Live theater and plays are popular and ongoing presently, hosting many great shows and performances.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><i>70 S Main St, New Hope<span class=\"Apple-converted-space\">    </span></i><a href=\"http://Bcptheater.org\" target=\"_blank\" rel=\"noopener noreferrer\"><i>Bcptheater.org</i></a></p>\n<p class=\"p5\"><strong><span class=\"s3\">Potters Mill (or Turks Mill)</span></strong><span class=\"s1\"> was a grist (meaning grain used to make four) and flour mill built along the Neshaminy Creek. It is found now at the junction of S. Easton Road and Turk Road, located on Turk Road just beyond the underpass on the left. This mill dates back to 1735 and was rebuilt in 1840. It is three stories high, close to the street, and easy to find. It is now home to Des-Carr Doors business. Definitely do a drive-by to see it.</span></p>\n<p class=\"p6\"><i>2000 Turk Rd, Doylestown<span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p5\"><span class=\"s6\">Newlin Grist Mill</span><span class=\"s7\"> is an opportunity to see inside a real, working grist mill. Tour this with or without a guide, and walk their incredibly beautiful and well-maintained 160 acres of land and nature trails. This mill dates back to 1704 and has served its community both then and now. This mill grinds locally grown grains that produce flour, further enriching the economy by exporting its products to international markets all around the world.</span></p>\n<p class=\"p6\"><i>219 Cheyney Rd, Glen Mills<span class=\"Apple-converted-space\">    </span></i><a href=\"http://Newlingristmill.org\" target=\"_blank\" rel=\"noopener noreferrer\"><i>Newlingristmill.org</i></a></p>\n<p class=\"p5\"><strong><span class=\"s3\">Steel Stacks</span></strong><span class=\"s1\"> is one of my favorite mills. Home to Bethlehem Steel Company, this ten-acre campus houses the magnificent steel mill that was once the second-largest steel manufacturer in the country. This plant served as the lifeblood of the surrounding community for many generations. The stacks stretch up to the clouds more than 230 feet high and nearly a quarter of a mile in length.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">This mill made thousands of tons of iron and steel products per day in the mid-1800s for railroads, skyscrapers, bridges, and items needed for the U.S. Navy. Bethlehem Steel was even used for some of our most prominent U.S. monuments, like New York City’s Chrysler Building, Madison Square Garden, and the Golden Gate Bridge. After a 120-year run, Steel Stacks closed its doors for good in 1995. In 2005 work began to revitalize this cherished structure.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">By 2010 the site was open to the public, along with a newly built ArtsQuest Center. Steel Stacks has become an extraordinary gathering place for millions of tourists annually. It’s a place rich in history, arts, music, and entertainment. Check the website for a jam-packed monthly calendar of events.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><i>101 Founders Way, Bethlehem    </i><a href=\"http://steelstacks.org\" target=\"_blank\" rel=\"noopener noreferrer\"><i>steelstacks.org</i></a></p>\n<p class=\"p5\"><strong><span class=\"s8\">The Thompson-Neely Grist Mill</span></strong><span class=\"s4\">, found in Washington Crossing, was built in 1875. The original mill on this site was actually built in 1740 along the river’s edge. A water wheel powers a series of intricately interconnected steps using systems of pulleys, levers, and grinding stones. Here you can learn how the grain was separated, sifted, ground, and stored in cloth sacks and handmade wooden barrels for international transport.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">This mill processes corn and wheat into fine flour of different levels of quality for different uses and pricing. A 60-minute walking tour of the adjacent Thompson-Neely House and Farmstead is available along with the grist mill daily from 10 a.m. to 4 p.m. Tours cost $7.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><i>1638 River Road, Washington Crossing</i></p>\n<p class=\"p6\"><a href=\"http://washingtoncrossingpark.org/park/thompson-neely-grist-mill/\" target=\"_blank\" rel=\"noopener noreferrer\"><i>washingtoncrossingpark.org/park/thompson-neely-grist-mill/</i></a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/New-Hope-Silk-and-Cotton-Mill.jpeg"
}