{
  "id": 14107,
  "title": "Faces of Doylestown: The Ice Cream Man",
  "slug": "faces-of-doylestown-the-ice-cream-man",
  "date": "2022-07-13T16:52:27",
  "author": "Staff",
  "category": [
    "Play",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Jim Foster",
    "laura hoover",
    "Slobodan Stojanovic"
  ],
  "excerpt": "<p>By Laura Hoover • Special to The Cardinal If you’ve ever wondered what it feels like to have a job where children run when they hear you coming, just ask Slobodan Stojanovic.  The longtime ice cream truck man, known around these parts as Sloby, is enjoying his 27th year in business.  “I’m dealing with children, [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Laura Hoover • </strong>Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">I</span><span class=\"s3\">f you’ve ever wondered what it feels like to have a job where children run when they hear you coming, just ask Slobodan Stojanovic. </span></p>\n<p class=\"p5\"><span class=\"s3\">The longtime ice cream truck man, known around these parts as Sloby, is enjoying his 27th year in business. </span></p>\n<p class=\"p5\"><span class=\"s3\">“I’m dealing with children, that is the best part,” said Stojanovic, who hails from Serbia near Belgrade. “I’ve never had a problem with any of them. I know 95 percent of my customers everyday.” </span></p>\n<p class=\"p5\"><span class=\"s3\">Sloby first came to the United States as an exchange student in 1988 and then returned in 1995 when civil war struck his country. Because his wife was born in the United States, he could travel back and forth. At that time, he called the Jack &amp; Jill company and got started with a truck. Six months out of the year, he drives, sometimes 12 hours a day and up to 130 miles a day in the Doylestown area selling ice cream. He lives in an apartment with friends in Philadelphia. The rest of the time he returns to his home country where he translates books spends as much time as possible with his family.</span></p>\n<p class=\"p5\"><span class=\"s3\">While the traveling can be back and forth can be hard, ““I know some people in a war situation and  spend a lot more time apart from their families,” Sloby said. </span></p>\n<p class=\"p5\"><span class=\"s3\">Like businesses across the country, Sloby raised prices this summer to deal with gas prices and inflation. He refused to raise all of them though. </span></p>\n<p class=\"p5\"><span class=\"s3\">“I was afraid it was going to hurt my customers too much, he said. </span></p>\n<p class=\"p5\"><span class=\"s3\">So far this year, he hasn’t gotten too many complaints.</span></p>\n<p class=\"p5\"><span class=\"s3\">“He is always nice to people. He greets everyone,” said Doylestown resident Sean Smith, 10. </span></p>\n<p class=\"p5\"><span class=\"s3\">“Sloby is the best. He’s just so nice to the kids. If someone is short a quarter, he will give them the ice cream anyway. I have come and paid him back,” said Furlong mom Angelique Toadvine. “He also doesn’t charge you for his time if he works a party. He just charges you for the ice cream.”</span></p>\n<p class=\"p5\"><span class=\"s3\">Fanny Chapman Pool Manager Jim Foster said Sloby has been coming to the pool and surrounding park for 20 years.</span></p>\n<p class=\"p5\"><span class=\"s3\">“He’s an icon. He’s been here longer than I have,” said Foster. “We had someone else come and try to sell. Nobody bought from him. It’s customer loyalty. On a hot day, he donates ice cream to the staff.”</span></p>\n<p class=\"p5\"><span class=\"s3\">Sloby said he appreciates the old-timey feel of Fanny Chapman.</span></p>\n<p class=\"p5\"><span class=\"s3\">“From what I understand, it hasn’t changed all that much from 100 years ago. There is no time for recreation in my home country. It’s like the military.”</span></p>\n<p class=\"p5\"><span class=\"s4\">His next career plan? Retirement. But not before enjoying a chocolate Magnum or two.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><i>Laura Hoover is a Doylestown-based freelance writer.<span class=\"Apple-converted-space\">  </span>Mom of three, you can find her work in the Philadelphia Inquirer and other local publications online.</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/07/Slobodan-Stojanovic.jpg"
}