{
  "id": 18573,
  "title": "Family Portrait Tips from a Photographer",
  "slug": "family-portrait-tips-from-a-photographer",
  "date": "2023-12-14T17:36:49",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "Katie Baab"
  ],
  "excerpt": "<p>By Katie Baab • Special to The Cardinal For many families in Bucks County, fall acts not only as a precursor to the holidays but a stark reminder of how another year has somehow raced by.  We begin thinking about documenting our families in photographs as a way to hold onto this season of life. [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Katie Baab</strong></em> • Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">F</span><span class=\"s1\">or many families in Bucks County, fall acts not only as a precursor to the holidays but a stark reminder of how another year has somehow raced by.<span class=\"Apple-converted-space\">  </span>We begin thinking about documenting our families in photographs as a way to hold onto this season of life. But also, as a “necessity” for those who want to mail holiday cards to friends and loved ones with a photographic update on our lives. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Bucks County offers no shortage of beautiful landscapes. Whether you are taking your own family photographs or hiring a professional, consider one of these locations for a taste of what our beautiful towns have to offer.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">Moland House.</span></strong><span class=\"s4\"> This historic stone farmhouse and surrounding woods serve as a beautiful backdrop for a quintessential Bucks County scene. No permit is needed and you can even peek in the windows and see how the home would have been furnished in the 1700s. The Moland House served as one of Washington’s encampments during the Revolutionary War and this is the very site that Marquis de Lafayette decided to become a general in George Washington’s army.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">Local township parks.</span></strong><span class=\"s4\"> Not every location needs beautiful architecture to set the scene for a family portrait.<span class=\"Apple-converted-space\">  </span>Light is the most important element in taking a beautiful image so consider a trip to your local park at sunset to capture golden light streaming through the trees behind your subject. As the sun dips lower toward the horizon, position the subjects to be lit up by the sun when it is less harsh this time of day. As the leaves continue to turn, the sunset will illuminate the colors in the background, creating a beautiful backdrop while still allowing the focus to be on the people in front of them.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s5\">Downtown.</span></strong><span class=\"s1\"> Whether you live in Doylestown, Lambertville, New Hope, or want to venture into Frenchtown or other surrounding towns, why not let our local shops and scenes be the backdrop for a family session? Showcase the lovely boroughs we have right at our fingertips and add some character to your photos, giving friends near and far a glimpse into what it looks like where you live.</span></p>\n<p class=\"p5\"><strong><span class=\"s5\">Peddler’s Village.</span></strong><span class=\"s1\"> If it’s Christmas you celebrate, Peddler’s Village is the perfect place to visit. Choose a meticulously decorated tree to stand in front of or let strings of lights illuminate the background of your festive holiday portrait. Be sure to visit while it’s still light enough to take non-flash photography but wait for the holiday lighting to be turned on which occurs at sunset. The decorations will be in effect as of Nov. 17 this year.</span></p>\n<p class=\"p5\"><span class=\"s1\">Once you’ve found the perfect scene for your family portrait, it’s time to dress your crew.<span class=\"Apple-converted-space\">  </span>My favorite tips for coordinating outfits aside from the obvious ones (complement, don’t match!) include considering textures when outfitting a larger group. Combining textures like flannel, wool, corduroy, cable knit and other materials will add visual interest and is equally as important as finding colors that work together. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">When styling my own family portraits I normally abide by a general rule of choosing one small print, maybe floral for myself or one of my daughters, a few neutrals, and one additional larger print, such as flannel patterns, so as not to compete. Adding a pop of color is great and choosing different shades in the same color family that will accompany the neutrals is usually a safe bet. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">At the end of the day, it’s the people in the photo that matter most so if your location isn’t ideal and your outfits aren’t perfect, just have fun. If children are involved, let them be themselves. Maybe everyone smiling at the camera isn’t the photo that is meant to be this year and you’ll end up with something better if you can let go of the idea of perfection. (I will have to remind of this advice myself in a few weeks when I try to dress my 10, eight, and five year old in coordinating outfits and get that “perfect shot” with my family.)<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><i>Katie is a wedding and portrait photographer residing in Buckingham with her husband and three children.<span class=\"Apple-converted-space\">  </span>When she’s not behind the camera, she enjoys running and playing tennis.<span class=\"Apple-converted-space\">  </span>She has operated her business for 17 years from the Lehigh Valley, NYC, and now Bucks County.<span class=\"Apple-converted-space\">  </span>Find her on Instagram @kateleighphoto or online at <a href=\"http://www.kateleigh.com.\" target=\"_blank\" rel=\"noopener noreferrer\">www.kateleigh.com.</a></i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/Katie-Baab.jpg"
}