{
  "id": 19818,
  "title": "A Chat with Faye Meyer",
  "slug": "faye-meyer-2",
  "date": "2024-06-12T12:27:13",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [],
  "excerpt": "<p>A central Pennsylvania native, Faye grew up a theater kid. She studied musical theater at The Boston Conservatory, later relocating to Bucks County. Faye taught at The Conservatory of Doylestown and School of Rock and worked on professional theater productions, eventually opening a vocal studio in New Britain.  After the birth of her children, Faye [&hellip;]</p>\n",
  "content": "<p><span style=\"font-weight: 400;\">A central Pennsylvania native, Faye grew up a theater kid. She studied musical theater at The Boston Conservatory, later relocating to Bucks County. Faye taught at The Conservatory of Doylestown and School of Rock and worked on professional theater productions, eventually opening a vocal studio in New Britain. </span></p>\n<p><span style=\"font-weight: 400;\">After the birth of her children, Faye started learning covers and playing piano, performing gigs in the Greater Philadelphia area. Her musical path led her to songwriting. With the help of fellow musicians she has met along the way, she recorded some of the songs, releasing three singles and two videos on major streaming platforms.</span></p>\n<p><b>Q: What is it about music that makes you feel passionate? </b></p>\n<p><b>A:</b><span style=\"font-weight: 400;\">  I feel a sense of community. When I listen to music, I relate to what people have dealt with and I don’t feel alone. I hope people can feel the same way through my songs as well. I love being creative and making people feel something. When I was five, I sang the song “Tomorrow” from Annie in front of my whole elementary school. From that moment on, I was hooked!</span></p>\n<p><b>Q: What&#8217;s the best piece of advice another musician ever gave you?</b></p>\n<p><b>A: </b><span style=\"font-weight: 400;\">Don’t let the daily grind keep you from going after your dreams. Stay true to what you want and who you are as an individual.</span></p>\n<p><b>Q: What advice would you give your younger self now? </b></p>\n<p><b>A: </b><span style=\"font-weight: 400;\">To not let people’s opinions of what you want deter you from going after your dreams. I let too many people make me believe I wasn’t good enough.</span></p>\n<p><b>Q: Favorite Doylestown venue to perform and why? </b></p>\n<p><b>A: </b><span style=\"font-weight: 400;\">The Doylestown Arts Festival. I’ve had the privilege of being in it three times so far. I love how it is outside, and incorporates fine art with music. I love being a part of the community in a way that makes people excited to want to see live music. I finally felt something of accomplishment this past year when I was able to play my originals. There is nothing more awesome than creating something and sharing it with people. </span></p>\n<p><b>Q: Tell us about the single most memorable experience you’ve had as a performer. </b></p>\n<p><b>A: </b><span style=\"font-weight: 400;\">I was in a production of “Jesus Christ Superstar”. I played Mary Magdalene. It was a sold-out show at The Keswick Theatre I never performed in front of that many people. </span><span style=\"font-weight: 400;\">My character’s song “I don’t know how to love him” is one of the most famous in the show. I was all alone on stage, with all those eyes on me. I finished the song and there was just silence then an exuberant amount of applause. I knew then I had done my job. </span></p>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/06/Faye-Meyer.jpeg"
}