{
  "id": 16225,
  "title": "First Saturday Chess in Doylestown",
  "slug": "first-saturday-chess-in-doylestown",
  "date": "2023-01-09T23:36:18",
  "author": "Staff",
  "category": [
    "Live",
    "Play"
  ],
  "tags": [
    "chess in doylestown",
    "doylestown cardinal",
    "Doylestown Historical Society Park",
    "Ed Ziegman",
    "Gary Harris",
    "John Connelly"
  ],
  "excerpt": "<p>Lauren Heine • The Cardinal Contributing Writer Are you looking for a New Year’s resolution to reduce stress, manage anxiety, improve memory, and become part of a community? If so, you’re sure to meet your match at First Saturday Chess in Doylestown Borough. First Saturday Chess, held on the first Saturday of the month, takes [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>Lauren Heine • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">A</span><span class=\"s3\">re you looking for a New Year’s resolution to reduce stress, manage anxiety, improve memory, and become part of a community? If so, you’re sure to meet your match at First Saturday Chess in Doylestown Borough.</span></p>\n<p class=\"p5\"><span class=\"s3\">First Saturday Chess, held on the first Saturday of the month, takes place in the Doylestown Historical Society Park on South Main Street from June through Sept. and inside the Syd and Sharon Martin Barn at the far end of the park from Nov. through April.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Here, chess enthusiasts of all ages and skill levels gather and play. It runs from 11 am to 2 pm without a competitive schedule, so anyone can pop in with a friend or meet new ones. Bring your own chess board or use one of the ones provided. These sessions are informal, relaxed, and free. With no lessons given or trophies to win, there’s plenty of wisdom and humility to go around. Regulars and decorated players welcome new players, and everyone enjoys the camaraderie and the game.</span></p>\n<p class=\"p5\"><span class=\"s3\">First Saturday Chess has evolved from the first Open Chess Day in the spring of 2005. Doylestown Parks and Recreation director Gary Harris created the event after the purchase of two chess tables and chairs for Doylestown Historical Society Park. At the event, John Connelly, now director of the program, volunteered to organize a monthly meeting.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">In cold weather months, the club held sessions in a coffee shop basement with unreliable lighting. Now it has a bright, cozy home in the barn thanks to a Navy connection and the kindness of the Doylestown Historical Society. After 17 years, the program is the only of its kind in the community. Its focus is to bring people together to enjoy the game in a relaxed setting.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Players at these events remember how they learned to play chess. There are stories of a wise grandfather or learning from other kids on the community playground. Some people<span class=\"Apple-converted-space\">  </span>self-taught through library books, or had a teacher help during study hall, or took lessons from a chess master. They all smile when they reminisce. Connelly recalls being able to pick up a game anywhere in the world while he was serving in the Navy.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Ed Ziegman, who was in the Top 50 children in chess when he was just ten years old, beams about having taught his own daughter, who now shares his passion. They appreciate the discipline and focus, benefit from the planning and problem-solving, and value the way the game brings people together across generations and circumstances.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Though players were quietly concentrating on their black and white chess boards, they couldn’t help but shake their heads and chuckle at the lighthearted banter between the group. Harris and Connelly have created a group and an enjoyable opportunity for everyone to participate, from novices to pros. Your New Year’s resolution will be a pleasure to keep if it consists of First Saturday Chess. For more information, visit the Doylestown Boro Parks and Recreation Facebook page.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/01/IMG_1639-e1673325369741.jpeg"
}