{
  "id": 12404,
  "title": "Frutta Bowls Expanding Grocery Store Concept in Doylestown",
  "slug": "frutta-bowls-expanding-grocery-store-concept-in-doylestown",
  "date": "2022-03-01T22:20:33",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Frutta Bowls"
  ],
  "excerpt": "<p>Frutta Bowls, a WOWorks brand, has expanded its grocery store-within-store locations via multi-unit franchisee partners Curtis High and Jordan Rideout. The pair recently opened the brand’s first franchisee-owned Frutta Bowls restaurant in a grocery store in Doylestown, Pennsylvania. The men are owners of eight Saladworks, also owned by WOWorks, in Pennsylvania and Delaware. “When we [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">F</span><span class=\"s2\">rutta Bowls, a WOWorks brand, has expanded its grocery store-within-store locations via multi-unit franchisee partners Curtis High and Jordan Rideout. The pair recently opened the brand’s first franchisee-owned Frutta Bowls restaurant in a grocery store in Doylestown, Pennsylvania. The men are owners of eight Saladworks, also owned by WOWorks, in Pennsylvania and Delaware.</span></p>\n<p class=\"p3\"><span class=\"s3\">“When we reviewed and visited Frutta Bowls restaurants after WOWorks’ acquisition, we immediately saw how their menu of fresh smoothies, bowls and bites appeal to young people and families who are trying to find healthy and convenient meals that also taste great,” Rideout said. “We were especially attracted to the possibility of co-branding Frutta Bowls and Saladworks restaurants. If this Frutta Bowls location does well, we intend on co-branding all our existing Saladworks locations with Frutta Bowls restaurants.”</span></p>\n<p class=\"p3\"><span class=\"s3\">The Frutta Bowls grocery store location in Doylestown will create 10-15 jobs, and to open the store-within-a-store location, WOWorks facilitated several interviews with the grocery store chain executives and coordinated walk-throughs in the franchisees’ stand-alone restaurants.</span></p>\n<p class=\"p3\"><span class=\"s3\">“We are happy to welcome Curtis High and Jordan Rideout to the Frutta Bowls family,” he said. “Our grocery store and co-branding restaurant model is helping our franchisee network expand in non-traditional verticals and increase revenue with their existing WOWorks’ restaurant investment. Co-branding allows franchisees to open multiple restaurant brands together, tap into several dayparts, and enjoy greater efficiencies due to shared back-end operations and equipment.”</span></p>\n<p class=\"p3\"><span class=\"s3\">Frutta Bowls has grown from its original location in Freehold, New Jersey to 39 locations. WOWorks was formed in 2020 and also owns Garbanzo Mediterranean Fresh and The Simple Greek. For more information, visit <a href=\"http://www.fruttabowls.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.fruttabowls.com</a>.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/03/Frutta.jpg"
}