{
  "id": 14777,
  "title": "Get to Know Charming Newtown, our Neighboring Borough",
  "slug": "get-to-know-charming-newtown-our-neighboring-borough",
  "date": "2022-09-12T22:37:12",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "Danielle Gannon",
    "doylestown cardinal",
    "newtown"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer The beautiful community of Newtown was founded by William Penn in 1684. Newtown was one of several towns that Penn had organized around Philadelphia to provide country homes for city residents and to support farming communities. It was the county seat of Bucks County from 1726 until [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Danielle Gannon</strong> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">The beautiful community of Newtown was founded by William Penn in 1684. Newtown was one of several towns that Penn had organized around Philadelphia to provide country homes for city residents and to support farming communities. It was the county seat of Bucks County from 1726 until 1813 when it was replaced by a more central Doylestown.</span></p>\n<p class=\"p4\"><span class=\"s2\">Newtown Borough was enlarged four times since 1838, and its buildings show excellent examples of all major architectural styles. Newtown Borough became one of Bucks County’s preeminent communities with the construction of many substantial colonial residences and taverns. The Historic District, established in 1969, enlarged in 1976, and again in 1985, is listed on the National Register of Historic Places. Today, Newtown still retains the character of this important period of history.</span></p>\n<p class=\"p4\"><span class=\"s2\">Newtown borough is positioned in the center of the town, with two major streets. Sycamore and State streets running parallel to one another and are lined with shops and dining. Outside the little historic borough, you find four large, beautifully renovated shopping centers hosting food and shops for the most exquisite of palates.</span></p>\n<p class=\"p4\"><span class=\"s3\">You look around and see old cobblestone walkways, driveways, and homes. You feel the hustle and bustle of the local community driving in, walking, and conversing with each other. Shop owners often open after dropping their kids off at school, and their children are in the business when school lets out. It is a proper small town. It is the essence of what makes Bucks County so appealing.</span></p>\n<p class=\"p4\"><span class=\"s2\">I love to walk into the shops, be greeted by the owners, and hear the daily buzz of what’s happening locally. Events, theatre, dining, smoothies, apparel, and workouts… all a stone’s throw away from one another. All in true support of one another. This is a community. This is Newtown!</span></p>\n<p class=\"p4\"><span class=\"s2\">This community is also home to Council Rock. This top-rated public school district has approximately 10,494 students in grades K-12. Our children attend school here, and I feel confident in their education, as they’re in some of the Nation’s best schools.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">With how spectacular this little Bucks County town is, and only a stone’s throw away from Doylestown, we felt the only next right move was to begin sprinkling Newtown into the mix of The Cardinal!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">We plan to spotlight local businesses and events in Newtown each month, so our love and appreciation for community expands to this charming neighboring borough. We have a lot of excitement and buzz in the making, and we look forward to cultivating these Newtown pages.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">In all of my time here in Bucks County, I can’t imagine the next best place to be but in Newtown.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Stay tuned for the expansion of this project. Newtown, contact me with any ideas, features, concerns, or questions. I am here for you!</span></p>\n<p><strong>Coming Events</strong></p>\n<p class=\"p1\">Come on out to Newtown this month for some fun events! Full of history and pride, this town has a lot to offer each and every day or the week.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p2\"><b>Saturday, September 10</b></p>\n<p class=\"p2\">Newtown Black &amp; White Dinner at Newtown Theatre<span class=\"Apple-converted-space\">  </span>5:30 – 10:30pm</p>\n<p class=\"p2\"><span class=\"s1\">Visit <a href=\"http://www.thenewtowntheatre.com/events\" target=\"_blank\" rel=\"noopener noreferrer\">www.thenewtowntheatre.com/events</a></span></p>\n<p class=\"p2\"><b>Saturday, September 17<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p2\">13th Annual Newtown BeerFest. Hosted by the Newtown Fire Association.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p2\">12:30 to 5:30pm at the Stocking Works<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p2\">For info: <a href=\"http://newtownbeerfest.com\" target=\"_blank\" rel=\"noopener noreferrer\">http://newtownbeerfest.com</a></p>\n<p class=\"p2\"><b>Friday, September 30<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p2\">Take a trip down memory lane at the first-ever “Night of Newtown Memories” at Newtown Theatre. 7:00 – 9:30pm<span class=\"Apple-converted-space\">  </span><span class=\"s1\">Visit <a href=\"http://www.thenewtowntheatre.com/events\" target=\"_blank\" rel=\"noopener noreferrer\">www.thenewtowntheatre.com/events</a></span></p>\n<p class=\"p2\"><b>Saturdays/Sundays through September<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p2\">Live music at the Crossing Vineyards! Visit <a href=\"http://www.crossingvineyards.com/live-music\" target=\"_blank\" rel=\"noopener noreferrer\">www.crossingvineyards.com/live-music</a> for more info. 2:00 – 6:00pm</p>\n<p class=\"p2\">Keep an eye out for The ProShop of Newtown opening this month! Kathleen, the shop’s owner, has been working hard to pull things together since a fire occurred there back in March. Kathleen is a gem in the Newtown community and all are anticipating the reopening of her shop for community connection and shopping. Visit <a href=\"https://luxepsn.com\" target=\"_blank\" rel=\"noopener noreferrer\">https://luxepsn.com</a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/09/Newtown.jpeg"
}