{
  "id": 13983,
  "title": "Get to Know a Doylestownian: Justine Maraska",
  "slug": "get-to-know-a-doylestownian-justine-maraska",
  "date": "2022-06-30T18:01:27",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "Central Bucks high school",
    "dana roberts",
    "doylestown cardinal",
    "Justine Maraska"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer Get to Know a Doylestownian is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide, in any way they see fit. In honor of June being graduation month, we wanted to honor [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Dana Roberts</strong> • The Cardinal Contributing Writer</p>\n<p class=\"p3\">G<span class=\"s2\">et to Know a Doylestownian </span><i>is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide, in any way they see fit. In honor of June being graduation month, we wanted to honor a Central Bucks graduate. Meet Justine Maraska, graduating senior from CB West.<span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p5\"><strong><span class=\"s2\">My name is</span></strong><span class=\"s1\">… Justine Maraska.</span></p>\n<p class=\"p6\"><strong>On Friday, June 10th, I will be graduating from CB West</strong><span class=\"s1\">&#8230; with a class size of approximately 500.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">Graduation feels</span></strong><span class=\"s1\">&#8230;honestly, surreal. I watched my brother graduate and peers graduate in years before me, and it never really set in that it was going to eventually be me. I remember during sixth grade graduation; I never imagined the year 2022 would ever come.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">This summer, I am</span></strong><span class=\"s4\">&#8230; going on a week-long trip down the West coast with my mom. Aside from vacation, I will be working at a hair salon in town that I have been working at since I was 15. I also have a lot of art projects that I plan to complete this summer, including making some art for my dorm!</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">During high school, I was involved in</span></strong><span class=\"s1\">&#8230; Art programs, which molded me to be more creative with my thinking and gave me a confidence I never realized I had. I also ran winter and spring track all 4 years of high school until my spring senior season. I became unable to run on a stress-fractured foot. Track taught me the importance and impact of bringing high energy to a group and connected me with some amazing friends.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">The best thing about living a block away from CB West was</span></strong><span class=\"s1\">… walking to school and being so close to such a great community. I love how I can hear the marching band from my sunroom. It just makes me feel even closer with the West environment.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">The thing I will miss the most about high school is</span></strong><span class=\"s1\">&#8230;Seeing all the kids, whether I was very close with them, friendly with them, or even those I was not as familiar with. I love talking to and connecting with others. Sharing a space, like school, with so many kids from Doylestown has been awesome.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">The thing I will miss the least about high school is</span></strong><span class=\"s1\">…I think people tend to get caught up in what they feel comfortable with, even if it&#8217;s not what they truly want. I think college is a great way to redefine your values and become closer in-tune with yourself.</span></p>\n<p class=\"p5\"><strong><span class=\"s5\">My favorite class at CB West was</span></strong><span class=\"s6\">&#8230;most definitely AP art. This class allowed me to grow and convey my thought process in a chronological order of expression. Art to me is such a therapeutic way of getting your ideas out there and is completely open to be as abstract or ideological as you want. This class shaped me in ways I would have never imagined.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">One of the most unusual/interesting things that happened during my high school<span class=\"Apple-converted-space\">  </span>experience was</span></strong><span class=\"s1\">&#8230; This is probably a very expected answer, but Covid hitting during my sophomore year was most certainly an unforgettable experience. This disrupted the social scene, and everyone became a bit more comfortable with solidarity, which I think is very important.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My after-high school plans include</span></strong><span class=\"s1\">… Attending the University of Vermont! I move in late August, and I am thrilled and so grateful.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">I chose University of Vermont because</span></strong><span class=\"s1\">&#8230;. I have always found such inspiration and value in nature, and I think Vermont is a place that is extremely environmentally conscious, with endless outdoor opportunities.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">The item I absolutely cannot leave home without when I go to college is</span></strong><span class=\"s1\">&#8230;Art supplies. I will always carry my love and interest in art to my future endeavors.</span></p>\n<p class=\"p5\"><strong><span class=\"s7\">The thing I am most looking forward to about college is</span></strong><span class=\"s8\">&#8230;Starting fresh. As cheesy as it sounds, this is the time to embrace the change and growth that comes with such a new pathway. I am looking forward to getting to better know myself, and find others who I relate to, in a different way that I am used to.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">I hope to major in</span></strong><span class=\"s1\">&#8230; Psychology with an art minor. I want to express my knowledge and artistic technique in a way that is relevant to others. I also want to help others find a healthy understanding of themselves, and how to better themselves mentally, as a therapist/art therapist.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">The home-cooked meal I will miss the most when I am at college is</span></strong><span class=\"s1\">&#8230; My mom’s Thai and Indian Food. She sometimes even makes homemade naan to go along with it. I will also miss my dad’s turkey chili, which I remember eating since the end of elementary school.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">The slang term teens say right now that adults could really benefit from understanding would be</span></strong><span class=\"s1\">&#8230; woke. I think it’s often misunderstood as trying to be hip and could be defined as know what’s going on in the media, but I interpret it as just being more spatially and intellectually aware of your surroundings.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">The app on my phone I use the most right now is</span></strong><span class=\"s1\">&#8230; My camera. I deleted a few social media apps in hope to feel more connected to reality. I am happy to say it has been successful, and much of my phone storage is now occupied by photos of my backyard in the spring, art progress pictures, and my friends and family.</span></p>\n<p class=\"p5\"><strong><span class=\"s5\">The best book I read during high school was</span></strong><span class=\"s6\">&#8230; A Mango Shaped Space by Wendy Mass. Even though I read this in my freshman year, it has still stuck with me as being one of my favorite reads. It is all about a girl named Mia who has synesthesia, which means her senses and perceptions are all jumbled. For example, she associates sounds, words, and names with colors. I think this book has also sparked a more serious interest in psychology and I would recommend it to those who enjoy realistic fiction.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">The advice I would give to people in next year’s graduating class would be</span></strong><span class=\"s1\">&#8230; Never let yourself hold back your true personality, or blend into others around you. It can be a scary thing, especially when surrounded by hundreds of possible influences. But when you stay true to your own values, with your own spice and humor, you would be amazed by the depth of a relationship you can form with others, and more importantly, yourself. <span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/06/Justine-Maraska.jpg"
}