{
  "id": 11982,
  "title": "Get to Know a Doylestownian: Mayor Noni West",
  "slug": "get-to-know-a-doylestownian-mayor-noni-west",
  "date": "2022-01-11T11:54:33",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "Elnora West",
    "Mayor Noni West"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer This month is the start of our new feature, “Get to Know a Doylestownian,” a piece in which each month a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide, in any way they see fit. We couldn’t [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Dana Roberts • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><i>T</i><i>his month is the start of our new feature, “Get to Know a Doylestownian,” a piece in which each month a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide, in any way they see fit. We couldn’t think of a more perfect person to start the feature off than Noni West, our new Mayor, who takes office on January 3rd. Read on to find out all about Noni, including what treat you should offer her if you’d like to bring her some New Year’s cheer!</i></p>\n<p class=\"p5\"><strong><span class=\"s2\">My full name is</span></strong><span class=\"s3\">&#8230;. Elnora West.</span></p>\n<p class=\"p5\"><span class=\"s3\">I got the nickname Noni&#8230; because I couldn’t say Elnora when I was little and for some reason, I called myself Noni.<span class=\"Apple-converted-space\">  </span>I didn’t use my nickname until I started working. I was in New York City working in advertising. My media reps kept butchering my name … Ellie, El… so I started using Noni and it stuck.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">I’ve lived in Doylestown</span></strong><span class=\"s3\"> as an adult for 20 years, but Doylestown is my home. I grew up here, lived on Lower State Road and walked to Lenape and Central Bucks High School when there was no “West.” Whether I lived in New York City, Los Angeles or Boston, I always came home for holidays or just to visit my family.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My professional background is in</span></strong><span class=\"s3\">&#8230; Advertising and marketing with a specialty in media. I’ve worked for Ogilvy &amp; Mather, Doyle Dane Bernbach and Della Femina on packaged goods, entertainment, high tech, and internet start-ups. Currently I work for a non-profit, The Council/PRO-ACT, whose focus is substance use disorder. I am a Public Policy Specialist and coordinator for our Advocacy Leadership </span><span class=\"s1\">Program where we address policy affecting recovery from addiction.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">I live</span></strong><span class=\"s3\">&#8230; In Ward 1 of the Borough near the Linden School. I watch children walk to school and see them gleefully running home when the school day is over. My neighbors are a reason to live in Doylestown.<span class=\"Apple-converted-space\">  </span>The neighborhood “Pineapple Gang” checked in on me everyday during the COVID sequester. Shoveling snow becomes a community project. Chats in the street keep us up to date with one another.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">If I need a really good cup of coffee, I head to</span></strong><span class=\"s3\">&#8230; Native and ask for a latte with an extra shot.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My favorite place to go out to dinner in Doylestown is</span></strong><span class=\"s3\">&#8230; unable to be pinpointed. I do not have a favorite place for dinner. There are so many excellent places to eat in Doylestown’s central business district, to all the restaurants on South and North Main.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My first job in life was</span></strong><span class=\"s3\">&#8230; working for the Bar M making steak sandwiches and hoagies at Swamp Road and 202. It isn’t there anymore.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">I got involved in local government because</span></strong><span class=\"s3\">&#8230;<span class=\"Apple-converted-space\">  </span>I had been active in working on public policy issues and campaigns. I had always been used to “working in the back room.” When I got the call asking me if I would consider running for Borough Council in Ward 1, I said yes! It has been a fabulous experience contributing to our community. And I must admit, it is a learning process.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">People would be surprised to know the mayor</span></strong><span class=\"s3\">&#8230; has the primary responsibility for the public safety of the Borough. That responsibility means the mayor is the Borough’s primary liaison with the Police. I look forward to my continued involvement with the Regional Police Commission and increased interaction with Chief Karl Knott and his department.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My biggest pet peeve is</span></strong><span class=\"s3\">&#8230; people who don’t listen.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">I am really good at</span></strong><span class=\"s3\">&#8230; strategic planning and cooking.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">On my bedside table, you’ll find</span></strong><span class=\"s3\">&#8230; New York Times crossword puzzles.</span></p>\n<p class=\"p6\"><strong><span class=\"s4\">A song I always turn up is</span></strong><span class=\"s3\">&#8230; “Being Alive.”</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My favorite outdoor space in Doylestown is</span></strong><span class=\"s3\">&#8230; Chapman Park. I love walking through the woods and walking around the dam. I haven’t tried the pump track yet.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My guilty pleasure is</span></strong><span class=\"s3\">&#8230; Reese’s White Chocolate Ghosts.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">I would like to travel to</span></strong><span class=\"s3\">&#8230; England, Scotland and Wales and visit the film locations of all the PBS mystery and detective series that I love.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">I always tell people to visit Doylestown because</span></strong><span class=\"s3\">&#8230; it has wonderful history and cultural institutions, and it’s a great town to walk around and shop. Of course, I mention the County Theater. Sometimes at night when I’m on Pine Street looking at the lit-up Mercer and Michener Museums I just think… what a wonderful town. And I live here.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">When I learned I won the mayoral election</span></strong><span class=\"s3\">&#8230; I experienced a sense of relief and accomplishment.<span class=\"Apple-converted-space\">  </span>And then I experienced awe at the change in my responsibilities from Borough Council to Mayor. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">I hope that during my 4-year term</span></strong><span class=\"s3\">&#8230; I am successful at continuing the community outreach and connections established by our prior Mayor(s).<span class=\"Apple-converted-space\">  </span>I also hope to have long-term impact on the future of Doylestown.<span class=\"Apple-converted-space\">  </span>COVID brought about changes in the way the Doylestown retail community has done business and we are already working on making some of the positive changes permanent. We are also embarking on a new Comprehensive Plan for the Borough, and I will be contributing strategic input into the process. And most importantly, I hope to have a lot of fun.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/01/Noni-West.jpg"
}