{
  "id": 17664,
  "title": "Get to Know a Doylestownian: Joe Dubyk",
  "slug": "get-to-know-a-doylestownian-joe-dubyk",
  "date": "2023-06-14T17:18:45",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "Apex R&amp;SM Corp",
    "dana roberts",
    "doylestown cardinal",
    "Joe Dubyk"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer “Get to Know a Doylestownian” is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide; in any way they see fit. This month, we spoke with Joe Dubyk, a Doylestown native and [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><b>By Dana Roberts • </b></span><span class=\"s1\">The Cardinal Contributing Writer</span></p>\n<p class=\"p3\"><span class=\"s3\"><b><i>“Get to Know a Doylestownian” </i>is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide; in any way they see fit. This month, we spoke with Joe Dubyk, a Doylestown native and owner of Apex Roofing &amp; Sheet Metal Corporation, who has a passion for helping those in Ukraine. Joe went on a self-funded service mission to Ukraine in February and March and is returning in May for two months to volunteer in various areas of the country. Read on to learn about what Joe’s experience was like and how you can help. Find Joe on Instagram @joedubyk, on Facebook by searching “Apex R&amp;SM Corp”, or via his website, <a href=\"http://apexroofexperts.com\" target=\"_blank\" rel=\"noopener noreferrer\">apexroofexperts.com</a>.<span class=\"Apple-converted-space\"> </span></b></span></p>\n<p class=\"p1\"><b>I have lived in the Doylestown area for… </b>37 years, aside from a summer in Columbus, Ohio, and a few months in Kyiv, Ukraine. I went to Buckingham Elementary, Holicong Middle School, and graduated from C.B. East.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>I decided to go to Ukraine for six weeks this spring because… </b>I could not stand to see Ukraine endure daily atrocities without doing something. At first, I thought I would go when Ukraine was liberated, but it became apparent that I had to go now.</p>\n<p class=\"p1\"><b>My trip was coordinated through… </b>I did most of the coordination myself, but I was able to give four drones to the Front Line Kitchen, which is a volunteer group based in Lyviv. They cook dehydrated meals daily for soldiers on the front lines, and ship food and supplies out East where the fighting occurs. I joined a Ukranian-led group in Kyiv, “Brave to Rebuild.” Every weekend and some days during the week, a group of 40-50 volunteers, primarily young Ukrainian men and women, clean up, fix, and help restore parts of the Kyiv oblast that were occupied or where intense battles took place.</p>\n<p class=\"p1\"><b>While there, I spent time in… </b>Lyviv, the largest city in<span class=\"Apple-converted-space\">  </span>Western Ukraine, Kyiv, the capital, and various cities on the outskirts of Kyiv: Irpin, Hostomel, Bucha, and Horenka.</p>\n<p class=\"p1\"><b>The volunteer effort I was a part of included… </b>The most significant effort was delivering Mavic 3 drones. Drones save lives and give the Ukrainians a significant advantage on the battlefield against the invaders. I still fundraise for drones, and I will continue to do so until the war is over. Soldiers I met were very, very appreciative of my efforts to deliver drones. I also did whatever Brave to Rebuild needed help with, which was usually cleaning up damage from Russian military strikes.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>The most amazing thing I saw there was… </b>the sheer number of foreign volunteers and Ukrainians doing selfless and heroic acts daily. Every weekend I watched young students and professionals commit their weekends to volunteer. Many have friends and family serving in the military, and almost half of the population now knows someone who was killed. I have seen foreign and local volunteers put themselves in dangerous situations to deliver aid to people they don’t know and never met before.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>The most devastating thing I saw there was…</b>Waking up to air raids almost regularly and reading that some of the missiles or drones Russia sent had killed a family or children. Russia attacks civilians on purpose every day. Also, knowing what my friends endure, grappling with family members who are currently fighting in the hottest spots of the war. I could not imagine what it is like to go to bed every night with that type of worry.</p>\n<p class=\"p1\"><b>Following my time there, I would say that Ukraine is… </b>An amiable and intelligent country. Three-quarters of the younger population is college-educated. They know their standing in the world. They understand their low salaries and that their government has been plagued with corruption. Despite that, the young people reject the Soviet way of life and want a free, capitalist society where hard work and uniqueness are celebrated. I see a country that will prevail, and a generation of young people who will have gone through the same sacrifices our World War 2 generation did. I am incredibly hopeful for their future and hope to be a part of it.</p>\n<p class=\"p1\"><b>If you want to help Ukrainians, one of the best ways I’ve found you can make an impact is…</b>Drones, drones, drones!!! www.buymeacoffee.com/joedubyk. I run fundraisers for drones and will go back to Kyiv in May. I use 100% of the proceeds for drones. Not my travel, food, or apartment. 100% of the money goes to drones and then I bring the drones directly to the front lines!</p>\n<p class=\"p1\"><b>The most powerful thing I experienced while there was… </b>Seeing grown men and women tear up when I explained that I was an American volunteer. They could not believe people so far away could care about their plight. That hit home and made me want to continue to help Ukraine. It made me realize that the reason for waking up every day shouldn’t be just for myself, but for my community, the betterment of the country, and of course, the world.</p>\n<p class=\"p1\">You can find Brave to Rebuild at bravetorebuild.in.ua.</p>\n<p class=\"p1\"><b>And now, a little bit more about Joe…</b></p>\n<p class=\"p1\"><b>My favorite meal to get in town is… </b>It changes, but right now, I love a good Spuntino’s pie. After a trip to Italy, I’ve been obsessed with Neapolitan-style pizza!</p>\n<p class=\"p1\"><b>I got into metal roofing because… </b>My father was in the business, and I followed in his footsteps. When I was working on 90-degree roofs on super humid days over summer breaks as a high school student, I didn’t want to take that path! But as I got older, I respected the craft and realized there are perks to being a tradesman (even with extreme weather!).</p>\n<p class=\"p1\"><b>The craziest thing that’s happened to me while at work was… </b>I fell off two roofs. Somehow, I got lucky and was fine both times I fell.</p>\n<p class=\"p1\"><b>Something people don’t usually know about roofing is…</b>that water can get into your house because of a number of things, not just due to a roof issue. My biggest pet peeve is heavy wind-driven rain, which causes masonry and other siding materials to leak. Even though the roofs are not leaking, most assume that if there’s water, it’s the roof.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>The three things I can’t live without are… </b>the priceless things in life: 1) My two huskies Murphy, 7, and Natalia, 1. 2) My business partner, Dan Cantarella. I don’t know anyone who works as hard as Dan, and we support each other through non-work issues. 3) Good people, in general. If you search hard enough, you will find many people who constantly give back. Without these kinds of people, I’d have difficulty getting out of bed.</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/06/Joe-Dubyk-on-right-with-glasses-and-business-partner-Dan-Cantarella.jpg"
}