{
  "id": 18525,
  "title": "Giving Thanks for D-Town",
  "slug": "giving-thanks-for-d-town",
  "date": "2023-12-14T16:30:23",
  "author": "Staff",
  "category": [
    "Live",
    "Play"
  ],
  "tags": [
    "brian pultro",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Brian Pultro • The Cardinal Contributing Writer You never know what you have until it’s gone (for a little while).  When I was a young resident of Doylestown and moving through CB West, I could not wait to get out of here. Every university I applied to was at least 1,000 miles away and [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Brian Pultro</strong> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">Y</span><span class=\"s1\">ou never know what you have until it’s gone (for a little while).<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">When I was a young resident of Doylestown and moving through CB West, I could not wait to get out of here. Every university I applied to was at least 1,000 miles away and I yearned to escape the “boring” town I grew up in. So, I did.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">I went to the Deep South to attend Auburn University. Then I was commissioned into the Navy and spent another ten years exploring the world. As the time away from home and the adventures piled up, I began to yearn for the “boring” town I grew up in.</span></p>\n<p class=\"p5\"><span class=\"s1\">Now, I give thanks to Doylestown for preparing me for the adventure of young adulthood in semi-bucolic suburbia that not only pushed me away but also drew me back. D-Town has done so much for me that I wanted to showcase what continues to make this place so magical to this day.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">Thank you, Evolution Candy</span></strong><span class=\"s1\"> (“The Shack” as my kids call it), for always bringing a smile to the faces of my three young boys with your amazing treats and constantly smiling and outgoing customer service.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>Thank you, Domani Star</strong>,</span><span class=\"s1\"> for giving me six years of employment and tough love to prepare me for the real world. Your Bolognese is second to none the world over and every time I have a bowl I am rocketed in a time machine back to 2002.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">Thank you, Travis Manion Foundation</span></strong><span class=\"s1\">, for shining the spotlight on our true heroes, those who serve bravely and silently defending something greater than themselves.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">Thank you Annie’s Water Ice</span></strong><span class=\"s1\"><strong>,</strong> for always allowing me to bring my beloved Basset Hound “Casey” onto your deck for a lovely summer treat.</span></p>\n<p class=\"p5\"><span class=\"s3\">Thank you, County Theater,</span><span class=\"s1\"> for allowing me to relive my childhood on the big screen through your “Hollywood Summer Nights” program and showing my children the classics from years gone by.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>Thank you, Bagel Barrel</strong>,</span><span class=\"s1\"> for adding at least 10 pounds to my waistline over the years by baking the greatest bagel in human history. No single bite of food brings me back home more than my forever faithful ham, egg, and cheese on everything bagel. Your bagel bites keep children, and adults alike, satiated for hours and have even landed me a few bass on the end of a fishing line.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>Thank you, Burpee Park</strong>,</span><span class=\"s1\"> for your towering trees and wonderful playground that is always the highlight of a trip into the center of town for three young boys with boundless energy.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>Thank you, Kenny’s Newsstand</strong>,</span><span class=\"s1\"> for the excitement of waiting in line with friends for hours to have a shot at concert tickets via your old Ticketmaster machine.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>Thank you, Fanny Chapman</strong>, </span><span class=\"s1\">for so many wonderful memories and for allowing the joyous laughter of my children to be the soundtrack of my summers the last three years.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>Thank you, Vitality Fit Kitchen</strong>,</span><span class=\"s1\"> for filling a need in our town by providing healthy prepared meals delivered right to your home for all of those busy families out there.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>Thank you, Mercer Museum</strong>,</span><span class=\"s1\"> for allowing my kids to explore your twisted corners and sled down your perfect-sized hills when a fresh blanket of snow coats the ground.</span></p>\n<p class=\"p6\"><span class=\"s3\"><strong>Finally, thank you to Jess and Dave Ramoy</strong>.</span> A few years ago, they took a leap of faith and moved to our town from Florida. Not only did they fall in love with D-Town, but they brought something back to our community that had been slowly fading away as the digital age took over. <span class=\"s3\">The Doylestown Cardinal </span>has and continues to showcase all of the wonderful things that make D-Town such a magical place to grow up in…and come back to. Thank you for putting print back in our hands and highlighting what makes Doylestown so great.</p>\n<p class=\"p5\"><span class=\"s1\"><strong>Thank you, Doylestown</strong>, for everything you have given and will continue to give in the future. Sometimes you need to move away for a bit to realize exactly what you have here. But, once you get it, there is no better place to call home.</span></p>\n<p class=\"p7\"><i>Brian Pultro is a Doylestown native, Navy Veteran, and local Financial Advisor. His practice is built upon the foundations of “Behavioral Finance” and training individuals and families on how to take natural human emotions out of the investment process.<span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p7\"><i>Reach Brian at Pultro Financial Management,<span class=\"Apple-converted-space\"> </span></i><i>(215) 489-3876, <a href=\"mailto:brian.pultro@LPL.com\">brian.pultro@LPL.com</a></i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/Doylestown.jpg"
}