{
  "id": 12077,
  "title": "Habits are the New Goals",
  "slug": "habits-are-the-new-goals",
  "date": "2022-01-14T15:32:32",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "daid ramoy",
    "doylestown cardinal",
    "new year 2022"
  ],
  "excerpt": "<p>By David Ramoy • The Cardinal Associate Publisher A New Year’s resolution has been the coined phrase over time to tell the world you’re making a change.  ‘This year my resolution is to open that new business, pay off all debt and put 10,000 in savings, write a book, lose 20lbs and get rock solid [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong><span class=\"s1\">By David Ramoy • </span></strong><span class=\"s1\">The Cardinal Associate Publisher</span></p>\n<p class=\"p3\"><span class=\"s3\">A </span><span class=\"s2\">New Year’s resolution has been the coined phrase over time to tell the world you’re making a change.<span class=\"Apple-converted-space\">  </span>‘This year my resolution is to open that new business, pay off all debt and put 10,000 in savings, write a book, lose 20lbs and get rock solid abs’, and the list goes on. Combine these absolutes with some alcohol on New Year’s Eve, and the list of empty promises only grows.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">The reality is, often we fall short of our goals, sometimes miserably, and we end up making the same resolutions the following year. It’s a vicious cycle, yet most of us still fall victim to it time and time again.</span></p>\n<p class=\"p5\"><span class=\"s4\">Not this year! This year we’re going to do things differently. Do you know why? Because science tells us so. According to researchers from Duke University, up to 40% of our behaviors on any given day are driven by habit, not by your goals or determination while watching the ball drop. That’s right, New Year’s goal setting is getting an upgrade in 2022, and its all about the process rather than the end goal. This year we are changing habits.</span></p>\n<p class=\"p6\"><strong><span class=\"s1\">Habits vs Goals</span></strong></p>\n<p class=\"p5\"><span class=\"s2\">Let’s circle back to the opening paragraph about setting a goal to lose 20 lbs and getting rock solid abs. The intention behind this gregarious statement is encouraging, and I’m sure that motivation even pays off while you sweat out all that dopamine on the treadmill.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">However, after the high has worn off and your schedule gets a curveball, a slice of pizza seems way easier to eat then making a healthy meal at home. Eventually your workout routine gets tested even further and you miss a day, then another, and the rest is history.</span></p>\n<p class=\"p5\"><span class=\"s2\">In that same example, had you built up a series of good habits prior to the pizza challenge, or the scheduling mishap, a contingency plan would have already been in place; because training and eating healthy is what you already do. It becomes a part of who you are.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong><span class=\"s1\">Commit to the Minimum<span class=\"Apple-converted-space\"> </span></span></strong></p>\n<p class=\"p5\"><span class=\"s4\">Let’s consider a person who sets a goal to write a book. They decide to write 300 words a day. Writing 300 words generally doesn’t require a ton of effort, assuming it’s an interesting topic to them, and despite all the distractions of life, they can manage to find the time to finish the book. Some days they knock out 500 or 1000 words, but even on the busiest days they stay at their minimum 300 pace, and scratch and claw their way to finish it.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">On the contrary, setting “write a book this year” as a goal would have been overwhelming and intimidating on final word count alone.</span></p>\n<p class=\"p5\"><span class=\"s2\">When you’re trying to lose 20lbs, Instead of setting yourself up for failure each time after you don’t hit your goal in a week, try starting small and do the one minute a day method. Pushups, planks, jumping jacks it doesn’t matter, train for one minute per day, then work your way up. The same goes for eating healthy. Drink one more glass of water a day. Eventually graduate to two and so on.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">How about your finances? The Dave Ramsey method allowed my wife and I to pay off our student loans and credit cards in 18 months! How did we do it? We stuck to the plan of paying the lowest credit card first and then applied that payment to the next one. We didn’t try and knock out the whole shebang<span class=\"Apple-converted-space\">  </span>and then get discouraged. We had to re teach ourselves good financial habits starting with the smallest bill, and not only did it work, it empowered us to stay on track, and avoid that décor item from target or that Starbucks mocha froppa latte.</span></p>\n<p class=\"p6\"><strong><span class=\"s1\">Accountability Partner<span class=\"Apple-converted-space\"> </span></span></strong></p>\n<p class=\"p5\"><span class=\"s2\">I first heard the term “accountability partner” from the book “The morning Miracle” by Hal Elrod. One of the most influential books I’ve ever read, makes creating better habits simple, fun and life changing. Accountability partners can be one person or even multiple individuals who are willing to, you guessed it; hold you accountable! The idea is that, once someone other than yourself knows what you need to do and they are either doing it with you or supporting you in the process. A perfect example is a gym buddy. When you know that your gym buddy is expecting you to train with them that day, you are less inclined to not go. There becomes a sense of responsibility. In mine and my wife’s case, our three-year-old son became our accountability partner. His sports class is at the YMCA which we pay for and he LOVES, and since we are committed to his class, we take the time to get in a good hour workout. Monday gym night became a habit- a part of our routine because of our accountability partner.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong><span class=\"s1\">Boring is the New Winning<span class=\"Apple-converted-space\"> </span></span></strong></p>\n<p class=\"p5\"><span class=\"s2\">If you get to the point where your routine is boring, and the excitement from your avocado salad and workouts have run its course; give yourself a pat on the back because you’re on the right track. Process and habits are not sexy. The successful person that makes his or her high-level job look easy, are the byproducts of their long-term micro habits formed over time, through endless trial and error, to eventually form this thriving individual that everyone looks up to.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">I recently started listening to the audiobook “Will” by Will Smith. He said something in the beginning of the book that gave me chills. When talking about a wall his dad made him and his brother build as a kid, he goes on to say, his biggest lesson from that experience, was that eventually he realized there is no wall, just bricks.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">His job was just to build the perfect brick each time, not to pay attention to the wall in front of him. When he looked at his life from that perspective, he didn’t see the walls anymore only the tasks at hand.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Take the fear and awe out of each situation and just focus on what’s in front of you, start small and work your way up; eventually you may surpass your resolution and not even realize it.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/01/Daily-Habits.jpg"
}