{
  "id": 11567,
  "title": "Happy Thanksgiving . . .“Please Pass the Lasagna”",
  "slug": "happy-thanksgiving-please-pass-the-lasagna",
  "date": "2021-11-08T00:10:40",
  "author": "Staff",
  "category": [
    "Live",
    "Taste"
  ],
  "tags": [
    "altomontes italian market",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Kimberly Cambra  •  Special to The Cardinal Traditions, culture and family beautifully intersect on several corners of this industrious woman’s life, and with the approach of the holidays; she is wildly passionate about the season of celebrations that occur between October to January (her birthday falls around Halloween).  As the mother to two very [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong><span class=\"s1\">By Kimberly Cambra  •  </span><span class=\"s1\">Special to The Cardinal</span></strong></p>\n<p class=\"p3\"><span class=\"s3\">T</span><span class=\"s2\">raditions, culture and family beautifully intersect on several corners of this industrious woman’s life, and with the approach of the holidays; she is wildly passionate about the season of celebrations that occur between October to January (her birthday falls around Halloween).<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">As the mother to two very active school age boys, she is involved in cub scouts, 4 wheeling, BMX motorsport and grass stains much to her delight. Professionally, her role as a business owner/operator is a responsibility lovingly shared with her mother Frances and brother Vincent as proprietors of Altomonte’s Italian Markets (Doylestown and Warminster).<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">So what does it look like when your career and personal life demand excellence in all of these arenas? It looks like a five foot two inch, beautiful fiery Italian-American who happens to be an executive and mother better known as Maria Nappi. Day in and day out, there is literally a FULL plate with Nappi between running her stores, staffing, navigating food costs, keeping the shelves stocked, and there’s also her need to parent and spouse. Know she’s gritty, hardworking, grounded and her self-care approach includes mindfulness and has mastered transcendental meditation.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">This year, the business celebrates its 50th anniversary.<span class=\"Apple-converted-space\">  </span>It opened in 1971 in Germantown as a corner store called Mike’s Meats. Maria’s father, Michael Grispino, grew up in Altomonte, Italy, as a third generation butcher. Eventually, the business grew, and her family relocated to Bucks County in 1982, and the new store was proudly named Altomonte’s.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">One of the many facets of her two stores is the highly regarded reputation of their exceptional catering operation, which customers have come to know and love about Altomonte’s. Their holiday catering menus, especially for Thanksgiving, is a completely prepared meal they champion and often sell out.<span class=\"Apple-converted-space\">  </span>Maria, along with her mother and brother, oversee and ensure the quality of their food from the store to customers’ table; flavorful, delicious and made from scratch. That’s right, scratch, just like Nonna makes! There are no short cuts in the Altomonte’s kitchens. Through her father’s legacy as a butcher, the business has cultivated relationships with all their vendors, especially for their turkeys.</span></p>\n<p class=\"p5\"><span class=\"s2\">Altomonte’s Thanksgiving meals can provide busy couple a delicious dinner for 2 for $59.99.<span class=\"Apple-converted-space\">  </span>The dinner includes: 1.5 pounds of all white meat, roasted and sliced in-house, topped with gravy, 1.5 pounds of real mashed potatoes, 0.75 pounds of candied mashed sweet potatoes, 1 pound of Italian herb stuffing, 0.75 pounds of green beans with almond breadcrumbs and caramelized shallots, half a pint of orange cranberry relish, an extra half pint of gravy on the side, and 2 football rolls.<span class=\"Apple-converted-space\">  </span>Options also include dinner for four and six. The store also offers a full section of a la carte sides priced per pound.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">After the last turkey and pumpkin pie has left the store, Maria goes home to enjoy the fruits of her labor surrounded by those she loves to give thanks. Finally at home she’s able to savor her beloved family and her own turkey dinner.</span></p>\n<p class=\"p5\"><span class=\"s4\">Pass the lasagna? What you will find on the table alongside the cranberry sauce, green beans and stuffing is lasagna, a side dish onto itself. Many Italian-American families enjoy and anticipate knowing that along with all of the traditional fixins, a pan of lasagna is ever-present to round out the comforting familiarity of this old world favorite.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Maria’s pride and joy aside from her two boys is Altomonte’s Italian bakery with its sumptuous selection of cakes, cookies, pastries and pies. What would Thanksgiving be without an assortment of pies on your holiday table?<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">The Doylestown store is home to their in-store pastry shop with a team of talented bakers and pastry chefs alike. Long past the delicious meals and sandwiches made from turkey leftovers, Altomonte’s bakery operates with sprinkled covered talent and produces show stopping themed birthday cakes, yule logs and traditional favorites that taste like Italy at first bite.<span class=\"Apple-converted-space\"> </span></span></p>\n<p>For more info visit <a href=\"https://altomontes.com\" target=\"_blank\" rel=\"noopener noreferrer\">https://altomontes.com</a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/11/Altomontes.jpg"
}