{
  "id": 20010,
  "title": "Indigenous Ingenuities Offers Summer Garden Advice ",
  "slug": "indigenous-ingenuities-offers-summer-garden-advice",
  "date": "2024-07-09T15:08:39",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [],
  "excerpt": "<p>By Dakoda Carlson  &#8211; Cardinal Contributing Writer Have you ever come across a garden with a sign that reads “Indigenous Ingenuities habitat” and wondered what exactly it was? Our friends over at Indigenous Ingenuities are known for their informational approach to planting and prioritizing native species in gardens. They work with an abundance of clients [&hellip;]</p>\n",
  "content": "<p><b>By Dakoda Carlson  &#8211; Cardinal Contributing Writer</b></p>\n<p><span style=\"font-weight: 400;\">Have you ever come across a garden with a sign that reads “Indigenous Ingenuities habitat” and wondered what exactly it was? Our friends over at Indigenous Ingenuities are known for their informational approach to planting and prioritizing native species in gardens. They work with an abundance of clients and handle different needs and requests when it comes to gardens.  </span></p>\n<p><span style=\"font-weight: 400;\">No garden is too big and no garden is too small. The landscaping company does not approach the process behind the end goal of creating long-lasting, beautiful, and beneficial gardens lightly. “All of our projects start with a design, which allows for cohesive, thought-out plans to guide our unique final product,” says owner Matt Benzie. “The first step in the process is scheduling an on-site consultation with our design director, Carl Molter. After the Design phase is complete, the plans can move onto Indigenous Ingenuities outdoor build and/or carpentry branches for implementation proposals.”  </span></p>\n<p><span style=\"font-weight: 400;\">“Many of our clients stay on for routine, chemical-free maintenance with our garden care and restoration branch,” says Executive Assistant Emily Landgreen. </span></p>\n<p><span style=\"font-weight: 400;\">If you’re looking to plant this summer or wondering how to transition your garden from summer to autumn, Indigenous Ingenuities has you covered with tips and tricks to keep your garden thriving.</span></p>\n<p><span style=\"font-weight: 400;\">One of the important factors to consider when planting anything in the summer is choosing plants that can tolerate drought and full sun. “One of the most overlooked issues is the late afternoon sun,” Matt and Emily say.  &#8220;</span><span style=\"font-weight: 400;\">The afternoon sun can be intense, “even for plants that are classified as full sun tolerant.” </span></p>\n<p><span style=\"font-weight: 400;\">Contrary to popular belief, autumn is the ideal time of the year to plant, as opposed to spring. “It can be easy to get caught up in the spring fever when that first 70-degree day hits, but we always encourage our clients to take their time in order to create something lasting and holistic,” Matt says. There are a few factors to consider. “It really depends on the plant, the size, and the amount of time you can devote to watering and caring for the garden,” Emily explains.  </span></p>\n<p><span style=\"font-weight: 400;\">The best thing you can do for your garden is to pay attention to it and be aware of changes. Just like a child, a young garden will need lots of care and nurturing, but once it’s established it will often thrive on its own. Don’t get discouraged if something doesn’t work out, make edits, and be proactive, the company’s advice goes.  </span></p>\n<p><span style=\"font-weight: 400;\">When it comes to transitioning your garden from summer to autumn, Indigenous Ingenuities favor the minimalist approach to gardening. “But that doesn’t mean you have to do it our way,” Matt says. “We focus on habitat which means, the more you leave it alone the more insects and animals you will attract and support. But we are always experimenting and learning and we encourage everyone to do the same.”  </span></p>\n<p><span style=\"font-weight: 400;\">Unsure of what to plant this summer? Consider these seven native plants: </span></p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Switchgrass (Panicum Virgatum)  </span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Little Bluestem (Schizachyrium Scoparium)  </span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Blazing Star (Liatris Spicata)  </span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Clustered Mountain Mint (Pycnanthemum Muticum)  </span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Spotted Bee Balm (Monarda Punctata) </span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Butterfly Weed (Asclépias Tuberosa) </span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Nodding Onion (Allium Cernuum)  </span></li>\n</ul>\n<p><span style=\"font-weight: 400;\">Adding a few of these native plants will help support pollinators while creating habitats and resources for insects and birds.  </span></p>\n<p><span style=\"font-weight: 400;\">Indigenous Ingenuities is a Landscape Design company based in Doylestown PA. In addition to the amazing landscape design they provide, the business also has a carpentry, outdoor build and garden care and maintenance branches. For more information, visit <a href=\"https://www.ind-ing.com/\" target=\"_blank\" rel=\"noopener noreferrer\">ind-ing.com</a> or call 267-279-9633. </span></p>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/07/Indiginous-Ingenuities.png"
}