{
  "id": 12383,
  "title": "Keep Calm &#038; Garden On",
  "slug": "keep-calm-garden-on",
  "date": "2022-03-01T22:11:38",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "Bucks Country Garden",
    "doylestown cardinal",
    "garden centers",
    "nicole toro"
  ],
  "excerpt": "<p>By Nicole Toro • Special To The Cardinal It has become obvious to Garden Centers everywhere, the trending desire to bring nature into our homes is growing at a rapid pace. Visual stimulation from plants induces a physiological response that promotes overall well-being not only mentally but physically.  The bodies’ response to visual happiness, “A.K.A. [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Nicole Toro • </b>Special To The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">I</span><span class=\"s3\">t has become obvious to Garden Centers everywhere, the trending desire to bring nature into our homes is growing at a rapid pace. Visual stimulation from plants induces a physiological response that promotes overall well-being not only mentally but physically.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The bodies’ response to visual happiness, “A.K.A. plants”, releases endorphins helping to decrease mental fatigue, blood pressure, and stress, all while increasing our mental attentiveness and feelings of happiness. This means, by simply increasing the diversity in plant ownership in your home, office, or backyard, we become not only happier, but healthier.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">With our increasingly demanding schedules, finding the time to expose ourselves to the outdoors can be challenging. Fortunately for plant parents, the inclusion of indoor plants mimics the mind’s response that occurs while outdoors. Tropical foliage, such as Monstera and Philodendrons satisfy the need for visual stimulus provided by our deciduous outdoor plants during the summer.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Brilliant blooms of Cyclamen and Orchids paint our coffee tables, kitchens, and bathrooms by enhancing and enlightening our senses. Did you know most houseplants are considered tropical and help clean the air? Sounds healthy!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">The natural need to connect with our environments should not limited to our experiences outdoors but<span class=\"Apple-converted-space\">  </span>expanded to our atmosphere indoors.<span class=\"Apple-converted-space\">  </span>Lots of gardeners today have prioritized growing with a newfound level of the desire for “self-sufficiency”. An overwhelming interest in food crops has increased the demand for seed starting supplies.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">Exciting as it is rewarding, starting seeds indoors to be transplanted outdoors in the Spring, has grown tremendously in popularity. The non-houseplant consumer has shifted to become an avid indoor food producer, starting in the early weeks of March.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">This shift in interest is also paired with the need for spatial availability and becoming popular for tenure and new age gardeners alike. From our narrow windowsills to our modest urban balconies, even our large suburban backyards; pairing our favorite colors and styles has become a new form of self-expression in our spaces.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Container gardens have become a new way of presenting our aesthetic creativity and efficiency in our homes. Mediterranean inspired clays, bold glazes, even risky slogans haven’t fallen short of the newfound decor in our comfortable spaces.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">So, the question remains, how will you get started? Whether you find interest in growing food, colorful blooms, or tremendous sized tropicals, finding your connection to plants is easy. Human’s desire to connect to the environment is built into our psychology and no space is too small to limit your experience.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Get to Bucks Country Gardens and find the answer to what’s calling to you. Your mind, body, and doctor will thank you.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><i>Nicole Toro is a Nursery Sales and Horticulture Specialist at Bucks Country Gardens in Doylestown. Visit <a href=\"http://www.buckscountrygardens.com\" target=\"_blank\" rel=\"noopener noreferrer\">http://www.buckscountrygardens.com</a></i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/03/Garden-pic.jpg"
}