{
  "id": 17000,
  "title": "Kindness Korner: An Interview with Michael Hutkin",
  "slug": "kindness-korner-an-interview-with-michael-hutkin",
  "date": "2023-03-06T18:03:56",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "Central Bucks School District Transportation DepartmentEdie Weinstein",
    "doylestown cardinal",
    "Michael Hutkin"
  ],
  "excerpt": "<p>By Edie Weinstein • The Cardinal Contributing Writer Food offers nourishment for the body, as well as the soul. A local kindness maven, Michael Hutkin, feeds people’s hearts while generously donating time and money to nourish employees at Doylestown Hospital and drivers and staff at the Central Bucks School District Transportation Department. “Those who work [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Edie Weinstein • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">F</span><span class=\"s3\">ood offers nourishment for the body, as well as the soul. A local kindness maven, Michael Hutkin, feeds people’s hearts while generously donating time and money to nourish employees at Doylestown Hospital and drivers and staff at the Central Bucks School District Transportation Department.</span></p>\n<p class=\"p5\"><span class=\"s1\">“Those who work at<span class=\"Apple-converted-space\">  </span>Doylestown Hospital were viewed as heroes throughout the pandemic,” Hutkin says. The people who make sure students get to and from school safely are also essential workers to be lauded, he believes. And so, he and Rafaa Habib of Bocelli’s in Doylestown, joined forces to bring cheer to these professionals who may feel taken for granted.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Hutkin also teamed up with Jeannie Kim from Nothing Bundt Cakes in Warrington and Victoria Kita Bak, owner of Sweet Victory Gluheroicten Free and Dairy Treats in Dublin. They work together to sweeten the lives of those doing<span class=\"Apple-converted-space\">  </span>acts.“Kindness is treating people gently and compassionately in a way you would like to be treated yourself,” Hurkin says. “I know a lot of ordinary people, but they are heroes because of how they treat people.”</span></p>\n<p class=\"p5\"><span class=\"s1\">Kindness came naturally to this modest man, “I did a kind th</span><span class=\"s4\">ing when I was 11 or 12 and I gave away a big blue and white navy scarf that my mom had just made for me. It was windy and cold, and I wanted the mail carrier to have it,” Hutkin recalls. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">His mother had a mahjong group that played for 50 years, and its members would talk about how sweet he was. He thought of these women as his other mothers who treated him like their own son. They called him “mensch,” a Yiddish word that translates to “a person who can be relied on to act with honor and integrity.” But the term means more than that: it also suggests someone who is kind and considerate. Hutkin liked the feeling so he wanted to do more good deeds.</span></p>\n<p class=\"p5\"><span class=\"s1\">His actively practicing Jewish parents modeled kindness to Hutkin. “Part of it was being raised Jewish,” he says. “Christmas was the loneliest day of the year for me since my Christian friends didn’t think to invite me over. My parents weren’t home because they were volunteering at Lower Bucks Hospital so Christian volunteers could have the day off.”</span></p>\n<p class=\"p5\"><span class=\"s1\">Today, for Hutkin, kindness is personal. He takes some of his personal money to donate to the causes he finds valuable to people. “With the pandemic happening, there are bakeries and franchise owners who are struggling to keep their businesses going,” Hutkin says. “I love cake and wondered how to help.” And he did. Hutkin bought Bundt cakes for people who worked at the vaccination center in Perkasie to give them a sweet treat.</span></p>\n<p class=\"p5\"><span class=\"s1\">Hutkin encourages people to be kind every day. “It’s more important to have a kind thought than to give a gift,” he says. “When I wave, I want everybody to wave back.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">And so, if you happen to see Michael Hutkin in town, please be sure to wave back.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><i>Edie Weinstein, MSW, LSW is a licensed social worker, psychotherapist, interfaith minister, journalist, speaker, PR and marketing professional and the grandmother of two wonderful children, who we are teaching to be kind.</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/03/michaelhutkin.jpg"
}