{
  "id": 17909,
  "title": "Kindness Korner: The Learning Experience &#8211; Generous Hearts Doing Good",
  "slug": "kindness-korner-the-learning-experience-generous-hearts-doing-good",
  "date": "2023-08-05T21:50:26",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "Edie Weinstein"
  ],
  "excerpt": "<p>By Edie Weinstein • The Cardinal Contributing Writer The office of the Learning Experience in Doylestown is filled with educators whose joy is to help guide the next generation. Jennifer Eckfield is the owner, Samantha Williams is the director, Nicole Graham and Noelle Kreicz are the regional managers, Jen Murray is the senior VP-East Coast, [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Edie Weinstein</strong> </em>• The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">T</span><span class=\"s1\">he office of the Learning Experience in Doylestown is filled with educators whose joy is to help guide the next generation. Jennifer Eckfield is the owner, Samantha Williams is the director, Nicole Graham and Noelle Kreicz are the regional managers, Jen Murray is the senior VP-East Coast, and Brad Wahl is the Chief Branding Officer, to whom his coworkers refer as the “Mayor of Happyville.”</span></p>\n<p class=\"p5\"><span class=\"s1\">Decked out in a rainbow array of colors, the group celebrated a big day. The childcare community of families raised over $12,000 in donations for The Make A Wish Foundation, an organization that grants wishes for children between the ages of 2 ½ and 18 at the time of their referral diagnosed with a critical illness. According to Joanna Kim, the representative from Make A Wish, who joined the celebrants, their goal is “making the impossible possible.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Because of this monumental feat, Bubbles and Brayden, the school’s mascots visited the children who were excited and “lost their minds. They spent the entire day chanting “We are TLE”! Lots of hugs and high fives,” Eckfield said. “The generosity and kindness in our TLE Doylestown village, and those that live in our community, is a reminder of all the good people can and do in the world. We were able to grant two wishes for children battling life threatening medical conditions. Next year we will strive to grant four wishes; $20,000. We always stay humble, and I remind myself that my worst day is probably someone’s best day, be thankful for the people that surround you. We can do great things to change the world, one act of kindness at a time.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The Learning Experience is a wonderland for early learners. The preschool incorporates a curriculum called L.E.A.P.) which uses “fun, hands-on activities throughout early education to help children develop intellectually, socially, and cognitively.” The focus zooms on kindness and compassion for others. Countrywide, the school system educates 48,000 children.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">According to Murray, each child “learns how to be a good human.” This has a ripple effect that spreads beyond the walls of the school. The influence is far reaching as the school has a YouTube channel available to the public. It is called Bubbles and Friends, and is both educational and fun for early learners.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Wahl (a.k.a. The Mayor of Happyville), shares, “The intention is to make a positive difference in the lives of our children and their families in the community.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Eckfield adds, “Just a reminder that no matter how big or small you are you can change someone’s world with just one act of love and kindness. Be a good human.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><i>Edie Weinstein, MSW, LSW is a licensed social worker, psychotherapist, interfaith minister, journalist, speaker, PR, and marketing professional. She is also the grandmother of two wonderful children, whom she is teaching to be kind.</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/08/IMG_9991-e1691286618321.jpg"
}