{
  "id": 17321,
  "title": "Kindness Korner: Interview with Thomas Brunt",
  "slug": "kindness-korner-interview-with-thomas-brunt",
  "date": "2023-04-12T14:29:44",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "Edie Weinstein",
    "Thomas Brunt"
  ],
  "excerpt": "<p>By Edie Weinstein • The Cardinal Contributing Writer In Kindness Korner we want to hear about random acts of kindness you’ve experienced recently. This can be acts from a stranger, a business owner or employee, a teacher, a child . . . anyone. Send your story to jess@doylestowncardinal.com. Please include a picture of the kind [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Edie Weinstein • </b>The Cardinal Contributing Writer</p>\n<p class=\"p1\"><em><span class=\"s1\">I</span><span class=\"s1\">n Kindness Korner we want to hear about random acts of kindness you’ve experienced recently. This can be acts from a stranger, a business owner or employee, a teacher, a child . . . anyone. Send your story to jess@doylestowncardinal.com. Please include a picture of the kind person if possible (with their permission).<span class=\"Apple-converted-space\"> </span></span></em></p>\n<p class=\"p1\"><b>Q: How would you describe what you do?</b></p>\n<p class=\"p3\"><span class=\"s1\">A: For my entire career, I have worked in many aspects of video production, mostly in remote sports broadcasting. I did everything from camerawork to editing, to technical engineering, nationwide and internationally. Recently, I decided to go back to my roots in local production. I use my creative and technical skills to help clients with video-related technology.</span></p>\n<p class=\"p1\"><b>Q: You are a Doylestown native. What keeps you anchored to this community?</b></p>\n<p class=\"p3\"><span class=\"s1\">A: Over the years, I helped cover many parts of the community &#8211; local politicians, artists, organizations, and events. Being exposed to so much of what goes on in this community &#8211; and to the people doing it &#8211;<span class=\"Apple-converted-space\">  </span>had a big effect on me.<span class=\"Apple-converted-space\">  </span>Through that, I became fascinated with Doylestown’s history and began studying it. It really is amazing just how much Doylestown has contributed to our region, nation, and even internationally. It’s very unique in that way.</span></p>\n<p class=\"p1\"><b>Q: What drew you to photojournalism?</b></p>\n<p class=\"p3\"><span class=\"s1\">A: It all started with the local cable company in Doylestown. “HomeVue Cable TV” had a local studio. In 1985, I was 16 and I saw an ad looking for high school volunteers. I have already had a strong interest in electronics and technology. I met the staff and they showed me around. I felt so intimidated by all the complicated-looking equipment that I almost walked out. But I didn’t, and soon found out it was my calling.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>Q: You and your video camera are a perpetual presence at nearly every event that takes place in Doylestown. What do you enjoy most about covering such diverse activities?</b></p>\n<p class=\"p3\"><span class=\"s1\">A: A few things. Being fond of history, I feel strongly about documenting it for future generations. It also feels like a nostalgic throwback to my early career when I would cover some of the same events for cable. Now it’s on Facebook and YouTube. When they are large events with large crowds, I feel the adrenaline rush of traversing the crowds. I love seeing people react to “being on TV.” And I love reading comments under the videos, and seeing lots of views, especially from people who now live elsewhere but love seeing their hometown. I love that.</span></p>\n<p class=\"p1\"><b>Q: What role do you play in Discover Doylestown?</b></p>\n<p class=\"p3\"><span class=\"s1\">A: Currently I am on the main board. We meet monthly and discuss the overall plans of the group. Many events and features in town happen through us. Arts Fest, the hanging flower baskets, tree lighting, and pride festival, among others. There are sub-committees for the bigger events. I am also part of Winterfest and I help to organize tree lighting and holiday-related events. I would say that everyone involved in Discover Doylestown is a “chronic community volunteer.” We do it just for the love of the town, and to do something that people enjoy and enhance the place we all live.</span></p>\n<p class=\"p1\"><b>Q: What does kindness mean to you?</b></p>\n<p class=\"p3\"><span class=\"s1\">A: I think it’s having empathy and understanding of what other people are dealing with. It can be as simple as “treating others as you would like to be treated.”</span></p>\n<p class=\"p1\"><b>Q: Please share your favorite ways of spreading kindness.</b></p>\n<p class=\"p3\"><span class=\"s1\">A: For myself, I seem to gravitate toward people who have a harder time. Since I have become involved in homelessness issues, I started by just simply acknowledging them as fellow human beings deserving of the same dignity we expect. I learned about “blessing bags” and would give some out in my travels. I would make sure to ask them their names. Seemingly little acts like that can mean a lot to a person who feels ignored much of the time.</span></p>\n<p class=\"p5\"><i>Edie Weinstein, MSW, LSW is a licensed social worker, psychotherapist, interfaith minister, journalist, speaker, PR, and marketing professional. She is also the grandmother of two wonderful children, whom she is teaching to be kind.</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/IMG_1441.jpeg"
}