{
  "id": 13688,
  "title": "Local Spotlight with Danielle: Buckingham Winery",
  "slug": "local-spotlight-with-danielle-buckingham-winery",
  "date": "2022-06-14T16:20:45",
  "author": "Staff",
  "category": [
    "Live",
    "Taste"
  ],
  "tags": [
    "Buckingham Winery",
    "Danielle Gannon",
    "Jerry Forest"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer In the sixties, Jerry Forest was a college student at the University of Pennsylvania (Penn) and a hippie at heart. He would strum guitar with his college buddy, sipping wine, and say, “We should do this one day!” So in 1966, they cruised up to Bucks County [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Danielle Gannon • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">I</span><span class=\"s1\">n the sixties, Jerry Forest was a college student at the University of Pennsylvania (Penn) and a hippie at heart. He would strum guitar with his college buddy, sipping wine, and say, “We should do this one day!” So in 1966, they cruised up to Bucks County and purchased five acres right on Durham Road (413) in Buckingham, Pa.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">They started planting grapes. Thirty-seven different varieties of grapes were planted from 1966-to 1980. Many didn’t make it, and a handful did. It was a learning process. Through this learning process, a lot of money was lost. Jerry believed in his vision for the vineyard, and so to keep it sustaining, he wore a variety of hats. He was head of advertising at The Bucks County Courier Times during the week, a groundskeeper and real estate salesman on the weekends.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">In 1980, Jerry bought his buddy out, and Kathy, his wife, became his partner.<span class=\"Apple-converted-space\">  </span>Kathy was mothering their children and building a winery. Jerry credits Kathy as being the “official winemaker”.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Their three sons, Kevin, Chris, and Jonathan, now live on and around the property. In addition to running all aspects of the winery, the sons also wear many hats. One is an artist who sculpts beautiful pieces of art, one works in IT and builds 3-D printing machines, and the third works as a local township supervisor and a local state constable. “The biggest testament I have is my family. We all live here and work the business,” “It doesn’t get much better than that!” states Forest.</span></p>\n<p class=\"p5\"><span class=\"s1\">The winery produces a couple hundred thousand bottles of wine a year. They make fruit wines, reds, whites, and sparkling wines. When asked what Jerry’s favorite was, he admits his taste buds have changed over the years&#8230; but right now, he’s into the sparkling!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Buckingham Valley is a part of the Bucks County Wine Trail. This is a local non-profit started in 2004 to support each other. The trail comprises seven member wineries: Bishop Estate Vineyard and Winery, Buckingham Valley Vineyards, Crossing Vineyards and Winery, Rose Bank Winery, Rushland Ridge Vineyard &amp; Winery, Sand Castle Winery, and Vino By Zzino. You can visit their site for event updates and more: <a href=\"http://www.buckscountywinetrail.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.buckscountywinetrail.com</a></span></p>\n<p class=\"p5\"><span class=\"s1\">In speaking with Jerry, one thing was crystal clear. He loves his family. He knows that family is everything, and without them, he wouldn’t be where he is today. He attributes his wife and sons to it all. Kathy is the driving force of the business and the winemaker. Having their three sons working in the family business is all he could ask for.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">“Freedom is the most important thing. Peace of mind and happiness,” says Jerry.</span></p>\n<p class=\"p5\"><span class=\"s1\">The winery now sits on 40 acres. They have a charming little tasting room and some beautiful outdoor space for nice weather. In the cellar, they have more seating and even a private little room for small events. (See @localspotlightwithdanielle on IG for details on Charlotte from Common Road Wine and hosting tastings here)<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">“We love Bucks County; this is paradise,” said Forest.</span></p>\n<p class=\"p5\"><span class=\"s1\">The thing we all love and adore about Bucks County is the LOCAL feel and access. Family run, small mom and pop businesses. Buckingham Valley Vineyards exuded all of that. It’s the American Dream. Work hard, do what you love, and make a little money while doing so. I admire this family and all the perseverance they put forth to get to where they are.</span></p>\n<p class=\"p5\"><span class=\"s1\">This Forest family is sure a force to be reckoned with.</span></p>\n<p class=\"p5\"><span class=\"s1\">Visit their IG @buckinghamvalleyvineyards or <a href=\"http://www.pawinestore.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.pawinestore.com</a> 1521 Durham Road Buckingham, Pa 18912 215.794.7188</span></p>\n<p class=\"p5\"><span class=\"s1\">Tuesday- Saturday 11-5, Sunday 12-5, Closed Monday</span></p>\n<p class=\"p5\"><span class=\"s1\">Cheers!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Danielle Gannon is a local Bucks County entrepreneur. Mom to three, she is an English teacher at RedBarn Homeschool (a local co-op she co-founded), co-owner of Organnons Natural Market and Founder &amp; Managing Director of Local Spotlight with Danielle. Her passion is connecting people and creating community. She graduated with a degree in Journalism from Penn State University, went into real estate and sales, then business ownership. Residing in Ivyland, writing has always been a passion of hers. Find her on IG @localspotlightwithdanielle</i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/06/16DE918D-2909-479E-A485-F2FDD5A5E910.jpg"
}