{
  "id": 17773,
  "title": "Local Spotlight with Danielle: Going Down the Shore",
  "slug": "local-spotlight-with-danielle-going-down-the-shore",
  "date": "2023-06-16T17:04:05",
  "author": "Staff",
  "category": [
    "Fit",
    "Play",
    "Stay",
    "Taste"
  ],
  "tags": [
    "Danielle Gannon",
    "doylestown cardinal",
    "jersey shore"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer From the time I was a little girl, our family vacation was always “down the shore.” That’s where you went in the 80s. Your family rented a house for a week or maybe two, if you were lucky, packed the house up, and took the family. If [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Danielle Gannon • </strong></em>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">F</span><span class=\"s3\">rom the time I was a little girl, our family vacation was always “down the shore.” That’s where you went in the 80s. Your family rented a house for a week or maybe two, if you were lucky, packed the house up, and took the family. If you live in the Bucks, Montgomery, or Delaware County area, the phrase “down the shore”, means South Jersey. From Brigantine to Cape May and everywhere in between.</span></p>\n<p class=\"p5\"><span class=\"s3\">My family always stayed in Strathmere NJ. Strathmere was an old “Fisherman” town back in the day. A small beach town situated in between Ocean City and Sea Isle, it’s two blocks deep and about 18 blocks long. My grandmother used to rent out the front of the old “Twisties” Tavern back in the 60s/70s with her seven children. This became their nostalgic place and this is where they all began taking their children. Now, I, as the children’s child, take my kids there too.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The slogan when I grew up in the 80s for the beach town was, “Where the hell is Strathmere?” It was printed on the back of all the old T-Shirts sold by the original Deauville Inn. My cousins and I would get new T-shirts every year and wear them with pride. In the ’80s/’90s, as a child, I wanted to be in a town with a boardwalk… like where all my friends and family were taking them. You know, with rides, pizza, ice cream, and games. I would look at my parents, aunts &amp; uncles as they sat peacefully on the beach with a favorite beverage in hand, no beach tags needed, and wonder… why don’t they want to stay in Ocean City, Sea Isle, or Wildwood like all of my friends? Don’t they like having fun?<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Strathmere consisted of five restaurants: Uncle Bill’s Pancake House, Twistie’s Tavern, The Deauville Inn, Mildreds, and La Fontana. No ice cream or pizza shops. There was one playground in the center of town, back by the bay. My favorite memories are of my parents renting a house for two weeks, and all of my aunts, uncles, and cousins renting for the same two weeks on the same block or one over. We all met every day on the beach, drug down the wagons popped up the umbrellas, fought the wind on the walk down with our boogie boards, and sat down on our beach chairs. We would sit there from 10 am &#8211; 5 pm. Coolers filled &amp; sandwiches packed, we were there for the day.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">At the high point, there were seven houses rented, 17 cousins and 14 adults. The parents were over at Deauville Wing night Tuesday nights for all-you-could-eat wings and Coors light beer ( with a reusable Let’s get winged mug ) and the kids were making movies in the houses using an old tripod and VHS recorder. We had a blast.</span></p>\n<p class=\"p5\"><span class=\"s3\">One day of the week we were allowed to go to Ocean City. Ocean City is known for its family town reputation, it’s a dry town and very clean. We would start early, and the dads would take us to the water park. We would do the lazy river and slides for two hours, shower, get pizza, and hit the rides at Wonderland Pier.</span></p>\n<p class=\"p5\"><span class=\"s3\">On another day of the trip, we would travel to Wildwood. Wildwood was a little different than OC., it was bigger, had more iron-on decal T-Shirt and airbrush stores and they had a haunted house. This was what we did. We would start out for pizza at the “Hot Spot” then head to the Haunted House and then over to Morey and Mariner’s Piers. I loved the upside-down roller coasters and spinning rock and roll ride.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Sea Isle had a small boardwalk back then that we would go to if it rained one of the days. It wasn’t a “board” walk. It was a paved elevated walk overlooking the beach with some hotels, condos, and shops. They had an arcade, ice cream, candy shop, and a few good souvenir shops. Really, we went to Sea Isle to play mini golf! The obligatory shore excursion… does anyone ever get to the finish of the 18 holes without just throwing your ball in by the end?<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">As I have gotten older, I can appreciate the shore for everything it is. The feeling’s I got when writing this, brought me right back to where I was as a child. You know the smell as you drive over the bridge into the beach town, put the windows down, and BAM… Jersey Shore! Nothing like it.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The sounds of the boardwalk., the smiles on everyone’s faces, Manco’s pizza, Wawa hoagies, Johnson’s popcorn, Kohr Brother’s soft serve, Italian ice, buckets of French fries, sun-kissed faces and burnt shoulders, surreys and bicycles, beach umbrellas and boogie boards. This is our beach. This is what we call, “The Shore”.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">This summer, I am traveling to Puerto Rico, Florida, Vermont, and of course the Jersey Shore! It wouldn’t be summer if I didn’t get to South Jersey. I love tradition and this tradition has been with my family for generations. One that I am showing my children and one that I hope they continue. Our people in this part of PA are a special kind of people. We like to repeat history. We like where we came from and we are proud of it. Sure, other beaches in the world have crystal clear water, conch shells, and yachts floating… but do they have Soft Pretzels and Hoagies? We like a little Philly down by the beach.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">This summer, try leveling up the Jersey Shore experience by adding a Sea Isle Ice Tea into the mix! Founders of the original bagged ice, Sea Isle Ice collaborated with my friends from Island Podcast and created a canned alcoholic beverage. The passion behind them all is contagious and I just LOVE the story! It goes right along with the passion for Philly, its surrounding suburbs, and the Jersey Shore.</span></p>\n<p class=\"p5\"><span class=\"s3\">You can find me sitting with my toes in the sand, sometime between mid-June and Labor Day, in and around Vincent Street, Strathmere NJ. I’ll be the one with the three kids in tow, Sea Isle ice tea in hand, soaking it all in. Summer is here my friends! Where do you plan to go?</span></p>\n<p class=\"p7\"><i>Danielle Gannon is a local Bucks County entrepreneur. Mom to three, she is co-owner of Organnons Natural Market and Founder &amp; Managing Director of Local Spotlight with Danielle. Her passion is connecting people and creating community. Residing in Ivyland, writing has always been a passion of hers. Find her on IG @localspotlightwithdanielle</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/06/1980sstrathmere.jpg"
}