{
  "id": 17267,
  "title": "Local Realtor Heather Walton Spreads Kindness Through Community Events",
  "slug": "local-realtor-heather-walton-spreads-kindness-through-community-events",
  "date": "2023-04-12T11:58:43",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Style"
  ],
  "tags": [
    "Class-Harlan Real Estate",
    "Edie Weinstein",
    "Heather Walton"
  ],
  "excerpt": "<p>By Edie Weinstein • The Cardinal Contributing Writer “Kindness, to me, means thinking of others before oneself. How can my action or reaction to a situation make a difference in someone else’s day or life?” And that is the attitude Heather Walton puts into everything she does.  A local realtor with Class-Harlan Real Estate in [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Edie Weinstein</strong> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s1\">“Kindness, to me, means thinking of others before oneself. How can my action or reaction to a situation make a difference in someone else’s day or life?” And that is the attitude Heather Walton puts into everything she does.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">A local realtor with Class-Harlan Real Estate in Doylestown, Walton is a true purveyor of kindness. “I am proud to work with a team of people at Class-Harlan who believe, as I do, that sharing our time, our talents, and our treasures with the community will make a difference,” she says. “We have hosted or participated in a variety of events and activities over the years that have no doubt brought smiles to people’s faces, put food on their tables, and warmed their hearts.”</span></p>\n<p class=\"p4\"><span class=\"s1\">Together with her team, Walton organizes food drives, closing drives, music events, and other activities to bring the local community together and help those in need.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">For eight years, Class-Harlan has sponsored the Give-Back Fest, a musical event in Doylestown that benefits the Bucks County Housing Group. Local bands and individual performers from ages 6-80 come together for a great cause. “We ask the performers and attendees to “bring a can if you can” as they come to enjoy the music that will “soothe their soul,” Walton says.<span class=\"Apple-converted-space\">   </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Class-Harlan’s Annual Sock and Mitten Drive run from Mid-November through Mid-January. The office collects winter garments and distributes them to families and individuals in need.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Class-Harlan has also hosted school supply drives in August with the Bucks County Association of Realtors, assisting in filling hundreds of school backpacks for children heading back to school in September.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">One of Class-Harlan’s favorite activities is caroling in Doylestown in December. “We love dressing up, grabbing our bells and lyrics, and strolling the streets, parading through the bars and restaurants spreading holiday cheer,” Walton says. “We’re always sure to get a smile!”</span></p>\n<p class=\"p4\"><span class=\"s1\">Walton is a strong advocate for addiction recovery. “I personally have been driven to raise awareness and remove the stigma of addiction in the community,” she says. “Working with members of the community and county-wide leaders, programs have been put in place over the years to provide education and safe places where one will not be judged, and aid is provided.” <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">The annual “Tree of Hope” event at the Bucks County Courthouse in December is just one of many events where local families gather to remember people who have passed from addiction. They honor those who are living in recovery and recognize the array of resources that are available. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Several years ago, members of several local churches gathered and partnered with the Council of Southeast Pennsylvania and Pro-Act to create the Addiction Awareness Initiative. The purpose of the Initiative remains to provide support, resources, and education to the loved ones of those struggling with addiction. The Council continues this important work every day. Walton says she is proud of having been involved with the Initiative to help this important cause.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">“To me, it is a no-brainer. Kindness can be as simple as a smile, eye contact, words of appreciation, or a generous gesture of some sort that could potentially change the outcome of someone’s day,” Walton shares. “I’ll never forget the day, several years ago, when my mail carrier reminded me of the time when my, then 6-year-old, son chased her down the street with a paper dixie cup filled with water because it was so hot outside. Or the time he gave her an ice pop and sat on the bench on the front porch with her.<span class=\"Apple-converted-space\">  </span>That simple act of kindness on his part carried her through her career as a mail carrier in Doylestown.”</span></p>\n<p class=\"p6\"><i>Edie Weinstein, MSW, LSW is a licensed social worker, psychotherapist, interfaith minister, journalist, speaker, PR and marketing professional and the grandmother of two wonderful children, who we are teaching to be kind.</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/image1.jpeg"
}