{
  "id": 12724,
  "title": "Local Spotlight with Danielle: The Mountains We Climb",
  "slug": "local-spotlight-with-danielle-the-mountains-we-climb",
  "date": "2022-04-12T14:33:25",
  "author": "Staff",
  "category": [
    "Fit"
  ],
  "tags": [
    "bikeworks",
    "brian boger",
    "Danielle Gannon",
    "doylestown cardinal",
    "mountains we climb",
    "pag's pub"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer I walked up to Pag’s Pub on a warm, rainy afternoon to meet the producer of “Mountains We Climb”, Brian Boger, and cyclist Chris Baccash. I had heard about this documentary coming to the County Theatre in Doylestown, and I wanted to learn more. It fascinated me. I [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Danielle Gannon • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">I</span><span class=\"s1\"><span class=\"Apple-converted-space\"> </span>walked up to Pag’s Pub on a warm, rainy afternoon to meet the producer of “Mountains We Climb”, Brian Boger, and cyclist Chris Baccash. I had heard about this documentary coming to the County Theatre in Doylestown, and I wanted to learn more. It fascinated me. I never realized or looked into the world of cycling.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">I went into the meeting with open ears. What is this all about? Who are these two men, and why are they making a documentary about cycling? I sat down outside, and we ordered a round of espressos.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Brian owns Bikeworks, a local bicycle shop in Doylestown Boro, and one in Newtown Boro. Chris, an avid cyclist, is a Drexel undergraduate and currently going for his Master’s in Applied Positive Psychology.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">They were founding team members of the Bike Works/ Fred Beans cycling team, which was created in 2017. This was when they were able to get Bucks County on the map for a recognized cycling team. This cyclist community supports, trains, and rides together.</span></p>\n<p class=\"p5\"><span class=\"s3\">And ride they did! The Bucks County Classic is a huge bike race that many know of locally because it occurs during the Arts Festival, Doylestown’s largest yearly festival, every September. Shops and restaurants are flooded with people. Local artists have tables on the sidewalks, and streets are blocked off to accommodate the crowd. It’s an amazing time to be in Doylestown! During this time, the Bucks County Classic cyclists are flying by, and cheers echo from the streets. It’s a community day, and it feels so good to be a part of it!</span></p>\n<p class=\"p5\"><span class=\"s1\">Brian, a passionate entrepreneur, connected with Ryan Canney, a local Doylestown filmmaker, in mid-2019 and suggested that he should capture the essence of biking on film. Brian wanted to showcase the amazing cyclists of Bucks County that are training on an elite level and crushing competitions like Leadville Colorado, The Bucks County Classic, and more races across the U.S.</span></p>\n<p class=\"p5\"><span class=\"s1\">Ryan agreed… and so they started filming.</span></p>\n<p class=\"p5\"><span class=\"s4\">Chris Baccash was one of the bikers featured in the film. He was a Doylestown native, a graduate of Central Bucks, and avid cyclist.<span class=\"Apple-converted-space\">  </span>Baccash was then diagnosed with brain cancer in late 2019, not long after the Bucks County Classic Pro Cycling Race. On a Sunday, he had what felt like a seizure. Monday, he was diagnosed with a brain tumor, and by Friday, he underwent successful treatment at the University of Pennsylvania.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">“I got my deck reshuffled”, states Baccash.</span></p>\n<p class=\"p5\"><span class=\"s1\">The original focus of the documentary changed from cycling to Chris’s personal journey through cancer treatments, the global pandemic, and training for his next big race (Leadville 100 MTB-104 miles long with over 14,000 feet of elevation gain at altitudes up to 12,600 feet ).<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Chris has an unbelievable character. He is a cyclist with incredible biking stories from all over the U.S. Chris overcame brain surgery and, in my opinion, didn’t miss a beat. Now he’s using all of that to move forward in dedication to a career that will positively impact others.</span></p>\n<p class=\"p5\"><span class=\"s1\">The film was accepted into the Bicycle Film Festival and will be shown at the County Theatre Thursday, April 28th, through Saturday, April 30th.</span></p>\n<p class=\"p5\"><span class=\"s1\">I truly look forward to seeing the film. How wonderful is it to be part of something so magnificent? These men, local Doylestown natives, followed their dreams and look at where it landed them!<span class=\"Apple-converted-space\">  </span>We wrapped the meeting up, and I felt like I had made two new friends. Thanks for the espressos Brian, and Chris, I can’t wait to see what’s next for you.</span></p>\n<p class=\"p5\"><span class=\"s1\">Tickets go on sale in early April. Keep an eye out.</span></p>\n<p class=\"p5\"><span class=\"s1\">You can visit @localspotlightwithdanielle for updates.</span></p>\n<p class=\"p6\"><span class=\"s5\"><i>Danielle Gannon is a local Bucks County entrepreneur. Mom to three, she is an English teacher at RedBarn Homeschool (a local co-op she co-founded), co-owner of Organnons Natural Market and Founder &amp; Managing Director of Local Spotlight with Danielle. Her passion is connecting people and creating community. She graduated with a degree in Journalism from Penn State University, went into real estate and sales, then business ownership. Residing in Ivyland, writing has always been a passion of hers. Find her on IG @localspotlightwithdanielle</i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/04/Bikeworks.jpg"
}