{
  "id": 18519,
  "title": "Local Artist Eternalizes Flowers Through Her Art",
  "slug": "local-artist-eternalizes-flowers-through-her-art",
  "date": "2023-12-14T16:22:22",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "Christina D. Galagarza",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer Every space deserves a piece of artwork to inhabit it, one that makes the people who dwell there smile, one that brings them a certain and specific joy.  Christina D. Galagarza is a master at creating this type of art. Her paintings, which are lush, dreamy, colorful [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Dana Roberts • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">E</span><span class=\"s1\">very space deserves a piece of artwork to inhabit it, one that makes the people who dwell there smile, one that brings them a certain and specific joy.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Christina D. Galagarza is a master at creating this type of art. Her paintings, which are lush, dreamy, colorful renderings of precious photos, are meant to capture the special moments, people, or pets who are imprinted on us forever. Her female-owned-and-operated business, Eternal Flower Paintings, makes artwork for families, specializing in flowers, landscapes, pets, and people with sentimental significance.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Though Eternal Flower Paintings is a more recent venture, Galagarza has never remembered a time when art wasn’t a part of her life. Describing how she came to define herself as an artist, Galagarza says, “I didn’t come into art; art came through me at an early age, and my parents nurtured that.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Galagarza is a Bucks County local, having grown up in Chalfont and graduated from Central Bucks West in 2002. After a semester at Pratt, she transferred to Kutztown and received her Bachelor of Fine Arts, where she began to develop a specific interest in art therapy. This interest manifests in her current full-time position as an activities assistant for special needs children, where she is able to utilize art’s healing power with those under her care.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Her career path has been as dynamic as her paintings: she’s worked as an art assistant to contemporary artists; has worked with wedding photos, in interior design, and for an online wholesale furniture company; and has teamed up with a jeweler, Michelle Pressler.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Galagarza lived in Philadelphia from 2011 to 2021, mainly in the Fishtown neighborhood.</span></p>\n<p class=\"p5\"><span class=\"s1\">Now living again in the home she grew up in, Galagarza finds the same sentimentality in returning to her roots that lives at the core of her art. Her first job at 14 was at Bonnie’s Flowers in Chalfont, and her mom is an experienced gardener. Following the full-circle path her life has taken, flowers have again become a focus of her work.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Though she can paint beautiful keepsakes for families of any subject matter, she is particularly drawn to painting wedding flowers. Galagarza loves weddings and the experience of getting married. She loves creating artwork that is sentimental and a part of a couple’s journey and finds that flowers are emblematic of that.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">In conversation with Galagarza, one gets the sense that they are speaking to a true romantic in the best sense: a person who looks for beauty in all of life’s moments and is able to capture it, and who knows how important it is to honor the precious moments of life.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Those interested in having a painting commissioned by Galagarza typically begin by browsing her work at www.christinagalagarza.com/eternalflowerpaintings. Reference photos are then shared via email, the painting size is determined, a deposit is remitted, and the process of painting begins. The timeline for her paintings varies significantly, and if her clients don’t have a specific deadline, Galagarza offers a 30-to-90-day turnaround time. Galagarza loves to paint in the quiet mornings or during the day.</span></p>\n<p class=\"p5\"><span class=\"s1\">Being an artist and a businessperson offers its own juxtaposition, and Galagarza eloquently summarizes this: “As a woman and an artist, I struggle with calling the thing I love to do most in the world a business. There is always some business thing I want to do that I’m not doing, things I need to learn, and things beyond my reach. Every day, I water some aspect of the business responsibilities. I am learning how to manage finances and create marketing and promotions, which can take a lot of time away from the artmaking, but over time, as I strengthen my business acumen, I know I’ll get that time back to paint more sentimental artwork for people to share with their families for generations to come. That is my motivation and my brightest joy in having a small art business. It always comes back to family and home.”</span></p>\n<p class=\"p5\"><span class=\"s1\">Contact Galagarza directly at <a href=\"mailto:eternalflowerpaintings@gmail.com\">eternalflowerpaintings@gmail.com</a>, or via her website at <a href=\"http://christinagalagarza.com\" target=\"_blank\" rel=\"noopener noreferrer\">christinagalagarza.com</a>, to bring a piece of her art into your life or as a gift to a loved one.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/christina-galagarza.jpg"
}