{
  "id": 15392,
  "title": "Meet Superunknown’s Jason Reed",
  "slug": "meet-superunknowns-jason-reed",
  "date": "2022-10-25T22:53:28",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "Jason Reed"
  ],
  "excerpt": "<p>Tell me a little bit about Superunknown and how you got started.   I started Superunknown in 2018 as a solo acoustic tribute to Chris Cornell. Back then, I did several shows with a Foo Fighters Tribute band called Whit Limo. Ron DiSilvestro, the drummer for White Limo, offered to have his band back me [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>Tell me a little bit about Superunknown and how you got started. <span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p2\"><span class=\"s1\">I started Superunknown in 2018 as a solo acoustic tribute to Chris Cornell. Back then, I did several shows with a Foo Fighters Tribute band called Whit Limo. Ron DiSilvestro, the drummer for White Limo, offered to have his band back me if I ever wanted to expand to a full band version of Superunknown. I took him up on his offer and in February 2019 we did our first full band show.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>Your band is playing at The New Hope Winery on Friday, October 7th. Have you ever played there before?<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p2\"><span class=\"s1\">This is our first time playing the New Hope Winery. We’ve heard great things about this venue from our friends in the Ledbetters so we can’t wait for the show.</span></p>\n<p class=\"p1\"><b>You recently played in Guantanamo Bay on the Fourth of July, how did that gig come about?</b></p>\n<p class=\"p2\"><span class=\"s1\">We started working with Armed Forces Entertainment (AFE) through Degy Entertainment back in 2019. The organization invited us to play at a base in Honduras for their Summer Heatwave tour. AFE’s mission with that tour was to provide live entertainment at as many US Military bases around the world as possible for the Fourth of July. The program stalled out for a couple of summers due to the pandemic, but it resumed this summer. We were invited to play at the Naval base in Guantanamo Bay, Cuba. That show was especially important to me because I served at Gitmo with the Marines 27 years ago. It was definitely a surreal experience going back there.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>What are some of your favorite songs to perform live?<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p2\"><span class=\"s1\">My favorite songs to perform live are some of the old songs going back to the Badmotorfinger record. It’s for nostalgic reasons, I guess. That was my entry point for Soundgarden back in 1991. Songs like Outshined and Searching with my Good Eye Closed. I think for most people, we hear a ton of great music over the course of a lifetime but the music we fall in love with in our youth always seems to hold a special place.</span></p>\n<p class=\"p1\"><b>Find more information about the band at: <a href=\"https://www.thesoundgardentribute.com\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.thesoundgardentribute.com</a></b></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/10/Jason-Reed.jpg"
}