{
  "id": 14091,
  "title": "Music and Titanic History Roll On",
  "slug": "music-and-titanic-history-roll-on",
  "date": "2022-07-13T16:21:26",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "David Nonini",
    "doylestown cardinal",
    "jamie stem"
  ],
  "excerpt": "<p>By Jamie Stem • The Cardinal Contributing Writer Tell us about David Nonini and your music? Well I’m a Doylestown native, born and raised. Music has fascinated me all my life. Growing up I listened to the music my parents were in to, so there was a lot of bands from the 60s and 70s, [&hellip;]</p>\n",
  "content": "<p><strong>By Jamie Stem • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p1\"><strong>Tell us about David Nonini and your music?</strong></p>\n<p class=\"p2\"><span class=\"s1\">Well I’m a Doylestown native, born and raised. Music has fascinated me all my life. Growing up I listened to the music my parents were in to, so there was a lot of bands from the 60s and 70s, especially Jethro Tull. It wasn’t until I discovered The Beatles when I was eight that I became interested in actually playing an instrument. I’ve been part of the local music scene for the better part of ten years now. I was the host of the open mic at Puck for six years until the beginning of 2019. I’ve performed in a number of acts over the years: the Nirvana-tribute “Floyd &amp; The Barbers”, Beatles tribute “Mean Mr. Mustard’s Revue”, The Greg Sover Band, Daylight Evolution, and Rose Salamone.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Where will you be performing this summer?</strong></p>\n<p class=\"p2\"><span class=\"s2\">You’ll find me throughout Doylestown this summer. I have a monthly engagement at HopsScotch on the first Saturday of every month. I also have shows coming up Maxwell’s On Main, Penn Taproom, and Villa Capri, and you can find out about these shows through my Facebook music page &#8211; <a href=\"http://facebook.com/DaveNoniniMusic\" target=\"_blank\" rel=\"noopener noreferrer\">facebook.com/DaveNoniniMusic</a></span></p>\n<p class=\"p1\"><strong>I hear you are a Titanic history buff and have worked on Mystery Science Theater 3000. Tell us a little bit about that.</strong></p>\n<p class=\"p2\"><span class=\"s2\">I worked on the newest season, number 13, of MST3K and it has been the thrill of a lifetime. Having been a fan growing up, working as a transcriptionist in the writer’s room and getting to watch the creative process has been a joy and one of my favorite experiences thus far. I think everyone is going to love what’s coming down the pipeline.</span></p>\n<p class=\"p2\"><span class=\"s2\">As for the Titanic, I’ve always found history fascinating, but there’s something about her story<span class=\"Apple-converted-space\">  </span>that has captivated me for almost three decades now. I could talk your ear off on the subject if you have a spare five hours. I recently fulfilled a life-long dream this year when my first article on the subject was published in the journal of the Titanic Historical Society, an<span class=\"Apple-converted-space\">  </span>organization founded in 1963 to continue preserving the memory of the ship and the people who built, crewed, and sailed on her.</span></p>\n<p class=\"p1\"><strong>What’s your favorite part about being a musician?</strong></p>\n<p class=\"p2\"><span class=\"s2\">It’s hard to narrow it down to one single thing because it’s a combination of many different things that keeps me playing. From just the playing part, there’s a satisfaction that comes from being able to pick up an instrument and play through something, when that seemingly simple thing now once seemed so daunting that you let it sit behind the door for years.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">There’s also the connection between the performer and the audience, which in the best situations can feed off each other to create this amazing electric energy that is hard to describe but is one of the best feelings in the world. And this is coming from someone who has great stage fright! But if you never face your fears and take chances, you’ll always wonder what could have been.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/07/David-Nonini.jpg"
}