{
  "id": 13703,
  "title": "Musical Chemistry in Two Rocks Rye",
  "slug": "musical-chemistry-in-two-rocks-rye",
  "date": "2022-06-14T16:31:07",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "two rocks rye"
  ],
  "excerpt": "<p>Tell us about Two Rocks Rye and your music? Two Rocks Rye is an alternative rock band formed by Ben Smith and Matt Walters back in 2015 when they discovered the musical chemistry between them.  It started out as an acoustic duo attending open mics to test their chops but soon began booking gigs at [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>Tell us about Two Rocks Rye and your music?</strong></p>\n<p class=\"p2\"><span class=\"s1\">Two Rocks Rye is an alternative rock band formed by Ben Smith and Matt Walters back in 2015 when they discovered the musical chemistry between them.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">It started out as an acoustic duo attending open mics to test their chops but soon began booking gigs at small bars and clubs, where eventually they met the drummer, Brian Shaw, and the bassist, Brendan Cassidy, within the local music community.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">Right away, the foursome clicked and started recording their own music and released their debut album, Saving Claire, in 2018. The band continues to record and release new music while playing a few times a month in the tri-state area.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Tell us about your music career?</strong></p>\n<p class=\"p2\"><span class=\"s1\">Ben Smith, the New Zealand American, was in a band back in Wellington. But for the rest of us, this is the first “invested” band we’ve been in.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Describe your favorite and least favorite part about being a musician?</strong></p>\n<p class=\"p2\"><span class=\"s2\">Let’s start with the least favorite part: Promoting shows and being on social media platforms. There are better ways time can be spent.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s3\">Favorite part: at least once per year, we all getaway to the river house and spend four days writing, jamming, and recording new music. Zero distractions with great company and peaceful views is a great recipe for something good. We also love playing live shows.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Tell us about your favorite performance of your career?</strong></p>\n<p class=\"p2\"><span class=\"s1\">It would have to be in October of 2019 at Geronimo Brewing here in Doylestown. We had just played a live acoustic set at Radio 104.5fm the week before during the Live at 5 segment so that we could promote it in a big way with the power of radio.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s4\">Geronimo brewing is very small and intimate, but it was such a good turnout. They ran out of seats, so people were sitting on the floor, standing in the back, even tucking into the entryway door just to hear us play. We played maybe two or three hours and got such a great response. After the show, Ben wrote a riff called Geronimo, and it is now a song that we play live and will be on the upcoming album due out this year. So, you never know where you and going to be inspired.<span class=\"Apple-converted-space\"> </span><i> </i><span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/06/Ben-and-Matt.jpg"
}