{
  "id": 11604,
  "title": "Neshaminy Creek Brewing Opens Taproom in Old Service Station in Dublin",
  "slug": "neshaminy-creek-brewing-opens-taproom-in-old-service-station-in-dublin",
  "date": "2021-11-13T12:06:05",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Dublin Town Center",
    "jenna ball",
    "Neshaminy Creek Brewing"
  ],
  "excerpt": "<p>Neshaminy Creek Brewing announced the opening of their third taproom in Dublin, PA. “Neshaminy Creek at The Station” opened in October and is located at 139 North Main Street. Their new location will be a part of what is called, The Station, located at 139 N. Main Street, Dublin, PA.  The Station is an offshoot [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">N</span><span class=\"s2\">eshaminy Creek Brewing announced the opening of their third taproom in Dublin, PA. “Neshaminy Creek at The Station” opened in October and is located at 139 North Main Street.</span></p>\n<p class=\"p3\"><span class=\"s2\">Their new location will be a part of what is called, The Station, located at 139 N. Main Street, Dublin, PA.<span class=\"Apple-converted-space\">  </span>The Station is an offshoot of The Shops at The Square, which is all part of a larger Dublin Town revitalization project – the Dublin Town Center. This project is a fresh and modern take on a “Town Square,” featuring retail shops, dining, and a variety of other vendors.<span class=\"Apple-converted-space\">  </span>The Square also hosts live music and events on the weekends, and is part of an ever expanding retail and entertainment landscape in Upper Bucks County.</span></p>\n<p class=\"p3\"><span class=\"s2\">The new taproom from Neshaminy Creek will sit inside of the old Dublin Service Gas Station, and will feature 12 rotating beers on tap, as well as takeout beer and merchandise available for purchase. There will be other vendors situated alongside Neshaminy Creek inside of The Station, such as Itri Wood Fired Pizza, Juicy’s Burritos, and Nina’s Waffles and Ice Cream.<span class=\"Apple-converted-space\">  </span>Indoor and seasonable outdoor seating will be available for guests, as they are able to explore the shops, and sample the food and beverages offered at this new and exciting destination.</span></p>\n<p class=\"p3\"><span class=\"s2\">“The opening of this new taproom has been a long time coming and is personally exciting for me as someone who grew up five minutes away from Dublin,” says Jenna Ball, CEO and Co-Owner of Neshaminy Creek Brewing Co. “As Bucks County’s first production brewery, we’re always looking for new opportunities to connect with the community and this will be a great venue for that. It’s been a really rewarding partnership with the team behind The Station and we can’t wait to get the doors open and have those taps flowing!”</span></p>\n<p class=\"p3\"><span class=\"s2\">You can follow the brewery’s new taproom on Instagram to continue to stay up to date on all of their growth. For more visit <a href=\"https://neshaminycreekbrewing.com\" target=\"_blank\" rel=\"noopener noreferrer\">https://neshaminycreekbrewing.com</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/11/neshaminycreekthestation.jpg"
}