{
  "id": 19230,
  "title": "NOVA Victim Assistance Celebrates 50 Years of Victim Support",
  "slug": "nova-victim-assistance-celebrates-50-years-of-victim-support",
  "date": "2024-03-17T21:06:12",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "Danielle Gannon",
    "doylestown cardinal",
    "nova"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer For five decades, NOVA Victim Assistance has been the steadfast beacon of hope and support for individuals navigating the aftermath of trauma and victimization in Bucks County. As NOVA marks its golden anniversary this year, it continues to embody the essence of compassion and resilience, offering unwavering [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Danielle Gannon • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">F</span><span class=\"s1\">or five decades, NOVA Victim Assistance has been the steadfast beacon of hope and support for individuals navigating the aftermath of trauma and victimization in Bucks County.</span></p>\n<p class=\"p5\"><span class=\"s1\">As NOVA marks its golden anniversary this year, it continues to embody the essence of compassion and resilience, offering unwavering assistance to those in need.</span></p>\n<p class=\"p5\"><span class=\"s1\">Founded in 1974 as Women Organized Against Rape (WOAR) the organization continues to still be the only Rape Crisis Center in Bucks County. Over the years, it grew to become NOVA and its mission has remained steadfast: to provide healing, advocacy, and empowerment to victims of crime and trauma, regardless of age, gender, or circumstance.</span></p>\n<p class=\"p5\"><span class=\"s1\">NOVA’s multi-faceted approach encompasses a wide range of services tailored to meet the diverse needs of individuals and families impacted by crime. From crisis intervention and counseling to legal advocacy and community education, NOVA’s dedicated team of professionals works tirelessly to ensure that survivors receive the support and resources they need to heal and rebuild their lives.</span></p>\n<p class=\"p5\"><span class=\"s3\">The 50-year anniversary is not just a milestone of longevity but a testament to the organization’s commitment to serving the Bucks County community. To commemorate the occasion, NOVA is hosting a gala event at Spring Mill Manor on April 19, 6-10 p.m. The gala promises an evening of celebration and reflection, bringing together community members, supporters, and advocates to honor NOVA’s legacy of compassion and resilience. Guests will have the opportunity to hear inspiring stories of survival, connect with fellow advocates, and show their support for NOVA’s vital mission.</span></p>\n<p class=\"p5\"><span class=\"s1\">To sponsor, donate, or attend the GALA, visit: <a href=\"http://novabucks.org/a-starlit-evening\" target=\"_blank\" rel=\"noopener noreferrer\">novabucks.org/a-starlit-evening</a>. To be involved with NOVA in any other capacity, or if you or someone you know needs assistance, you can reach them at 215-343-6543 or the Help Line: 1-800-675-6900.</span></p>\n<p class=\"p5\"><span class=\"s1\">When you know better, you do better. We are Bucks County!</span></p>\n<p class=\"p7\"><i>Danielle Gannon is a local Bucks County entrepreneur. Mom to three, she is co-owner of Organnons Natural Market and Founder &amp; Managing Director of Local Spotlight with Danielle. Her passion is connecting people and creating community. Residing in Ivyland, writing has always been a passion of hers. Find her on IG @localspotlightwithdanielle</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/03/Danielle-Nova-Victim.jpg"
}