{
  "id": 20045,
  "title": "Ordinary Delights : Observations of Everyday Sparks of Happiness",
  "slug": "ordinary-delights",
  "date": "2023-07-13T09:17:49",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [],
  "excerpt": "<p>By Natalya Bucuy, Cardinal Managing Editor  I look up camping sites for the trip. My two teenage sons and I have been planning our first trip of the summer, a weekend adventure in the mountains. We wittily debated about the destinations over group text. It’s been a delight.  Sitting on my front porch, I feel [&hellip;]</p>\n",
  "content": "<p><b>By Natalya Bucuy, Cardinal Managing Editor </b></p>\n<p><span style=\"font-weight: 400;\">I look up camping sites for the trip. My two teenage sons and I have been planning our first trip of the summer, a weekend adventure in the mountains. We wittily debated about the destinations over group text. It’s been a delight. </span></p>\n<p><span style=\"font-weight: 400;\">Sitting on my front porch, I feel the warm sun dance down its high noon rays, playing with shadows, warming the skin. A man in a blue hat walks by. I don’t know him. But it’s a delight to see random people, whether they say hello or just pass by. </span></p>\n<p><span style=\"font-weight: 400;\">I water my garden. I smell honeysuckle in the air as I go for a bike ride. I focus on work for a good amount of time. A delicious sandwich. A really good read. A bonfire. Delights, turns out, are everywhere. </span></p>\n<p><span style=\"font-weight: 400;\">Recently, I discovered “</span><a href=\"https://www.rossgay.net/the-book-of-delights\"><span style=\"font-weight: 400;\">The Book of Delights</span></a><span style=\"font-weight: 400;\">.” Its observant, and sometimes philosophical author, Ross Gay, shares the result of his personal commitment to exploring and writing about everyday delights. His challenge is to do it every day for a year. </span></p>\n<p><span style=\"font-weight: 400;\">Gay takes me with him on a path through simple wonders &#8211; big things and small, from immersing in the joy of writing in a journal by hand to watching an insect turn its head. And then a magical thing happens to me. I catch myself delighting in so many more things, daily. </span></p>\n<p><span style=\"font-weight: 400;\">Having flowers on my desk &#8211; a delight. Watching a bird sitting on a bush &#8211; a delight. The way salty air feels on my face at the beach. My sons’ smiles. The way my friend laughs. The smell in the air when I water tomatoes in the abovementioned garden. My grandpa used to talk about that smell. It was one of his favorites. Or so he said, perhaps, to take on that chore and let my grandma rest. I recently learned that the scent of rain hitting the earth has a name &#8211; petrichor. It was coined by Australian scientists in the 1960s. I think there should be a name for the tomato-watering situation as well. I make a note to work on that. </span></p>\n<p><span style=\"font-weight: 400;\">In “The Book,” Gay puts the “magic” I’ve experienced in simple words. “The more you study delight, the more delight there is to study.” The human brain focuses on whatever we direct it to focus on. If we direct our attention to happy things, our happiness levels improve, regardless of what struggles we face in life.</span></p>\n<p><span style=\"font-weight: 400;\">In fact, the more things to be joyful about we find, the stronger we are when we face whatever difficulties come our way. Not only emotionally, but physically. In The Science of Happiness in Positive Psychology 101</span></p>\n<p><span style=\"font-weight: 400;\">In </span><a href=\"https://positivepsychology.com/happiness/#:~:text=Here%20are%20a%20few%20of,less%20likely%20to%20get%20sick.\"><span style=\"font-weight: 400;\">The Science of Happiness in Positive Psychology</span></a><span style=\"font-weight: 400;\">, psychologist </span><a href=\"https://positivepsychology.com/team/nicole-celestine/\"><span style=\"font-weight: 400;\">Nicole Celestine, Ph.D.</span></a><span style=\"font-weight: 400;\"> discusses scientific studies that show many physical health benefits surrounding happiness. These include a stronger immune system and resilience in the face of stress, a stronger heart, and less risk of cardiovascular disease. A positive outlook even shortens recovery times when overcoming illness or surgery. Happy people are healthier people. </span></p>\n<p><span style=\"font-weight: 400;\">As the weekend of the camping trip gets closer, rain is glimpsing in the forecast. Perhaps it’s time for a Plan B. Something that doesn’t involve wet tents and muddy trails. Or maybe something that does just a little. Either way, I am sure we will find delights to notice. </span></p>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/07/Delights.png"
}