{
  "id": 12479,
  "title": "Peddler’s Village Achieved Record-Breaking 2021 Retail Sales",
  "slug": "peddlers-village-achieved-record-breaking-2021-retail-sales",
  "date": "2022-03-02T20:34:03",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Style",
    "Taste"
  ],
  "tags": [
    "Bob McGowan",
    "doylestown cardinal",
    "peddlers village"
  ],
  "excerpt": "<p>Peddler’s Village, a countryside shopping, dining, and entertainment destination in Bucks County, Pennsylvania, achieved record-breaking retail sales in 2021. Sales exceeded the previous pinnacle, which occurred in 2019, by 35 percent. * The outdoor shopping center, which was created in 1962, has experienced a steady increase in visitation over the past several years. Despite its [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">P</span><span class=\"s2\">eddler’s Village, a countryside shopping, dining, and entertainment destination in Bucks County, Pennsylvania, achieved record-breaking retail sales in 2021. Sales exceeded the previous pinnacle, which occurred in 2019, by 35 percent. *</span></p>\n<p class=\"p3\"><span class=\"s2\">The outdoor shopping center, which was created in 1962, has experienced a steady increase in visitation over the past several years. Despite its closure for an extended time due to the pandemic, Peddler’s Village welcomed in 2020 more than two million visitors. It was subsequently named the top tourist destination in the Philadelphia area by the Philadelphia Business Journal.</span></p>\n<p class=\"p3\"><span class=\"s2\">“During the first pandemic year, we welcomed not only many visitors from outside of Bucks County, but also tens of thousands of local residents who rediscovered Peddler’s Village and found it a viable and exciting destination,” said Bob McGowan, chief operating officer of Peddler’s Village. “Wherever they were from, our visitors seemed to appreciate the shops and entertainment we recently added.”</span></p>\n<p class=\"p3\"><span class=\"s2\">Now in its 60th year, Peddler’s Village comprises 60 specialty shops—all but two of them locally owned and operated—along with seven restaurants, the 66-room Golden Plough Inn, and an indoor family fun center known as Giggleberry Fair. The distinctive architecture and rich pedestrian-oriented landscaping, originally created by founder Earl Jamison, evokes a rural 18th-century ambiance. In addition to being a popular shopping destination that attracts visitors from around the world, Peddler’s Village is known for its weekend festivals and events, a number of which have been in place for decades (i.e., Apple Festival, murder mysteries, Grand Illumination).</span></p>\n<p class=\"p3\"><span class=\"s2\">Bob McGowan, a hospitality veteran who stepped into the role of chief operating officer at Peddler’s Village in late 2017, recognized immediately the value of expanding entertainment to increase year-round visitation. He broadened the in-house events team and added comedy nights, food truck evenings, outdoor movies, trivia nights, a weekend-long Fourth of July celebration, and a spring PEEPS® in the Village display. In 2020, he expanded outdoor dining and introduced a large tent on the property to host Village-sponsored events as well as private parties. He has dedicated a stand-alone building—the Red Barn on Street Road—that will open this spring to ensure a permanent location for popular annual displays, including PEEPS® and holiday-themed gingerbread creations, and a permanent gallery of historical Village photos. This year, Peddler’s Village will present a free summer-long display of larger-than-life sand sculptures—Bucks County Beach Days: Sand Sculptures in the Village&#8211;created by world-renowned sand artists.</span></p>\n<p class=\"p3\"><span class=\"s2\">“We want Peddler’s Village to be a fun, enjoyable gathering place for people of all ages,” said McGowan. “Whether the personal draw for guests is shopping or dining, or comedy or festivals, our overall goal is threefold: to provide warm, old-fashioned hospitality; to invite support for our many locally owned small businesses; and to build upon and celebrate our success with continuous positive changes.”</span></p>\n<p class=\"p3\"><span class=\"s2\">Spurred by success at Peddler’s Village, several retail businesses have since expanded their operations. LSL Brands, a retail operation that began as a single lingerie boutique at Peddler’s Village in 1988, now encompasses seven brands and five shops at Peddler’s Village. Clusters Handcrafted Popcorn, a locally owned gourmet popcorn shop, recently launched a franchise initiative. The owner of Bucks County House of Jerky opened two new shops at Peddler’s Village in 2021: Inferno and Pickledilly Square. Also last year, the owner of The Total Animal opened a new Village shop called Tails of the Village.</span></p>\n<p class=\"p3\"><span class=\"s2\">Karen Thompson, owner of LSL Brands, said she values especially the loyalty of local residents to her shops. “We work hard to build rapport with our guests so we can anticipate their needs and make sure we present to them exactly what they are looking for,” she said. “We take great pride in our approach to personal service and in our longstanding relationships with customers who see the value in our services and our merchandise, and in supporting our small businesses.”</span></p>\n<p class=\"p3\"><span class=\"s2\">In contrast to many other shopping centers throughout the United States, Peddler’s Village is currently 100% leased. Several new businesses will be opening this spring, including Cloak and Wand, a “wizarding and witchcraft” shop that is expanding from its original location in Olde Mistick Village in Mystic, Connecticut.</span></p>\n<p class=\"p3\"><span class=\"s2\">“At Peddler’s Village, the conversations never stop,” said McGowan. “We are constantly evaluating and discussing ideas about how to move forward. We have smart merchants, a great team, and boundless enthusiasm to make this unique destination the best that it can be.”</span></p>\n<p class=\"p3\"><span class=\"s2\">For more information about Peddler’s Village visit <a href=\"http://PeddlersVillage.com\" target=\"_blank\" rel=\"noopener noreferrer\">PeddlersVillage.com</a> or call 215-794-4000.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/03/PeddlersVillage_StrawberryFest_May2017_03-M.Edlow-1.jpg"
}