{
  "id": 11487,
  "title": "Phillips’ Mill Art Show: 92 Years Old Yet New",
  "slug": "phillips-mill-art-show-92-years-old-yet-new",
  "date": "2021-10-13T03:37:04",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "Phillips’ Mill Annual Juried Art Exhibition"
  ],
  "excerpt": "<p>Get ready to be astonished, impressed, intrigued, provoked, and possibly haunted when the Phillips’ Mill Annual Juried Art Exhibition returns September 25th. It offers such a wide range of painting and sculpture that viewers can expect to feel a full spectrum of emotional responses to the artworks. This year—the 92nd annual—will be a first as [&hellip;]</p>\n",
  "content": "<p class=\"p1\">Get ready to be astonished, impressed, intrigued, provoked, and possibly haunted when the Phillips’ Mill Annual Juried Art Exhibition returns September 25th. It offers such a wide range of painting and sculpture that viewers can expect to feel a full spectrum of emotional responses to the artworks.</p>\n<p class=\"p3\">This year—the 92nd annual—will be a first as well, because the show will be hung in the Mill and will also be available for viewing online. Phillips’ Mill, situated near a whiplash turn in River Road just above the town of New Hope, is a gristmill dating from 1754. It has been designated a National Historic Site and is among Bucks County’s most picturesque spots.<span class=\"Apple-converted-space\"> </span></p>\n<figure id=\"attachment_11489\" aria-describedby=\"caption-attachment-11489\" style=\"width: 640px\" class=\"wp-caption alignnone\"><a href=\"https://doylestowncardinal.com/wp-content/uploads/2021/10/Love-Triangle.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-11489\" src=\"https://doylestowncardinal.com/wp-content/uploads/2021/10/Love-Triangle.jpg\" alt=\"\" width=\"640\" height=\"640\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2021/10/Love-Triangle.jpg 640w, https://doylestowncardinal.com/wp-content/uploads/2021/10/Love-Triangle-150x150.jpg 150w, https://doylestowncardinal.com/wp-content/uploads/2021/10/Love-Triangle-300x300.jpg 300w, https://doylestowncardinal.com/wp-content/uploads/2021/10/Love-Triangle-65x65.jpg 65w\" sizes=\"auto, (max-width: 640px) 100vw, 640px\" /></a><figcaption id=\"caption-attachment-11489\" class=\"wp-caption-text\">“Love Triangle (Paper, Rock, Scissors)” by Gene Underwood, from Buckingham, puts a new spin on a familiar hand gesture choosing game.</figcaption></figure>\n<p class=\"p3\">Each year, the jurors change, and jurors’ tastes vary. This keeps the show fresh and the topic of heated debates! The show is organized and produced by a large team of volunteers. “Typically, 400 or so painters and sculptors will enter works. About 90 works will be chosen to display in the gallery and more of the jurors’ selections will be in the portfolios, unframed. Another hundred or so unframed works are available in the portfolio section of the show,” says Laura Womack, a longstanding volunteer who is the art committee chair for the 92nd Show. “It’s an epic job,” she says, “to catalog all the submitted work, assist the jurors, return work that is not selected, and then hang the chosen artworks. This is followed by roughly a month of monitoring the gallery and executing the sales that benefit the Mill. The volunteers work diligently for months preparing this Show.” This year, many additional hours will be spent to prepare files of all the artworks and upload them to the online gallery which makes e-commerce a secure click-through experience for collectors.</p>\n<p class=\"p3\">The 92nd Annual Phillips’ Mill Juried Art Show, September 25th–October 31st. Open Daily, 1 pm – 5 pm. To learn more or to visit the show online, <a href=\"http://www.phillipsmill.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.phillipsmill.org</a>.<span class=\"Apple-converted-space\"> </span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/10/Winter-Shadows.jpg"
}