{
  "id": 11702,
  "title": "Placing the Spotlight On Makers Off Main",
  "slug": "placing-the-spotlight-on-makers-off-main",
  "date": "2021-11-23T13:04:56",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Style"
  ],
  "tags": [
    "Doylestown Borough",
    "doylestown cardinal",
    "john lund",
    "makers off main",
    "susan smith"
  ],
  "excerpt": "<p>By John Lund and Susan Smith • @DoylestownBoroBuzz • The Cardinal Contributing Writers Doylestown Borough, named the best small town for culture in America (USA Today, 2019), is known for its commitment to the arts. This month we visited a small business that also has an enduring commitment to the arts. Makers Off Main is [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By John Lund and Susan Smith</strong> • @DoylestownBoroBuzz • The Cardinal Contributing Writers</p>\n<p class=\"p3\"><i>D</i><i>oylestown Borough, named the best small town for culture in America (USA Today, 2019), is known for its commitment to the arts. This month we visited a small business that also has an enduring commitment to the arts. Makers Off Main is located at 38 E State Street, just a few steps away from the historic County Theater, in the heart of Doylestown borough. We sat down with co-owners Caitlin Hernandez and Wendy Stone to learn about their business.</i></p>\n<p class=\"p6\"><strong>About the Owners</strong></p>\n<p class=\"p7\"><span class=\"s2\">Caitlin lives in Doylestown with her husband, two children, and two dogs (Sully and Boo). She first dipped her toes into crafting when her grandmother taught her to crochet at the age of seven. In 2019, she created a product called “Doodle Jawnz” with her husband, making washable coloring dolls for kids and adults alike. She has a passion for learning, music, feminism, and all things Disney.</span></p>\n<p class=\"p7\"><span class=\"s2\">Wendy moved to Doylestown from Massachusetts in 2011 with her husband, where they later settled down to raise their two girls. As a former preschool teacher, Wendy easily settled into her role as a stay-at-home mom for the first 5 years at home with her daughters. Transitioning into the “working mom” life has been very fulfilling, as well, and she loves showing her daughters that they can do anything they put their minds to. She has a passion for teaching, Halloween, and crafting, and has recently taken up woodworking as a hobby (she built Maker’s front desk!).</span></p>\n<p class=\"p7\"><span class=\"s2\">The girls met in 2016 at The Little Gym, where Caitlin taught Wendy’s daughters. They quickly found themselves transitioning from acquaintances to friends to business partners between 2016-2020 when the pandemic hit and the idea for Makers Off Main began. </span></p>\n<p class=\"p6\"><strong><span class=\"s4\">About Makers Off Main</span></strong></p>\n<p class=\"p7\"><span class=\"s3\">All the products sold at Makers Off Main are hand-made by a community of over 80 artists and crafters who all live within one hour of Bucks County. The Makers Off Main community comes together to share their products, host creative workshops, and teach kids’ classes. Caitlin and Wendy believe that now, more than ever, it is important to support our neighbors in their creative ventures.</span></p>\n<p class=\"p6\"><strong><span class=\"s4\">How did Makers Off Main Get their Start?</span></strong></p>\n<p class=\"p7\"><span class=\"s2\">The business initially started out of Caitlin’s basement and Wendy’s garage a few years ago. Customers were contacting them from everywhere and they were delivering orders daily within a 10-mile radius and shipping product across the country. In July 2020, they opened their first “Brick &amp; Mortar” store in the north side of Doylestown and that’s when Makers Off Main really came to life.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><span class=\"s3\">It took only one year to grow out of that space, and in July 2021 they moved to their current location at 38 E. State Street.<span class=\"Apple-converted-space\">  </span>According to Wendy, “The timing of opening our store, during the pandemic, was critical for our vendors with festivals shutting down and local events being cancelled. Our store gave the local makers a showcase for their products and a platform to teach their crafts.”</span></p>\n<p class=\"p6\"><strong><span class=\"s4\">What Treasures will you Find at Makers Off Main?</span></strong></p>\n<p class=\"p7\"><span class=\"s1\">Visit Makers Off Main to find everything from Home Décor, Jewelry, Kitchen &amp; Barware, to Clothing &amp; Accessories. Need to add a new scent or a new candle look to your home? Check out the popular Cement Candles by Home Again Studios. Also don’t miss the macrame wall hangings and wood-working items like wood burned signs. According to Wendy, finding homemade, seasonal décor is very popular. Holiday wreaths and velvet pumpkins with real pumpkin stems are a few examples of the seasonal décor Makers Off Main offers.</span></p>\n<p class=\"p6\"><strong><span class=\"s4\">Classes &amp; Workshops</span></strong></p>\n<p class=\"p7\"><span class=\"s1\">Makers Off Main offers both standard and seasonal workshops. Every Saturday and Sunday, Makers Off Main hosts a $10 Make &amp; Takes for kids of all ages. Call, or go online, to book events like birthday parties and Messy Makers classes (for the smaller kids while their older siblings are at school). Also look for fun, BYOB events for the adults. Additional standard classes are Cutting Board, Macramé, and Felt Wreath Workshops. Examples of seasonal classes are Halloween Tree, Holiday Felt Wreath, Teen Night – Ring Making Workshop, Haunted House Workshops and Holiday Crafts for kids. Many classes are taught, hands on, by the vendors who supply the products to the store. Go to <a href=\"http://www.makersoffmain.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.makersoffmain.com</a> to get more information or to book your class.</span></p>\n<p class=\"p8\"><strong><i>From John Lund and Susan Smith</i></strong></p>\n<p class=\"p9\"><i>We are excited to be a part of the Business Spotlight section in The Cardinal. We started our Instagram account, @doylestownborobuzz, after we came out of the pandemic shutdowns, to help promote and support local businesses and local events within the “Boro of Doylestown”. We live in this town, and we love this town, and we are proud to share our drive to brighten the spotlight of these businesses within The Cardinal community. Small businesses are the backbone of Doylestown and whenever we can we try to Shop Local.</i></p>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2021/11/makers-off-main-2.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-11704\" src=\"https://doylestowncardinal.com/wp-content/uploads/2021/11/makers-off-main-2.jpg\" alt=\"\" width=\"1470\" height=\"1103\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2021/11/makers-off-main-2.jpg 1470w, https://doylestowncardinal.com/wp-content/uploads/2021/11/makers-off-main-2-300x225.jpg 300w, https://doylestowncardinal.com/wp-content/uploads/2021/11/makers-off-main-2-768x576.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2021/11/makers-off-main-2-1024x768.jpg 1024w, https://doylestowncardinal.com/wp-content/uploads/2021/11/makers-off-main-2-74x55.jpg 74w, https://doylestowncardinal.com/wp-content/uploads/2021/11/makers-off-main-2-111x83.jpg 111w, https://doylestowncardinal.com/wp-content/uploads/2021/11/makers-off-main-2-215x161.jpg 215w, https://doylestowncardinal.com/wp-content/uploads/2021/11/makers-off-main-2-990x743.jpg 990w, https://doylestowncardinal.com/wp-content/uploads/2021/11/makers-off-main-2-1320x990.jpg 1320w\" sizes=\"auto, (max-width: 1470px) 100vw, 1470px\" /></a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/11/makers-off-main-1.jpg"
}