{
  "id": 18145,
  "title": "Popular Non-Profit Unveils New Name and Identity That Encapsulates the Spirit of their Mission and Vision",
  "slug": "popular-non-profit-unveils-new-name-and-identity-that-encapsulates-the-spirit-of-their-mission-and-vision",
  "date": "2023-09-05T11:37:25",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "Keith Fenimore",
    "The Pine2Pink Foundation"
  ],
  "excerpt": "<p>The Pine2Pink Foundation 501(c)(3), an experience &#8211; based, community-driven non-profit dedicated to LOCAL breast cancer patients is now Main St. Serving the mission, Main St. will continue to support local breast cancer patients in treatment and recovery across Bucks County. The new identity was brought to light after witnessing years of intimate community involvement from [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">T</span><span class=\"s2\">he Pine2Pink Foundation 501(c)(3), an experience &#8211; based, community-driven non-profit dedicated to LOCAL breast cancer patients is now Main St. Serving the mission, Main St. will continue to support local breast cancer patients in treatment and recovery across Bucks County. The new identity was brought to light after witnessing years of intimate community involvement from local residents and businesses across Bucks County.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Entire towns embraced the Local-For-Local mantra the non-profit represents.<span class=\"Apple-converted-space\">  </span>These towns were empowered to create and participate in community driven initiatives that have impacted the lives of over 1000 local breast cancer patients. Visit welcometomainst.org to participate and follow the work of Main St. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Our new identity is Main St.<span class=\"Apple-converted-space\">  </span>Why Main St.? At the heart center of every small town is a Main St. It is a focal point of a community.<span class=\"Apple-converted-space\">  </span>Every Main St. typically carries with it nostalgia, meaning and memories. A meeting place for connection, support and celebration. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">The symbol supporting Main St. is a HUG. A hug is an image and an action that is universally known for exuding unbridled support, friendship, comfort and love. It can be an embrace in the physical sense or a metaphor for a community caring for people in a nurturing way and forging a special bond. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">The colors selected for the logo are pink and orange. The Pink is the universal color representing breast cancer and the orange is a vibrant color that is meant to exude warmth, positivity and optimism.</span></p>\n<p class=\"p3\"><span class=\"s2\">Main St. 501(c)(3) reinforces that our friends, neighbors and loved ones battling breast cancer are not alone.</span></p>\n<p class=\"p3\"><span class=\"s3\">“Since launching Pine2Pink in 2018 our work has profoundly touched not only those we’ve helped, but the residents and businesses of entire towns across Bucks County who have supported us. The evolution of who we were when we launched and who we have become is best represented by our new name and identity, Main St.<span class=\"Apple-converted-space\">  </span>Main St. personifies small towns and the image of two people hugging shows the support offered by the people of those towns. We are excited to unveil our new identity as Main St. and we are passionate about continuing to support our local breast cancer community in treatment and recovery in amazing ways,” shares Founder and Executive Director or Main St. (formerly Pine2Pink), Keith Fenimore.</span></p>\n<p class=\"p3\"><span class=\"s2\">The funds raised by Main St. benefit breast cancer patients at Fox Chase Cancer Center Buckingham, Grand View Health, Doylestown Health and Kin Wellness and Support Center through programs such as; food assistance, cold capping, integrative services, counseling and therapy, out-of-pocket expenses, treatment transportation, comfort bags and treatment center support and improvements.</span></p>\n<p class=\"p3\"><span class=\"s2\">Along any Main St. across the US you’ll find many local businesses. Our non-profit is a collaborator and advocate of these local businesses. Our circle-of-life is realized when local businesses participate in fundraising that attracts customers who make purchases that benefit our non-profit.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">The new creative vision of the non-profit was realized by the hard work of digital marketing agency ebow, a long-standing partner of our non-profit. ebow donated their marketing and design services to create the logo and website. ebow is a full-service international agency: <a href=\"http://ebowdigital.com\" target=\"_blank\" rel=\"noopener noreferrer\">ebowdigital.com</a>.</span></p>\n<p class=\"p3\"><span class=\"s2\">Main St. is now in New Hope, Peddler’s Village, Carversville, Doylestown, Perkasie, Newtown and Shops at Valley Square in Warrington.</span></p>\n<p class=\"p3\"><strong><span class=\"s2\">During the month of October, you can expect Main St. to:</span></strong></p>\n<p class=\"p3\"><span class=\"s2\">• Change the lights in towns across Bucks County pink</span></p>\n<p class=\"p3\"><span class=\"s2\">• Launch a virtual scavenger hunt<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">• Partner with local businesses creating special Main St. offers</span></p>\n<p class=\"p3\"><span class=\"s2\">• Host amazing events</span></p>\n<p class=\"p3\"><span class=\"s2\">Please show your support by getting involved. Visit <a href=\"http://www.Welcometomainst.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.Welcometomainst.org</a> for non-profit news and details and follow us on our new social channels on Facebook @MainStreet and Instagram @welcometomainst</span></p>\n<p class=\"p3\"><span class=\"s4\">Visit the Main St. website to donate or participate in community events (<a href=\"http://www.Welcometomainst.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.Welcometomainst.org</a>). Donations can also be made via check and sent to P.O. Box 307, Doylestown, PA 18901. 2023 Sponsorship opportunities are still open The Main St. was established through a charitable grant contribution made by The Minford Charitable Foundation. <span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/09/Main-St_Horizontal_FA-e1693928238381.jpg"
}