{
  "id": 12272,
  "title": "Share Your Love For Our Local Businesses This Valentine’s Day",
  "slug": "share-your-love-for-our-local-businesses-this-valentines-day",
  "date": "2022-02-08T12:31:06",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "Britt Around Town",
    "bucks county",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Britt Around Town • Special to The Cardinal The love for LOCAL runs strong here in Bucks County. All throughout the pandemic, the community has banded behind our local businesses and found creative ways to support them throughout all of the uncertainty.  The saying goes that the grass grows the greenest where you water [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Britt Around Town</strong> • Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">T</span><span class=\"s3\">he love for LOCAL runs strong here in Bucks County. All throughout the pandemic, the community has banded behind our local businesses and found creative ways to support them throughout all of the uncertainty. </span></p>\n<p class=\"p5\"><span class=\"s3\">The saying goes that the grass grows the greenest where you water it, and when you support our local small businesses, you are helping our community to grow and flourish. Instead of purchasing from a big corporation, shopping small helps a parent put food on the table for their family, creates local jobs, and invests in local entrepreneurs. However, there are so many ways you can show your support for the businesses in our community that go beyond the wallet. </span></p>\n<p class=\"p5\"><span class=\"s3\">Have you ever scrolled through Instagram or Facebook and found yourself hungry after seeing photos of food posted by your friends? Have you ever asked a Facebook group for recommendations? Recent years have increased the usage of social media communications in both the personal and business worlds, causing word of mouth referrals to spread like never before. Simply posting a photo and telling your positive experience is a new form of free marketing for the business that can help them tremendously. </span></p>\n<p class=\"p5\"><span class=\"s3\">Not long before the pandemic, I started my social media pages in an effort to share my love for our community through my photos and personal experiences. I had no idea back then how much of an impact that passion would make for the businesses I posted about. I dedicated my time to visiting the towns of Bucks County and getting to know the faces behind the counters. I sat through webinars and did an abundance of research on the ins and outs of social media marketing and how I could make it my contribution to my community.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">It has been one of the most rewarding adventures of my life and to this day I still tear up when businesses tell me about people who pay them a visit on my recommendation and from followers who say that they never knew something existed until they saw it on my feed. Social media can be a beautiful thing</span></p>\n<p class=\"p6\"><span class=\"s4\"><strong>So How Can You Help?</strong>  </span></p>\n<p class=\"p5\"><span class=\"s3\">There are so many ways you can support your favorite businesses that can help them to expand their reach and bring them new foot traffic. </span></p>\n<p class=\"p5\"><strong><span class=\"s5\">• Interact With Their Posts:</span></strong><span class=\"s3\"> Social Media algorithms are an interesting phenomenon. Interacting allows their post to be seen by a larger audience &#8211; therefore making it more effective. Ways you can interact with their posts include:</span></p>\n<p class=\"p5\"><span class=\"s3\">– Follow their social media accounts</span></p>\n<p class=\"p5\"><span class=\"s3\">– Like their posts</span></p>\n<p class=\"p5\"><span class=\"s3\">– Comment on their posts &#8211; even if it’s just an emoji</span></p>\n<p class=\"p5\"><span class=\"s3\">– Share their posts to you page, stories or directly to a friend</span></p>\n<p class=\"p5\"><strong><span class=\"s5\">• Share Your Experience With Your Friends and Family:</span></strong><span class=\"s3\"> If you loved your visit, tell your family and friends all about it, both in person and online! People are more likely to visit somewhere that has been highly recommended by those they know who have experienced it firsthand. Don’t forget to add a photo to make your suggestion unforgettable. </span></p>\n<p class=\"p5\"><strong><span class=\"s5\">• Leave Reviews:</span></strong><span class=\"s3\"> Share your experience with others by leaving a positive review on their Facebook, Google and Yelp pages. </span></p>\n<p class=\"p5\"><span class=\"s3\">A simple post goes a long way, and the businesses in our community will be so thankful for your additional support. </span></p>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2022/02/109521731_170289904611394_7779786734507670211_n.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-12278\" src=\"https://doylestowncardinal.com/wp-content/uploads/2022/02/109521731_170289904611394_7779786734507670211_n.jpg\" alt=\"\" width=\"387\" height=\"387\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2022/02/109521731_170289904611394_7779786734507670211_n.jpg 387w, https://doylestowncardinal.com/wp-content/uploads/2022/02/109521731_170289904611394_7779786734507670211_n-150x150.jpg 150w, https://doylestowncardinal.com/wp-content/uploads/2022/02/109521731_170289904611394_7779786734507670211_n-300x300.jpg 300w, https://doylestowncardinal.com/wp-content/uploads/2022/02/109521731_170289904611394_7779786734507670211_n-65x65.jpg 65w\" sizes=\"auto, (max-width: 387px) 100vw, 387px\" /></a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/02/Shop-Locally.jpg"
}