{
  "id": 17746,
  "title": "Smiles and Traditions: June Celebrates Immigrant Heritage",
  "slug": "smiles-and-traditions-june-celebrates-immigrant-heritage",
  "date": "2023-06-16T16:49:00",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "Natalya Bucuy"
  ],
  "excerpt": "<p>By Natalya Bucuy • The Cardinal Managing Editor One September morning, 24 years ago, I walked into a classroom. “Something-something Natale-e-e-eya,” the student volunteer who had walked me through the maze of the high school hallways said to the teacher before heading out. The teacher, whose large glasses took up half of her face, stood [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong><span class=\"s1\">By Natalya Bucuy • </span></strong></em><span class=\"s1\">The Cardinal Managing Editor</span></p>\n<p class=\"p3\"><span class=\"s3\">One September morning, 24 years ago, I walked into a classroom. “Something-something Natale-e-e-eya,” the student volunteer who had walked me through the maze of the high school hallways said to the teacher before heading out. The teacher, whose large glasses took up half of her face, stood up from behind her desk. Her smile nearly reached the bottom of her glasses. I wasn’t used to people smiling so enthusiastically at me, especially if they were complete strangers. “Something-something Natalie?” she asked, then tapped her finger on her chest with force. “Mrs. Price,” she said, a bit louder than necessary. “Something-something-something.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">I stared at her blankly, unsure what to do or say. Mrs. Price then picked a book off her desk and lifted it above her head. “Something-something dic-ti-ona-ry” she said as she shook it. I only knew she said “dictionary” because she pointed at the word printed on the cover. Even after learning English at school for five years back in my native Russia, I could only read and speak a few words and phrases. Deciphering what was coming out of the native speakers’ mouths now that I was a fresh-off-the-plane immigrant in America, however, proved to be impossible.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">“Something-something Natalie?” Mrs. Price asked again. That sounded close enough to my name, so I nodded. “Dictionary!” Mrs. Price smiled with a full mouth of bright white teeth again. “Bring tomorrow.” I stretched my lips into something of a smile of my own, glad to recognize two more spoken words. I nodded again and took the seat to which Mrs. Price pointed.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">Second-period social studies class became my favorite in 10th grade, even though “something-something-somethings” didn’t become comprehensive words until the end of that school year. “Natalie” remained my name until graduation. Now, over two decades later, I can still picture Mrs. Price’s huge smile.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">Why do Americans smile so much?<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">The good people at the Atlantic magazine cite a study that shows deep cultural reasoning for our determination to flash those pearly whites whenever possible. The reason lies in our very foundation cited in the Founding Fathers’ work: the pursuit of happiness. We’re always pursuing it and we’re not afraid to show it. But there is more to it. In our society, diverse from its roots to its blossoms, smiling serves as a universal language. It comes to aid the ubiquitous human search for connection.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">On the contrary, in more homogeneous cultures smiling often communicates one’s superiority over another. Or, sometimes, the need to smile just isn’t there as folks live in the comfort of their own people. The constant desperate reach for a connection is not necessary for social survival. But in America, that’s a different story. Americans smile more because we seek connection with others not like us.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">June celebrates Immigrant Heritage Month. It is now that we aim to recognize and honor diversity and explore the richness of each other’s cultures. But what exactly are we celebrating? Is it the food? The music? The traditions our ancestors practiced in their homelands? Or only those they brought with them to their new homes? What exactly is immigrant heritage?<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">As a Russian-American who’d spent more than half of her life on American soil, I cannot determine which of my life experiences are Russian, which are American, and which are those of an immigrant. But all of them are part of me.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">Since my first day of school, I’ve learned so much from the many places I visited and the many people I met. Every morning, I make myself a cup of Puerto Rican coffee I first tried when I traveled there with my sister. At Christmas time, I place a small pickle ornament on my tree. A friend with German background gave it to me and explained the tradition of hiding it for someone to find. Over the last few years, I fell in love with Latin dance and it’s hard for me not to move my body when Latin beats come on the radio.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">All these and more are pieces of my own personal complex heritage. They are part of me just as much as my ability to cook a mean pot of borsch using my Ukranian-born great uncle’s recipe. They live in me as do the Russian folk songs my mom sang to me when I was little and I sang to my children when I rocked them to sleep.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">I believe this works on a bigger scale for our nation as a whole. In a country as diverse as the United States, the connection between cultures is the glue that holds us together. As generations of immigrants turn into Americans, traditions, memories, and experiences can both, go on or vanish in time. We cannot control what stays or what goes. We don’t know what our children will carry on, what our grandchildren will remember, and what our great-grandchildren will forget. We can only celebrate what we cherish right now.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">We’re all just colorful squares of a large brilliant quilt of cultures. Immigrant heritage is American heritage. And American heritage is immigrant heritage. One cannot be separated from another. Our differences do not separate us. They unite us.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">The gift of American diversity is the ever-present companion to that pursuit of happiness that’s written in our hearts as our lives’ goal. Our collective heritage helps us along on that journey. It’s what makes us happy. Or, at the very least, makes us smile at each other.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\"><i>Natalya Bucuy is a journalist, fiction, and non-fiction writer and the managing editor of the Cardinal. You can often find her roaming the streets of her beloved Doylestown in search of writing material, adventure, or both. To view more of her work, visit her website, <a href=\"http://nowwehaveastory.com\" target=\"_blank\" rel=\"noopener noreferrer\">nowwehaveastory.com</a></i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/06/Natalya-Immigration.jpg"
}