{
  "id": 11553,
  "title": "Sun Dog Yoga Studio: Finding Your Peace of Mind",
  "slug": "sun-dog-yoga-studio-finding-your-peace-of-mind",
  "date": "2021-10-13T21:17:44",
  "author": "Staff",
  "category": [
    "Fit"
  ],
  "tags": [
    "doylestown cardinal",
    "shari simon",
    "Sun Dog Yoga Studio"
  ],
  "excerpt": "<p>Shari Simon, E-RYT500, YACEP is the creator and main teacher at the lovely Sun Dog Yoga Studio. She has been practicing yoga for over thirty years and opened Sundog Yoga Studio right here in the heart of Doylestown fifteen years ago.  The Cardinal sat down recently with Shari for a chat about her studio. What [&hellip;]</p>\n",
  "content": "<p class=\"p3\">Shari Simon, E-RYT500, YACEP is the creator and main teacher at the lovely Sun Dog Yoga Studio. She has been practicing yoga for over thirty years and opened Sundog Yoga Studio right here in the heart of Doylestown fifteen years ago.<span class=\"Apple-converted-space\">  </span><em>The Cardinal</em> sat down recently with Shari for a chat about her studio.</p>\n<p class=\"p1\"><strong>What first brought you to yoga and what made you decide to open a studio?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p5\"><span class=\"s1\">After college, I spent fifteen years in advertising and worked in the intense and creative world of film production. During these years of super long workdays in Chicago, I found a great stress-reliever in Iyengar Yoga, which I studied for seven years before moving to the east coast. Ending up in Bucks County, I discovered Vinyasa and Ashtanga Yoga, which really spoke to my body and my heart . . . and a lifetime love affair was bonded!<span class=\"Apple-converted-space\">  </span>I was invited to start teaching at a small studio in New Hope twenty-five years ago, and continued teaching classes all over Bucks &amp; Montgomery Counties as well as the Philly area and New Jersey.<span class=\"Apple-converted-space\">  </span>I vowed to never open a yoga studio (I had an inkling of how much work it would be . . . I was right!) and after the passing of both of my parents in 2005, I decided to take the plunge, and my creation of Sun Dog Yoga Studio was born.</span><span class=\"s1\"><span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Tell us about your studio, Sun Dog Yoga Studio.</strong></p>\n<p class=\"p5\"><span class=\"s1\">Sun Dog Yoga Studio has been open for our community since June, 2006. We are a full-service yoga center offering classes 7 days a week, yoga-related workshops, yoga teacher trainings as well as private yoga sessions and bodywork therapies. We offer classes geared towards all levels of practitioners, from beginners to advanced. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Although we are predominantly an Ashtanga Vinyasa Yoga studio, we have always offered a variety of classes from Gentle Yoga to Vinyasa, Meditation and more. Our intention at Sun Dog Yoga is to assist anyone who comes through our doors in achieving a better life through the practices that yoga offers . . . whether it’s a stronger more flexible body, or finding peace of mind in a chaotic world, yoga can serve an many levels of healing.</span></p>\n<p class=\"p1\"><strong><span class=\"s3\">How do you like living and owning a business in the downtown Doylestown area?</span></strong></p>\n<p class=\"p5\"><span class=\"s4\">I love Doylestown and the wonderful people that inhabit it. I grew up in a small town around the same size as Doylestown, and I feel comfortable with the sense of community available here.<span class=\"Apple-converted-space\">  </span>I have been lucky to live close to the studio, so my “commute” for the last 10 years is a 2-minute walk up the hill! I find that people are pretty much the same, and good at heart, wherever you go . . . it’s seeing the connection that we all share as the key!</span></p>\n<p class=\"p1\"><strong>How was your experience owning a small business during Covid? How did you keep your doors open, while several other studios unfortunately didn’t make it?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p5\"><span class=\"s1\">What does the song say, “What doesn’t kill you makes you stronger..”? It’s clear that no one has gone through the time of Pandemic unchanged or without facing significant challenges.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Having a business like a yoga center where we are constantly in physical proximity and using physical touch to help our students made it quite problematic, to say the least. We were able to pivot quickly to put all classes online, which we know was a lifesaver for so many of our students at that critical time. While we feel blessed to have had that as a way to stay connected, the need to continue to pay for a brick and mortar space at the same time was quite hard. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">With the help of government loans, the generosity of many of our students and family, and a dogged determination to keep our doors open made it just possible . . . and certainly very difficult at the same time. We feel fortunate that we have been able to keep our beautiful space, and look forward to this fall when we can welcome back old students and greet many new ones into our yoga home.</span></p>\n<p class=\"p1\"><strong>There are many different types of yoga. Tell us a little about your lineage, Ashtanga yoga. What is this practice all about?</strong></p>\n<p class=\"p5\"><span class=\"s1\">Ashtanga Yoga is a philosophy and “map” for self-transformation and living a great life. It encompasses ethical tenets (Yamas and Niyamas) that show us how to not only be a good human but interact with kindness and integrity in our community as well.<span class=\"Apple-converted-space\">  </span>This philosophy incorporates physical postures (asana), breath work (pranayama) and stages of meditation.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Physically, Ashtanga Vinyasa Yoga incorporates breath, movement, and meditation all in one yoga practice. This is the predominant practice we offer at the studio, and we feel it is a very powerful and beautiful form of yoga that can be adapted for everyone.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The centuries old yoga philosophy of Ashtanga Yoga has come to us from the yogic sage, Patanjali. The physical practice of Ashtanga has come to us through the family of S.K. Pattabhi Jois in Mysore, India.</span></p>\n<p class=\"p1\"><strong>What types of changes and additions are you making for this fall season to Sun Dog Yoga Studio?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p5\"><span class=\"s5\">We have re-branded our Ashtanga Yoga program to offer something for everyone, so that those new to the practice can start at the beginning or find a level and length of class that suits their needs. We are adding in two new Yin Yoga classes which focus on releasing the connective tissue in the body, and bring balance through a slower and more gentle experience than our Ashtanga classes. We have also added back our popular Gentle Yoga on Sunday mornings at 11:30am, which took a break during the Pandemic.</span></p>\n<p class=\"p1\"><strong>What other services do you offer at Sun Dog Yoga Studio?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p5\"><span class=\"s1\">We have graduated hundreds of students over the last decade through our Anatomy of Ashtanga Yoga Teacher Training Programs.<span class=\"Apple-converted-space\">  </span>We also offer Private and Semi-Private Group Yoga Sessions.</span></p>\n<p class=\"p5\"><span class=\"s1\">In addition, I offer Intuitive Bodywork Therapy and Soul Guidance Sessions. I have been practicing various forms of bodywork therapy for the last thirty years and incorporate my depth of somatic knowledge of the body, combining it with my study of yoga and indigenous teachings.</span></p>\n<p class=\"p1\"><strong>Briefly explain the benefits of yoga and is yoga for everyone?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p5\"><span class=\"s1\">The main intention of yoga, as I see it, is to help us have the best experience of being a human as possible. That means working on a physical level to create a balanced body, both flexible and strong, and keeping joints, muscles, tissue, and bones happy and humming at all ages.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Connecting with our breath not only kicks in our relaxation responses, but can also help us stay present and grounded in the face of stress. Learning to follow the breath and connect with our true inner being becomes a simple form of meditation that can produce wonderful results.</span></p>\n<p class=\"p5\"><span class=\"s1\">Yoga can help us recognize that we are multi-dimensional . . . we have a mind, a body, a heart, emotions and all are connected by our energy. I have always said that yoga helps you become more aware – and you can’t change something you can’t see, so this is the first step to transformation.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Once we begin to recognize our patterns of thought and behavior, and move from our heart with compassion and clarity, life becomes more enjoyable and the chaos and challenges that arise can be managed rather than pulling us under.</span></p>\n<p class=\"p2\"><span class=\"s1\"><span class=\"Apple-converted-space\"> </span></span><strong>What class/classes would you recommend for a first-time student?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p5\"><span class=\"s1\">A fan-favorite over many years at Sun Dog Yoga is our Yoga Basics 6-Week Course.<span class=\"Apple-converted-space\">  </span>In this workshop we take time to break down important postures, introduce practical breathing practices and learn to flow in an out of postures with many modifications for all bodies given along the way. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">This fall we have a new beginner class on the schedule: Ashtanga Lite on Wednesdays, 6:30-7:30pm.<span class=\"Apple-converted-space\">  </span>Other options include our Vinyasa Lite classes (Tues. &amp; Thurs. 11am), Gentle Yoga (Sun. 11:30am) and our new Yin Yoga (Wed. 11am and Sun. 4pm).</span></p>\n<p class=\"p1\"><strong>Do you have any upcoming workshops or events planned for October?</strong></p>\n<p class=\"p5\"><span class=\"s1\">We will offer a Yoga and Crystal Singing Bowl Meditation, which will be a fundraiser for Pine2Pink on October 8th.<span class=\"Apple-converted-space\">  </span>We will also offer a Heart Chakra Workshop and a Headstand Workshop in October.<span class=\"Apple-converted-space\">  </span>Please check out our website for additional information regarding the dates and times of workshops and our new fall schedule. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong>Sun Dog Yoga Studio</strong></p>\n<p class=\"p7\"><em>17 West State St., Doylestown, PA  18901</em></p>\n<p class=\"p7\"><em><a href=\"http://sundogyogastudio.com\" target=\"_blank\" rel=\"noopener noreferrer\">sundogyogastudio.com</a> • 215.230.4031</em></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/10/Shari-Simon.jpg"
}