{
  "id": 17700,
  "title": "Support Bucks County SPCA",
  "slug": "support-bucks-county-spca",
  "date": "2023-06-16T16:28:40",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "sarah petersSupport Bucks County SPCA"
  ],
  "excerpt": "<p>By Sarah Peters • The Cardinal Contributing Writer The Bucks County SPCA’s mission has remained unchanged since 1912. However, since its founding the organization evolved to offer a multitude of services to Bucks County pet owners and their pets. These services include rescue, re-homing, cruelty investigation and prosecution, as well as community outreach.  What is [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong><span class=\"s1\">By Sarah Peters • </span></strong></em><span class=\"s1\">The Cardinal Contributing Writer</span></p>\n<p class=\"p3\"><span class=\"s3\">T</span><span class=\"s2\">he Bucks County SPCA’s mission has remained unchanged since 1912. However, since its founding the organization evolved to offer a multitude of services to Bucks County pet owners and their pets. These services include rescue, re-homing, cruelty investigation and prosecution, as well as community outreach.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s1\">What is the most common misconception about the Bucks County SPCA?</span></strong></p>\n<p class=\"p6\"><span class=\"s2\">Many Bucks County locals don’t realize the Bucks County SPCA is an independent, non-profit organization that is not affiliated with the national ASPCA. Donations contributed at the national level do not trickle down to support our local shelter. Our local SPCA, with convenient locations in both Lahaska and Quakertown, benefits people and animals right here in our community.</span></p>\n<p class=\"p5\"><strong><span class=\"s1\">What impact does the Bucks County SPCA have on our community?</span></strong></p>\n<p class=\"p6\"><span class=\"s2\">• The Bucks County SPCA prioritizes saving as many lives as possible, with a 92% live release rate, which nearly doubles the national average. In fact, 1,260 pet adoptions took place in 2022.</span></p>\n<p class=\"p6\"><span class=\"s2\">• The Bucks County SPCA offers dog training classes and kitten kindergarten “that will help people really enjoy their pets and better understand how to navigate questionable behaviors,” says Cindy Kelly, Director of Communications and Development. The organization also operates a free pet behavior hotline. You can call 215-794-7425 ext. 113 with your pet questions and concerns.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\">• In 2022, the Bucks SPCA full-time veterinarian and medical team provided 9,678 exams for both shelter and public animals.</span></p>\n<p class=\"p6\"><span class=\"s2\">• The organization employs humane law enforcement officers who answer calls from the community, responding to over 500 complaints of annual cruelty or neglect annually. Last year, these humane police officers rescued 341 animals from harm. If you suspect animal cruelty in Bucks County, contact their tip line at 844-SPCA-TIP.</span></p>\n<p class=\"p6\"><span class=\"s2\">• This non-profit organization also offers a cat spay and neuter clinic. In the last year, the SPCA sterilized 263 cats.</span></p>\n<p class=\"p6\"><span class=\"s2\">• Bucks County SPCA is especially proud of its track record for reuniting lost pets with their families. The organization found the proper owners for 218 pets last year.</span></p>\n<p class=\"p5\"><strong><span class=\"s1\">Why should you consider the Bucks County SPCA for pet adoption?</span></strong></p>\n<p class=\"p6\"><span class=\"s2\">“The SPCA is the best deal in town if you’re looking for a new pet for your family,” Kelly says. “We try to make pet adoption accessible for everyone.” The local non-profit found adoptive families for 1,260 dogs, cats, and small and farm animals in 2022.</span></p>\n<p class=\"p6\"><span class=\"s2\">All dogs, cats, and rabbits are spayed or neutered, microchipped, vaccinated, and have had a checkup from a veterinarian. This is far more affordable than initial care for an animal coming from a pet store or even a free kitten from a litter in your neighborhood.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\">The SPCA is currently working through the “kitten season”, with cats being donated to the shelter every day. An extensive network of foster volunteers cares for the animals before they’re spayed or neutered and offered for adoption. Last year alone, volunteers offered 639 foster homes.</span></p>\n<p class=\"p6\"><span class=\"s2\">The staff loves adoption success stories. Zeus (pictured) was adopted in July 2022. He’s a big lovable senior dog who lost his home when his original owner had to move. He had several medical needs that were attended to by the staff veterinarian. Today his adopter reports that Zeus is doing well in his new home and enjoys lying in the sun on the deck or sleeping on the couch.</span></p>\n<p class=\"p6\"><span class=\"s2\">Spencer (pictured) was one of hundreds of helpless kittens brought to the shelter each year. The tiniest ones enter foster care until they can be adopted. Adopting a kitten – or two – from the shelter creates additional spaces to help other animals in need. Spencer was adopted in April 2022 and is thriving in his new home.</span></p>\n<p class=\"p5\"><strong><span class=\"s1\">How can we support the Bucks County SPCA?</span></strong></p>\n<p class=\"p6\"><span class=\"s2\">The organization is always looking for new foster volunteers to care for animals in their homes. The SPCA provides all the food, litter, and medicine. There are ongoing opportunities at both the Lahaska and Quakertown shelters.</span></p>\n<p class=\"p6\"><span class=\"s2\">Our local SPCA greatly appreciates donations that can be used to continue the pet care work. In 2022, the organization received $4,478 in donations from community members. In lieu of monetary donations, you can shop for items on the shelter’s wish list. Visit its website at www.buckscountyspca.org for details. The website also has additional information about ways to get involved, wish list items, at-home projects to help the animals, and upcoming events, like the Barn Bash benefit in July.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><span class=\"s1\"><i>Sarah Peters is a top producing Realtor, leader of the Sarah Peters Team, ALC board member at Keller Williams Doylestown, &amp; mother of three. She’s passionate about serving others &amp; helping people find themselves right at home in greater Bucks County. For more details, visit <a href=\"http://www.sarahpetersteam.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.sarahpetersteam.com</a>, Instagram @sarahpetersteam or call her at (484) 459-9944.<span class=\"Apple-converted-space\"> </span></i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/06/Zeus.jpg"
}