{
  "id": 11769,
  "title": "Sweetah’s Gluten Free Bake Shop Finds a Happy Home",
  "slug": "sweetahs-gluten-free-bake-shop-finds-a-happy-home",
  "date": "2021-12-10T10:52:34",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "Beverly Berkeley",
    "doylestown cardinal",
    "Sweetah’s Gluten Free Bake Shop"
  ],
  "excerpt": "<p>In 2016, Beverly Berkeley decided to take a leap of faith and start her own business. Having worked as a freelance writer and communications director at a local private school for fifteen years, she was ready for a change.  Like many people, she had her bucket list and owning her own business was one of [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">I</span><span class=\"s2\">n 2016, Beverly Berkeley decided to take a leap of faith and start her own business. Having worked as a freelance writer and communications director at a local private school for fifteen years, she was ready for a change.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Like many people, she had her bucket list and owning her own business was one of the items. With steadfast support from her husband, Frank, she started Sweetah’s Gluten Free Bake Shop. She went to work, recreating her favorite recipes to gluten free and adding some vegan recipes.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Her goal was to offer delicious small batch, gluten free desserts that were created with cleaner, mostly organic ingredients, premium quality gluten free flours, and a variety of locally grown seasonal flowers, fruits and vegetables. She wanted to serve people with celiac disease, gluten intolerance, digestion issues, and those who choose to follow a gluten free or vegan diet.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Beverly took the grow-as-you-go approach. First, she certified her home kitchen with the health department and baked at home. Each week, she sold her desserts at local farmer’s markets. As each opportunity came to grow the business, she grabbed them.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Beverly, who has lived in Central Bucks for over 30 years, wanted her retail space in Doylestown. In March 2017, she rented and shared a small dining space in the quaint Hargrave House Bed and Breakfast on South Main Street. A year later, she expanded to her own store front on East Oakland. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">But that wasn’t enough. She wanted her next expansion to include a dedicated gluten free commercial kitchen. Motivated by constant praise, encouragement, and a frequent cantation of “thank you for being here,” from her customers, Beverly opened her bake shop at 23 South Clinton Street in Doylestown. Today, the bake shop includes a retail space, a bright and cozy seating area, and a dedicated gluten free kitchen.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">The gluten free menu has grown to include custom cakes, small desserts for weddings and parties, and vegan desserts as well, along with a variety of small batch cupcakes, pastries, cookies, mini bundt cakes, mini breads, lemon bars, cream puffs and more. Her husband likes to tell people, “You won’t believe it’s gluten free!” <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Sweetah’s is now taking orders for Christmas. Their holiday menu is posted on their website at <a href=\"http://www.sweetahs.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.sweetahs.com</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/12/Sweetahs.jpg"
}