{
  "id": 11265,
  "title": "Tasty Tweets: Wine Trends To Try",
  "slug": "tasty-tweets-wine-trends-to-try",
  "date": "2021-08-22T15:35:42",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "aillinn brennan",
    "doylestown cardinal",
    "Pét-Nat",
    "Pétillant Naturels",
    "wine"
  ],
  "excerpt": "<p>By Aillinn Brennan • Special to The Cardinal The Pandemic &amp; Wine Sales Remember when everything came to slow and scary halt and we were seeing our world as we were accustomed close down and we all had to stay at home. Initially, there was a general feeling, “ok let’s get ahead of the this…it [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Aillinn Brennan • </b>Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s1\"><b>The Pandemic &amp; Wine Sales</b></span></p>\n<p class=\"p3\"><span class=\"s1\">Remember when everything came to slow and scary halt and we were seeing our world as we were accustomed close down and we all had to stay at home. Initially, there was a general feeling, “ok let’s get ahead of the this…it will only be for a few weeks. then back to normal…” We all know how that went. With restaurants and bars shuttered and the liquor stores with cumbersome ordering by phone and busy signals for hours and more busy signals for curbside pick-up.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">It’s no wonder that in March of 2020, online wines sales rose 234 percent. As the virus spread and it became apparent that the restaurants and bars were not opening anytime soon, and the term “lockdown” became our new vocabulary, online wine sales began to skyrocket even more. By April 2020 they spiked up 500 percent! Thank you heroes of UPS, Fed-Ex, USPS who were worked ragged during the pandemic so we could have our stuff.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\"><b>Pét-Nat, What Dat?</b></span></p>\n<p class=\"p3\"><span class=\"s1\">Think of it as naked wine that is a part of a noninterventionist philosophy, often made from “biodynamically farmed” grapes, meaning totally organic, without herbicides and pesticides in the farming practice. Carrying through to the winemaking process there are no sugar or additives and the fermentation process is left to its own devices. Pétillant Naturels, or “pét-nats,” are a trending style which were discovered long before the scientific understanding of fermentation.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">Also known as the “methode ancestral” they were an accidental creation of unintended fermentation in the bottle. They are produced in both red and white and can be unusual in color and often in a capped bottle, rather than corked. Whites can be a bright sunshiny yellow with an unfiltered yeasty sediment. When you taste them, they and are rustic, light, with a delightful nose tickling effervescence which pair easily with most cuisines. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">Most wines of the world have regional designations and classifications and specific ways of being made, pét-nat has a basic requirement, that it goes through a single fermentation where the winemaker bottles and caps it before fermentation is complete. If you’re shopping for a French one, where wine classification is strict, you will not see it labeled “pét-nat,” but “methode ancestrale.” The Loire Valley is known for producing these funky biodynamic wines.<span class=\"Apple-converted-space\">  </span>In addition to their green cred, they tend to be low in alcohol and residual sugar and as such, are heavily trending among the clean and green crowd.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\"><b>Who’s Drinking What???</b></span></p>\n<p class=\"p3\"><span class=\"s1\">Wine trends drive an industry that needs years to get product from vine to glass. Every generation, except for millennials choose Chardonnay as their go-to white wine. The all-important, Millennials, born 1981 to 1996, and Gen Z, the just turned 21’ers, have been the long sought-after market segment to capture due to the longevity of their potential consumption. And they are finally buying wine! Their go to is Sauvignon Blanc. Both generations favor the zingy, fruity, lip smacking, gooseberry forward, style of New Zealand. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">Whether shopping online, perched in your pub, or getting back out on the road for foodie adventures, these are trends to try!</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/08/freemousse.jpg"
}