{
  "id": 20006,
  "title": "The Living Earth Brings the Gifts of Nature ",
  "slug": "the-living-earth-brings-the-gifts-of-nature",
  "date": "2024-07-09T14:58:06",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [],
  "excerpt": "<p>By Emma Williams &#8211; Special for the Cardinal  Found just before crossing into the bustling town of New Hope between Union and Main Street is the heart of gardening and gift giving, The Living Earth. Established by husband and wife, Sue and Jim Fagnani in 1974, the center embraces the experience of discovering a plant [&hellip;]</p>\n",
  "content": "<p><b>By Emma Williams &#8211; Special for the Cardinal </b></p>\n<p><span style=\"font-weight: 400;\">Found just before crossing into the bustling town of New Hope between Union and Main Street is the heart of gardening and gift giving, The Living Earth. Established by husband and wife, Sue and Jim Fagnani in 1974, the center embraces the experience of discovering a plant that speaks to the individual through touch, appearance, and smell. Within the indoor establishment, customers are greeted by hanging arrangements, small gifts for loved ones, and other knick-knacks that leave them enthralled by the homey feel.</span></p>\n<p><span style=\"font-weight: 400;\">Freshly after graduating college, Sue and Jim began their journey with nature by creating custom plant arrangements for customers including hospitals in Philadelphia. Eventually, they moved into New Hope, and with the encouragement of the community, opened The Living Earth on Mechanics Street in Doylestown. Eventually, they moved locations to West Bridge Street where they have been ever since.</span></p>\n<p><span style=\"font-weight: 400;\">Most of the team that works there have been standing employees for decades, dedicated to providing a helping hand in customer’s decisions to choose the right gift for themselves or others. Sue and Jim’s son, Mike, is also a member of the team who has taken the same appreciation for life as his parents, working alongside them and helping manage the greenhouse in Doylestown that contains all of the plants for the Living Earth. The couple’s other son, while not in the gardening business, doesn’t stray far as a physical therapist, keeping the well-being of life close in the family.</span></p>\n<p><span style=\"font-weight: 400;\">To Sue, running a gardening business is not like managing a retail store, but rather a lifestyle of tending to others in need as a farmer would in the field. Each plant is unique and needs the proper attention to be in its best shape when purchased. In the grand scheme of things, “the plant world is a different world,” she says, and experiencing it is unlike any other shopping endeavor. With the world shifting to online, Sue stands firm in supplying an in-person opportunity to connect buyers with their own plants, so they can truly feel a part of welcoming life into their home. No matter the occasion, The Living Earth offers community-nurtured gifts that leave a lasting impression. For more information, visit <a href=\"http://livingearthnewhope.com\" target=\"_blank\" rel=\"noopener noreferrer\">livingearthnewhope.com</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/07/Living-Earth.png"
}