{
  "id": 12657,
  "title": "The Pots and Pans Show: Ledbetters Pay Tribute To Pearl Jam",
  "slug": "the-pots-and-pans-show-ledbetters-pay-tribute-to-pearl-jam",
  "date": "2022-04-07T13:00:15",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "the ledbetters"
  ],
  "excerpt": "<p>Tell us about The Ledbetters and your music. Well, we are just five dads in our mid 40’s from Doylestown, and we play Pearl Jam songs in a tribute band as close to the album as we possibly can. About three years back we were asked by a local promoter Joe Montone, to put together [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>Tell us about The Ledbetters and your musi</b><span class=\"s1\"><b>c.</b></span></p>\n<p class=\"p2\"><span class=\"s2\">Well, we are just five dads in our mid 40’s from Doylestown, and we play Pearl Jam songs in a tribute band as close to the album as we possibly can. About three years back we were asked by a local promoter Joe Montone, to put together a band to perform the Pearl Jam album “Ten”. The show ended up going so well that we decided to keep performing and haven’t stopped since. It’s been a lot of fun bringing the Pearl Jam experience to people at smaller venues and trying our best to replicate the sound and energy of that era of music </span></p>\n<p class=\"p1\"><span class=\"s3\"><b>Tell us a bit about your music career.</b></span></p>\n<p class=\"p2\"><span class=\"s1\">Well, it’s really just starting for The Ledbetters as we are starting to play out of state in larger theaters like The Infinity Music Hall in Hartford Connecticut and The Landis Theater in New Jersey. Truly we can’t wait to play at some of the local theaters like The Sellersville Theater and New Hope Winery in the upcoming months. We really feel our show is getting tighter and we keep learning more and more Pearl Jam songs, it’s been a really fun process.</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>Describe your favorite and least favorite part about being a musician?<span class=\"Apple-converted-space\"> </span></b></span></p>\n<p class=\"p2\"><span class=\"s4\">As a performer there is a lot of give and take with the audience, so I think for me my favorite part is when the crowd is locked in and singing along and enjoying themselves and my least favorite part is when they aren’t and you’re just background noise. It’s all part of the excitement of performing and getting the most out of your ability, leaving it all on the stage, James Brown style.</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>Tell us about your favorite performance of your career.</b></span></p>\n<p class=\"p2\"><span class=\"s5\">Literally it just happened at The Broken Goblet this past weekend, we had 300 people rocking out and enjoying Pearl Jam, and even though I didn’t write the songs or anything, to see people enjoying a rock show again was amazing! We are looking forward to spring and performing as much as possible!</span></p>\n<p class=\"p4\"><i>Follow them on Instagram @the_ledbetters_ or check out their website for more information &#8211; www.theledbettersmusic.com.<span class=\"Apple-converted-space\"> </span></i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/04/The-Ledbetters.jpg"
}