{
  "id": 18057,
  "title": "The Family Corner",
  "slug": "the-family-corner",
  "date": "2023-08-12T15:21:43",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Play",
    "Taste"
  ],
  "tags": [
    "dakoda carlson",
    "doylestown cardinal",
    "Doylestown Library",
    "elmwood zee",
    "Sesame Place",
    "Shady Brook Farm",
    "Tinicum Park"
  ],
  "excerpt": "<p>By Dakoda Carlson • The Cardinal Editorial Intern Looking for some more fun during summer break? Here’s our monthly breakdown of what’s exciting in and around town. Catch the Summer Concert Series at Central Park. 425 Well Rd. Doylestown. Bring a chair, a beverage, and blankets, and enjoy the free music. Hosted by “Class Act” [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Dakoda Carlson</strong></em> • The Cardinal Editorial Intern</p>\n<p class=\"p3\"><span class=\"s2\">Looking for some more fun during summer break? Here’s our monthly breakdown of what’s exciting in and around town.</span></p>\n<p class=\"p4\"><span class=\"s3\">Catch the </span><span class=\"s4\"><strong>Summer Concert Series at Central Park</strong>.</span><span class=\"s3\"> 425 Well Rd. Doylestown. Bring a chair, a beverage, and blankets, and enjoy the free music. Hosted by “Class Act” on Wednesday, Aug. 16 from 7 pm-9 pm. Music covers from artists such as Harry Styles, Journey, Michael Jackson and so much more! Fun for the whole family and a perfect summer evening. For more information, check out their website at classact215.com. Looking for a different genre of music? From Aug. 2 to Aug. 30 head to Central Park for more music is hosted every Wednesday night at 7 pm. Enjoy music from genres like rock, R&amp;B, and more. Check out <a href=\"http://Buckscountyalive.com\" target=\"_blank\" rel=\"noopener noreferrer\">Buckscountyalive.com</a> for more information.</span></p>\n<p class=\"p4\"><span class=\"s2\">A movie fan? Catch the </span><span class=\"s5\"><strong>County’s Matinee Screening</strong></span><span class=\"s2\"> of the family-friendly film, Beethoven’s 2nd on Aug. 19th at 10:30 am. Tickets are priced at only $5 at E State St. Doylestown. Enjoy the cool air of the theater! 215-345-6789</span></p>\n<p class=\"p4\" style=\"text-align: left;\"><span class=\"s2\">Looking for something more active? The YMCA offers a </span><strong><span class=\"s5\">Kid’s Triathlon</span></strong><span class=\"s2\"> from ages 3 to 12, hosted on Aug. 13 at 2500 Lower St. Rd. Doylestown. Kids can enjoy an active, enjoyable adventure with their friends. Register today on the YMCA website at <a href=\"http://ymcabhc.org\" target=\"_blank\" rel=\"noopener noreferrer\">ymcabhc.org</a>. Reach the YMCA at 215-348-8131.</span></p>\n<p class=\"p4\"><span class=\"s2\">Finish up that summer reading list by heading over to the </span><span class=\"s5\"><strong>Doylestown Library</strong>.</span><span class=\"s2\"> Enjoy family storytime on Mondays, Tuesdays, Wednesdays, and Fridays at 9:30 and 11 am. Head over to the library on Aug. 1 at 1 pm for “life-sized” games to play. The library also offers a movie matinee every Thursday at 2 pm, a “Come and chat: In German” event on Aug. 10 at 7 pm, and some movement with chair yoga every Friday at 9:30 am. Located at 150 Pine St. Doylestown. 215-348-9081</span></p>\n<p class=\"p4\"><span class=\"s2\">Get in touch with nature with Mr. Beaks for his 12th birthday bash! The blue and gold macaw is celebrated with guided tours at the </span><strong><span class=\"s5\">Barn Nature Center</span></strong><span class=\"s2\">. Located at 1283 Almshouse Rd., the center hosts on Wed Aug. 16, from 9:30-10:30 am, 11:30-12:30, and 1:30-2:30 and Friday, Aug. 18th at 12:30-1:30, 2 pm-3 pm and 3:30-4:30 pm. Touch, hold, pet, and interact with all the critters with a guided tour around the facility. Tickets priced at $12. 445-205-0793</span></p>\n<p class=\"p4\"><strong><span class=\"s5\">Elmwood Zoo</span></strong><span class=\"s2\">, located at 1661 Harding Blvd, Norristown hosts a “summer entertainment series” every weekend in August from 12-3 pm. Enjoy live music, a great crowd, and a fun experience. Ever want to experience the nightlife of zoo animals? Camp out at the zoo on Aug. 11th from 5:30 pm to Aug. 12 at 10 am. Enjoy a unique experience by dining with the giraffes for breakfast on Aug. 12 at 8:30-10 am. And for the older teen crowd that wants something more up their alley, experience the adventure of the zip lines and ropes on Aug. 13, 18, 19, 20, and 26 from 7 pm to 10 pm. 800-652-4143</span></p>\n<p class=\"p4\"><span class=\"s2\">For some hot summer fun, head over to </span><strong><span class=\"s5\">Sesame Place</span></strong><span class=\"s2\"> for the Sesame Summer Splash hosted every day throughout August until September 4. Enjoy water fun and more. For a unique experience, head to the amusement park for the Sand Sculpture weekend on Aug. 10-13. Enjoy a walk around the fabulous sand sculptures by famous artists. Located in Hulmeville PA. 215-702-3566</span></p>\n<p class=\"p4\"><span class=\"s6\">Want to travel back in time and experience the excitement of the 1920s? Head over to </span><strong><span class=\"s7\">Tinicum Park</span></strong><span class=\"s6\"> in Erwinna for a dance + play cards 1920’s themed event! On Aug. 24 at 6 pm-9 pm enjoy the ambiance of a different decade. Registration can be completed at <a href=\"mailto:ashollander@buckscounty.org\">ashollander@buckscounty.org</a></span></p>\n<p class=\"p4\"><span class=\"s2\">For a hands-on experience register your little ones for the Clay and Sculptures camp at </span><span class=\"s5\">7th Street Studios</span><span class=\"s2\"> on 215 N 7th St. Perkasie. It runs from Aug. 7 to Aug. 10 at 9 am and lasts for two hours. Bring home something special. Reach the studio at 267-315-1705.</span></p>\n<p class=\"p4\"><strong><span class=\"s5\">Shady Brook Farm</span></strong><span class=\"s2\"> located at 931 Stony Hill Road, Yardley has live music on the patio every Thursday, Saturday, and Sunday. Enjoy drinks, music, and more! If music isn’t your speed, head back over to the farm for the Peach and Sunflower festival on Aug. 5 and 6 and 12, and 13 from 10-4 pm. 215-968-1670.</span></p>\n<p class=\"p4\"><span class=\"s2\">Head over to the </span><strong><span class=\"s5\">Historical Tileworks</span></strong><span class=\"s2\"> at 130 E. Swamp Road, Doylestown for a Summer Clay sampler event. Ages 5 to 12 are welcome and parents can watch their little ones create a masterpiece. The event takes place on Aug. 1, 8, and 22 at 3 pm and Aug. 15 at 10:30 am. Create hand-built flowers, and plates with Mercer stamps and a turtle sculpture. 215-239-9797.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/08/Sesame-Place.jpg"
}