{
  "id": 12207,
  "title": "The Roaming Realtor: This Olde House",
  "slug": "the-roaming-realtor-this-olde-house",
  "date": "2022-02-07T13:57:35",
  "author": "Staff",
  "category": [
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "jeff lavine",
    "Montgomery Baptist Church in Colmar",
    "New Britain Baptist Church",
    "the roaming realtor"
  ],
  "excerpt": "<p>By Jeff Lavine • The Cardinal Contributing Writer The Roaming Realtor of Doylestown began as a daily posting on Facebook on March 17, 2020. This is my inaugural feature in The Cardinal. I hope you enjoy these monthly brief looks at the history of and architecture insights into our residences, buildings, and landmarks in Doylestown, [&hellip;]</p>\n",
  "content": "<p><strong>By Jeff Lavine</strong> • The Cardinal Contributing Writer</p>\n<p class=\"p1\"><em>The Roaming Realtor of Doylestown began as a daily posting on Facebook on March 17, 2020. This is my inaugural feature in The Cardinal. I hope you enjoy these monthly brief looks at the history of and architecture insights into our residences, buildings, and landmarks in Doylestown, along with the occasional personal anecdote. The properties that surround us tell our history. Every building has a story to tell.</em></p>\n<p class=\"p3\">First up is one of our iconic structures, the distinctive landmark that earned the name, the “Landmark Building”. Fittingly named, 10 S. Clinton Street was formerly the First Baptist Church. Its history extends over a long period that began in 1846.</p>\n<p class=\"p3\">The first Baptist church in our area was the Montgomery Baptist Church in Colmar. Next came the New Britain Baptist and the Hilltown Baptist Churches, both being daughter churches of the Montgomery Baptist. The First Baptist Church of Doylestown is a daughter church of New Britain Baptist Church, hence a kind of granddaughter of the Montgomery Baptist Church, that’s the lineage.</p>\n<p class=\"p3\">This church had its first pulse of life under the direction of Rev. Samuel Nightingale, a former pastor of New Britain Church. He provided the opportunity for people to begin building the original church at 164 E. State Street. Work began in 1850, but the building was never finished above the first floor. The expense incurred was $630, at which point they ran out of the money to continue. In 1865, the property was sold. The funds obtained were applied to the erection of the 2nd church in another location, where W. Court and W. State Streets intersect with N. &amp; S. Clinton Streets, creating that multiple traffic 6-point intersection that we all know. The lot the building stands on is 220’ x 240’ and was purchased for $1,212.00. The building was to be 102’ long and 45’ wide, with the lower part of stone, the upper of brick, and both plaster-coated. By January 1869, the building was under roof, and by September of that year, the ground floor Sunday school room was finished. After seven years of worship in the Sunday school room, the sanctuary was opened, and the first service was held there on January 13, 1877.</p>\n<p class=\"p3\">A double stairway of ash and walnut inside the north door at the foot of the tower led up to the sanctuary with its 26’ high ceiling, eighteen 17’ high stained-glass windows along each side, and new pews also of ash and walnut. It must have been a wonderful worship space. The church, by this time, had well over 200 members and was growing steadily. New congregants were undoubtedly attracted by this beautiful new building—the Rev. A. J. Hastings was the pastor from 1870 to 1876. During the spring of 1875, it seems that a great revival was witnessed under the leadership of evangelist H. D. Dewitt.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p3\">The church building was originally just the portion on the corner and running along W Court Street. The 40- foot steeple was not added to the church until 1876, bringing the building to the height of 100 feet. The steeple was made by John Fitzgerald of Doylestown and still holds a 500-pound bell made by McShane’s Foundry of Baltimore and placed in the belfry. In 1967, the First Baptist relocated to 311 W State Street, and the building was purchased and converted to be the current Landmark Building in 1969 … 101 years after its erection. The addition on the S. Clinton side did not occur until the church transitioned to the Landmark Building. The only stained-glass window transferred to the new church was the one in the rear of the pulpit, over the Baptism Pool.</p>\n<p class=\"p3\">The ‘Landmark Building’ looms over its intersection in town and does serve as a landmark. Today it holds offices, but the majesty of the original church building is clear to us all. The evolution of a structure like the Landmark illustrates the continuing growth of our town and even our own lives. Everything begins with an idea and an action, and, over time, all things adapt to their current situation. As we start the new year, I wish you the ability to create new things and adapt to everyday situations in ways that improve your life and your surroundings. We all move forward in time. Doing so with thought and grace is my hope for us all.</p>\n<p class=\"p3\"><em>I look forward to this monthly feature and hope you will come to as well. Your Roaming Realtor of Doylestown is also your Real Estate Advisor. I view my job as giving you the information you need to make the best decisions for you and your family and facilitate your move forward if that is in your plan. It would be my great pleasure to work with you in 2022.</em></p>\n<p class=\"p3\"><em>Give me a call at Keller Williams Real Estate at 215.340.5700 or visit <a href=\"http://PropertyinBucksCounty.com\" target=\"_blank\" rel=\"noopener noreferrer\">PropertyinBucksCounty.com</a></em></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/02/Landmark-building.jpg"
}