{
  "id": 11622,
  "title": "The Mechanics of Gratitude",
  "slug": "the-mechanics-of-gratitude",
  "date": "2021-11-13T12:34:07",
  "author": "Staff",
  "category": [
    "Fit",
    "Live",
    "Play"
  ],
  "tags": [
    "colin kirts",
    "doylestown cardinal",
    "gratitude"
  ],
  "excerpt": "<p>By Colin Kirts • Special to The Cardinal Remember back in late September, into early October, when the weather was basically perfect? Blue skies. Crisp air. Picturesque sunshine. Mid-60s, and comfortably into the 50s at night… And, thankfully, no humidity. It was an idyllic few weeks. You may recall a bit of gleeful sweater weather [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Colin Kirts • </strong>Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">R</span><span class=\"s1\">emember back in late September, into early October, when the weather was basically perfect? Blue skies. Crisp air. Picturesque sunshine. Mid-60s, and comfortably into the 50s at night…</span></p>\n<p class=\"p5\"><span class=\"s1\">And, thankfully, no humidity.</span></p>\n<p class=\"p5\"><span class=\"s1\">It was an idyllic few weeks. You may recall a bit of gleeful sweater weather talk. It was apparently even the kind of perfection inspires some people to move here from Florida. Who’d of thunk!</span></p>\n<p class=\"p5\"><span class=\"s1\">Paying attention to the weather can be a bit passé, yes, and, we all do it. For good reason! It’s critical for literally every aspect of our lives.</span></p>\n<p class=\"p5\"><span class=\"s1\">Of course, though, it doesn’t last. Hence the cliché, right? Eventually, for better or worse, it’s going to change. Eventually, that damn humidity returns…</span></p>\n<p class=\"p5\"><span class=\"s1\">My friend Joe and I were just reflecting on this in fact. For those few weeks, we were both like kids in a candy shop. We live for the relatively colder weather. During our talk, he mentioned a neat practice he’s found helpful: developing a low threshold for gratitude. In other words, he explained how he is intentionally practicing being grateful for, well, anything.</span></p>\n<p class=\"p5\"><span class=\"s1\">And he’s really good at it! Again, though, it’s a cliché, right? Gratitude IS an attitude. It is, ultimately, a choice.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Just a few months ago, some of you may have literally lost homes and/or businesses from Hurricane Ida. Some people are still sick twenty years later from 9/11. Hell, let’s not forget how the last 18 months have been unbelievably difficult for so many people.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Should you be grateful? Should they? All of us? No.</span></p>\n<p class=\"p5\"><span class=\"s1\">And, we can. Yes, both can be true. How many people do you know who have literally found a renewed sense of being alive after something earth shattering? I know someone right now who has been living with breast cancer for over 3 years, and I think she would agree, she is more awake and grateful than ever.</span></p>\n<p class=\"p5\"><span class=\"s1\">Yah, it isn’t easy, and it certainly isn’t effortless, but it is possible, and, it is necessary. And we don’t need to wait for tragedy to strike. In fact, building on Joe’s practice, I bet we can discern some other key mechanics of gratitude, such as…</span></p>\n<p class=\"p7\"><strong>1: Stop, breathe</strong></p>\n<p class=\"p5\"><span class=\"s3\">Yup, this is going to be that kind of a list. Mundane. Earthly Why? Because that’s what’s universal. That’s what we all share, and we all rely upon. In short, it’s what works!</span></p>\n<p class=\"p5\"><span class=\"s1\">What’s the one thing we all always need? Air! Whether you call it meditation, or the art of doing nothing, or allowing yourself to breathe, the significance cannot be understated. Simply prioritize being aware of your breathe.</span></p>\n<p class=\"p5\"><span class=\"s1\">Mostly, learn to breathy deeply, and through your nose. Nasal breathing is key for a few reasons; suffice to say, for now, just breathe.</span></p>\n<p class=\"p7\"><strong>2: Observe Nature</strong></p>\n<p class=\"p5\"><span class=\"s1\">Nature with a capital “N” refers to that which is constant. Nature has a rhythm. A pace. An implicit interconnectivity.</span></p>\n<p class=\"p5\"><span class=\"s1\">We are no different. There’s no negating our connection to Nature. The strangest thing about us humans is, arguably, how we seem to forget this. If you have a pet, especially a dog, you probably would agree with these two observations: they are good at doing nothing, and, they are very grateful for you. There’s a correlation, I assure you.</span></p>\n<p class=\"p7\"><strong>3: Embrace Growth</strong></p>\n<p class=\"p5\"><span class=\"s1\">In my work, I get to spend time with people of all ages, and I have never met someone who is fully cooked. In other words, no one is finished.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Our capacity to enjoy life goes hand-in-hand with whether or not we embrace learning. Growing. Moving. In other words, we are more able to experience gratitude because we are willing to grow.</span></p>\n<p class=\"p5\"><span class=\"s1\">Again, Nature embodies the inevitability of change, of movement, and of showing us something new.</span></p>\n<p class=\"p7\"><strong>4: Express Yourself</strong></p>\n<p class=\"p5\"><span class=\"s1\">Creativity is not just a nice thing some people have. It’s a biological imperative! Everything and everyone is innately creative; there’s no getting around it.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Intentionally adding something new is the key, and, thankfully, there is no shortage of options for we can express ourselves. In no uncertain terms, to do so is to engage in life, to take part in the revelation that is existence.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><strong>5: Be Playful</strong></p>\n<p class=\"p5\"><span class=\"s1\">Honestly, why not? A lot of what we do on a day-to-basis is just an organized game. Let’s have fun with it! Let’s make fun of it. The people who seem most able to consistently embody gratitude definitely take their efforts seriously, but not themselves. In effect, it’s so easy for them to share what they’re feeling.</span></p>\n<p class=\"p5\"><span class=\"s1\">Someone once said, “happiness is only real when shared.” I think it was Tolstoy. Irrelevant. Bottom line, it’s the same with gratitude. It’s not ours, it’s just a feeling, and, quite frankly, it strengthens as we share it. On that note, in fact, make it communal! Invite others. After all, what’s the fun of a game if you don’t have others to play with?</span></p>\n<p class=\"p5\"><span class=\"s3\">Perhaps with this relatively simple model, we can more easily be grateful. Maybe it is mechanical, and we just need to explore a bit more consistently. Whatever the case, whether or not gratitude flows through you with ease, you have the ability to embrace it more. You can learn to soak it in, like a nutrient, no different than air or water.</span></p>\n<p class=\"p5\"><span class=\"s4\">No matter what, start simple. Just breathe, and, as soon as possible, say thank you.</span></p>\n<p class=\"p8\"><i>KORU Real Wellness is a somatic education center, founded by Colin Kirts and Alex Siegel in 2018. It is home to the Movement Matters Podcast as well as the Real Wellness Education Model. As Alex and Colin like to say, “Be good, do your best, and have fun.” With this spirit, at the very least, KORU is a place where you can relearn to enjoy being yourself, and enjoy the never-ending process of growing into someone new. For more visit <a href=\"http://www.wearekoru.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.wearekoru.com</a> or call (215) 348-5977</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/11/Healing-is-Found-in-an-Attitude-of-Gratitude-and-Not-Toxic-Positivity-1000x600.jpg"
}