{
  "id": 13971,
  "title": "This Olde House",
  "slug": "this-olde-house-2",
  "date": "2022-06-30T17:49:13",
  "author": "Staff",
  "category": [
    "Live",
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "jeff lavine",
    "roaming realtor"
  ],
  "excerpt": "<p>By Jeff Lavine  • The Cardinal Contributing Writer One of the things that attract so many visitors to the charming streets of Doylestown is the wide variety of architectural styles that exist in the 2.2 square miles that encompass the Borough. Diversity is a cornerstone of our community in so many ways. Colonials, Victorians, Bungalows, [&hellip;]</p>\n",
  "content": "<p><strong>By Jeff Lavine</strong>  • The Cardinal Contributing Writer</p>\n<p class=\"p1\"><span class=\"s1\">O</span><span class=\"s1\">ne of the things that attract so many visitors to the charming streets of Doylestown is the wide variety of architectural styles that exist in the 2.2 square miles that encompass the Borough. Diversity is a cornerstone of our community in so many ways. Colonials, Victorians, Bungalows, Ranches, Gothic, Italianate, Tudor, and Modern &#8211; all these styles coexist beautifully and create one-of-a-kind visual charm.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\">Today’s subject of the Tuesday Tour is the classic Greek Revival structure right in the center of town at 21 North Main Street. The façade of the building features four Greek Tuscan columns &#8211; a feature called monumental tetrastyle.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p3\">The Greek Revival style was a popular architectural movement of the late 18th and early 19th centuries. It revived the style of ancient Greek architecture, particularly the Greek temple, with varying degrees of thoroughness and consistency. A product of Hellenism &#8211; a term for imitation of ancient Greek culture &#8211; it was the last phase in the development of Neoclassical architecture, which had mainly drawn from Roman architecture. The building at 21 North Main Street is a homage to Hellenism, sited between a classic Bucks County stone colonial and a Federal-style brick building.</p>\n<p class=\"p3\">Besides the notable architecture, the building holds some remarkable history. The Josiah Hart family constructed the stucco-over-brick building between 1858 and 1859 as a bank. The Intelligencer reported the opening of the bank on March 1, 1859, with the following announcement: “The subscribers have moved into their new Banking House on Main Street opposite ‘Browers Hotel’ and are prepared to conduct a General Exchange Banking Business”.</p>\n<p class=\"p3\">The bankers, Josiah Hart &amp; Company, kept their business under their name and continued operating the bank there until George Hart, Josiah’s brother, died in 1875.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p3\">Josiah’s son, John, joined the business venture, and in 1882, his brother, Frank, became a partner. Josiah died in 1885, and his sons continued the business until 1896 when its operation ceased.</p>\n<p class=\"p3\">The owners of the bank had a deeply rooted history in the community. Josiah was married to Sarah Brock. She was the daughter of Stephen Brock, the owner of the Doylestown Hotel. Sarah’s uncle, Jonathan Brock, built a brick structure next to the Doylestown Hotel in 1837 and kept it as a hardware store.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p3\">Before 1857, Josiah Hart was the cashier at the Doylestown Bank on the west side of North Main Street. Both the Brocks and the Harts had many family members and financial ties on both sides of North Main Street throughout the 19th century.</p>\n<p class=\"p3\">Following the closure of the Hart Banking House, various businesses occupied the property at 21 North Main Street. The Nejad Gallery, which still operates the shop at 1 North Main Street, had been the last tenant when it maintained its expanded showroom in the building. Currently, there are plans underway for a new business to come in as the vibrancy of our town continues to attract amazing ventures.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p3\">Follow The Roaming Realtor of Doylestown on Facebook for more historical and architectural insights of our town.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\"><span class=\"s2\"><b><i>Jeff Lavine, a REALTOR with Keller Williams Real Estate, has been leading the industry since 1984. Jeff and his team can be reached at his office, 215-340-5700 x222, his cell. 215-280-2750 or website www. <a href=\"http://www.PropertyinBucksCounty.com\" target=\"_blank\" rel=\"noopener noreferrer\">PropertyinBucksCounty.com</a>. The Roaming Realtor appears weekly on Facebook.</i></b></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/06/Greek-Revival.jpg"
}