{
  "id": 13670,
  "title": "This Olde House",
  "slug": "this-olde-house",
  "date": "2022-06-14T16:08:55",
  "author": "Staff",
  "category": [
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "jeff lavinew",
    "William Raike House"
  ],
  "excerpt": "<p>by Jeff Lavine • The Cardinal Contributing Writer The “William Raike House”, circa 1895, tucked away on the seldom traveled Decatur Street, is one of our little  town’s most charming “Painted Ladies”. Like so many of our borough residences built at the end of the 19th century, 193 Decatur has been both a single-family dwelling [&hellip;]</p>\n",
  "content": "<p><strong>by Jeff Lavine</strong> • The Cardinal Contributing Writer</p>\n<p class=\"p1\">The “William Raike House”, circa 1895, tucked away on the seldom traveled Decatur Street, is one of our little<span class=\"Apple-converted-space\">  </span>town’s most charming “Painted Ladies”. Like so many of our borough residences built at the end of the 19th century, 193 Decatur has been both a single-family dwelling and a duplex over the years.</p>\n<p class=\"p3\">Are you aware that the Painted Ladies are not authentic? If you’ve ever been to or seen a postcard from San Francisco, or the TV show Full House, you’re sure to recognize the bright Painted Ladies of San Francisco. The homes are a huge attraction for tourists and photographers alike, but they didn’t always go by the nomenclature “Painted Ladies”. The authors of “Painted Ladies: San Francisco’s Resplendent Victorian”, Elizabeth Pomada and Michael Larsen, are to thank for the nickname.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p3\">The architectural phrase represents repainted Victorian and Edwardian houses featuring three or more colors. The homes featured in that book are not just those beauties lining the San Francisco streets that we all know. They also feature homes in Cape May, Baltimore, St. Louis, and Cincinnati. And, yes, we have many<span class=\"Apple-converted-space\">  </span>great examples of Painted Ladies here in our town.</p>\n<p class=\"p3\"><span class=\"s1\">About 48,000 houses in the Victorian and Edwardian styles were built in San Francisco between 1849 and 1915, with the change from Victorian to Edwardian occurring with the death of Queen Victoria in 1901. Many were painted in bright colors, as one newspaper critic noted in 1885, “&#8230;red, yellow, chocolate, orange, everything that is loud is in fashion &#8230; if the upper stories are not of red or blue &#8230; they are painted up into uncouth panels of yellow and brown &#8230;”.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">While many of the mansions of Nob Hill were destroyed by the 1906 San Francisco earthquake, thousands of the mass-produced, more modest houses survived in the western and southern neighborhoods of the city. During World War I and World War II, many of these houses were painted battleship gray with war-surplus Navy paint. Another sixteen thousand were demolished, and many others had the Victorian decor stripped off or covered with tar paper, brick, stucco, or aluminum siding. It was San Francisco artist Butch Kardum who began the repainting of homes in bold colors in the 1960s and many began to follow his lead. Although polychrome decoration was common in the Victorian era, the colors used on these houses are not based on historical precedent.</span></p>\n<p class=\"p3\"><span class=\"s1\">It was 1963 when Butch Kardum began combining intense blues and greens on the exterior of his Italianate-style Victorian house. His house was criticized by some, but other neighbors began to copy the bright colors on their own houses. Kardum later became a color designer, and he and other artists/colorists began to transform dozens of gray houses into the Painted Ladies. By the 1970s, the colorist movement, as it was called, had changed entire streets and neighborhoods. And, the process continues to this day.</span></p>\n<p class=\"p3\"><span class=\"s1\">So, the term that we use for these homes that many may think has always existed, was coined in the recent past of 1978. I am keenly aware that everything that exists today exists for a reason. The “why” of all things has always fascinated me. I know it’s the repeated question of all children to their parents… the constant “why?” to exhaustion, right? I know I did it to my parents and the “because I said so” response never seemed a satisfactory answer. I know I drove them crazy. I continue to always be questioning the why and looking for the answer in all things. I find that understanding the evolution and reasoning of things achieves the best results. Yes, history matters. This inquisitiveness has followed me all my life and has led me to be your Roaming Realtor. I thank you for your interest in these postings… your feedback and following. I deeply appreciate it.</span></p>\n<p class=\"p5\"><span class=\"s2\"><i>Jeff Lavine, a REALTOR with Keller Williams Real Estate, has been leading the industry since 1984. Jeff and his team can be reached at his office, 215-340-5700 x222, his cell. 215-280-2750 or website <a href=\"http://www.PropertyinBucksCounty.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.PropertyinBucksCounty.com</a>. The Roaming Realtor appears weekly on Facebook.</i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/06/this-olde-house-may-2022.jpg"
}