{
  "id": 11683,
  "title": "Top Seasonal Beer &#038; Wine in Bucks County",
  "slug": "top-seasonal-beer-wine-in-bucks-county",
  "date": "2021-11-23T11:26:37",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "Bucks County Ale Trail",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Alexa Johnson, Visit Bucks County • Special to The Cardinal Cooler weather is here! Try new releases and favorite flavors of these fall and winter brews &#8211; many available for pick-up still &#8211; along the Bucks County Ale Trail. Try them all with your passport and get the NEW Bucks County Ale Trail t-shirt! [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><b>By Alexa Johnson, Visit Bucks County • </b></span><span class=\"s1\">Special to The Cardinal</span></p>\n<p class=\"p1\"><span class=\"s1\"><i>Cooler weather is here! Try new releases and favorite flavors of these fall and winter brews &#8211; many available for pick-up still &#8211; along the Bucks County Ale Trail. Try them all with your passport and get the NEW Bucks County Ale Trail t-shirt!</i></span></p>\n<p class=\"p3\"><span class=\"s2\" style=\"color: #993300;\"><b>BEER:</b></span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Aristaeus Craft Brewing Co. • Langhorne</b></span></p>\n<p class=\"p4\"><span class=\"s2\">GROSSES ZELT BRÄU (“Big Tent Beer”). Style: Munich Dunkel. ABV: 6%. A traditional Dark German Style Lager is a well-balanced beer that is not overly sweet yet offers rich malt flavors of toffee, chocolate, biscuit or bread crust and caramel.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Bitchin’ Kitten Brewery • Morrisville</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Cat-O-Lantern. An Imperial Pumpkin Ale. Cat-O-Lantern is a scary amber ale that clocks in at a big 10% ABV! Malty notes balance with the classic pumpkin and spices we all love!</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Broken Goblet Brewing • Bensalem</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Broken Goblet releases two new fall brews: Ashes In The Air is a 10% Barleywine that leans toward the English spectrum of the style. This dark and malty brew is rich and complex with notes of bread, caramel, honey, molasses and toffee. Makeshift Atomsmasher is a 5.5% Traditional Marzen-style Lager, otherwise commonly known as an Oktoberfest, and was brewed in collaboration with Deadguy, a pioneering NJ-based metal act.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Bucks County Brewery • Pipersville<span class=\"Apple-converted-space\"> </span></b></span></p>\n<p class=\"p4\"><span class=\"s2\">Oktoberfest became available in September. All of the malty goodness you’d expect from an Oktoberfest!</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Free Will Brewing Company • Perkasie &amp; Peddler’s Village</b></span></p>\n<p class=\"p4\"><span class=\"s2\">In collaborating with Breweries in PA, Free Will has releases four “Sharing Size” dessert stouts for the third year in a row. The beers include chocolates from Pierre’s Chocolates in New Hope! Caramel Chocolate Cookie, Coconut Almond Chocolate, Peanut Butter Chocolate and Peppermint Chocolate are available individually or in a four-pack.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Geronimo Brewing • Doylestown</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Nitro Chocolate Porter. We love porters and stouts here at Geronimo Brewing! They are perfect cooler weather beers. This year’s winter brew is a 6.7% Porter aged with Ghanian Cacao nibs and vanilla bean to create a wonderful full flavored porter.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Great Barn Farm To Glass Tap Room &amp; Great Barn Taphouse • New Hope &amp; Warrington</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Barnburner Farmhouse Saison. A deep red hue is akin to a fire burning in the distance at dusk. Brewed with our own farm grown malt and spicy European hops along with coriander and orange peel. Fresh malt and fragrant spices in combination with esters produced by a free rise fermentation have created this unique experience and a true taste of Bucks County in a glass. 6% ABV.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Iron Hill Brewery • Newtown<span class=\"Apple-converted-space\"> </span></b></span></p>\n<p class=\"p4\"><span class=\"s2\">Black is Beautiful. ABV 7.3%. This beer was brewed for the “Black is Beautiful” movement &#8211; an idea started by people of color and embraced by the brewing community to promote racial equality. This version is a Chocolate Milkshake Stout. Roasty yet creamy, it reminds you of that sweet treat you would split at a local diner. $1 from each beer sold will be donated to the Urban League of Philadelphia.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Langhorne Brewing Company<span class=\"Apple-converted-space\">  </span>• Langhorne</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Sweet Tater. ABV 7.5%. A sweet potato porter, grab a can to-go or a pint from on tap of this fall spiced beer. Another seasonal favorite? Oktoberfest Lager of course.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Mad Princes Brewing Co. • Doylestown</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Fine Beer Indeed. ABV 7.6%. Silky smooth with almost no bitterness while licorice notes dance around the edges. Just what you need to ward off the Autumn chill. A strong Porter? Aye. An imperial? Nay. But…without a doubt…a Fine Beer Indeed.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Moss Mill Brewing Co. • Huntingdon Valley</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Da Birds is a 5.2% ABV kölsch, dry-hopped with a special E.A.G.L.E.S. blend of hops. 20% of the proceeds from this beer support Eagles Autism Foundation. Pine2Pink is a 6.5% milkshake IPA, brewed with cherry, vanilla, &amp; strawberry. 20% of the proceeds from this beer supports the Pine2Pink organization, which supports local women with breast cancer</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Naked Brewing Co. • Huntingdon Valley &amp; Bristol<span class=\"Apple-converted-space\"> </span></b></span></p>\n<p class=\"p4\"><span class=\"s2\">Birthday Cat. A celebration for the Naked Brewing Company’s 11th birthday. With hazy IPAs and DDH with Citiva and Zamba, this brew certainly lives up to its name.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Neshaminy Creek Brewing Co. • Croydon, Dublin &amp; New Hope</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Strange Rituals is back! This blood Red IPA was previously released in the dead of winter but we thought this beer was better suited for Spooky Season. Next up in October will be Citrus Shape of Haze to Come and the next Variety Pack featuring Opposing Bookends Oatmeal Stout and Sultana Sandra IPA.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Newtown Brewing Co. • Newtown</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Stay Golden Ponyboy. Trappist Style Single. 5.7% ABV. Using the Trappist Single recipe of their 2021 Homebrew contest winner, @seanclacerte, this Belgian ale showcases Floor-Malted Bohemian Pilsner, Saaz hops, and Belgian Golden Syrup. Abbey Ale yeast gives this light refreshing Belgian ale a fruity-spicy character.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Odd Logic Brewing Company • Bristol</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Pumpkin Patch Field Trips. This nostalgic blend surly will have you reminiscing about your time as a youngin’. For non-beer lovers who still want a dash of autumn with their alcohol, don’t miss their cocktail, Cinnamon Apple Cider Rum Slushee.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Red Lion Brewery • Quakertown</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Lionfestivus. An unfiltered, unabashed and creamy festbier. Brewed with the finest Vienna malts, German hops and yeast, this 5.8% abv lager is equally crushable and smooth.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Second Sin Brewing Company<span class=\"Apple-converted-space\">  </span>• Bristol</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Lil’ Slugger. Leaves are starting to change color, it’s getting darker earlier, and the air is getting CRISP…almost as crisp as this fan favorite from spring time.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\"><b>The Proper Brewing Co. • Quakertown</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Gracie Lou Witches Brew. 6% ABV. Just in time for fall, this pumpkin ale is ready and waiting for you! There’s just NO better way to get into the fall spirit than with your local pumpkin beer.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Tower Hill Brewery • Chalfont<span class=\"Apple-converted-space\"> </span></b></span></p>\n<p class=\"p4\"><span class=\"s2\">Blonde Ale. 5.6% ABV. A crisp, easy drinking ale with a light malt, biscuity flavor and all-around classic.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Triumph Brewing Co. • New Hope</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Stop in for Neshaminy Creek’s Oktoberfest. ABV 5.8%. Triumph’s nod to the traditional Festbier found in Munich. A malty, nutty, crisp lager perfect for the fall season.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Two Rivers Brewing Co. • Quakertown</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Olly’s Oktoberfest. 5.9% ABV. Rich and toasty lager perfect for Oktoberfest, or any other Easton fall festival. Named for Olly Hess a popular local Pennsylvania German poet.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Vault Brewing Co. &amp; Vault Taproom • Yardley</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Paint the Tape. This West Coast IPA weighs in at 7.0% ABV, exhibiting notes of grapefruit, orange zest and pine with a spicy, citrus-forward aroma and a smooth, lingering bitterness.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Warwick Farm Brewing • Jamison</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Hills of Hops &amp; Haze. ABV 7.0%. A Hazy IPA in collaboration with our friends from Visit Bucks County! We heavily hopped this with Simcoe, Mosaic, and 586. Expect flavors and aromas that include citrus, berry, apricot, and sweet fruit. Oats were added to the mash to create a smooth body.</span></p>\n<p class=\"p3\"><span class=\"s2\" style=\"color: #993300;\"><b>WINE:</b></span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Bishop Estate Vineyard And Winery • Perkasie</b></span></p>\n<p class=\"p4\">Applenoonie Apple wine features crisp, sweet apples that pair nicely with spices when served warmed. Applenoonie is also the base wine in the winery’s fall sangria. Cranberries Dream combines Niagara wine with a hint of cranberry tart that makes this sweet wine a perfect complement to your turkey dinner. For pumpkin spice wine-lovers Bishop’s Smash’N Pumpkin features cinnamon, cloves and is reminiscent of pumpkin pie in a bottle.</p>\n<p class=\"p4\"><span class=\"s2\"><b>Boyd’s Cardinal Hollow Winery • Lahaska</b></span></p>\n<p class=\"p4\"><span class=\"s2\">There are many country wines that pair perfectly with late in the year food and sweets. Try their Apple Wine &#8211; the winemaker’s favorite apple wine to date filled with crisp flavor. Or, the seasonal Black Forest wine, featuring gold medal winning combo of cherries and real cocoa beans with a light body.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Buckingham Valley Vineyards<span class=\"Apple-converted-space\">  </span>• Buckingham</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Nana’s Apple Pie is 100% apple wine. The spices make this wine perfect as-is served warm in a mug on a chilly evening. Likewise, Buckingham’s Holiday Spice – a sweet red wine accented with natural spices – is a great wine for sipping warm.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Chaddsford Winery • Lahaska</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Their wine of the month of October is Spiced Apple, a tart and sweet wine with hints of spice that tastes like apple in a glass! Be sure to also try their Apple Iced Tea Cocktail featuring the wine.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Crossing Vineyards And Winery • Washington Crossing</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Crossing’s main seasonal wine is its Le Nouveau, a Beaujolais Nouveau style wine. The winery releases it each year on the weekend of the Bucks County Wine Trail’s Nouveau Celebration, which for 2021 will be Nov. 13-14. It pairs perfectly with holiday turkey and trimmings. During the holidays, Crossing features its signature Chocolate Cherry Truffle, a full-flavored Port-style wine featuring a complex aroma of dark chocolate mingled with notes of black cherry, ripe plum and toasted oak. The “dessert in a bottle” offers a rich and sweet taste, with a satisfying, warm finish.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Rushland Ridge Vineyards • Jamison</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Traminette, a spicy, aromatic semi-sweet wine, pairs nicely with holiday meals. The winery’s award-winning Cabernet Franc, a classic red, and its Chambourcin, a full-bodied red, are also great pairing options for hearty dinners.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Rose Bank Winery • Newtown</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Spiced Apple sweet wine tastes like “apple pie in a bottle” and is refreshing served over ice or warm to sip on a cold night. Another popular wine for fall and winter is Rose Bank’s Raspberry Secret, a decadent dessert wine made from red raspberries and rich, dark chocolate. Rose Bank’s Apple and Rose’ hard ciders are another fall and winter favorite.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Sand Castle Winery • Erwinna</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Alpine Spice is made from Chardonnay and Riesling with the perfect amount of spices. This sweet, mulled wine is refreshing served warmed or chilled. Alpine Spice can also be blended with rum to make a hot toddy.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Wycombe Vineyards • Furlong</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Stop over in fall and winter to enjoy their fire pits while sipping a sweet dessert wine, like their Apfelwein, which tastes like a crisp hard cider without the bubbles, or Everything Nice, which is a sweet spiced wine that tastes like apple pie, made exclusively with Chardonnay grapes and complements vanilla ice cream or cheesecake perfectly when served warm.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Vivat Alfa Winery • Doylestown</b></span></p>\n<p class=\"p4\"><span class=\"s2\">Try Magic Spice! This is a dessert, sweet wine, European blend and enjoyable hot in the wintertime next to a cozy fire.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/11/Great-Barn-Brewery.jpg"
}