{
  "id": 19997,
  "title": "In Their Words: Local Filmmaker Kevin Lapsley",
  "slug": "unmasking-monsters-below",
  "date": "2024-07-09T14:37:02",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [],
  "excerpt": "<p>“In Their Words” is a monthly feature in which people of interest help us get to know them better by finishing sentences we provide; in any way they see fit. To honor summer’s much anticipated Shark Week, which starts on July 7 on the Discovery Channel (and is hosted by John Cena!), we interviewed local [&hellip;]</p>\n",
  "content": "<p><span style=\"font-weight: 400;\">“In Their Words” is a monthly feature in which people of interest help us get to know them better by finishing sentences we provide; in any way they see fit. To honor summer’s much anticipated Shark Week, which starts on July 7 </span><span style=\"font-weight: 400;\">on the Discovery Channel (and is hosted by John Cena!), we interviewed local filmmaker Kevin Lapsley, who is one of the executive producers on the documentary Unmasking Monsters Below, a film that is sure to mesmerize viewers with its depiction of life in the water with sharks. Read on to learn more about Kevin and his work on this project, which ultimately portrays the beauty and importance of these fascinating sea creatures.</span></p>\n<figure id=\"attachment_20003\" aria-describedby=\"caption-attachment-20003\" style=\"width: 400px\" class=\"wp-caption alignleft\"><a href=\"https://doylestowncardinal.com/wp-content/uploads/2024/07/Kevin-Lapsley-image.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-20003\" src=\"https://doylestowncardinal.com/wp-content/uploads/2024/07/Kevin-Lapsley-image-225x300.jpg\" alt=\"Kevin Lapsley\" width=\"400\" height=\"533\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2024/07/Kevin-Lapsley-image-225x300.jpg 225w, https://doylestowncardinal.com/wp-content/uploads/2024/07/Kevin-Lapsley-image-768x1024.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2024/07/Kevin-Lapsley-image-990x1320.jpg 990w, https://doylestowncardinal.com/wp-content/uploads/2024/07/Kevin-Lapsley-image-1320x1760.jpg 1320w\" sizes=\"auto, (max-width: 400px) 100vw, 400px\" /></a><figcaption id=\"caption-attachment-20003\" class=\"wp-caption-text\">Kevin Lapsley</figcaption></figure>\n<p><b>I grew up in&#8230;</b><span style=\"font-weight: 400;\">Upper Black Eddy in Northern Bucks County. I attended Palisades High School and finished schooling at Penn State, University Park.</span></p>\n<p><b>One of my favorite parts of being back in the area again is&#8230;</b><span style=\"font-weight: 400;\">the time spent with family and friends.</span></p>\n<p><b>My career in filmmaking and producing has been&#8230;</b><span style=\"font-weight: 400;\">a winding road full of twists and turns that have taken me from film studios in North Carolina and Los Angeles, to location work in almost every state across the country.</span></p>\n<p><b>The first films I made were&#8230;</b><span style=\"font-weight: 400;\">home movies with my brother and cousins when we were kids, and then I really started to take things seriously when I made my first independent movie while at Penn State. After college, I moved to North Carolina, where I was able to work on full-scale, studio-produced television and film projects. Since then, it’s been a wide range of independently produced projects here in the tri-state area, more studio produced projects at almost every studio in Los Angeles, and music videos for a wide range of musicians in small towns and large cities from coast to coast.</span></p>\n<p><b>Unmasking Monsters Below came about because&#8230;</b><span style=\"font-weight: 400;\">thrill seeker/explorer/story-teller Justin Sago became aware of the many species-threatening issues surrounding sharks when he relocated to the state of Florida.</span></p>\n<p><b>I got involved with Unmasking Monsters Below&#8230;</b><span style=\"font-weight: 400;\">through my work with Nashville recording artists the Davisson Brothers Band and Chris Davisson’s connection to fellow West Virginia native, Justin Sago, director and executive producer of Unmasking Monsters Below.</span></p>\n<p><b>One of the coolest things I learned about sharks while producing this documentary was&#8230;</b><span style=\"font-weight: 400;\">all the different types of sharks that there are in the oceans of the world, and that people can</span></p>\n<p><span style=\"font-weight: 400;\">actually safely dive cage-free with sharks under the right circumstances.</span></p>\n<p><b>My view on sharks after working on this film&#8230;</b><span style=\"font-weight: 400;\">is that they are not bloodthirsty, mindless creatures like they are frequently depicted in movies and the media.</span></p>\n<p><b>I think viewers will most appreciate&#8230;</b><span style=\"font-weight: 400;\">the beautiful and amazing cinematography of people interacting in the water with sharks, and the efforts of the individuals in the documentary that are trying to do their part to be advocates for sharks.</span></p>\n<p><b>If I had the opportunity to swim with a shark now, I would&#8230;</b><span style=\"font-weight: 400;\">honestly, more than likely, still pass on the opportunity. I am not much of a thrill seeker and actually can get rather seasick. There is footage out there of me on a deep-sea fishing expedition proving that point. And, ironically, in an effort to cool off, and at the suggestion of the captain, there is footage of me jumping into the ocean, where I was more than likely—you guessed it—swimming with sharks.</span></p>\n<p><b>I am most proud of this film because&#8230;</b><span style=\"font-weight: 400;\">I like to say it’s a movie about good people trying to do good things. And also, because of the story, Justin, Ryan Mathews (director of photography, executive producer, cast member) and all the rest of the crew and cast, were able to make a movie that highlights the many important issues surrounding sharks and just how important sharks are to the ocean, and to people.</span></p>\n<p><b>To watch Unmasking Monsters Below&#8230;</b>we are having a free indoor screening at Zhad Albasha Mediterranean Grill &amp; Hookah Lounge (29 South Main Street, Doylestown, PA 18901) for Shark Month on Saturday July 20th, 2024. More information can be found at: <a href=\"http://sunviewnetwork.com/summer-screens\" target=\"_blank\" rel=\"noopener noreferrer\">sunviewnetwork.com/summer-screens</a> And we were also able to sign a distribution deal with Global Digital Releasing. Our team is actively working on bringing the movie to streaming platforms world-wide sometime later this year. All news surrounding where, when, how to watch, stream and own copies of the movie can be found on our official website at: <a href=\"http://unmaskingmonstersbelow.com\" target=\"_blank\" rel=\"noopener noreferrer\">unmaskingmonstersbelow.com</a> and on most social media platforms usually under @unmaskingmonstersbelow.</p>\n<p><b>Other films or projects I have worked on include&#8230;</b><span style=\"font-weight: 400;\">a very long and varied list at this point, which can be explored on IMDb. The projects I am eagerly trying to get to are a couple of screenplays/stories including “Motorcycle to Mars” (coming of age love story), “Tower Road” (horror), and “Hollywood Sunrise” (crime action thriller). Along with trying to find a production company to produce our award-winning screenplay “LimoCop” (crime action thriller).</span></p>\n<p><b>An award I’ve won that I’m really proud of is&#8230;</b><span style=\"font-weight: 400;\">every award that I, or a project I’ve been associated with, have won over the last couple years has been special in its own right, because I can honestly say that none of them have been because of a connection or anything like that, and have only been won because of the project itself. And it really is nice to be recognized here and there, because the journey has been a long one.</span></p>\n<p><b>The most interesting interaction I’ve had with a celebrity (that I can share!) is&#8230;</b><span style=\"font-weight: 400;\">ha, well, let’s see&#8230; my first day ever on a “real” production, Katie Holmes walked onto set and leaned </span><span style=\"font-weight: 400;\">up against the wall directly next to me, shoulder-to-shoulder basically, as the director went over </span><span style=\"font-weight: 400;\">the scene on a Dawson’s Creek episode, which was kind of fantastic. The time it was Mandy Moore, Wilmer Valderrama, the director and me getting shuttled back to the studio and Mandy got a call saying she was nominated for song of the year or something was fun. Sitting at a table talking with Lawrence Taylor, one of the NFL’s all-time toughest players, in between takes while he was in costume, wearing a dress, for a Showtime series. Kevin Connolly and I watching an NHL playoff game in between scenes in Beverly Hills on the set of Entourage. Trying not to sound dumb while having a conversation about black holes with Neil deGrasse Tyson on lunch break, and then Bill Nye showing up on set an hour later on a date, and wearing his trademark bow-tie, and telling a story about his lowest carbon footprint competition with Ed Begley Jr. was an interesting day. Or the time I finally got to be on set with Jennifer Love Hewitt and she broke my heart because she left holding hands with Jamie Kennedy! Those are a few of the ones just scratching the surface that I can tell from this crazy film journey I’ve been on through the years. You should hear some of the ones from life on the road with the bands, ha.</span></p>\n<figure id=\"attachment_20001\" aria-describedby=\"caption-attachment-20001\" style=\"width: 1024px\" class=\"wp-caption alignnone\"><a href=\"https://doylestowncardinal.com/wp-content/uploads/2024/07/Unmasking-Monsters-Below-diver-image.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-20001 size-large\" src=\"https://doylestowncardinal.com/wp-content/uploads/2024/07/Unmasking-Monsters-Below-diver-image-1024x683.jpg\" alt=\"Unmasking Monsters Below\" width=\"1024\" height=\"683\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2024/07/Unmasking-Monsters-Below-diver-image-1024x683.jpg 1024w, https://doylestowncardinal.com/wp-content/uploads/2024/07/Unmasking-Monsters-Below-diver-image-300x200.jpg 300w, https://doylestowncardinal.com/wp-content/uploads/2024/07/Unmasking-Monsters-Below-diver-image-768x512.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2024/07/Unmasking-Monsters-Below-diver-image-414x276.jpg 414w, https://doylestowncardinal.com/wp-content/uploads/2024/07/Unmasking-Monsters-Below-diver-image-470x313.jpg 470w, https://doylestowncardinal.com/wp-content/uploads/2024/07/Unmasking-Monsters-Below-diver-image-640x426.jpg 640w, https://doylestowncardinal.com/wp-content/uploads/2024/07/Unmasking-Monsters-Below-diver-image-130x86.jpg 130w, https://doylestowncardinal.com/wp-content/uploads/2024/07/Unmasking-Monsters-Below-diver-image-187x124.jpg 187w, https://doylestowncardinal.com/wp-content/uploads/2024/07/Unmasking-Monsters-Below-diver-image-990x660.jpg 990w, https://doylestowncardinal.com/wp-content/uploads/2024/07/Unmasking-Monsters-Below-diver-image-1320x880.jpg 1320w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" /></a><figcaption id=\"caption-attachment-20001\" class=\"wp-caption-text\">Unmasking Monsters Below</figcaption></figure>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/07/Unmasking-Monsters-Below-ad-image.jpg"
}