{
  "id": 19164,
  "title": "Waters Edge Winery &#038; Bistro of Doylestown Set to Open Its Doors",
  "slug": "waters-edge-winery-bistro-of-doylestown-set-to-open-its-doors",
  "date": "2024-03-15T15:30:16",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Eric and Nicole Landolfi",
    "Waters Edge Winery &amp; Bistro"
  ],
  "excerpt": "<p>Waters Edge Winery &amp; Bistro of Doylestown, an innovative family-owned craft winery, announced it will be opening its doors in early March. Led by husband-and-wife duo and local residents Eric and Nicole Landolfi, the new venue combines elements of a traditional winemaking experience with the popular, unique Waters Edge Wineries wine bar concept. Waters Edge [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">W</span><span class=\"s2\">aters Edge Winery &amp; Bistro of Doylestown, an innovative family-owned craft winery, announced it will be opening its doors in early March. Led by husband-and-wife duo and local residents Eric and Nicole Landolfi, the new venue combines elements of a traditional winemaking experience with the popular, unique Waters Edge Wineries wine bar concept.</span></p>\n<p class=\"p3\"><span class=\"s2\">Waters Edge Winery &amp; Bistro of Doylestown was brought to life from a deeply engrained love for exceptional wine, great food and time well spent with friends and family. “It is truly a lifelong dream for us to open a craft winery in Doylestown and we could not be more excited to officially open our doors and welcome in our community,” said Eric Landolfi. “We are thrilled to create a space where our neighbors can enjoy handcrafted wines and unique tasting experiences while creating lasting memories in the heart of Doylestown.”</span></p>\n<p class=\"p3\"><span class=\"s2\">Eric Landolfi, who brings extensive hospitality experience as well as business management expertise from his career in manufacturing, will run the winery with his wife Nicole, a respected title insurance agent in the community. When it opens later this month, Waters Edge Winery &amp; Bistro will offer a variety of wines globally sourced from wine regions around the world, all made in-house, for guests to enjoy including prominent varietals such as Merlots, Cabernets, Pinot Noirs, Sauvignon Blancs and Chardonnays. Other rare wines such as Barolos, Pinotages, and Petit Verdot will also be available, alongside unique adaptations including Peach Apricot Sangria and Pomegranate Sangria.</span></p>\n<p class=\"p3\"><span class=\"s2\">The winery’s menu is expected to showcase Eric’s Italian heritage, intertwined with an enticing selection of classic tapas including Gnoccheti Cacio E Peppe, Whipped Ricotta &amp; Honey and Cabernet Sliders along with Italian and Mediterranean style charcuterie boards to start off with. Guests will be able to enjoy a selection of paninis, sandwiches and flatbreads all to be completed with mouthwatering desserts including a limoncello flute and Coppa Tiramisu among others. A ‘Winemakers Table’ that accommodates 24 people will provide an exceptional experience with tastings of exquisitely aged wines drawn straight from the winery’s tanks.</span></p>\n<p class=\"p3\"><span class=\"s2\">For true wine enthusiasts, an exclusive wine club membership features four different options ranging from $40 per month to $95 per month. Membership perks include monthly bottles of wine, exclusive discounts on wine purchases, daily complimentary tastings, invitations to special events, discounts on winery events and more.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Waters Edge Winery &amp; Bistro of Doylestown, PA, is an independently owned and operated franchise location of Waters Edge Wineries, a California-based innovative urban winery system bringing the cultural experience of wine to communities across the country.</span></p>\n<p class=\"p3\"><span class=\"s3\">For more information on Waters Edge Winery &amp; Bistro Doylestown visit <a href=\"http://www.wewdoylestown.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.wewdoylestown.com</a>, follow us on Instagram @watersedgewinery_doylestown and Facebook or contact 267-689-9463. For more information on the wine club, visit <a href=\"https://wewdoylestown.com/wine-club\" target=\"_blank\" rel=\"noopener noreferrer\">https://wewdoylestown.com/wine-club</a>/.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/03/Waters-Edge-Winery.jpg"
}