{
  "id": 15420,
  "title": "Way of The Doylestown Ninja",
  "slug": "way-of-the-doylestown-ninja",
  "date": "2022-10-25T23:33:46",
  "author": "Staff",
  "category": [
    "Play",
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "Nate Schneller",
    "Way of The Doylestown Ninja"
  ],
  "excerpt": "<p>By Nate Schneller • The Cardinal Editorial Intern Recently, you may have heard through the grapevine about a certain resident roaming in Doylestown. Someone who embraces the shadows and uses his skill to bring joy and excitement to our little town. Yes, I am talking about the Doylestown Ninja.  If you haven’t heard, the Doylestown [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Nate Schneller • </strong>The Cardinal Editorial Intern</p>\n<p class=\"p3\"><span class=\"s2\">R</span><span class=\"s3\">ecently, you may have heard through the grapevine about a certain resident roaming in Doylestown. Someone who embraces the shadows and uses his skill to bring joy and excitement to our little town. Yes, I am talking about the Doylestown Ninja. </span></p>\n<p class=\"p5\"><span class=\"s3\">If you haven’t heard, the Doylestown Ninja is something of a local social media star. A look at his Instagram reveals a guy in a mask, wearing all black. His mission is to spread positivity and promote local businesses. I recently had the opportunity to talk to the Doylestown Ninja about what he does and how he got started. </span></p>\n<p class=\"p5\"><span class=\"s3\">Ninja is a lifelong Doylestown resident. “I’ve been here all my life,” he says. “I went to school here and I graduated from Central Bucks East.” He has since remained in the area.</span></p>\n<p class=\"p5\"><span class=\"s3\">When he was younger, Ninja tells me, he had a much different personality. “I was very timid and introverted, but I wanted to do more with my life.” Eventually, due to certain life circumstances, Ninja decided it was time for a change in attitude. “I decided to step out of my shell,” he says. “I just started telling myself, ‘You can do it.’ And it worked. It’s kind of simple. If you start telling yourself you’re awesome, then you will be.’” </span></p>\n<p class=\"p5\"><span class=\"s3\">The attitude change and his desire to do more would eventually lead to the birth of the Doylestown Ninja. Things got started back in 2020, at the start of the pandemic. Wanting to help cheer people up, Ninja decided to dress up and go out. “It started as a joke. I went to Applebees and filmed myself doing ninja katas. People in the window just stared and laughed. I’m sure they were like, ‘what the heck is that?’” </span></p>\n<p class=\"p5\"><span class=\"s3\">Eventually, as he went out more, people started noticing his videos, and he developed a fanbase. (He now has over 11,000 followers on instagram(@doylestownninja) These videos include him hanging out with members of the community and working to promote local businesses. His videos include interactions with Makers Off Main and Fabby-Do, among others. Whatever the content, Ninja’s videos are filled with silliness and positive energy.</span></p>\n<p class=\"p5\"><span class=\"s3\">A major part of Ninja’s activities is upholding his principle of dressing up as he pleases. “I encourage people to go out and wear what they want,” he says. This is something Ninja embodies completely as his appearance changes often. Past looks include a mohawk and blonde hair. He also has a specific Star Wars themed version of his ninja outfit he calls “Darth Ninja.”</span></p>\n<p class=\"p5\"><span class=\"s3\">Going along with these concepts, Ninja is also a big fan of cosplay. In the past, he’s dressed up as Captain America, a favorite of his. “Wearing that suit, you take on the character. I’ll call people ‘ma’am’ or bring on inside jokes like, ‘on your left.’” Besides the Captain, Ninja has other outfits in the works, like a Mandalorian outfit as well as a couple of other projects.   </span></p>\n<p class=\"p5\"><span class=\"s3\">I’m  glad I had the chance to talk with Ninja and I was very impressed with his positive outlook and philosophy. It’s clear, he cares very deeply about the community and just being nice to people. </span></p>\n<p class=\"p5\"><span class=\"s3\">“Man, this whole frickin’ world is one community,” he says. And that’s a wise bit of ninja wisdom right there. So, if y</span><span class=\"s1\">ou’re ever in Doylestown, keep your eyes peeled. The Doylestown Ninja could be lurking in the shadows.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/10/76A8A19F-A9E4-4D7B-A6BF-C25AC675C13D.jpeg"
}