{
  "id": 18781,
  "title": "What&#8217;s New in Town &#8211; DTown Cafe Launches in Doylestown",
  "slug": "whats-new-in-town-dtown-cafe-launches-in-doylestown",
  "date": "2024-01-19T17:12:35",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "DTown Cafe"
  ],
  "excerpt": "<p>DTown Cafe is the new lunch and pastry shop open Monday &#8211; Friday in the Doylestown Commerce Center on 2005 South Easton Road, in the back of Building A. Indulge in homemade food, away from crowds and with ample free parking on the premises.  Many of the food offerings have been passed down through generations [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">D</span><span class=\"s2\">Town Cafe is the new lunch and pastry shop open Monday &#8211; Friday in the Doylestown Commerce Center on 2005 South Easton Road, in the back of Building A. Indulge in homemade food, away from crowds and with ample free parking on the premises.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Many of the food offerings have been passed down through generations as family recipes. A big seller is Pierogies which are not only delicious but are a true family tradition. The pierogies are made old-world-style with potato dough, and a variety of different fillings, including the popular potato and cheese, sauerkraut, and buffalo chicken. They are made fresh and then frozen for your convenience.</span></p>\n<p class=\"p3\"><span class=\"s2\">Dtown Cafe also makes bread daily from scratch, as well as a variety of pastries and confections such as our delicious cinnamon buns, cookies, and</span></p>\n<p class=\"p1\"><span class=\"s1\">Place orders online at <a href=\"http://dtown.cafe\" target=\"_blank\" rel=\"noopener noreferrer\">dtown.cafe</a>, on facebook page @DtownCafe, or in person at 2005 South Easton Road.</span></p>\n<p class=\"p4\"><strong>About Chef Conar:</strong></p>\n<p class=\"p3\"><span class=\"s2\">Chef Conar Welsh was born and raised in Bucks County (a CB East grad) and is a graduate of the prestigious Le Cordon Bleu Paris. He is proficient in savory cuisine, pastry, and bread.</span></p>\n<p class=\"p3\"><span class=\"s2\">Conar has worked with some of the best chefs in the world cooking French, Italian, Mexican, Thai, Southern BBQ, Midwestern Tex-Mex, Polish, and Irish cuisine, but his favorite thing to cook will always be seafood.</span></p>\n<p class=\"p3\"><span class=\"s2\">Originally inspired and taught to cook by his mother Lisa, you will now find them working in the cafe together.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/01/image0.jpeg"
}