{
  "id": 11544,
  "title": "What Makes A Wine Fine?",
  "slug": "what-makes-a-wine-fine",
  "date": "2021-10-13T21:03:36",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "aillinn brennan",
    "doylestown cardinal",
    "fine wine"
  ],
  "excerpt": "<p>By Aillinn Brennan • Special to The Cardinal Vintage From now through the Fall harvest, the 2021 vintage is being picked and fermented! Some years go better for wine growing than others. Vintage is important because it denotes the growing conditions of the grapes for that particular year, in a particular place. Factors such  as [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Aillinn Brennan • </b>Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s1\"><b>Vintage</b></span></p>\n<p class=\"p3\"><span class=\"s1\">From now through the Fall harvest, the 2021 vintage is being picked and fermented! Some years go better for wine growing than others. Vintage is important because it denotes the growing conditions of the grapes for that particular year, in a particular place. Factors such<span class=\"Apple-converted-space\">  </span>as the weather, climate change, wild fires, and drought all inform how a particular vintage will end up tasting. Wine critics put out charts with numeric ratings for vintages by region.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\"><b>A<span class=\"Apple-converted-space\">  </span>Wines Report Card</b></span></p>\n<p class=\"p3\"><span class=\"s1\">Ever see the pictures of fancy wine people, in a fancy<span class=\"Apple-converted-space\">  </span>hotel banquet hall with dozens of<span class=\"Apple-converted-space\">  </span>glasses<span class=\"Apple-converted-space\">  </span>of wine in<span class=\"Apple-converted-space\">  </span>front<span class=\"Apple-converted-space\">  </span>of them, swirling,<span class=\"Apple-converted-space\">  </span>sniffing, tasting and then spitting<span class=\"Apple-converted-space\">  </span>it out? They are evaluating wines. On wine labels you might come across a little round label that says “90 points” <span class=\"Apple-converted-space\">  </span>with some guy’s name on it<span class=\"Apple-converted-space\">  </span>like “James<span class=\"Apple-converted-space\">  </span>Suckling”<span class=\"Apple-converted-space\">  </span>or “Robert Parker.” You also might come across points and the name of a publication like “Wine Enthusiast”<span class=\"Apple-converted-space\">  </span>or “Wine Spectator.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">In the wine world you are striving for an “A” 90 or above. In Robert Parker’s rating system, 96-100 are “extraordinary,” 90 to 95 are” outstanding.” Anything less that 59 is “appalling,” you’ll never see a sticker for those ones!<span class=\"Apple-converted-space\">  </span>Look for those ratings stickers<span class=\"Apple-converted-space\">  </span>with a 90 or above and you found a fine<span class=\"Apple-converted-space\">  </span>wine!<span class=\"Apple-converted-space\">   </span></span></p>\n<p class=\"p3\"><span class=\"s1\"><b>Knowing Where It’s From: Region,<span class=\"Apple-converted-space\">  </span>Sub-Region, Appellation<span class=\"Apple-converted-space\"> </span></b></span></p>\n<p class=\"p3\"><span class=\"s1\">Specific regions and appellations, the village the grapes are from, can also point you toward a fine wine. The French wine region of Burgundy is famous for its Pino Noir wines. Within Burgundy there are sub-regions, and within<span class=\"Apple-converted-space\">  </span>the sub -regions are villages or appellations which must adhere to strict laws.</span></p>\n<p class=\"p3\"><span class=\"s1\"><b>Time To Shop! <span class=\"Apple-converted-space\"> </span></b></span></p>\n<p class=\"p3\"><span class=\"s1\">Let’s look for some red Burgundy. Robert Parker gave the 2016 vintage of Côtes de Nuit<span class=\"Apple-converted-space\">  </span>(a<span class=\"Apple-converted-space\">  </span>Sub-Region of Burgundy) 97 points! A red, 2016, Cote de Nuits, from<span class=\"Apple-converted-space\">  </span>the appellation “Côtes de Nuit – Villages” goes for around $35. Not bad for an “extraordinary” wine. The grapes for this wine were sourced from multiple vineyards<span class=\"Apple-converted-space\">  </span>from within that appellation.</span></p>\n<p class=\"p3\"><span class=\"s1\">In Burgundy, some of the appellations<span class=\"Apple-converted-space\">  </span>produce some of the most expensive wines in the world. Those wines come from specific vineyards within a famous appellation. Continuing to shop for Côte de Nuit, in the appellation of Vosne-Romanée, and the vineyard of Romanée St Vivant, that bottle of Pino Noir will cost around two thousand dollars depending on the vintage! Thirty-six<span class=\"Apple-converted-space\">  </span>dollars, two thousand dollars, they are both fine wines!</span></p>\n<p class=\"p3\"><span class=\"s1\"><b>“California,” Red Wine</b></span></p>\n<p class=\"p3\"><span class=\"s1\">Not so fine. 85 percent of wine produced in the United states comes from California. Regional designation is important to finding a fine American wine. California wines are popular and most people<span class=\"Apple-converted-space\">  </span>grab-and-go with a Kendall Jackson, or Woodbridge “California” cabernet. If you just see the word California on the label, that means the grapes used to produce the wine can come from any AVA, American Viticultural Area, in the entire state which is huge, and produces vast numbers of grapes.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">Think massive scale production, machine harvested grapes and swimming pool size vats of wine. It’s not necessarily a negative judgement on the wine, but “fine” has<span class=\"Apple-converted-space\">  </span>to be more special, about a specific place. It’s a macro, micro situation.</span></p>\n<p class=\"p3\"><span class=\"s1\">Next time, take a closer to look at the label and you’ll likely find one within the same price point with a regional designation such “Central Coast” or “Alexander Valley” or “Lodi.” <span class=\"Apple-converted-space\">  </span>AVA’s within famed Napa Valley produce some of the world’s finest wines</span></p>\n<p class=\"p3\"><span class=\"s1\">Vintage,<span class=\"Apple-converted-space\">  </span>points, regions, appellation, AVA! Now you’re ready to peruse like a pro next time you go shopping for wine. Happy new vintage!</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/10/fine-wine.jpg"
}