{
  "id": 15436,
  "title": "What’s New In Town: La Frida’s",
  "slug": "whats-new-in-town-la-fridas",
  "date": "2022-10-25T23:45:04",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Enoelio Ambrocio",
    "La Frida’s"
  ],
  "excerpt": "<p>By Jules from @FortheLoveofDoylestown • The Cardinal Contributing Writer Enoelio Ambrocio arrived in Norristown in 2003. He left his home in Southern Mexico because he had no other choice &#8211; there was no opportunity or money in the small village. Upon arriving in Pennsylvania, he worked for Lee’s Hoagie House in Blue Bell for 13 [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Jules from @FortheLoveofDoylestown • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">E</span><span class=\"s3\">noelio Ambrocio arrived in Norristown in 2003. He left his home in Southern Mexico because he had no other choice &#8211; there was no opportunity or money in the small village. Upon arriving in Pennsylvania, he worked for Lee’s Hoagie House in Blue Bell for 13 years. There, he learned as much as he could about the restaurant industry. Later, he got a job at California Kitchen in Doylestown, which is now the location of Enoelio’s very own restaurant &#8211; Las Frida’s Mexican Kitchen.</span></p>\n<p class=\"p5\"><span class=\"s3\">Ambrocio chose Doylestown as the location for the business he runs with two partners due the neighborly nature of his customers. “People are very, very friendly here,” he says. “I feel welcome. I always wanted a restaurant and this feels like a dream. It’s been very busy and I just cannot believe this is happening.”</span></p>\n<p class=\"p5\"><span class=\"s3\">The charm of the restaurant is casual and authentic. The artwork of Frida Kahlo, a well-known Mexican painter, enhances the orange and yellow walls, adding a cheerful and welcoming feel.</span></p>\n<p class=\"p5\"><span class=\"s3\">The restaurant serves breakfast, lunch, and dinner. A popular breakfast favorite is the Huevos Divorciados, which includes two sunny-side-up eggs on top of a flat, crispy tortilla, spread with beans and cheese and topped with ranchero and green sauce. Cilantro, lime, sour cream, and avocado accompany this hearty breakfast. Other customer favorites include tacos, burritos, and burrito bowls. I ordered the Chile Relleno &#8211; a traditional Mexican stuffed-pepper dish &#8211; twice now, and I am happy to report that it is delightfully fresh and perfectly spiced.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Then, there is Mexican coffee. I overheard other customers complimenting it and I asked for a cup. I loved it. It was strong, dark, and smooth with hints of cinnamon. I will definitely be returning just for the coffee alone.</span></p>\n<p class=\"p5\"><span class=\"s3\">In addition to dining in, and delivery options set to start soon, Las Frida’s offers off-site catering. For $16 a person, the restaurant’s team will set up a delicious on-location taco bar. Long-term goals include the acquisition of a liquor license. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Ambrocio is living out his dream. He beams with gratitude and humble pride. He still resides in Norristown with his wife and four children. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The Doylestown location of Las Frida’s Mexican Kitchen marks the third location of the brand, with other locations in Maple Glen and Lansdale. The fourth location in Norristown will be opening within a month. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><i>Jules lives in Doylestown with her husband, son and two rescue dogs.<span class=\"Apple-converted-space\">  </span>In her spare time, she enjoys performing with her improv troupe The Department of Lost Socks, singing for the Bucks County Choral Society and acting in local shows.<span class=\"Apple-converted-space\"> </span></i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/10/Enoelio-Ambrocio-e1666755895517.jpg"
}