{
  "id": 19616,
  "title": "When You Just Can’t “Wing It” Anymore, Call Wingmom",
  "slug": "wingmom-bucks-county",
  "date": "2024-05-13T11:23:23",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "Bucks County Moms",
    "community support",
    "family support",
    "moms"
  ],
  "excerpt": "<p>By Danielle Gannon • Cardinal Contributing Writer Carla Altomare, a cardiovascular perfusionist and epidemiologist and a mom of three maintained her sanity by hiring “Wingmom” in Delaware back in 2017, at the company’s inception.  “I am meticulous with my life,” Altomare says. “My house, my laundry, it all has to be done. And done right. [&hellip;]</p>\n",
  "content": "<p><b>By Danielle Gannon <em>• </em></b>Cardinal Contributing Writer</p>\n<p><span style=\"font-weight: 400;\">Carla Altomare, a cardiovascular perfusionist and epidemiologist and a mom of three maintained her sanity by hiring “Wingmom” in Delaware back in 2017, at the company’s inception. </span></p>\n<p><span style=\"font-weight: 400;\">“I am meticulous with my life,” Altomare says. “My house, my laundry, it all has to be done. And done right. Raising three (at teh time) teens, with a high-pressure position, working around the clock, Wingmom was what truly saved me. </span></p>\n<p><span style=\"font-weight: 400;\">“I used the personal assistant, which was my absolute favorite position within Wingmom. They handle laundry, empty dishes, clean the house, tidy, cut veggies, pick up dry cleaning.. whatever you need. They are your extra set of hands,” boasts Altomare.</span></p>\n<p><span style=\"font-weight: 400;\">In late 2022, Altomare was convinced this was a service that not only did she support and use, but one she wanted to become involved with. “I called Kate Maxwell, the owner of Wingmom Inc. and I said, I want to open a Wingmom,” Altomare laughs.</span></p>\n<p><span style=\"font-weight: 400;\">The company not only helps <a href=\"https://doylestowncardinal.com/live/life-lessons-from-local-moms/\">working and busy moms</a> but empowers moms on the other side. These are women who are looking to make money to put their kids through extracurricular activities, and school and want to make money around their children’s schedules.“I appreciate and support both sides of the equation at Wingmom, Altomare says.</span></p>\n<p><span style=\"font-weight: 400;\">Originally from Bucks County, Altomare decided to move back to Bucks County after her youngest left for college last fall. Her older children were in college and the natural pull was to come back home. All of Altomare’s friends and family live here or close by. She is a Villa Joseph Marie alumna and is very involved. In May of 2023, Wingmom Bucks County launched. “We are here to “build a great support village” for our clients, says Altomare. “There is no reason to do it all on your own.”</span></p>\n<p><span style=\"font-weight: 400;\">Wingmom is very involved in the community. Being born, raised, and now returning to her old stomping grounds, Altomare is committed to weaving herself into the pulse of people here. She sponsors the Council Rock North softball team, Villa Joseph Marie, the PA RHINO conservation advocate (PARCA), and The Jimmy Way, to name a few. </span></p>\n<p><span style=\"font-weight: 400;\">At Thanksgiving time, the company chooses four local families in need to gift them big baskets full of all the fixings for the family holiday. During the Christmas season, they very humbly were able to give a wonderful holiday to many in need.</span></p>\n<p><span style=\"font-weight: 400;\">In Bucks County, babysitting and home organizing are huge, along with personal shopping and gift wrapping. “We have even had a client hire us to test drive a car for them, Altomare smiles. It is evident that the trust just keeps building once you work with Altomare and her team.</span></p>\n<p><span style=\"font-weight: 400;\">Giancarlo, Carla’s son is graduating from the Haub School of Business at St. Joseph’s University in June and will be joining Wingmom as the Chief Financial Officer. Devon, her dear friend&#8217;s daughter, is the Director of Business Development.</span></p>\n<p><span style=\"font-weight: 400;\">In March 2024, Altomare opened Wingmom Princeton. And when asked what the future holds for Wingmom…. she lit up! Sparks were coming out of her ears as she picked up her phone and dialed Kate Maxwell, the Wingmom founder. She placed her on speaker and said, “Kate! I am sitting here with Danielle, being interviewed for Local Spotlight, is it ok to share the next big news for Wingmom?” Kate said, “Yes! Do it!” Carla shouted.</span></p>\n<p><span style=\"font-weight: 400;\">The news? Wingmom Main Line is next to launch! “I will then own three branches of Wingmom &#8211; Bucks County, Princeton, and the Main Line,” gleamed Altomare. </span></p>\n<p><span style=\"font-weight: 400;\">At this time there are Wingmom’s in Delaware, Catskills, and Southeastern PA, in addition to the three Altomare runs. “I like that everything is very real and genuine, says Devon Kilgariff (Director of Business Development). “There is a very personal touch, and it starts from the top down.”</span></p>\n<p><span style=\"font-weight: 400;\">All of the owners of the branches are very tight. They are all women who see the vision of this business model and maintain the utmost importance of sticking to the original mission: “To build a support village.”</span></p>\n<p><span style=\"font-weight: 400;\">Dr. Carla Altomare wears a lot of hats. Doctor, Clinician, Adjunct Professor, Business Owner, future podcast host (Hot Mom Check-in stay tuned for more on this!), and Mom. The most important role is being a mother to her three children. Being an owner of this franchise allows her to do visit them as they embark on Dental school and college days. </span></p>\n<p><span style=\"font-weight: 400;\">As we were wrapping up our interview, we heard a knock on her office door. It was Altomare’s dad, Angelo. He stopped by to surprise her. “It is so good to have you home,” he smiled, “Home, doing what you do best, and that’s always been helping people,” Angelo proudly said. </span></p>\n<p><span style=\"font-weight: 400;\">We had a late appointment and had to close up, but we could have chatted for hours. Altomare had to be up at 5 am. She was heading to a client’s house to fill a personal assistant role before heading to the hospital and then to her office for a meeting. </span></p>\n<p><span style=\"font-weight: 400;\">“Wingmom is a win-win for everybody. It’s supporting the household, assisting in the purchase of those special pairs of shoes or cleats, and at the same time, assisting the Mom, who is so desperately in need of help,” says Altomare. </span></p>\n<p><span style=\"font-weight: 400;\">Connect with Wingmom Bucks County at 215-360-3151 or Wingmom Princeton at 302-268-6432. </span><a href=\"http://www.wingmominc.com/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">www.wingmominc.com</span></a><span style=\"font-weight: 400;\"> </span></p>\n<p><em><span style=\"font-weight: 400;\">Danielle Gannon<br />\n</span><span style=\"font-weight: 400;\">Founder &amp; Creative Director<br />\n</span><span style=\"font-weight: 400;\">Local Spotlight with Danielle<br />\n</span><span style=\"font-weight: 400;\">267-980-2176 </span><a href=\"http://www.localspotlightwithdanielle.com/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">www.localspotlightwithdanielle.com</span></a><span style=\"font-weight: 400;\"> </span></em></p>\n<p><em><span style=\"font-weight: 400;\">&#8220;The Voice Behind Small Business&#8221;</span></em></p>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/05/Wingmom.png"
}