{
  "id": 17706,
  "title": "YMCA Partners with USA Triathlon to Bring USA Kids Tri to Bucks and Hunterdon Counties",
  "slug": "ymca-partners-with-usa-triathlon-to-bring-usa-kids-tri-to-bucks-and-hunterdon-counties",
  "date": "2023-06-16T16:33:50",
  "author": "Staff",
  "category": [
    "Fit",
    "Play"
  ],
  "tags": [
    "doylestown cardinal",
    "ymca"
  ],
  "excerpt": "<p>YMCA of Bucks and Hunterdon Counties has announced a new partnership with USA Triathlon, launching the USA Kids Tri initiative throughout Bucks County, PA and Hunterdon County, NJ. Kicking off the partnership in Doylestown, PA, the inaugural Kids Tri youth program began last month at the Doylestown branch, where the Y also offers Kids Tri [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">Y</span><span class=\"s2\">MCA of Bucks and Hunterdon Counties has announced a new partnership with USA Triathlon, launching the USA Kids Tri initiative throughout Bucks County, PA and Hunterdon County, NJ. Kicking off the partnership in Doylestown, PA, the inaugural Kids Tri youth program began last month at the Doylestown branch, where the Y also offers Kids Tri Summer Camp, and will host the 13th annual YMCA Kids Triathlon race on August 13. </span></p>\n<p class=\"p3\"><span class=\"s2\">“At the Y we are always seeking new partnerships to foster youth development that create community out of healthy, inclusive competition,” said Trish Feinthel, chief operations officer for YMCA of Bucks and Hunterdon Counties. “Our Kids Tri has always been a great example of that, so it is exciting to expand those opportunities to all kids throughout the year.”</span></p>\n<p class=\"p3\"><span class=\"s2\">Taught by YMCA and USA Triathlon Certified Coaches, the Kids Tri program is designed to introduce youth to multi-sport opportunities for lifelong success in the sport. This program will focus on general conditioning, along with swim, bike, run, and transition skills to prepare for fun competition in youth triathlons. Weekly sessions include drills and games with an emphasis on fun, competition, and sportsmanship, capped off with a mini triathlon to celebrate program completion.</span></p>\n<p class=\"p3\"><span class=\"s2\">Powered by USA Triathlon’s USA Kids Tri, the eight week YMCA Kids Triathlon program is designed to help children be ready to compete to complete the YMCA Kids Triathlon race on August 13. All USA Kids Tri programs include structured time for kids to connect with peers and USA Triathlon certified coaches, a youth-focused kids triathlon curriculum, and the chance to compete locally. </span></p>\n<p class=\"p3\"><span class=\"s2\">“Compete to complete is our inclusive mantra for competition at the Y,” Feinthel continued. “Our Kids Triathlon program and race are for all youth who wish to be active and healthy in a fun, safe place where they can learn and excel together. More experienced athletes set the example for our newcomers, with the goal for all to complete the race.”</span></p>\n<p class=\"p3\"><span class=\"s2\">“Creating more consistent opportunities for kids to engage in triathlon and multisport by practicing and participating with their friends will lead to the fun-filled unforgettable moments that stay with them for a lifetime,” said Emma O’Brien, USA Triathlon youth program coordinator. “When the activity becomes intertwined with their routines, friends and interests, it becomes a healthy passion. The USA Kids Tri program will introduce the sport in a fun, non-competitive fashion for athletes from all backgrounds.”</span></p>\n<p class=\"p3\"><span class=\"s2\">The USA Triathlon Foundation is supporting the Y with training resources and equipment including heart rate monitors, pedometers, Wahoo Kickr Bike Trainers, and Zone 3 goggles and swim caps. All youth athletes who participate in the YMCA’s Kids Tri programs, camp and/or race receive a free USA Triathlon Youth Annual Membership. Benefits of USA Triathlon Youth Membership include access to an online, members-only dashboard with giveaways and usatriathlon.org/youth resources, opportunities to participate in youth sanctioned events, an online subscription to the quarterly USA Triathlon Magazine (with a Kids’ Section), and exclusive discounts from USA Triathlon sponsors.</span></p>\n<p class=\"p3\"><span class=\"s2\">The YMCA is pleased to offer Financial Assistance to those who qualify, for any of the YMCA Kids Tri programs, camps or races.</span></p>\n<p class=\"p3\"><span class=\"s2\">To learn more and to register for the inaugural YMCA Kids Tr Program or 13th annual YMCA Kids Triathlon race, visit <a href=\"http://ymcabhc.org/kids-tri\" target=\"_blank\" rel=\"noopener noreferrer\">ymcabhc.org/kids-tri</a>.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/06/YMCA-Finishers.jpg"
}