{
  "id": 11778,
  "title": "You Are a Gift",
  "slug": "you-are-a-gift-2",
  "date": "2021-12-10T10:59:15",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "colin kirts",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Colin Kirts • Special to The Cardinal In late 2009, I had this youthful idea to start a movement called youarethegift. Naturally, I expected it to be a big hit and for everyone to just seamlessly get on board. As such, I launched this project around Christmas. The intention was to inspire people to [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong><span class=\"s1\">By Colin Kirts • </span></strong><span class=\"s1\">Special to The Cardinal </span></p>\n<p class=\"p3\"><span class=\"s3\">I</span><span class=\"s2\">n late 2009, I had this youthful idea to start a movement called youarethegift. Naturally, I expected it to be a big hit and for everyone to just seamlessly get on board. As such, I launched this project around Christmas. The intention was to inspire people to see themselves—as opposed to stuff—as the gift most worth giving.</span></p>\n<p class=\"p5\"><span class=\"s2\">Suffice it to say, it did not take off in the way that I had hoped it would. It didn’t really take off at all, in fact. Looking back at the somewhat naive 23 year old I was at the time, this actually makes a lot of sense. As well-intentioned a project as it was, I clearly did not have the real world experience to validate and to substantiate such a concept.</span></p>\n<p class=\"p5\"><span class=\"s2\">Honestly, today I kind of view the whole endeavor as overly hippie dippie, to say the least. It was even a bit narcissistic. I was only 23, though. Cut me some slack.</span></p>\n<p class=\"p5\"><span class=\"s2\">And then, 2020 happened. Yah, there were some events in between, but I think recent issues have put a lot of this in perspective. Without a doubt, we have seen the absolute need for, well, stuff. From hand sanitizer and PPE, to medicine, and, of course, food, there is no denying our shared need for certain things.</span></p>\n<p class=\"p5\"><span class=\"s2\">Throughout the last 18 months or so, though, we have heard quite a bit about an equally significant tale, that of loneliness, and of the literal danger of isolation. We don’t need to compare stats here; the bottom line is, we all need real material items—and we always will—and we also need connection.</span></p>\n<p class=\"p5\"><span class=\"s2\">If we can hone in on just this one lesson for now, I sincerely believe 2022 could be a year like no other. Both/And. It’s a phrase I hear more and more these days, and, I couldn’t be happier about. It’s a fairly straightforward concept. Both this And that can have value. They both can—and probably do—matter. It’s a way of thinking which serves more to integrate than to alienate.<span class=\"Apple-converted-space\">  </span>Implicit to its message, of course, is the need to embrace all. When you really dig into it, in fact, funny enough, it even allows you to sometimes embrace what we call an either/or attitude.</span></p>\n<p class=\"p5\"><span class=\"s2\">Case in point, there is a need for both toilet paper and, well, eye contact. Let’s consider a few relatable examples. How about George Bailey. Yes, George Bailey of the obviously relevant classic Christmas tale It’s a Wonderful Life. First off, if you haven’t seen it, why the heck not? Regardless, maybe this is your lucky year. Second, this won’t be a spoiler; it’s a fairly well known plot.</span></p>\n<p class=\"p5\"><span class=\"s2\">There’s a very specific reason George’s story—and Mary’s, for that matter, and Zuzu’s, etc. etc.—is so heartbreakingly beautiful. Yes, George gets the money he needs. He’s not going to jail, to say the least, and that’s important. The money matters. Arguably, though, the reason I am tearing up even as I write this—and why I am wanting to play Auld Lang Syne right now—is because of how he gets the money.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Connection. The quality of George’s RELATIONSHIPS. This is why George succeeds in the end. Without even knowing it, he literally spent his entire life showing everyone around him that they mattered. That’s it. That’s why, in the end, he became the richest man in town, and why his life was wonderful.</span></p>\n<p class=\"p5\"><span class=\"s2\">Even more importantly, though, is the fact that everyone in Bedford Falls felt the effect. The entire community was nourished by this feedback of presence.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Heck, we can even begrudgingly tease out this essential theme from Squid Game, if we must…</span></p>\n<p class=\"p5\"><span class=\"s2\">On that note, yes, poverty is real. Money is important. Starvation is dangerous, and unfortunately, food insecurity is not likely to go away anytime soon. Both this hard fact and the reality that loneliness kills are true.</span></p>\n<p class=\"p5\"><span class=\"s2\">This year, I propose we take the so called spirit of giving and extend it as long as we can. There’s no reason for it not to be the new norm, quite frankly. In a recent interview, in fact, I was asked about charity. “Why”, the host wondered, “do we feel so good when we give?” If you need a reason, I’d like you to try to boil it down to this one simple fact: everything is connected. When you give, for real, you get. It’s not magic, it’s just how it works. The trick is, quite simply, to make it real…</span></p>\n<p class=\"p5\"><span class=\"s2\">As we begin anew, consider making it your norm to see connections. Wave. Smile. Even honk your horn. Bug your neighbor, for crying out loud. They’ll eventually appreciate it. Probably. Whatever the case, whether you’re regifting toilet paper or lysol wipes from your private stash, or you are going the route of just being more present with everyone in your life, really give. Mean it. The stuff is a gift. Time is a gift. And, why not… you are the gift…</span></p>\n<p class=\"p7\"><i>KORU Real Wellness is a somatic education center, founded by Colin Kirts and Alex Siegel in 2018. It is home to the Movement Matters Podcast as well as the Real Wellness Education Model. As Alex and Colin like to say, “Be good, do your best, and have fun.” With this spirit, at the very least, KORU is a place where you can relearn to enjoy being yourself, and enjoy the never-ending process of growing into someone new. For more visit <a href=\"http://www.wearekoru.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.wearekoru.com</a> or call (215) 348-5977</i></p>\n<p class=\"p1\"><b>Coming Event at Koru Real Wellness</b></p>\n<p class=\"p2\"><b>• Cacao Ceremony •</b></p>\n<p class=\"p2\">December 11 from 4:00 &#8211; 7:00pm</p>\n<p class=\"p2\">$55/person.</p>\n<p class=\"p2\">As ancestral medicine becomes more of a cliche these days, having a clear understanding of what it entitles is what makes a difference between just having a good time and truly experiencing healing and transformation through these practices.</p>\n<p class=\"p2\">We invite you to join us as we explore the ancestral tradition of the Andes in this Cacao circle.</p>\n<p class=\"p2\">We will give an introduction to ancestral plant medicine and how it differs from modern medicine.</p>\n<p class=\"p2\"><b>What is Cacao?</b></p>\n<p class=\"p2\">Cacao is one of the ancient plant medicines used by natives in Central and part of South America. It is known as a heart opener because it stimulates blood circulation which increases activity in the brain and nervous system. As it does this, it energetically connects the mind with the heart allowing us to be in tune with ourselves and those around us.</p>\n<p class=\"p2\"><b>Your Guides</b></p>\n<p class=\"p2\"><span class=\"s1\">Carolina has been working and training with natives in Peru for over ten years where she received the title of Paqo or Inca mesa carrier. She has been part of and has hosted multiple national and international plant medicine and self-discovering retreats. Certified Yoga instructor since 2015, she practices Tibetan Buddhism and is recognized as a holistic massage therapist.</span></p>\n<p class=\"p2\">Shane is a world traveler, hiking guide and certified Tai Chi instructor.  He has been working with ancestral plant medicines for over six years.</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/12/You-are-a-gift.jpg"
}