{
  "id": 14137,
  "title": "10 Free Things to Do with Kids This Summer",
  "slug": "10-free-things-to-do-with-kids-this-summer",
  "date": "2022-07-13T17:18:25",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Fit",
    "Live",
    "Play",
    "Taste"
  ],
  "tags": [
    "dana roberts",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer Summer is a delightful time for kids. They get to enjoy long hours of freedom, treats from the ice cream truck, vacations, and later bedtimes. And for parents it is certainly a wonderful time to make memories and languish at a slower pace. However, filling those long [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Dana Roberts</strong> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">S</span><span class=\"s1\">ummer is a delightful time for kids. They get to enjoy long hours of freedom, treats from the ice cream truck, vacations, and later bedtimes. And for parents it is certainly a wonderful time to make memories and languish at a slower pace. However, filling those long days of summer can be exhausting, not to mention expensive. </span></p>\n<p class=\"p5\"><span class=\"s1\">Here are 10 fun, free, and unique things to do with kids in and around Doylestown. </span></p>\n<p class=\"p6\"><strong>1 • Take Advantage of the Doylestown Library</strong></p>\n<p class=\"p5\"><span class=\"s1\">Storytime at the library continues into the summer, held most Mondays in July at 9:30 and 10:30am.</span></p>\n<p class=\"p5\"><span class=\"s1\">Additionally, the library’s Summer Quest program is a bonanza of awesome activities for kids: </span></p>\n<p class=\"p5\"><span class=\"s1\">• Stories and Songs with Lolly Hopwood every Tuesday morning at 10am</span></p>\n<p class=\"p5\"><span class=\"s1\">• Crafts and special activities (a Bubble Party! Making a Jar of Happiness!) Wednesdays at 10 am</span></p>\n<p class=\"p5\"><span class=\"s1\">• A YouTube-based movement and exercise program on Fridays at 10am</span></p>\n<p class=\"p5\"><span class=\"s1\">• Special events like the NJ Snakeman on Thursday 7/21 at 1pm</span></p>\n<p class=\"p5\"><span class=\"s1\">• Evening programs include Eyes of the Wild on Thursday 7/14 at 7pm, Kids Yoga Play with Kate Wilcox on Monday 7/18 at 6:30pm, and a Hula Hoop Dance Party on Wednesday 7/20 at 6:30pm. </span></p>\n<p class=\"p5\"><span class=\"s1\">And don’t forget to explore the Backyard at the library, a kid-friendly enclosed outdoor space.</span></p>\n<p class=\"p5\"><span class=\"s1\">Click on the Doylestown branch at <a href=\"http://calendar.buckslib.org\" target=\"_blank\" rel=\"noopener noreferrer\">calendar.buckslib.org</a> for detailed information. </span></p>\n<p class=\"p1\"><strong><span class=\"s3\">2 • Watch a Movie Under the Stars</span></strong></p>\n<p class=\"p4\"><span class=\"s4\">While technically free for children 5 and under only (tickets are $12 for the general public, $10 for members and $8 for 18 and under) this activity is an absolute must if you are a Doylestown resident—child or adult alike. The Mercer Museum and the County Theater, in partnership with The Moving Picture Cinema, bring outdoor family-friendly movies to the community on the third Thursday of each month on the green of the Mercer Museum. </span></p>\n<p class=\"p4\"><span class=\"s4\">July 21st, gates open at 7:45 and Mamma Mia (the Sing-a-Long version!) starts at 8:45. </span></p>\n<p class=\"p4\"><span class=\"s4\">August 18th, gates open at 7:15 and The Karate Kid begins at 8:15. </span></p>\n<p class=\"p5\"><span class=\"s4\">Shows in September and October include Legally Blonde and Labyrinth. </span></p>\n<p class=\"p5\"><span class=\"s4\">For tickets and more information: h<a href=\"//www.mercermuseum.org/moviesatthemercer\" target=\"_blank\" rel=\"noopener noreferrer\">ttps://www.mercermuseum.org/moviesatthemercer</a></span></p>\n<p class=\"p1\"><strong><span class=\"s3\">3 • Cool off at the Splash Pad at Warwick Community Park</span></strong></p>\n<p class=\"p4\"><span class=\"s4\">This lesser-known playground to most Doylestown residents is located in Jamison, behind the Warwick Township Police Department. It features a spray pole, perfect for cooling off after running around the multiple playgrounds. Warwick Township Community Park, 1733 Township Greene, Jamison</span></p>\n<p class=\"p1\"><strong><span class=\"s3\">4 • Walk Amidst Dinosaurs</span></strong></p>\n<p class=\"p4\"><span class=\"s4\">Best of France Antiques, at the corner of 313 and 202, is a fantastic haven for kids to explore. Affectionately dubbed “Dino Garden”, it is a largely outdoor antique place that features sculptures and works of art, as well as several ponds where kids can spy fish, frogs, and other creatures. Even more captivating are the two peacocks that roam the premises.</span></p>\n<p class=\"p5\"><span class=\"s4\">Best of France Antiques, 3686 US-202, Doylestown</span></p>\n<p class=\"p1\"><strong><span class=\"s3\">5 • Doylestown Borough Parks and Recreation Summer Shows for Children at Burpee Park</span></strong></p>\n<p class=\"p4\"><span class=\"s4\">With help of their awesome sponsors, C&amp;N, Central Bucks Education Association, and Simply Fresh by McCaffrey’s, the Borough is putting on some amazing free shows this summer at Burpee Park. </span></p>\n<p class=\"p5\"><span class=\"s4\">Bring your own chairs and enjoy Family Stages’ Hansel and Gretel on Wednesday 6/29 (rain date 7/6), Magician Jeff Ballew on Wednesday 7/13 (rain date 7/14), and Lolly Hopwood &amp; Friends’ Interactive Play on Thursday 7/28 (rain date 8/4). All events start at 9:30 am. </span></p>\n<p class=\"p5\"><span class=\"s1\">For information check Parks &amp; Recreation Programs at <a href=\"http://doylestownborough.net\" target=\"_blank\" rel=\"noopener noreferrer\">doylestownborough.net</a>.</span></p>\n<p class=\"p1\"><strong><span class=\"s3\">6 • Enjoy a Summer Concert</span></strong></p>\n<p class=\"p4\"><span class=\"s4\">On Wednesday nights at 7pm through the summer, take your family and head to the C&amp;N Amphitheater for the free and family-friendly Thompson Performing Arts Series at Central Park. July’s performers include Seamus Kelleher, an Irish Master Storyteller and singer, on July 6th, Studio Two (Beatles tribute band) on July 13th, Real Diamond (a Neal Diamond tribute band) on July 20th, and Frontiers (The World’s Number one Tribute to Journey) on July 27th. Shows run every Wednesday through August 31st. An extra draw for adults 21 and over is the Beer Garden, courtesy of Warwick Farm Brewing, which opens at 6pm. </span></p>\n<p class=\"p5\"><a href=\"https://doylestownpa.org/parks-rec-home/performing-arts\" target=\"_blank\" rel=\"noopener noreferrer\"><span class=\"s4\">https://doylestownpa.org/parks-rec-home/performing-arts</span></a></p>\n<p class=\"p1\"><strong><span class=\"s3\">7 • Head to the Farmer’s Market</span></strong></p>\n<p class=\"p5\"><span class=\"s4\">Most Doylestown residents know about our Farmer’s Market that takes place each Saturday, which is a great place to take kids to people-watch and find a snack on a Saturday morning. But the New Britain Farmer’s Market is my personal favorite, largely for the fun it provides my children. Located in the field behind the New Britain Baptist Church, the Market occurs Wednesdays from 4pm-7pm, from May 28-September 28. There is live music, a great selection of vendors to peruse, and ample space for kids to run and play while parents relax and enjoy Market goods or a picnic of their own. Dinner options (not free!) include a pizza truck and burger truck that typically make an appearance.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">Follow the New Britain Borough Farmers Market on Facebook for a list of vendors each week and updates!</span></p>\n<p class=\"p1\"><strong><span class=\"s3\">8 • Ride Bikes at Doylestown Pump Track</span></strong></p>\n<p class=\"p4\"><span class=\"s4\">The pump track at Chapman Park is a gem of a place to take your confident bike rider to burn some steam and have some fun.<span class=\"Apple-converted-space\">  </span>The track is a dirt track with berms and rollers, designed to challenge all experience levels. The park also features a playground and some woody trails to explore. </span></p>\n<p class=\"p5\"><span class=\"s4\">Check trail conditions on the Doylestown Borough Parks and Rec Facebook Page and on Instagram @dtownpumptrack. </span></p>\n<p class=\"p5\"><span class=\"s4\">Doylestown Pump Track at Chapman Park, 10 McKinstry Avenue, Doylestown</span></p>\n<p class=\"p1\"><strong><span class=\"s3\">9 • Walk across the New Hope/Lambertville Bridge</span></strong></p>\n<p class=\"p4\"><span class=\"s4\">For a view that is not to be beaten and an experience that will enthrall your children, park on the Lambertville side of the bridge and walk across the bridge into New Hope. Kids will love watching boats pass below the bridge and the thrill of being high above water. Take advantage of the delicious food options at the very kid-friendly Ferry Market, around the corner in New Hope once you cross the bridge. </span></p>\n<p class=\"p5\"><span class=\"s4\">New Hope-Lambertville Bridge, U.S. Route 202, New Hope</span></p>\n<p class=\"p5\"><span class=\"s4\">Ferry Market, 32 South Main Street, New Hope<span class=\"Apple-converted-space\">  </span><a href=\"http://theferrymarket.com\" target=\"_blank\" rel=\"noopener noreferrer\">theferrymarket.com</a></span></p>\n<p class=\"p1\"><strong><span class=\"s3\">10 • Dip your Feet in a Creek</span></strong></p>\n<p class=\"p4\"><span class=\"s4\">Wading in creeks, looking for critters, and feeling mud squish between toes is a near-universal delight for children. </span></p>\n<p class=\"p4\"><span class=\"s4\">Head to the Wilma Quinlan Nature Preserve in New Britain Borough and take the trail all the way down and around to the left for an excellent wading spot. Wilma Quinlan Nature Preserve, 626 Mathews Avenue, New Britain, 18901</span></p>\n<p class=\"p5\"><span class=\"s4\">Explore Krupp Park in Chalfont, behind the Chalfont Borough Administration Building on Main Street. This park has a pavilion, walking bridge, and picnic area with a swing. Krupp Park, 32 N. Main Street, Chalfont</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/07/2020-Movies-at-the-Mercer-3-Wide-Web-1-scaled.jpg"
}