{
  "id": 11782,
  "title": "A Sitdown with Musician Matt Freedman",
  "slug": "11782",
  "date": "2021-12-10T11:08:19",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "Matt Freedman",
    "Villa Capri"
  ],
  "excerpt": "<p>The new “Pots and Pans Show” section of The Cardinal, brought to you by Villa Capri, highlights local musicians and the restaurants that host their live music. Please send your music lineups and news to Jess@DoylestownCardinal.com A melodious chat with local musician Matt Freedman Tell us about yourself and your music. When and how did [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><b>The new “Pots and Pans Show” section of The Cardinal, brought to you by Villa Capri, highlights local musicians and the restaurants that host their live music. Please send your music lineups and news to <a href=\"mailto:Jess@DoylestownCardinal.com\">Jess@DoylestownCardinal.com</a></b></span></p>\n<p class=\"p1\"><span class=\"s1\"><i>A melodious chat with local musician Matt Freedman</i></span></p>\n<p class=\"p3\"><strong>Tell us about yourself and your music. When and how did you get started? </strong></p>\n<p class=\"p4\"><span class=\"s2\">Sure! My name is Matt Freedman, I’m a local singer/songwriter and grew up in the area. I went to Council Rock High School and met my first bandmates when I was in middle school playing in the jazz band. I played football in college as a quarterback at Bloomsburg University, and blew my knee out my junior year, and turned to music to get me through the tough rehabilitation.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">I had been playing the drums and guitar since the age of 12/13, so it felt natural to turn to writing songs. I had a band in my early twenties with friends from high school and played a lot regionally for several years. When my wife and I got married and had our first daughter, I took a bit of a break from music to focus on family, now we have two girls and another baby on the way! <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">So, my music career has spanned over 15 years, now travelling back and forth to Nashville to record, play songwriter showcases and to continue my career there.</span></p>\n<p class=\"p3\"><strong><span class=\"s1\">Who/what is your inspiration? Describe your creative process when you write new music. </span></strong></p>\n<p class=\"p4\"><span class=\"s2\">As someone who writes every day both by myself and with others (called co-writing) I typically am always very in tune to my surroundings, and the people that I’m with.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">For me, good songs come from the places that you’re NOT looking for inspiration. When things aren’t forced, and I’m not pressured to write a ‘radio’ song. I find inspiration in everything. My kids, my wife, friends, travel, and being around music generally. I’ve written hundreds of songs, and the best ones are always coming from a place of introspection reflecting on something that I’ve gone through or seen someone close to me go through.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">Too many songwriters today make the mistake of trying to write a ‘hit’.<span class=\"Apple-converted-space\">  </span>My process typically starts with a spark of an idea that can come from just walking down the street. Then I try to really pay attention to all the sensory influences around me, what I’m seeing, what I’m hearing, smelling etc. That helps me really paint a picture for the listener and bring them into the world of the song.</span></p>\n<p class=\"p3\"><strong>Describe your favorite and least favorite part about being a musician. <span class=\"s2\"> </span></strong></p>\n<p class=\"p4\"><span class=\"s4\">Favorite hands down is the writing process. For me its therapy, its prayer, it’s my sanctuary. I love collaborating with other writers too, it’s amazing how talented people are. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Least favorite part is lugging my equipment all over the place playing gigs.. the setup and load in is always the worst part of being a musician haha. Don’t get me wrong, I’m so blessed to be able to perform music especially after 18 months where live music wasn’t happening!  </span></p>\n<figure id=\"attachment_11784\" aria-describedby=\"caption-attachment-11784\" style=\"width: 2100px\" class=\"wp-caption alignnone\"><a href=\"/data/media/Matt-Freedman.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-11784\" src=\"/data/media/Matt-Freedman.jpg\" alt=\"\" width=\"2100\" height=\"1400\" srcset=\"/data/media/Matt-Freedman.jpg 2100w, /data/media/Matt-Freedman-300x200.jpg 300w, /data/media/Matt-Freedman-768x512.jpg 768w, /data/media/Matt-Freedman-1024x683.jpg 1024w, /data/media/Matt-Freedman-414x276.jpg 414w, /data/media/Matt-Freedman-470x313.jpg 470w, /data/media/Matt-Freedman-640x426.jpg 640w, /data/media/Matt-Freedman-130x86.jpg 130w, /data/media/Matt-Freedman-187x124.jpg 187w, /data/media/Matt-Freedman-990x660.jpg 990w, /data/media/Matt-Freedman-1320x880.jpg 1320w\" sizes=\"auto, (max-width: 2100px) 100vw, 2100px\" /></a><figcaption id=\"caption-attachment-11784\" class=\"wp-caption-text\">Matt Freedman</figcaption></figure>\n<p class=\"p3\"><strong>Tell us about your favorite performance of your career. </strong></p>\n<p class=\"p4\"><span class=\"s2\"><span class=\"Apple-converted-space\"> </span>I think for me it was opening for Miranda Lambert this summer. It was in front of my hometown with a ton of friends and family in the crowd.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">We had 7 people in the band, all of whom I’m close friends with, and many I have been playing and writing with for many years. I debuted 12 original songs many of which are on my upcoming album, and it was amazing to hear so many singing the words back to us, on songs that aren’t even released yet.</span></p>\n<p class=\"p3\"><strong>Do you have any hobbies or interests outside of music? </strong></p>\n<p class=\"p4\"><span class=\"s2\">Absolutely! I love to cook and enjoy being active. I love playing golf, pickup basketball and being outside with my kids. </span></p>\n<p class=\"p3\"><strong>Why Doylestown? How is it being a musician in this town?</strong></p>\n<p class=\"p4\"><span class=\"s2\">Of all the towns locally, it seemed Doylestown had the strongest music presence, and Matt Manninno from Villa Capri is SO dedicated to music and the artists that I instantly fell in love with the venue and his energy. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">I’ve always called Villa Capri my musical home, no matter where this journey takes me, that stage with their staff &#8211; Alicia, Scott, Dan, Matt and everyone is my home. I’m incredibly humbled that they gave me a chance on an open mic night not long ago, that truly sparked this phase of my journey as an artist. </span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/12/Pots-and-Pans-Picture.jpg"
}