{
  "id": 17301,
  "title": "Get to Know a Doylestownian: Glenda Childs",
  "slug": "17301",
  "date": "2023-04-12T12:22:39",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live"
  ],
  "tags": [
    "dana roberts",
    "doylestown cardinal",
    "glenda childs",
    "library"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer “Get to Know a Doylestownian” is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide; in any way they see fit. Since March is National Reading Month, we wanted to celebrate the [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Dana Roberts • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><em>“Get to Know a Doylestownian” is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide; in any way they see fit. Since March is National Reading Month, we wanted to celebrate the joys of reading and honor our local bookstore by interviewing <span class=\"s2\">Glenda Childs</span>, the owner of <span class=\"s2\">The Doylestown Bookshop</span>. Read on to learn the inside scoop on being the proprietor of such a magical place, as well as all of Glenda’s book recommendations. Visit The Doylestown Bookshop at 16 S. Main Street, Doylestown, or its sister store, the <span class=\"s2\">Lahaska Bookshop</span>, at 162 A Peddler’s Village, Lahaska. You can also visit the website at doylestownbookshop.com, where you can buy books directly and check out book clubs and special events the Bookshop hosts.<span class=\"Apple-converted-space\"> </span></em></p>\n<p class=\"p1\"><em><span class=\"s3\">Glenda with her dog, Irene. Irene comes to the bookshop on Wednesdays and loves seeing staff and customers!<span class=\"Apple-converted-space\"> </span></span></em></p>\n<p class=\"p1\"><span class=\"s3\"><b>If I could describe the Doylestown Bookshop in 15 words or less, I would say it is</b>&#8230; A place to get lost in and discover books that entertain, educate, and enrich.</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>Purchasing the Doylestown Bookshop in 2012 was</b>&#8230; So exciting, a dream come true! But it was also overwhelming; I had so much to learn. Luckily, I had a great staff to teach me and a wonderful community that embraced me and the bookstore!</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>Before I made the purchase, the Bookshop was owned by</b>&#8230; Pat Gerney, who bought it 25 years ago from Village Green Bookstore.</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>My favorite times in the Bookshop are when</b>&#8230; the store is filled with people, talking to each other, sitting on the floor looking at books and there are kids laying on the floor reading a book or being read to. My second favorite time is before we open the doors in the morning; all is quiet as the books and staff await the possibilities when we open the doors!</span></p>\n<p class=\"p1\"><b>The Bookshop has a staff of</b>&#8230; between 18-25 booksellers, depending on the time of year. We have six full-time staff, mostly working in the back offices. We usually have a couple of high school students and a couple of college students. We love when our college students come back on their breaks and work in the bookshop again.</p>\n<p class=\"p1\"><span class=\"s3\"><b>An interview question I always ask people who want to work at the Bookshop is</b>&#8230; Why do you want to work at the bookshop and what are you reading right now?<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><span class=\"s3\"><b>If I had to bring 3 books to a desert island with me, I would bring</b>&#8230; Impossible to choose just three! But here goes: The Pillars of the Earth by Ken Follett, any Jane Austen book, and some kind of wilderness survival book!</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>Each year, I read</b>&#8230; a Christmas-themed book during December. This year I read the Mistletoe Murder and Other Stories, by P.D. James.</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>My preferred way to get news is</b>&#8230; I’m not a big news follower. I read the Herald and the Patch when I can. My husband, an avid news follower, keeps me posted on the important stuff I might have missed!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><span class=\"s3\"><b>Some of the bigger-name authors we have hosted at the Bookshop for readings include</b>&#8230; John Grisham, Chris Bohjalian, Anna Quindlen, Debbie Macomber, Jennifer Weiner, Alexander McCall Smith, Lidia Bastianich, Jack Carr, Jason Reynolds, Brad Meltzer, Lisa Scottoline, Nick Foles, Art Garfunkel.</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>One of my favorite authors to meet in person was</b>… They are all so different and have such interesting stories, I don’t have a favorite!</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>My favorite part of my previous career in early childhood education wa</b>s&#8230; Inspiring a love of reading and books.</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>If parents want to cultivate a love of reading in their children, I encourage them to</b>&#8230; Read to their children from a very early age and let their children see them enjoying a good book!</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>The book bans and challenges that are currently going on</b>&#8230;. Are truly challenging for everyone. I stay focused on our mission to support and connect to our community through books and events, putting books into the hands of every reader.</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>I have lived in Doylestown for</b>&#8230;. Eleven years.</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>Previous places I lived include</b>&#8230; Nashville, TN; Irvine, CA; Chicago IL; Boston, MA; Jacksonville, FL. I explored independent bookstores wherever I lived, to feed my dream of owning one someday!</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>My love for reading and books started</b>&#8230; when I was six years old and read my first real book. It was a miracle to read words on a page and see a story in my mind. The book was Alice in Wonderland, a great book for imagery!</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>My family includes</b>&#8230;. My husband, Allen, and our dog, Irene. Our daughter lives in Ambler with her family, including our two granddaughters. We have a son in Chicago and a son and his family in Grand Forks, ND with two more grandchildren there! My husband’s extended family lives nearby. It is wonderful to get together with all of them!</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>The book I recommend over and over to adults is</b>&#8230; Last year it was Lessons in Chemistry, by Bonnie Garmus.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><span class=\"s3\"><b>The book I love to give for a baby shower or new baby’s library is</b>&#8230; Goodnight Moon, by Margaret Wise Brown, and also Good Night, Gorilla, by Peggy Rathmann.</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>A book that I love for teens is.</b>.. I Must Betray You, by Ruta Sepetys.</span></p>\n<p class=\"p1\"><b>Besides books, popular items that the Bookshop sells include</b>&#8230; Gifts, journals, greeting cards, and puzzles!</p>\n<p class=\"p5\"><b>If I pop over to Native Cafe, our Main Street neighbor, I usually order</b>… Hot chocolate.</p>\n<p class=\"p1\"><b>My favorite place/way to read is</b>&#8230; In a comfy chair overlooking our backyard, with my dog snuggled close and a cup of tea or coffee.</p>\n<p class=\"p1\"><b>For me, reading is</b>&#8230; My great escape. Whether fiction or non-fiction, reading lets me leave all my concerns behind and get lost in another world!</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/Glenda-Childs.jpeg"
}