{
  "id": 18021,
  "title": "2023 Bucks County Classic Set For September 10",
  "slug": "2023-bucks-county-classic-set-for-september-10",
  "date": "2023-08-12T14:59:12",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "2023 Bucks County Classic",
    "doylestown cardinal"
  ],
  "excerpt": "<p>On September 10 the Bucks County Classic bike race returns to Doylestown, PA. Now in its 19th edition the race has become a highlight of the year for residents, racers and community members. Featuring some of the top racers in the country and taking place the same weekend as the Doylestown Arts Festival it’s a [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">O</span><span class=\"s2\">n September 10 the Bucks County Classic bike race returns to Doylestown, PA. Now in its 19th edition the race has become a highlight of the year for residents, racers and community members. Featuring some of the top racers in the country and taking place the same weekend as the Doylestown Arts Festival it’s a day not to be missed.</span></p>\n<p class=\"p3\"><span class=\"s2\">“It was hard to imagine the Bucks County Classic and Doylestown Arts Festival existing together in 2004. But now they are intrinsically linked and are one of our most anticipated weekends. The Bucks County Classic brings riders from all over the world and has expanded to include children’s, women’s and amateur races. On Sunday our streets are lined with spectators and the ringing of cowbells urges cyclists to the finish line.” says Doylestown Mayor Noni West.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Race day activities on the 1.4 mile course begin with masters and amateur men’s and women’s races. Community members can try the course during the Herald Ride the Course or Jarrett Vaughan Builders Kids Ride and Sprints. In the afternoon, pros from across the country and around the world take to the streets for the Doylestown Health Pro Women’s and Thompson Pro Men’s races. All events start from the start/finish line at Court and Printers Alley. Day of registration is available but pre registration is encouraged. Registration is via BikeReg <a href=\"https://www.bikereg.com/bucks-county-classic\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.bikereg.com/bucks-county-classic<span class=\"Apple-converted-space\"> </span></a></span></p>\n<p class=\"p3\"><span class=\"s2\">Notable racers in the 2022 event included Thompson Pro Men Winner Scott McGill. McGill won 2 stages of the Volta a Portugal in August 2022 and just two weeks after the Bucks County Classic win went on to compete in the UCI Road Race Worlds Championships in Australia. He was one of five Americans to be selected to compete at worlds and one of only one hundred and three racers to finish the 165 mile race.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Former Mexican Road National Champion Katia Martinez of Goldman Sachs ETFs Racing took the win for the Doylestown Health Pro Women’s race. She also won the Easton Twilight Criterium and Tour of Somerville in 2022.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">The 2023 race is made possible by the support of the Thompson Organization, Doylestown Health, Eastburn and Gray, the Borough of Doylestown, Marshall Financial Group, Hepatitis B Foundation, Baruch S Blumberg Institute, Pennsylvania Biotechnology Center, Doylestown Health Foundation, Verge Sport, Jarrett Vaughan Builders, C&amp;N Bank, Terrain, UndrBudr, Paper and Leaf and Raben Cleaning.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><strong>Race Day Schedule:</strong></p>\n<p class=\"p3\"><span class=\"s2\">9:10 AM Masters 45+</span></p>\n<p class=\"p3\"><span class=\"s2\">9:55 AM Women Category 3/4<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">10:35 AM Men Category 2/3</span></p>\n<p class=\"p3\"><span class=\"s2\">11:30 AM The Herald Ride the Course</span></p>\n<p class=\"p3\"><span class=\"s2\">12:05 PM Doylestown Health Women Pro/1/2<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">1:10 PM Jarrett Vaughan Builders Kids Ride and Sprints<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">1:50 PM Thompson Men Pro/1/2<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong>For more information on the Bucks County Classic and the weekend’s events,<span class=\"Apple-converted-space\">  </span>please visit: <a href=\"http://www.buckscountyclassic.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.buckscountyclassic.com</a></strong></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/08/Scott-McGill-Wins-the-2022-Thompson-Pro-Mens-Race-photo-by-Mike-Maney.jpeg"
}