{
  "id": 17779,
  "title": "5 Awesome Activities for the Summer",
  "slug": "5-awesome-activities-for-the-summer",
  "date": "2023-06-16T17:08:19",
  "author": "Staff",
  "category": [
    "Live",
    "Play",
    "Taste"
  ],
  "tags": [
    "Addie Baab",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Addie Baab  (4th grader at Buckingham Elementary School) • Special to The Cardinal We’ve all been there. After devouring breakfast and dressing for the glorious summer day, you realize you have nothing to do. Look no further! Here are five awesome activities to do in the Doylestown and New Hope areas. 1. Go Swimming [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><em><strong>By Addie Baab</strong></em><span class=\"Apple-converted-space\">  </span></span><i>(4th grader at Buckingham Elementary School) • </i>Special to The Cardinal</p>\n<p class=\"p4\"><span class=\"s3\">W</span><span class=\"s2\">e’ve all been there. After devouring breakfast and dressing for the glorious summer day, you realize you have nothing to do. Look no further! Here are five awesome activities to do in the Doylestown and New Hope areas.</span></p>\n<p class=\"p6\"><strong>1. Go Swimming</strong></p>\n<p class=\"p7\"><span class=\"s2\">Who said you needed a pool in your own backyard? Noone. Families can go for a swim at Fanny Chapman Pool in Doylestown. If you sign up for a membership, you can have a whole summer of swimming. Not interested in a full membership? You can swim for a day and pay only $15 per person if you are not a member, or $5-7 if you are visiting with a member. Fanny Chapman has five main pools, including an adults-only pool, a baby pool, and a diving pool equipped with two low diving boards, and one high dive.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><span class=\"s2\">If you are willing to drive, visit the Menlo pool. Menlo pool, complete with a water slide, snack bar, and a rock wall could easily be the best pool in the world. No matter which one you chose, every pool will get you out of the heat.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong>2. Buy a Sweet Frozen Treat</strong></p>\n<p class=\"p7\"><span class=\"s2\">Ice cream, popsicles, and water ice are the best treats on a hot summer day.<span class=\"Apple-converted-space\">  </span>If you’re looking for ice cream, I would recommend Nina’s Waffles or Owowcow.<span class=\"Apple-converted-space\">  </span>Water ice is best at Rita’s and Annie’s. They have amazing flavors like cotton candy!<span class=\"Apple-converted-space\">  </span>If you’re not one to go and buy something sweet to cool off, simply grab a popsicle out of the freezer and enjoy. Of course, ice cream trucks stop at pools and parks too.<span class=\"Apple-converted-space\">  </span>Mr. Sloby, a Doylestown ice cream truck legend, has been serving the community by selling sweet treats for 27 years.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong>3. Ride Your Bike</strong></p>\n<p class=\"p7\"><span class=\"s2\">There are plenty of good biking trails around town including the pump track at Fanny Chapman. At Peace Valley Park, you can take the six-mile loop around Lake Galena.<span class=\"Apple-converted-space\">  </span>If you’re a more experienced rider, you could also try the mountain biking trail at Lake Nockamixon. There are family-friendly bike trails throughout Bucks County for all levels of riders.</span></p>\n<p class=\"p6\"><strong>4. Go to a Park</strong></p>\n<p class=\"p7\"><span class=\"s2\">There are so many recreational parks in the area.<span class=\"Apple-converted-space\">  </span>My personal favorite is Lion’s Pride Park because of all of its newer features, like an obstacle course you can take to get to one of the slides. Some other parks in the area include Kid’s Castle, a park with a big castle you can go into (and get lost in) and Burpee Park, which has a merry-go-round and two separate playgrounds, suitable for all ages.</span></p>\n<p class=\"p6\"><strong>5. Shop in Doylestown</strong></p>\n<p class=\"p7\"><span class=\"s4\">After lunch, you might want to go out and do something.<span class=\"Apple-converted-space\">  </span>So why not go out shopping?<span class=\"Apple-converted-space\">  </span>Doylestown has plenty of places to check out and shop until you drop!<span class=\"Apple-converted-space\">  </span>If you’re looking for things to do, Fabby Do is the place for you. They have crafts and even host birthday parties.<span class=\"Apple-converted-space\">  </span>Great reading material can be found at Cyborg One, the best comic book store around.<span class=\"Apple-converted-space\">  </span>They have walls of books, bobbleheads, and posters. If you have no idea what to wear, Gap has got you covered. You can buy T-shirts and baby wear, as well as sweatshirts and adult wear. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><span class=\"s2\">Busy Bee, found on East State St., has everything from adorable stuffed animals to Pop-Its. It’s the perfect place to get a gift. To round our Doylestown shopping spree off, Evolution Candy is the best place to get a sweet treat.<span class=\"Apple-converted-space\">  </span>From gum to chocolates, they have the widest selection of delicious candies to choose from.</span></p>\n<p class=\"p7\"><span class=\"s2\">Boredom in the summer will be easy to conquer with these five options so close to home!</span></p>\n<p class=\"p1\"><i>Adelaide C. Baab is a 4th grader at Buckingham Elementary School.<span class=\"Apple-converted-space\">  </span>In her free time, she enjoys practicing soccer, drawing, reading, and writing. She is the oldest of 3 kids and wants to be an author when she grows up.</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/06/Fanny-Chapman.jpg"
}