{
  "id": 11825,
  "title": "5 Fashion Tips for Staying Stylish This Winter",
  "slug": "5-fashion-tips-for-staying-stylish-this-winter",
  "date": "2021-12-12T12:58:37",
  "author": "Staff",
  "category": [
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "lorraine jensen",
    "winter clothing"
  ],
  "excerpt": "<p>by Lorraine Jensen &#8211; Holly Hill Boutique • Special to The Cardinal 1) As the cold weather approaches, it’s time to pull out the cozy clothing and accessories. But before you put away all your summer styles, try reimagining them as additions to your colder wardrobe. At Holly Hill Boutique, we embrace the notion of [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>by Lorraine Jensen &#8211; Holly Hill Boutique • </b>Special to The Cardinal</p>\n<p class=\"p4\">1) As the cold weather approaches, it’s time to pull out the cozy clothing and accessories. But before you put away all your summer styles, try reimagining them as additions to your colder wardrobe. At Holly Hill Boutique, we embrace the notion of many of the items in your closet being all-season styles. Here are some ways you can transform your spring and summer clothing into fall and winter fashion:</p>\n<p class=\"p4\">• Pair your sundress with a chunky cardigan, tights and boots to easily go from summer nights to fall mornings. For added warmth, swap the tights for leggings and add a coat.</p>\n<p class=\"p4\">• What about a skinny turtleneck and blazer with your white jeans? White doesn’t have to be left behind after Labor Day! Add tall boots to make it even cozier.</p>\n<p class=\"p4\">2) As for denim, anything goes this season! Wide leg, flare, cropped, straight, and especially high waisted. One of our favorites for a dressier look is the trouser jean in dark wash. Of course, we are always a fan of a relaxed, broken in pair too. Add a sweater and necklace to your favorite pair, or a cardigan with a crisp white shirt.</p>\n<p class=\"p4\">3) The must have item for this season is the “shacket”! A combination of shirt and jacket, it is the perfect addition to your winter wardrobe. Try it open over a dress, buttoned up over a turtleneck with leggings, or even over a tee and jeans on those days where the weather can’t make up its mind!</p>\n<p class=\"p4\">4) A cute new bootie(short boot) can jazz up your look! One of our favorites this season is the Chelsea bootie. Perfect for dresses, leggings, or jeans.</p>\n<p class=\"p4\">5) A chic new scarf is a great way to elevate your look, too. Leave it long or tie it up to stay cozy.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\"> Stop by and check out our boutique for all your clothing, shoes, gifts, and accessories. As a Doylestown merchant for 12 years, we pride ourselves on personal customer service and affordable style &#8212; nothing in our shop is over $100! We carry a thoughtfully curated selection for a wide range of ages and tastes.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\">You can also visit us at <a href=\"http://hollyhillboutique.com\" target=\"_blank\" rel=\"noopener noreferrer\">hollyhillboutique.com</a> or on Instagram at @hollyhill180</p>\n<p class=\"p4\">Holly Hill Boutique, 180 W State St in Doylestown.</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/12/winter-fashion.jpg"
}