{
  "id": 18528,
  "title": "A New Chapter for Doylestown Bookstore",
  "slug": "a-new-chapter-for-doylestown-bookstore",
  "date": "2023-12-14T16:33:45",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "The Doylestown Bookshop"
  ],
  "excerpt": "<p>By Jamie Brenner • Special to The Cardinal The Doylestown Bookshop celebrated its twenty-fifth anniversary this year, and with it, new ownership. After more than a decade at the helm, Glenda Childs has passed the baton to Lauren and Damian Ford of Furlong, who will also assume ownership of sister-store Lahaska Bookshop in Peddler’s Village. [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">By Jamie Brenner • </span><span class=\"s1\">Special to The Cardinal</span></p>\n<p class=\"p3\"><span class=\"s3\">The Doylestown Bookshop celebrated its twenty-fifth anniversary this year, and with it, new ownership. After more than a decade at the helm, Glenda Childs has passed the baton to Lauren and Damian Ford of Furlong, who will also assume ownership of sister-store Lahaska Bookshop in Peddler’s Village.</span></p>\n<p class=\"p4\"><span class=\"s3\">“I’ve loved my years of ownership and the opportunity to serve our community’s literary needs. I look forward to continuing to be one of the Bookshops’ best customers,” Glenda says. “I’m excited for the future of the bookshop under the ownership of Lauren and Damian Ford.”</span></p>\n<p class=\"p4\"><span class=\"s3\">The Fords know a thing or two about carrying on a business legacy. Their family company, Hendrixson’s Furniture, founded fifty years ago, has locations both in Bucks County and Lehigh County. Damian Ford says of their new venture, “The warm welcome we’ve received is a testament to the strong sense of community that surrounds these beloved bookshops.”</span></p>\n<p class=\"p4\"><span class=\"s3\">The Doylestown Bookshop staff remains unchanged, a team that includes Krisy Elisii, events, and social media manager; Jennifer Brenninger, general manager and adult books buyer; and children’s books buyer Hannah Smith. “Meeting and working alongside the incredibly talented and dedicated staff has been a true highlight for us,” Damian says. “Their passion for books and commitment to sharing that love is a true gift.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">One bookseller, in particular, serves as a bridge between past and present. The store supervisor Honor Ford, Lauren and Damian’s daughter, has worked at the store for the last seven years. Honor started working at Doylestown Bookshop the summer after her freshman year at Susquehanna University, where she studied creative writing. While she looked for a job, her grandmother approached Glenda Childs at church, asking if she had any positions available at the bookshop. “I don’t think they really [needed help] at the time,” Honor says. “But Glenda made room for me.” A highlight of that first summer was hosting legendary author John Grisham in conversation with Lisa Scottoline.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\"><span class=\"Apple-converted-space\"> </span>“Such a wonderful perk of this job is I get to meet authors on a daily basis,” Honor says. “I think a lot of the times, as with any job, you run the risk of that becoming your normal. Then I have to register: this is what I want to do with my life and it’s great meeting people who are living that out. And really nice people.”</span></p>\n<p class=\"p4\"><span class=\"s3\">Looking ahead, the owners hope to offer workshops and programs with local businesses. Also on the agenda: writers’ workshops, and a revival of local author readings that fell by the wayside during the pandemic. On Small Business Saturday, Nov. 25, the bookshop is celebrating with a day of refreshments, raffles, giveaways, guest booksellers, and entertainment by local musicians.</span></p>\n<p class=\"p4\"><span class=\"s3\">As for Honor, she says one of the highlights of working at Doylestown Bookshop has been getting to know the community through bookselling. A few regular customers even live in her apartment complex. “I go home at the end of the day and people ask me: how’s the bookshop?”She’s happy to let them know it’s ready for its next twenty-five years.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><i>Jamie Brenner is a novelist whose books include the national bestseller The Forever Summer.<span class=\"Apple-converted-space\">  </span>She moved to Doylestown from New York City after doing an event at The Doylestown Bookshop and falling in love with the town. She can be reached on Instagram @jamiebrennerwrites</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/Doylestown-Bookshop1.jpg"
}