{
  "id": 12101,
  "title": "A New Way to Shop in the New Year: Thrift is the Future",
  "slug": "a-new-way-to-shop-in-the-new-year-thrift-is-the-future",
  "date": "2022-01-14T15:54:23",
  "author": "Staff",
  "category": [
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "sutie madison",
    "thrift stores"
  ],
  "excerpt": "<p>By Sutie Madison • The Cardinal Contributing Writer The stigma of shopping thrift due to economic struggle is a thing of the past. Shopping second hand is the wave of the future for several incredibly worthwhile reasons! I’ll start with the seemingly most obvious one: It’s Economically Sensible!  The average price of a basic t-shirt [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Sutie Madison</strong> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">T</span><span class=\"s1\">he stigma of shopping thrift due to economic struggle is a thing of the past. Shopping second hand is the wave of the future for several incredibly worthwhile reasons! I’ll start with the seemingly most obvious one:</span></p>\n<p class=\"p5\"><strong><span class=\"s4\">It’s Economically Sensible! </span></strong></p>\n<p class=\"p6\"><span class=\"s1\">The average price of a basic t-shirt at a big box store is between $10-24.99+, while a gently used t-shirt at a thrift store averages less than $5. That’s more than a 75% savings. A great example of second-hand big savings are in the jeans! Jeans are often very expensive ranging anywhere from $25 (low end) to $150 and beyond if you’re shopping high end designer jeans. With a little patience and treasure hunting, you will come across barely used designer jeans at thrift stores for $8.00- $12.00!! </span></p>\n<p class=\"p5\"><strong><span class=\"s4\">Environmentally Ethical</span></strong></p>\n<p class=\"p6\"><span class=\"s3\">Big box stores have caused extensive damage to our environment, and most are unaware of the implications. According to World Economic Forum, the fashion industry is responsible for more annual emissions than all international flights and maritime shipping combined! If this continues, an increase of 50% in greenhouse gas emissions will occur within the next decade. As if that isn’t bad enough, 85% of all textiles end up at the dump each year adding to the overflowing landfills. Instead of heading to Target or the mall first, try a thrift store.<span class=\"Apple-converted-space\">  </span>You’ll be surprised at what you can find!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s4\">Buried Treasures! </span></strong></p>\n<p class=\"p6\"><span class=\"s1\">Shopping thrift always has an element of surprise. Thrift shopping can be immensely fun and enjoyable because you will find one-of-a-kind purchases at a fraction of the original cost which increases the dopamine “high” one feels when shopping. People often donate brand new clothes, shoes and accessories with tags still intact. With a little persistence and time, you will very likely find a designer brand new dress, shirt or decorative item at the secondhand price.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s4\">Support Local Business</span></strong></p>\n<p class=\"p6\"><span class=\"s1\">There is no better time during this uncertain economy to support your small local businesses. If you’re someone who remembers growing up during the time before big box stores, when starting your own business was the American dream, then supporting your local entrepreneurs is one step closer to bringing that dream back. Maybe you are the owner of one of these small businesses. Even more the reason to do as much of your shopping as possible local. </span></p>\n<p class=\"p5\"><strong><span class=\"s4\">Supporting a Critical Mission <span class=\"Apple-converted-space\"> </span></span></strong></p>\n<p class=\"p6\"><span class=\"s1\">Nearly every thrift store is a nonprofit who’s proceeds largely go towards helping people and communities who have been gravely afflicted by cultural oppression or negligence in one form or another. Not only are you getting the deal of a lifetime, but you can applaud yourself for putting your money towards helping people.</span></p>\n<p class=\"p6\"><strong><span class=\"s1\">There’s several wonderful thrift shops in Doylestown who’s proceeds go towards critically important causes. <span class=\"Apple-converted-space\"> </span></span></strong></p>\n<p class=\"p7\"><strong>Worthwhile Thrift<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p5\"><a href=\"https://worthwhilewear.org\" target=\"_blank\" rel=\"noopener noreferrer\">https://worthwhilewear.org</a></p>\n<p class=\"p6\"><span class=\"s1\">All Clothing, Shoes, Accessories, Housewares, Books, CD’s, DVD’s, Toys-Puzzles &amp; Games, Electronics, Tools, Lamps, Art</span></p>\n<p class=\"p6\"><span class=\"s5\">All proceeds serve as additional financial support for Worthwhile Wear’s restorative programs for survivors of human trafficking. The stores also provide vocational training and employment for women participating in The Well program.<span class=\"Apple-converted-space\">  </span>They have a safe house in Bucks County which currently houses up to 6 women at a time. A second location is coming soon in Collegeville.<span class=\"Apple-converted-space\">  </span>Plus January is Human Trafficking Awareness month so come out, support a wonderful cause AND find some buried treasure to take home! </span></p>\n<p class=\"p7\"><strong>In Full Swing (A Women’s Place)<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p5\"><a href=\"https://awomansplace.org\" target=\"_blank\" rel=\"noopener noreferrer\">https://awomansplace.org</a></p>\n<p class=\"p6\"><span class=\"s1\">All clothing, shoes, handbags, &amp; accessories, jewelry, Decorative housewares &#8211; glassware, pottery, new candles, wall art, collectibles, vintage items, DVD’s, CD’s, &amp; records, NEW toys, Sealed puzzles &amp; games, Children’s Books, NEW bedding, sheets, linens, &amp; pillows</span></p>\n<p class=\"p6\"><span class=\"s6\">ALL proceeds go to A Women’s Place, a community-based social change organization committed to the empowerment of women and to ending intimate and domestic violence for all.<span class=\"Apple-converted-space\">  </span>A Women’s Place provides free, private, confidential, and comprehensive services to anyone who has experienced domestic violence in Bucks County. We also provide free education &amp; training programs designed to build the community’s capacity for responding to domestic violence, supporting survivors, and preventing future violence.</span></p>\n<p class=\"p7\"><strong>Good Stuff Thrift<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p5\"><a href=\"https://goodstuffthrift.org\" target=\"_blank\" rel=\"noopener noreferrer\">https://goodstuffthrift.org</a></p>\n<p class=\"p6\"><span class=\"s6\">Store locations in Doylestown, Buckingham and Fairless Hills.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">Clothing &amp; accessories for women, children, babies and men, jewelry, books, toys, home décor, kitchen ware, CD’s, records, DVD’s, pictures and much more.</span></p>\n<p class=\"p6\"><span class=\"s1\">ALL profits go to charities that help kids in our community- Bethan Christian Services, Christ Home for Children, Hunting Park Christian Academy, ChoiceOne, Bethanna, Lenape Valley Foundation, Ann Silverman Community Clinic, Be the Family and Every Good Gift.<span class=\"Apple-converted-space\">  </span>Good Stuff Thrift’s mission is to operate the most efficient Thrift Stores possible so that we can provide the highest level of funding for helping kids in need in our communities.</span></p>\n<p class=\"p7\"><strong>Nova Thrift Shop<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p5\"><a href=\"https://novabucks.org/thriftshop\" target=\"_blank\" rel=\"noopener noreferrer\">https://novabucks.org/thriftshop</a></p>\n<p class=\"p6\"><span class=\"s1\">All clothing, housewares, decorative items, books, furniture and linens.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s3\">All Proceeds go to NOVA.<span class=\"Apple-converted-space\">  </span>Network of Victim Assistance (NOVA) supports, counsels and empowers victims of sexual assault and other serious crimes in Bucks County and works to prevent and eliminate violence in society through advocacy, training, community education and prevention programs.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/01/Thrift-Pic-1.jpg"
}