{
  "id": 19236,
  "title": "An Ode to Book Clubs",
  "slug": "an-ode-to-book-clubs",
  "date": "2024-03-17T21:13:18",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "book clubs",
    "dana roberts",
    "doylestown cardinal",
    "Doylestown Library Book Club",
    "Fonthill Castle",
    "Sarah Cornwell"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer In my humble opinion, there is no greater gathering than that of a book club. Sure, weddings are fun, and birthday parties can be a real hoot, but unpacking a book with a group of interesting individuals, with tasty snacks and beverages (sometimes even of the adult [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Dana Roberts</strong> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">I</span><span class=\"s1\">n my humble opinion, there is no greater gathering than that of a book club. Sure, weddings are fun, and birthday parties can be a real hoot, but unpacking a book with a group of interesting individuals, with tasty snacks and beverages (sometimes even of the adult variety!) to boot? This is an unrivaled delight.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Joining a book club not only can help you find your people, but it can prompt you to read more. Book clubs make you think, expose you to books, topics, and people you might not otherwise encounter, and offer a manageable social commitment.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong>A Bit of History<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p5\"><span class=\"s1\">The earliest recorded North American book club was essentially a Bible study group, begun by Anne Hutchinson in 1634 during her boat ride from England to the Massachusetts Bay Colony. Book clubs became increasingly popular in Europe over the next century, mainly among the middle- and upper-class. Participants drank, gossiped, and discussed politics, similar to the famous French salons.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">In 1727, Benjamin Franklin and a group of friends founded the Junto Club, also known as the Leather Apron Club, which lasted 38 years. The 12 members met on Friday evenings to discuss issues of morals, politics, or philosophy. Ideas for many public projects, including the first lending library, came from the club.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Reading circles grew in North America in the 19th century amongst American women, who began meeting to expand their education at a time before they were allowed to be officially educated. White women were the first marginalized group to use book clubs for education and empowerment, but book clubs have played an influential role in the history of other historically oppressed groups for hundreds of years.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong>Virtual Options</strong></p>\n<p class=\"p5\"><span class=\"s1\">Today, virtual options for book clubs abound. Individuals can look on the online platform Substack or search popular Bookstagrams or BookTok or even follow a celebrity or author’s book club. In 1926, Book of the Month, a subscription service that sent books by mail to its members, was launched. It’s still in existence today, and members can choose which book they want to receive and discuss the books with other members in an online forum.</span></p>\n<p class=\"p6\"><strong>Local Book Clubs- In-Person and via Zoom</strong></p>\n<p class=\"p5\"><span class=\"s1\">If you’ve thought about joining a book club in person, you can head to bookclubs.com or Meetup.com to find local options. Area libraries, bookstores, and churches are also great options for book clubs open to the public.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The Bucks County Library District hosts a variety of book clubs at each branch, as well as book club bags, in which you can choose bundles of popular book club titles for your own group.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The Doylestown and Lahaska Bookshops are ripe for the choosing when it comes to book clubs: their website currently shows nine different book clubs varying from Android’s Dream Sci-fi/Fantasy/Horror to Women’s Business to Philosophy to Mind Mastery. Visit doylestownbookshop.com and select “Book Clubs” to learn more. The Bookshops also offer a 20% discount for book purchases for registered groups.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Wheat &amp; Vine Provisions is starting a “Silent Book Club” in March in their café/retail space. The club will meet on the third Thursday of every month, starting March 21, from 5-7 pm. Silent book clubs, a growing trend around the country, are perfect for introverts. They allow friends and strangers to gather at a set time and location, order food or drinks, share what they’re reading, and settle in for an hour of silent, sustained reading. At the end of the hour, attendees can socialize—or not!</span></p>\n<p class=\"p6\"><strong>Starting Your Own Book Club</strong></p>\n<p class=\"p5\"><span class=\"s1\">If you’re looking to start your own club but are unsure where to find members, you can ask neighbors, family, coworkers, or, if you’re a parent, other parents at your children’s school/activity, if they’d be interested in joining.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Books can be chosen democratically, by voting for a favorite option each month amidst a selection of 3-4 books or having a different member choose the book each meeting. However you decide to choose your book, it’s helpful to have at least one discussion question for each meeting (our go-to is “What resonated with you while reading this book?”) and go around in a circle, giving each member time to answer it! Happy reading!<span class=\"Apple-converted-space\"> </span></span></p>\n<figure id=\"attachment_19238\" aria-describedby=\"caption-attachment-19238\" style=\"width: 1024px\" class=\"wp-caption alignnone\"><a href=\"/data/media/Jane-Miller-center-leads-a-discussion-with-the-Friends-of-the-Doylestown-Library-Book-Club-e1710724378948.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-19238\" src=\"/data/media/Jane-Miller-center-leads-a-discussion-with-the-Friends-of-the-Doylestown-Library-Book-Club-1024x464.jpeg\" alt=\"\" width=\"1024\" height=\"464\" /></a><figcaption id=\"caption-attachment-19238\" class=\"wp-caption-text\">Jane Miller (center) leads a discussion with the Friends of the Doylestown Library Book Club</figcaption></figure>\n<p class=\"p7\"><span style=\"color: #ff0000;\"><strong>The Friends of the Doylestown Library Book Club:</strong></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">How it started:</span></strong><span class=\"s1\"> FODL, which is an independent, non-profit organization whose mission is to support the work of the Doylestown library, had a book club that previously met in person, disbanded during Covid, and then re-launched online in January 2021.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">When They Meet: </span></strong><span class=\"s1\">Every other month, with in-person meetings in May and September, and virtual meetings the remainder of the year. They just started in-person meetups again in 2023.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">Open to Join:</span></strong><span class=\"s1\"> Currently the club averages from as few as seven to as many as 18 per meeting. Participation is co-ed and is open to all. For more information and to access the link for the next meeting, visit friendsofdtownlibrary.org/book-club. The Zoom link usually goes up about a week before the meeting.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">What They’re Reading:</span></strong><span class=\"s1\"> The Clockmaker’s Daughter, by Kate Morton, for their virtual March meetup on 3/26. A committee of five selects the books to read, with set parameters: books must be available in paperback for affordability, are typically fiction, less than seven years old, and not excessive in length. Note: FODL’s book club is separate from the Doylestown Library Book Club, which meets on Thursday, 3/28 from 6-7 in the Pearl Buck Room, and the book is The Guest List, by Lisa Foley.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">This Book Club Might Be For You…</span></strong><span class=\"s1\"><strong>.</strong> “If you like books that are best sellers, award winners, well-known, little-known, banned or challenged, by favorite authors, by authors you weren’t familiar with, of great interest, of little interest but that you end up loving;<span class=\"Apple-converted-space\">  </span>and you like discussing them, sometimes on Zoom, sometimes in person, with readers you might otherwise never have gotten to know,” says Jane Miller, secretary of the Board of Directors of the FODL, and Book Club Chair.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><span style=\"color: #ff0000;\"><strong>Sarah Cornwell (local jewelry designer and store owner) and her Book Club:</strong></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">How it Started:</span></strong><span class=\"s1\"> In the fall of 2020, when Sarah Peters (a local realtor and writer for the Cardinal) reached out to Sarah Cornwell about the idea. Sarah Peters said she was working with a coach who encouraged her to surround herself with other women focused on building businesses. So, they brainstormed and reached out to all the women they knew via text. Their first meeting was in Sarah Peter’s pool house.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">A Full and Happy Club:</span></strong><span class=\"s1\"> They’re currently at 12 members and have decided not to open it up to more people. They’ve found that when there are too many people, it’s hard to make sure everyone gets an opportunity to share. Rarely is everyone present for the meeting; it’s usually 9-10 people at each.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">The When and Where:</span></strong><span class=\"s1\"> This club meets once a month at restaurants and bars like Vela and Hopscotch, but the members also try to meet at each other’s place of business.</span></p>\n<p class=\"p5\"><span class=\"s1\"><strong>What They Read:</strong> Books that focus on business and mindset. March’s book is Who Not How, by Dan Sullivan and Dr. Benjamin Hardy. They pick all their books for their year and order through the Doylestown Bookshop with a discount.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/03/Sarah-Peters-and-Sarah-Cornwell-center-in-white-dresses-and-their-book-club.jpg"
}