{
  "id": 12507,
  "title": "Artist Spotlight: Cassie Tyson",
  "slug": "artist-spotlight-cassie-tyson",
  "date": "2022-03-02T20:51:17",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "Cassie Tyson",
    "doylestown cardinal",
    "makers off main"
  ],
  "excerpt": "<p>Get to know artist Cassie Tyson, the creative soul behind Pretty Fly For A DIY.  Vintage vibes, DIY, thrifted style and macrame are her forte! She lives a modern bohemian lifestyle in a 113 year old home nestled in beautiful Bucks County, PA.  Her lifestyle is fueled by learning to live more sustainably through repurposing, [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><i>Get to know artist Cassie Tyson, the creative soul behind Pretty Fly For A DIY.<span class=\"Apple-converted-space\">  </span>Vintage vibes, DIY, thrifted style and macrame are her forte! She lives a modern bohemian lifestyle in a 113 year old home nestled in beautiful Bucks County, PA.<span class=\"Apple-converted-space\">  </span>Her lifestyle is fueled by learning to live more sustainably through repurposing, thrifting and up-cycling as much as possible.<span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p1\"><strong>Tell us about yourself. When did your journey with art begin? </strong></p>\n<p class=\"p2\"><span class=\"s1\">I’m a lifelong creative, and I constantly reinvent myself by exploring new outlets for that creative drive. I honestly can’t remember a time that I wasn’t involved in some sort of project or art program.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">I inherited my love of making from my mom. Long before I came along, she was a maker and entrepreneur, even co-owning several shops similar to Makers Off Main back in the day.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">My entrepreneurial, creative journey began with sewing and jewelry making in high school. While I still love to sew and create jewelry, I found my passion in fiber art after purchasing my own home. It was the catalyst to helping my creativity bloom through design.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s2\">I have always loved interior design and using textures to transform a space. Scrolling endlessly through Pinterest boards, I rediscovered the art of Macrame and scoured the internet for tutorials on the basic knots and simple patterns to begin my journey.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">I created Pretty Fly For A DIY to share my creative journey and inspire others to follow theirs; that was in 2019, and I haven’t looked back!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Tell us about your art. What is your creative process like?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s1\">My process is&#8230;chaotic. That’s the hard truth about me. I thrive under the pressure of a tight deadline and find my best works always arise from them. I’d certainly prefer to be an organized maker, but I have learned to embrace my methods and run with it.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">The thing that I love most about the art of Macrame is the ability to connect with emotion. I gravitated to the art form during which I needed an escape from the stress in my life. I find the repetition of the knots very therapeutic, and honestly, I am still amazed at my abilities when I finish a piece.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">I rarely know how a piece will turn out when I begin. I’m not one to sketch first; I simply cut some cord and get to work. I embrace the concept of wabi-sabi wholeheartedly in my process and my final pieces.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Who or what is a big inspiration for you?</strong></p>\n<p class=\"p2\"><span class=\"s1\">I draw a lot of inspiration simply from the energy around me. The greatest joy I get from being a maker is the community that has grown around me. I love sharing the process and techniques that I have learned and perfected with others.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">Whether someone is taking one of my workshops for the first time or a fellow Macrame artist, I love the shared conversations and the pride in a finished piece of work. The people always keep me coming back. Even when the creative energy is low, I can count on my creative community to keep me going.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>How do you like being a local artist in Doylestown?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s1\">I am so thankful that our local area has such a vibrant art community. Growing my network of creative friends here has been so rewarding. Doylestown has welcomed me with open arms and provided me with so many wonderful opportunities as an artist.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Where can we find your work?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s1\">I am grateful to have several local brick-and-mortar shops that carry my work. You can find my products or attend a workshop with me at Makers Off Main here in Doylestown. You can also find my work at Art On The Hill in Souderton.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">For those who prefer a virtual experience, you can find my work on my website <a href=\"http://www.prettyflyforadiy.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.prettyflyforadiy.com</a> or follow my shenanigans on Instagram @_prettyflyforadiy_ and Facebook @prettyflyforadiy.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">I also participate in local artisan markets throughout the Bucks and Montgomery County area!<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/03/Cassie-Tyson.jpg"
}