{
  "id": 13697,
  "title": "Artist Spotlight: Ray Milora",
  "slug": "artist-spotlight-ray-milora",
  "date": "2022-06-14T16:25:58",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "makers off main",
    "Ray Milora"
  ],
  "excerpt": "<p>Get to know Ray Milora of “Salvage + Craft”. With a formal background in Graphic Design, Ray’s days are spent leading Workplace Experience for Cisco. He is a self-described old-home junkie, having remodeled several homes over the years, including a former 1920s school in Paupack, PA, and an 1830’s home in Media that Ray and [&hellip;]</p>\n",
  "content": "<p class=\"p1\">Get to know Ray Milora of “Salvage + Craft”. With a formal background in Graphic Design, Ray’s days are spent leading Workplace Experience for Cisco. He is a self-described old-home junkie, having remodeled several homes over the years, including a former 1920s school in Paupack, PA, and an 1830’s home in Media that Ray and his partner, Julie, are finishing and (hopefully) living in soon. Most of his work is created in his timber frame workshop, which he helped make several years ago. Ray has been a guitarist for over 40 years, something he finds he is always drawn back to… even though he never became Eddie Van Halen’s backup &#8211; his 13-year-old self’s singular goal for life.</p>\n<p class=\"p1\"><strong>When did your journey with art begin?</strong></p>\n<p class=\"p2\"><span class=\"s1\">I’ve been both an artist and musician since a very young age, spending many years playing guitar in bands in Bucks County and the surrounding area. I founded Salvage + Craft in 2014 as an outlet from my day job and to try out some ideas I had swirling in my head.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s2\">The catalyst was a new line of spirits that Art in The Age in Philly introduced at the time. They were well done and presented in an apothecary-type bottle that I thought would make an amazing pendant light. After a fair amount of trial and error, I made my first batch of pendants, managed to get them displayed for sale in the Art in the Age store in Old City, and things took off from there.</span></p>\n<p class=\"p1\"><strong>Tell us about your art. What is your creative process like?</strong></p>\n<p class=\"p2\"><span class=\"s2\">I draw inspiration from discovered, recycled, and reclaimed objects as well as the process of visioning what they could become. Some of my lighting is rather straightforward- the bottle or shape speaks for itself, while other pieces are amalgams of objects and parts that I feel work well together due to the contrast, similarity of texture, age, patina, etc.</span></p>\n<p class=\"p1\"><strong>Who or what is a big inspiration for you?</strong></p>\n<p class=\"p2\"><span class=\"s2\">I draw a lot of inspiration from architecture, specifically older, more industrial-type spaces once saved and reimagined and architectural salvage. I’m a huge fan of roadside junk shops, rummaging around in old barns and other forgotten spaces. Specifically for lighting, I’m very much drawn to the work of Warren Muller.</span></p>\n<p class=\"p1\"><strong>How do you like being a local artist in the Doylestown area?</strong></p>\n<p class=\"p2\"><span class=\"s2\">Love it! The area has such a rich history and support of the arts. Perhaps obvious, but I draw a lot of inspiration from Henry Mercer and the Moravian Tile Works. The aesthetic and visual overload of Fonthill is something I’ve remembered since the first time I set foot inside.</span></p>\n<p class=\"p1\"><strong>Where can we find your work?</strong></p>\n<p class=\"p2\"><span class=\"s2\">&#8211; Makers off Main in Doylestown</span></p>\n<p class=\"p2\"><span class=\"s2\">&#8211; Philadelphia Independents in Old City</span></p>\n<p class=\"p2\"><span class=\"s2\">&#8211; Lake Lights &amp; Candles in Hawley</span></p>\n<p class=\"p2\"><span class=\"s2\">&#8211; via my Instagram @salvageandcraft.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/06/Ray-Milora.jpg"
}