{
  "id": 16213,
  "title": "Artist Spotlight: Amy Karpinski",
  "slug": "artist-spotlight-amy-karpinski",
  "date": "2023-01-09T23:23:28",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "Artist Spotlight: Amy Karpinski",
    "doylestown cardinal"
  ],
  "excerpt": "<p>Meet Amy Karpinski, the artist, and designer behind 3 Suns Studio. Amy started 3 Suns Studio in 2015 after moving to the area as a way for her to get back to what she loves – designing, painting, and creating art. She tries to remind herself daily how lucky she feels to be doing what [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">M</span><span class=\"s1\">eet Amy Karpinski, the artist, and designer behind 3 Suns Studio. Amy started 3 Suns Studio in 2015 after moving to the area as a way for her to get back to what she loves – designing, painting, and creating art. She tries to remind herself daily how lucky she feels to be doing what she loves.</span></p>\n<p class=\"p4\"><b>Tell us about yourself. When did your journey with art begin?</b></p>\n<p class=\"p5\"><span class=\"s2\">I have been drawing and painting for as long as I can remember. I feel fortunate that from a very young age, I knew I wanted a career in art. I went to RIT and graduated with degrees in Graphic Design and Illustration.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">I then worked in the corporate world for over 20 years &#8211; mainly in the cosmetics and beauty industry. In 2015, after many stressful years working in NYC and living in NJ, we moved our family to Doylestown to live a simpler life.<span class=\"Apple-converted-space\">  </span>Now, I try to balance being a freelance graphic designer with creating art at 3 Suns Studio.</span></p>\n<p class=\"p4\"><b>Tell us about your art. What is your creative process like?</b></p>\n<p class=\"p5\"><span class=\"s2\">My background as a graphic designer gives me a unique perspective, and I lean towards bold graphic and geometric shapes. I have several styles and mediums &#8211; I create digital art and also work in acrylic, watercolor and mixed media. Most of my work starts as pencil sketches and then grows from there. The next step is often taking photos or using my existing photos from nature and/or vacations. I spend a lot of time creating the color palette for each piece. The final steps are either illustrating on the computer or hand painting, depending on the project.</span></p>\n<p class=\"p4\"><b>Who or what is a big inspiration for you?</b></p>\n<p class=\"p5\"><span class=\"s2\">I am inspired by so many things &#8211; travel, nature, and design styles of the past, like art deco and mid-century modern. My current obsession is travel posters – I love the bold graphic interpretations of cities and landscapes paired with typography. One of my favorite travel poster artists is Hans Wagula, a German artist from the early to mid-1900s.</span></p>\n<p class=\"p4\"><b>How do you like being a local artist in Doylestown?</b></p>\n<p class=\"p5\"><span class=\"s3\">I really appreciate Doylestown’s culture, history, and dedication to small businesses. I am thankful for the community at Makers off Main and enjoy meeting and networking with other artists and makers in the area.</span></p>\n<p class=\"p4\"><b>Where can we find your work?</b></p>\n<p class=\"p5\"><span class=\"s3\">Locally, you can find me at Makers off Main and various art and craft shows throughout the year, including the Doylestown Art Festival. Online, you can find me at <a href=\"http://3SunsStudio.com\" target=\"_blank\" rel=\"noopener noreferrer\">3SunsStudio.com</a>, <a href=\"http://etsy.com/shop/3SunsStudio\" target=\"_blank\" rel=\"noopener noreferrer\">etsy.com/shop/3SunsStudio</a> and on Instagram (3SunsStudio).</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/01/Amy-Karpinski-e1673324596179.jpg"
}