{
  "id": 14101,
  "title": "Artist Spotlight: Julie Edelman",
  "slug": "artist-spotlight-julie-edelman",
  "date": "2022-07-13T16:27:11",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "Julie Edelman"
  ],
  "excerpt": "<p>Tell us about yourself. When did your journey with art begin? Hi! I am Julie Edelman with Home Again Studios! While my business started four years ago, my journey with art began before l was ever born. My mom did macrame and made her own dresses, while my dad owned his own Contracting Business! I [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>Tell us about yourself. When did your journey with art begin?</strong></p>\n<p class=\"p2\"><span class=\"s1\">Hi! I am Julie Edelman with Home Again Studios! While my business started four years ago, my journey with art began before l was ever born. My mom did macrame and made her own dresses, while my dad owned his own Contracting Business! I was already building my own shelves in elementary school, so it is no surprise that my life would lead me back into art! After the birth of my second child, Harvey, maternity leave granted me time around the house I never had before. It wasn’t long before I made both candles and concrete, and Home Again Studios was born!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Tell us about your art and your creative process?</strong></p>\n<p class=\"p2\"><span class=\"s1\">We make boutique home décor products, specializing in making soy candles and handmade concrete décor! Our handcrafted Concrete Candles feature Glow &amp; Grow &#8211; after you burn your candle, you can plant our logo (printed on seed paper) and grow beautiful wildflowers. We love to make stylish and modern home décor while also being environmentally friendly.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Who or what is a big inspiration for you?</strong></p>\n<p class=\"p2\"><span class=\"s1\">My husband, Joe, is a huge inspiration for me! His personality is to jump in, and we will figure it out as we go! So especially with new products, he inspires me to try new things and follow every idea I have.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>How do you like being a local artist in the Doylestown area?</strong></p>\n<p class=\"p2\"><span class=\"s1\">I was born and raised in Doylestown, and growing up here was amazing! I remember walking around town and going into my favorite stores as a kid and teenager. I can’t believe that now I sell products that I make in Doylestown!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Where can we find your work?</strong></p>\n<p class=\"p2\"><span class=\"s1\">• <a href=\"http://www.HomeAgainStudios.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.HomeAgainStudios.com</a></span></p>\n<p class=\"p2\"><span class=\"s1\">• Instagram: @HomeAgainStudios</span></p>\n<p class=\"p2\"><span class=\"s1\">• Facebook: /HomeAgainStudios</span></p>\n<p class=\"p2\"><span class=\"s1\">• In-Store at Makers Off Main!</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/07/Julie-Edelman.jpg"
}