{
  "id": 19821,
  "title": "Ask Birdie June 2024",
  "slug": "ask-birdie-june-2024",
  "date": "2024-06-12T12:58:50",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [],
  "excerpt": "<p>Dear Birdie,  I struggle with being a goal-setter and micromanaging my life vs. surrendering and living in the present moment. How can I create a more balanced life where I’m still accomplishing goals, but living in the now?  Dear Struggler,  I first realized that Doylestown was a very hilly place when I started to ride [&hellip;]</p>\n",
  "content": "<p><strong><i>Dear Birdie, </i></strong></p>\n<p><strong><i>I struggle with being a goal-setter and micromanaging my life vs. surrendering and living in the present moment. How can I create a more balanced life where I’m still accomplishing goals, but living in the now? </i></strong></p>\n<p><span style=\"font-weight: 400;\">Dear Struggler, </span></p>\n<p><span style=\"font-weight: 400;\">I first realized that Doylestown was a very hilly place when I started to ride a cruiser bike around town. Going uphill often resulted in a defeated walk while wheeling the bicycle. The goal of getting to the top of the hill as quickly as possible drove me to pedal harder and faster. I pushed myself out of breath and into a cloud of frustration. </span></p>\n<p><span style=\"font-weight: 400;\">But then, one day, I didn’t get off that bike when sweat started to form on my forehead. Instead, I rode up the hill slower. That felt easier. I wasn’t pushing so hard. I rolled. Slower burn felt invigorating. What’s more is that at this slower pace, I took in my surroundings. No longer huffing and puffing, focusing on pushing those pedals, I got a chance to look around. </span></p>\n<p><span style=\"font-weight: 400;\">One day, I rode by a little stand set in front of a lavish front garden. Rows of pocket-sized yellow packages of flower seeds lined the table. Hand-written letters on them: Z’s seeds. There was a website with care instructions. I picked some out. “Your garden is lovely,” I said to the woman watering the plants. “She picks out the seeds herself from all the flowers,” the woman nodded towards her daughter who was digging something in the garden. We all smiled, enjoying our interaction. I continued my slow-paced ride and watched my fellow townsmen go about their days on the streets of the town, tending to their gardens, pushing up their own hills. </span></p>\n<p><span style=\"font-weight: 400;\">The answer to your question, my dear Struggler, lies in the struggle itself. It sits right there, in between micromanaged goal-setting and surrender into the moment. The age-old working hard vs. smelling the roses. </span></p>\n<p><span style=\"font-weight: 400;\">But what if twe could hold both of those values true? Both virtuous in their nature, they both can bring joy and fulfillment &#8211; in their own time. If focusing on a goal means ignoring what’s going on around us, letting the moment flee without notice, is the goal really worth it? When we make it to the top of the hill, do we want to look back and remember the struggle or the little girl who sells the seeds from her mother’s garden?</span></p>\n<p><span style=\"font-weight: 400;\">Small moments pave the road to our goals, giving us what we need to get there. Little seeds for sale. A smile. The sound of birds. Release that struggle into the moment. Enjoy the ride. We will get there. </span></p>\n<p>&nbsp;</p>\n<p><i><span style=\"font-weight: 400;\">Have a question for Birdie? Submit to the managing editor at natalya@doylestowncardinal.com</span></i></p>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/06/Gray-Blue-Gold-Rustic-Flower-Watercolor-Minimalist-Wedding-Banner-72-x-15-in.png"
}