{
  "id": 11632,
  "title": "Bar Carts and Liquor Cabinets Having Their Moment",
  "slug": "bar-carts-and-liquor-cabinets-having-their-moment",
  "date": "2021-11-13T17:28:52",
  "author": "Staff",
  "category": [
    "Style"
  ],
  "tags": [
    "bar carts",
    "doylestown cardinal",
    "liquor cabinets",
    "victoria guillot"
  ],
  "excerpt": "<p>By Victoria Guillot • The Cardinal Contributing Writer November marks the beginning of the holiday entertaining season as well as more time indoors due to colder weather. For many, the pandemic will have an impact on holiday plans this year. That means many of us will be spending more time indoors en famille this season [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Victoria Guillot • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">N</span><span class=\"s3\">ovember marks the beginning of the holiday entertaining season as well as more time indoors due to colder weather. For many, the pandemic will have an impact on holiday plans this year. That means many of us will be spending more time indoors en famille this season instead of attending or hosting large gatherings.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">I remember one thing clearly from the initial shutdowns of 2020 that I expect to continue through the holidays. Remember how the lines to the state liquor stores were around the block just before shutdowns were scheduled to begin?<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">It appears when we expect to be stuck in our homes, many, many (many) of us want copious amounts of alcohol to help us through our confinement. Combine that with the holiday season and bottles will be flying off the store shelves and into our homes!</span></p>\n<p class=\"p5\"><span class=\"s3\">Enter stylish storage for all those bottles! It’s no coincidence that bar carts are having a moment. The design industry has put forth a large number of stylish bar carts and cabinets to accommodate all those bottles we are stocking up on.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Once pandemic restrictions are history, these carts will continue to serve you well whether you’re entertaining a large group or hosting a small, intimate evening. Even if you have a built-in bar in your basement, sometimes you want to serve drinks upstairs for a dinner. And some of these cabinets are so gorgeous, you just want to include them for their looks.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Place a statement-making cabinet or roll a cart into the dining room, living room, family room, porch…<span class=\"Apple-converted-space\">  </span>wherever you want to hang out and make “moments” of your own.</span></p>\n<p class=\"p5\"><span class=\"s3\">For stationary options, consider a jaw-dropping cabinet that can become the focal point of a room. I’ve always loved the timeless look of neutral seating pieces with a statement cabinet, allowing art and accessories to punctuate the statement.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Tall bar cabinets can fill a blank wall nicely, bridge spaces in an open floor plan, or balance the height of a window on the opposite wall. Many are on tall legs so they create an airier feel than an armoire.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">There are long, lower cabinets for a horizontal silhouette, perfect for accessorizing with vases, lamps and art or mirrors above. A hot trend now is a horizontal cabinet with a circular mirror above and a vase with tall stems.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Cabinets come in a very wide range of styles. Whether you like mid-century, vintage, industrial, natural wood, glass and metal or chinoiserie, you are sure to find a piece to make your heart flutter.</span></p>\n<p class=\"p5\"><span class=\"s3\">Mobile options offer multiple open shelves, allowing you to display glasses and bottles and bar paraphernalia in a small footprint. Like their cabinet counterparts, these carts come in all styles and materials to satisfy just about any décor. Consider the range of other ways you could use one of these multi-purpose pieces, such as craft cart, printer station, etc.</span></p>\n<p class=\"p5\"><span class=\"s3\">For these bar images and more, I’ve curated a collection for you with special designer trade access to stunning bar cabinets and carts. Get access to best internet pricing by using the shopping links at https://stagecoachservices.com/home-shop. (If you purchase through this link, I will receive a commission at no additional cost to you.)</span></p>\n<p class=\"p7\"><span class=\"s4\"><i>Victoria Guillot is a home stager/interior designer of 15 years based in Buckingham/Doylestown.<span class=\"Apple-converted-space\">  </span>A 6-time Best of Houzz winner, she has been featured on a 26-episode radio series and is author of a book of tips on home staging. If you would like more trade access or would enjoy her decorating or staging assistance, you can find her at <a href=\"http://stagecoachservices.com\" target=\"_blank\" rel=\"noopener noreferrer\">stagecoachservices.com</a>.</i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/11/Bar-Cabinet-Design-Board-2.jpg"
}