{
  "id": 11912,
  "title": "Behavioral Finance: Rationalizing the Ups and Downs",
  "slug": "behavioral-finance-rationalizing-the-ups-and-downs",
  "date": "2021-11-01T13:40:41",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "Behavioral Finance",
    "doylestown cardinal",
    "m brian pultro"
  ],
  "excerpt": "<p>By Brian Pultro, AIF, BFA, RFC® • The Cardinal Contributing Writer Who likes a good sale? Everyone does! We look forward to President’s Day sales, Labor Day sales, Black Friday, and Cyber Monday! We are trained and conditioned to seek out the best possible deal for ourselves. You would never walk into a store and [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Brian Pultro, AIF, BFA, RFC® • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">Who likes a good sale? Everyone does! We look forward to President’s Day sales, Labor Day sales, Black Friday, and Cyber Monday! We are trained and conditioned to seek out the best possible deal for ourselves. You would never walk into a store and demand to pay full price for something. So, why don’t we take the same approach when it comes to our investments?</span></p>\n<p class=\"p4\"><span class=\"s3\">What I mean is this; if your favorite product at your favorite store went on sale for 30% off, you would most likely purchase more than one. However, if your well-diversified retirement portfolio went on sale for 30% off, would you panic and assume something is wrong? Why?</span></p>\n<p class=\"p4\"><span class=\"s3\">If your favorite ice cream was on sale for 30% off, you wouldn’t say to yourself “it must have salmonella in it.” So, why do we assume that something is wrong with our investments when they go on sale?</span></p>\n<p class=\"p4\"><span class=\"s3\">This is where the role of a Behavioral Financial Advisor comes into play, to help take the emotion out of investing. What if we could retrain ourselves to look at temporary (and routine) downturns in the stock market as an incredible opportunity to purchase more of our future retirement at a discounted price?</span></p>\n<p class=\"p4\"><span class=\"s2\">According to J.P. Morgan’s Guide to the Markets, the average annual intra-year downturn of the S&amp;P 500 is 14.8%. Despite this, the market’s full-year return has been positive in 31 of the last 41 years. Based on the data above, when the market does go on sale (as it typically does at some point each year) that could be an amazing opportunity to purchase more shares of our retirement portfolio at a huge discount! Instead of panicking and selling, we should look at this as a gift from the “animal spirits” to load up!</span></p>\n<p class=\"p4\"><span class=\"s3\">The world of Behavioral Finance is about taking those completely rational emotions, controlling them, and using sound logic to make long-term decisions about your retirement portfolio. In many instances, the best thing to do during a downturn is absolutely nothing at all.</span></p>\n<p class=\"p4\"><span class=\"s4\">Most financial consultants invest their clients into high quality mutual funds or blueship stocks. The thing that most financial consultants don’t do is coach and educate their clients on how to deal with their emotions. As an example, from 1998-2018 the S&amp;P 500 returned an average of 5.6% per year. Individual investors made just 1.9% on average. If, for the most part, we are all investing in similar holdings, why the huge difference? Those consultants were not trained to help their clients cope with the routine downturns of that 20-year period.</span></p>\n<p class=\"p4\"><span class=\"s3\">A Behavioral Financial Advisor can add value that cannot be quantified. You won’t know what has been happening behind the scenes until the storm has passed and your emotions are in check again. However, once the skies clear and the seas calm, you will have realized that all that education, training, and coaching to keep your emotions in check has paid off.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s5\"><i>As a Behavioral Financial Advisor (BFA) Brian utilizes the concept of “values-based investing” to keep clients focused on the big picture and what is truly important to them</i></span>.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p7\"><b>Pultro Financial Management</b></p>\n<p class=\"p7\"><b>(215) 489-3876 • <a href=\"mailto:brian.pultro@LPL.com\">brian.pultro@LPL.com</a></b></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/12/Behavorial-Finance.jpg"
}