{
  "id": 12156,
  "title": "Bob Krist to Judge the 2022 Phillips’ Mill Photographic Exhibition",
  "slug": "bob-krist-to-judge-the-2022-phillips-mill-photographic-exhibition",
  "date": "2022-02-05T18:13:05",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "2022 Phillips’ Mill Photographic Exhibition",
    "bob krist",
    "doylestown cardinal",
    "New Hope"
  ],
  "excerpt": "<p>New Hope, PA –  Phillips’ Mill Photo has announced that esteemed freelance photographer Bob Krist will be the sole juror for the 2022 Phillips’ Mill Photographic Exhibition. This will be the first time since 2018 that the prestigious show will be on the gallery walls at the historic Phillips’ Mill in New Hope, Pa. The [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">N</span><span class=\"s2\">ew Hope, PA –<span class=\"Apple-converted-space\">  </span>Phillips’ Mill Photo has announced that esteemed freelance photographer Bob Krist will be the sole juror for the 2022 Phillips’ Mill Photographic Exhibition. This will be the first time since 2018 that the prestigious show will be on the gallery walls at the historic Phillips’ Mill in New Hope, Pa. The exhibition will run from April 2 – 22, 2022 and will be mounted online, as well. Photographers worldwide are invited to submit their work online for consideration between February 1 &#8211; 28.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Bob Krist’s freelance photography and filmmaking for National Geographic, National Geographic Traveler, Smithsonian and Islands magazines and other clients have taken him to more than 150 countries on all seven continents.</span></p>\n<p class=\"p3\"><span class=\"s2\">During these assignments, he has captured not only some of the world’s most breathtaking scenery, but also the fascinating characters, cultural rituals and simple everyday occurrences that make life so interesting. Even though he was knighted with a cutlass during a voodoo ceremony in the hills of Trinidad, ran before charging bulls at a festival in southern India and was stranded on a glacier in Iceland for three days during a blizzard, he doesn’t like to think of himself as a great adventurer. Rather, he says he’s just a visual storyteller whose early days as a photojournalist taught him to intuitively seek beauty, truth and the most compelling human interest angle.</span></p>\n<p class=\"p3\"><span class=\"s2\">Krist has won awards in the Pictures of the Year, Communication Arts and World Press Photo competitions. He was named “Travel Photographer of the Year” by the Society of American Travel Writers three times and was honored at the Eisenstadt Awards for Magazine Photography. His latest book, Old Souls &amp; Timeless Places, won the Best Travel Book of 2020 in the Lowell Thomas Travel Journalism competition sponsored by the Journalism School at the University of Missouri.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">The Phillips’ Mill Photographic Exhibition will be at Phillips’ Mill, as well as online, from April 2 – 22, 2022, 2619 River Rd., New Hope, PA. Submissions will be accepted via Smarter Entry from Feb. 1—28, 2022. Visit <a href=\"http://www.phillipsmill.org/photography\" target=\"_blank\" rel=\"noopener noreferrer\">www.phillipsmill.org/photography</a> for details including the Call for Art and a link for submitting work. Learn more about Bob Krist at <a href=\"http://bobkrist.com\" target=\"_blank\" rel=\"noopener noreferrer\">bobkrist.com<span class=\"Apple-converted-space\"> </span></a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/02/Bob_Krist.jpg"
}