{
  "id": 17897,
  "title": "Bold Hope: Local Nonprofit Making Global Impact",
  "slug": "bold-hope-local-nonprofit-making-global-impact",
  "date": "2023-08-05T21:41:28",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "bold faith",
    "doylestown cardinal",
    "sarah peters"
  ],
  "excerpt": "<p>By Sarah Peters • The Cardinal Contributing Writer Bold Hope is a faith-based nonprofit in Doylestown that makes an impact on our global neighbors. The organization focuses on strengthening family and community relationships while improving the lives of impoverished communities around the world. What is the mission? The organization aims “to inspire hope by connecting [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Sarah Peters • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">B</span><span class=\"s1\">old Hope is a faith-based nonprofit in Doylestown that makes an impact on our global neighbors. The organization focuses on strengthening family and community relationships while improving the lives of impoverished communities around the world.</span></p>\n<p class=\"p5\"><strong>What is the mission?</strong></p>\n<p class=\"p6\"><span class=\"s1\">The organization aims “to inspire hope by connecting and empowering people to transform lives worldwide.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong>How did Bold Hope start?</strong></p>\n<p class=\"p6\"><span class=\"s1\">More than half of the Haitian population lives on $1 per day for food, transportation, education, rent, and other expenses. Trying to understand what it means to be impoverished, brothers Matt and Andrew Jones challenged themselves in 2010 to spend thirty days living in Haiti for $1 a day. Their visit coincided with the aftermath of the earthquake that decimated much of the country. Out of their firsthand experience of living in this developing country, Inspired Poverty Resolutions was born.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">For the next few years, the non-profit partnered with other local organizations to help with orphan care, sustainable farming initiatives, small business ventures, education, and construction. It supported the construction of a medical clinic in 2016 and a school in 2017. The clinic was opened to the public in 2018 with a doctor, a nurse, and 50 Haitians on staff.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">The organization evolved into Bold Hope, creating opportunities for people around the world to get involved, including many community members in Bucks County. Matt Jones claims that “destitution and despair exist around the world on a whole another level that’s hard to imagine without seeing it for yourself in person.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">Around 2019, Bold Hope programs expanded to offer support to Nepal and India. Today they are involved in helping to build infrastructure to reduce poverty and improve health in over a dozen countries in Latin America, South America, Asia, and Africa.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">“Connecting personally with someone in deep need” is profoundly impactful, according to Jones. “Whether you live in the suburbs of Philadelphia or a high rise in Calcutta, there is someone who is impoverished.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong>What is the focus?</strong></p>\n<p class=\"p6\"><span class=\"s1\">Bold Hope focuses on eight initiatives. Helping children is a top priority, with various feeding programs, mentorships, and general health. Hoping to break the cycle of poverty, Bold Hope provides education to empower children and raise leaders. Lastly, community development focuses on construction projects, employment opportunities, and community betterment projects.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong>How Can You Get Involved?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p6\"><span class=\"s1\">Bold Hope gratefully accepts donations, which are used towards their many different global initiatives.</span></p>\n<p class=\"p6\"><span class=\"s1\">Child sponsorship opportunities are available in eight countries. Board member Sarah Cornwell beams when she recalls the single mother and four boys who received support. “We have been sponsoring the same family for two years and got to meet them for the first time last summer. It’s a small amount each month but it’s been a game-changer for this family. It’s making all the difference in their lives.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">You can participate in the 2023 Bold Hope Golf Outing on August 14 at the Bucks Club, with food, raffles, contests, and more.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">If you want the experience of a lifetime, consider participating in a mission trip to build up a community in the Caribbean, Latin America, or Africa.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p8\">To learn more visit<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p8\"><a href=\"http://www.boldhope.org/events\" target=\"_blank\" rel=\"noopener noreferrer\">www.boldhope.org/events<span class=\"Apple-converted-space\"> </span></a></p>\n<p class=\"p9\"><i>Sarah Peters is a top-producing Realtor, leader of the Sarah Peters Team, ALC board member at Keller Williams Doylestown, and mother of three. She’s passionate about serving others and helping people find themselves right at home in greater Bucks County. For more details, visit <a href=\"http://www.sarahpetersteam.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.sarahpetersteam.com</a>, Instagram @sarahpetersteam or call her at (484) 459-9944.</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/08/IMG_7732.jpg"
}