{
  "id": 16204,
  "title": "Bucks County Based Non-Profit Kin Wellness and Support Center Celebrates One Year Anniversary",
  "slug": "bucks-county-based-non-profit-kin-wellness-and-support-center-celebrates-one-year-anniversary",
  "date": "2023-01-09T23:17:59",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "corrine sikora",
    "doylestown cardinal",
    "Keith Fenimore",
    "kin wellness"
  ],
  "excerpt": "<p>Kin, a 501(c)(3) non-profit, is an all-inclusive Wellness and Support Center providing FREE services to cancer patients and their caregivers across Bucks County. On December 8, 2022 Kin’s patients, volunteers and staff celebrated their one-year anniversary.  Launched on December 8, 2021, the non-profit’s mission, which was inspired by Corinne Sikora, was to encourage the community [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">K</span><span class=\"s2\">in, a 501(c)(3) non-profit, is an all-inclusive Wellness and Support Center providing FREE services to cancer patients and their caregivers across Bucks County. On December 8, 2022 Kin’s patients, volunteers and staff celebrated their one-year anniversary.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Launched on December 8, 2021, the non-profit’s mission, which was inspired by Corinne Sikora, was to encourage the community to help build a center that provided outstanding care delivered by compassionate and talented experts.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Kin’s overall wellness mission extends to the environment it provides which is carefully curated to create social engagement and support within a non-medical, warm and welcoming setting that offers cancer patients respite from the rigors of cancer treatment.</span></p>\n<p class=\"p3\"><span class=\"s2\">Within the first year, Kin has attracted nearly 250 patients and caregivers, along with over 50 practitioners and instructors to administer first rate care. While Kin works with all Bucks County based hospitals as well as health care providers in Philadelphia that care for Bucks County patients, both Grandview Health and Fox Chase Cancer Center Buckingham have joined Kin as official Sponsors.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">The non-profit is confident that other health care providers will follow their lead given that Kin supports and impacts their patients throughout their cancer journey.</span></p>\n<p class=\"p3\"><span class=\"s2\">To date Kin has offered 1,250 free treatments, classes and workshops to patients and caregivers. Kin’s Director, Kristina Fenimore states, “We have worked diligently to create a very robust programmatic slate at Kin that is unique to us. We listen to our patients and our practitioners and assimilate to ensure that we provide the best, most comprehensive care for everyone at Kin. We meet people where they are, with a very personalized approach.”</span></p>\n<p class=\"p3\"><span class=\"s2\">Kin’s services are comprised of various disciplines that address the entire person – emotionally, physically, and socially. Services include Massage &#8211; Reflexology &#8211; Acupuncture &#8211; Reiki &#8211; Chiropractor &#8211; Therapy &#8211; Facials &#8211; Breathing/Meditation &#8211; Yoga &#8211; Fitness &#8211; Pilates &#8211; Barre3 &#8211; Stretching &amp; Balancing &#8211; Nutrition &#8211; Pain Management &#8211; Support Groups &#8211; Book Club &#8211; Advocacy &#8211; Workshops &#8211; Crafting &#8211; Social Events.</span></p>\n<p class=\"p3\"><span class=\"s2\">Caregiver, Mary Ellen, who helps her friend Marianne who is battling cancer, shares, “Kin is an amazing place! I am so pleased to be here; it is amazing for friends to be able to attend Kin together. Kin has everything that cancer patients want to help support them during treatment and recovery.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Kin is 100% donation funded. The community, comprised of individual donors, small businesses &amp; corporations contribute to Kin in a myriad of ways. Partnerships and Sponsorships come with various incentives as does participating in any number of event and fundraisers hosted by Kin throughout the year.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">2023 will showcase some amazing sponsorship opportunities for those interested as the non-profit will host a golf outing, a 5k called “Be Kind” as part of the Bucks 5k Series, a casino night, and a Wellness Day event with local spas. “The first big question I faced as a non-profit leader was could we raise enough money to build Kin. The community answered that question by donating over $200,000 during our first fundraising campaign. Now my sights are set on inspiring the community to see the value in what they have helped build and continue to provide the funds and support necessary to sustain Kin. Ongoing donations will give us the financial security to keep Kin thriving so we can care for as many local cancer patients and their families as possible,” shares Keith Fenimore, Executive Director of Kin.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Coming to terms with her breast cancer diagnosis, Beth Cady of Furlong was working at Barre3 Doylestown when she learned about Kin from a colleague. The first time she visited, she felt an “instant connection” to Kin. She now sits on the advisory committee and volunteers at the front desk. Beth’s eyes light up talking about Kin’s vibrant atmosphere, “Everyone needs an escape &#8211; not to focus on the cancer, but to focus on living.”</span></p>\n<p class=\"p3\"><span class=\"s2\">Patients who need our services as well as companies and individuals in the community looking to support Kin in a meaningful way can connect with us by calling 267-544-5981 or via email at <a href=\"mailto:hello@welcometokin.org\">hello@welcometokin.org</a>. Learn more at <a href=\"http://www.welcometokin.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.welcometokin.org</a>.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/01/3-Erika-starting-a-breathing-and-meditation-class-with-well-dressed-mascot-Sunny-copy.jpg"
}