{
  "id": 13938,
  "title": "Bucks County Community Rallies Around Kin",
  "slug": "bucks-county-community-rallies-around-kin",
  "date": "2022-06-26T15:48:26",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "corrinee sikora",
    "doylestown cardinal",
    "Kin Wellness and Support Center"
  ],
  "excerpt": "<p>By Sarah Peters • Special to The Cardinal Doylestown’s hometown hero, Corinne Sikora, is the inspiration behind our community’s new Kin Wellness and Support Center. Even as she faced the devastating prognosis of both her brain and breast cancers, she aimed to build a brighter future for others. Just before she passed in November of [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Sarah Peters</strong> • Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">D</span><span class=\"s3\">oylestown’s hometown hero, Corinne Sikora, is the inspiration behind our community’s new Kin Wellness and Support Center. Even as she faced the devastating prognosis of both her brain and breast cancers, she aimed to build a brighter future for others. Just before she passed in November of 2020, Corinne envisioned a nurturing and compassionate, all-inclusive retreat center offering integrative services that would promote health and healing for patients living with cancer in Bucks County.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Industrious community members behind the non-profit Pine2Pink, partnered with generous local sponsors and donors and within one year of Corinne’s passing, Kin began onboarding their inaugural guests. </span></p>\n<p class=\"p5\"><span class=\"s3\">I’m honored to have been among the first to meet with the Kin team and immediately committed to becoming a sponsor and a donor. I can only imagine how different my own family’s cancer journeys would have felt if we had access to something this extraordinary. As hard as it was watching my father’s seven-year battle with Lymphoma during my teen years, I know it would bring him peace that people in the community no longer have to fight alone.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Having also experienced my own bout with cancer in my thirties, I’m grateful to know there is access to such outstanding care in our own backyard. I’ve walked this walk and know how cancer has impacted and shaped all of us in one way or another, a daunting experience to say the least.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">From the moment I experienced Kin, I felt compelled to share the story and help connect people along their journey of treatment and recovery. It’s been a great privilege speaking with many of our community members touched by Kin and I’m thrilled to share these inspiring stories.</span></p>\n<p class=\"p5\"><span class=\"s3\">For several years, Alayne Weitz of Newtown has bravely endured Stage 4 metastatic breast cancer. She first learned about Kin at a Pine2Pink celebration this past October of 2021. It’s the only place she knows that provides such a robust offering of services and doesn’t charge patients.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Between appointments at medical facilities, Alayne comes to Kin for tai chi, yoga with meditation, reflexology, and facials, but the cooking demonstrations, packed with nutrition for boosting immunity, truly bring her joy. “Being a part of Kin brings me peace and gives me balance between working full-time and going for medical treatment.” She deeply appreciates the connections and kinship among fellow guests and volunteer practitioners. “They’re like family.”</span></p>\n<p class=\"p5\"><span class=\"s3\">Coming to terms with her recent breast cancer diagnosis, Beth Cady of Furlong was working at Barre3 Doylestown when she learned about Kin from a colleague. The first time she visited, she felt an “instant connection” to Kin. She now sits on the advisory committee for fundraising and event planning at Kin, an essential mission, as Kin is 100% funded by the community.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Beth’s eyes light up talking about Kin’s vibrant atmosphere, where guests help themselves to a cup of coffee or tea and sit among friends. “Everyone needs an escape &#8211; not to focus on the cancer, but to focus on living.” Kin offers the positive mindset and amazing services to look forward to, both essential components of healing.</span></p>\n<p class=\"p5\"><span class=\"s3\">Not only does Kin consider local cancer patients to be their “guests”, but they welcome their courageous caregivers with open arms as well. Karen Sciarra of Doylestown learned about Kin from a neighbor when she found herself in the thick of her husband’s cancer journey. As the caregiver, she welcomed the escape Kin provided and quickly found herself “at home,” popping by for classes and companionship. It reinvigorates her to stay strong for herself and her husband, allowing her “to show up a better person” when she returns home to provide care and support.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Karen has been so passionate about singing Kin’s praises that she and her husband invited the community for a recent garden party at their home to raise funds to keep Kin thriving. </span></p>\n<p class=\"p5\"><span class=\"s3\">Leslie Carson of Erwinna fondly remembers Corinne from when they’d been involved together with various health and wellness initiatives for the children of Central Bucks schools. In celebration of the life of her compassionate friend, Leslie contributes to Kin by teaching gentle, breath-centric yoga, helping the guests to balance their physical, mental, and emotional selves.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">One breath at a time, the heaviness of their burdens is lightened and the stress and anxiety is more manageable. Like many of the wellness practitioners who donate their time and talents to Kin, Leslie says she’s “walking on air for the rest of the day” after making these meaningful connections.</span></p>\n<p class=\"p5\"><span class=\"s3\">Corinne’s mother, Jean Transue of Doylestown, beams with pride at her daughter’s legacy and what it means for our community. Jean has helped to shout from the rooftops all that Kin is doing for others, specifically reaching out to over eighty doctors’ offices. She’s a big reason Kin has opened its doors to over one hundred people in its first few months.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">While Corinne and Keith and Kristina Fenimore didn’t know each other personally, Jean feels like Corinne is working through them to move this mission forward. She smiles when she commends them all for being “KINdred spirits!” </span></p>\n<p class=\"p5\"><span class=\"s3\">Join us in spreading the news about Kin because you may not ever even know the profound impact it will have on others’ lives. Whether you live with cancer, care for a loved one, or are struck by curiosity, we invite you to attend Kin’s upcoming Community Open House, hosted by Hendrixson’s Furniture, on Saturday, June 18th from 1-6 PM so you can brighten someone’s life by shedding light on this amazing non-profit. </span></p>\n<p class=\"p5\"><span class=\"s3\">To learn more, visit <a href=\"http://www.welcometokin.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.welcometokin.org</a> or call 267-544-5981.</span></p>\n<p class=\"p7\"><i>Sarah Peters is a donor and sponsor of Kin Wellness and Support Center and local entrepreneur of the Sarah Peters Team with Keller Williams Real Estate</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/06/kin.jpg"
}