{
  "id": 14765,
  "title": "Bucks County Classic: The People Behind the Bikes",
  "slug": "bucks-county-classic-the-people-behind-the-bikes",
  "date": "2022-09-12T22:29:12",
  "author": "Staff",
  "category": [
    "Fit",
    "Play"
  ],
  "tags": [
    "Bucks County Classic",
    "doylestown cardinal",
    "Natalya Bucuy"
  ],
  "excerpt": "<p>By Natalya Bucuy • The Cardinal Contributing Writer Five races, 1.4 mile course, 8 turns, 90 feet of climbing per lap, and 18 years running. That is the Bucks County Classic in numbers. But for most participants, volunteers, hosts, and spectators of the premier Cycling event in Pennsylvania it’s not about the numbers. It’s about [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Natalya Bucuy • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">F</span><span class=\"s1\">ive races, 1.4 mile course, 8 turns, 90 feet of climbing per lap, and 18 years running. That is the Bucks County Classic in numbers. But for most participants, volunteers, hosts, and spectators of the premier Cycling event in Pennsylvania it’s not about the numbers. It’s about the people and the memories they create together. </span></p>\n<p class=\"p5\"><span class=\"s1\">Cyclists come from near and far corners of the world to ride the course on the beautiful historic borough streets. Over 10,000 spectators come to Doylestown to watch the race.  Volunteers organize and publicize the event and ensure safety on race day. And hosts welcome cyclists in their homes, providing comfortable places to stay. </span></p>\n<p class=\"p5\"><span class=\"s1\">Rick Millham, a Doylestown native and a long-time race volunteer, together with his wife, Lori, have hosted Gateway Development Cycling, IS Corp, and CWA Racing teams over the years. </span></p>\n<p class=\"p5\"><span class=\"s1\">“By providing a consistent home for hosting each year we have had the opportunity to get to know the riders and develop a wonderful bond with them,” Millham says. “When my children were younger I wanted them to meet these amazing athletes who leave home to pursue a dream of cycling all year long. Now with our children grown and out of the house it is a wonderful opportunity to fill our home with youthful energy, laughter, and happiness.”</span></p>\n<p class=\"p5\"><span class=\"s1\">Those bonds and moments of joy go beyond training and prepping days, as athletes share their victories and accomplishments with the family. </span></p>\n<p class=\"p5\"><span class=\"s1\">“Having a Pro Cycling race in Doylestown is great for our community because it brings the people out to see these amazing athletes compete at the highest levels,” Millham says. </span></p>\n<p class=\"p5\"><span class=\"s1\">One of the cyclists Mallhams have hosted is Dennis Ramirez Mejia, who has been participating in the event since the addition of Men’s Pro Race in 2014. </span></p>\n<p class=\"p5\"><span class=\"s1\">“Bucks County Criterium is one of the hardest criterium races in the country due to its demanding course and always changing weather conditions,” Ramirez says. “My best memory is in the 2017 edition when I was able to get 3rd place in the race. That has become one of the highlights of my racing career. I know the race by heart and I have been able to share this with the riders and teams I have met in Doylestown.”</span></p>\n<p class=\"p5\"><span class=\"s3\">In 2021, another one of Millham’s guests, Paula Munoz, of Chili, won the Women’s Pro Race of the Bucks County Classic. This year, her 16-year-old daughter, Javiera, will join her olympian mom in the race. Her team, CWA Racing’s owner Tish Kelly, plans to attend this year’s event. “My team raves about how well-run the event is and they just love their host housing,” she says. </span></p>\n<p class=\"p1\"><strong>Major Sponsors Include:</strong></p>\n<p class=\"p7\">Doylestown Health, The Thompson Organization, Eastburn and Gray PC,</p>\n<p class=\"p7\">Borough of Doylestown</p>\n<p class=\"p1\"><strong>Supporting Sponsors Include:</strong></p>\n<p class=\"p9\">Doylestown Health Foundation, Eagle Power Turf &amp; Tractor, Floyd’s of Leadville,</p>\n<p class=\"p9\">Verge Sport, Jarrett Vaughan Builders, Inc.</p>\n<p class=\"p9\">Hepatitis B Foundation/Blumberg Institute/Pennsylvania Biotechnology Center,<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p9\">Marshall Financial Group,<span class=\"Apple-converted-space\">  </span>Visit Bucks County Pennsylvania,<span class=\"Apple-converted-space\">  </span>Odyssey Energy Solutions</p>\n<p class=\"p1\"><strong>Community Sponsors Include:</strong></p>\n<p class=\"p9\">Bucks County Herald, Bike Works, C&amp;N, TD Bank</p>\n<p class=\"p9\">Bridge Acupuncture, Paper and Leaf Hemp Company</p>\n<p class=\"p1\"><strong>2022 Race Day Schedule:</strong></p>\n<p class=\"p4\"><span class=\"s1\">9:10am Masters 45+ Race</span></p>\n<p class=\"p4\"><span class=\"s1\">9:55am Amateur Women Race</span></p>\n<p class=\"p4\"><span class=\"s1\">10:40am Eagle Power Turf and Tractor Amateur Men Race</span></p>\n<p class=\"p4\"><span class=\"s1\">11:30am The Herald Ride the Course!</span></p>\n<p class=\"p4\"><span class=\"s1\">12:10pm Doylestown Health Pro Women</span></p>\n<p class=\"p4\"><span class=\"s1\">1:10pm Jarrett Vaughan Builders Kids Races</span></p>\n<p class=\"p4\"><span class=\"s1\">1:50pm Thompson Pro Men Race</span></p>\n<p class=\"p4\"><span class=\"s1\">3:45pm Awards Ceremony</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/09/VS7YKiWg.jpg"
}