{
  "id": 16988,
  "title": "Chatting It Up With Susie Steen",
  "slug": "chatting-it-up-with-susie-steen",
  "date": "2023-03-06T17:48:55",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "jamie stem",
    "susie steen"
  ],
  "excerpt": "<p>By Jamie Stem • The Cardinal Contributing Writer How and when did you get started playing music? I started taking piano lessons when I was eight. My mom played when she was a child and my parents wanted us to have that opportunity too. All my siblings played something but it was definitely different for [&hellip;]</p>\n",
  "content": "<p>By Jamie Stem • The Cardinal Contributing Writer</p>\n<p class=\"p1\"><b>How and when did you get started playing music?</b></p>\n<p class=\"p2\"><span class=\"s1\">I started taking piano lessons when I was eight. My mom played when she was a child and my parents wanted us to have that opportunity too. All my siblings played something but it was definitely different for me. I think I just knew immediately it would be more than a hobby.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>You are a bassist, a singer/songwriter, a music teacher, and you’ve even directed musicals too. Tell us a bit about your musical endeavors, which do you enjoy the most?<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p2\"><span class=\"s1\">I love all things music. I have taught infant music classes, worked with hospice patients, taught in public and private schools, etc. I gig as a solo musician but also as a pit musician <strong>for musicals, and yes I have music-directed several shows.<span class=\"Apple-converted-space\"> </span></strong></span></p>\n<p class=\"p4\"><strong><span class=\"s1\">I really love it all. I’m a French horn player and really miss playing in an orchestra. I love playing musicals, on any instrument. There is just something really special about live performances. I mostly wish I could focus more on my original music though. I sing and play guitar at local places and always cherish when I get to throw my originals in the mix. There is a real therapeutic release when you get to share your own music with people.<span class=\"Apple-converted-space\"> </span></span></strong></p>\n<p class=\"p1\"><b>You are always out and about playing music locally, where can we see you perform?</b></p>\n<p class=\"p2\"><span class=\"s1\">I try hard to balance being a mom, teaching full-time, and gigging. I have a few local places that I play at regularly. My favorite places are the wineries. I play Bishop Estate each month and it’s always a highlight for me. The winery vibe is just relaxed and fun.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>You are an original musician by trade. Where do you draw your inspiration from and do you have any plans for any new releases?</b></p>\n<p class=\"p4\"><span class=\"s1\">All of my originals just come to me in the moment. Words always come first for me. I can’t write the music first and then add words, it never feels right. Sometimes I write based on the things I’m going through at the time but a lot of times I just observe the world around me. I have songs that are deeply personal and others that sound like they are but they weren’t written about me. I like that. I like that people can relate to them in their own ways and interpret them how they want to.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">I have not recorded something in years and I really hope to do that this summer. I have grown so much as a songwriter and musician since I recorded my first album years ago, I would love to get the next one released and share it with everyone.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/03/Susie-Steen.jpg"
}