{
  "id": 18111,
  "title": "Cheers at the Castle: Fonthill Beer Festival is Back on Aug 26",
  "slug": "cheers-at-the-castle-fonthill-beer-festival-is-back-on-aug-26",
  "date": "2023-08-14T11:41:59",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Play",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Fonthill Beer Festival",
    "Fonthill Castle",
    "Natalya Bucuy",
    "zythophile"
  ],
  "excerpt": "<p>By Natalya Bucuy • The Cardinal Managing Editor Here is a cool and rare word: Zythophile.  “Phile,” as we all know, means “lover.” What does zythophile love? The same thing cerevisaphile loves, and if that synonym didn’t give it away, both words mean “the lover of beer.” The root “zytho” comes from the Greek “made [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Natalya Bucuy • </b>The Cardinal Managing Editor</p>\n<p class=\"p3\"><span class=\"s2\">H</span><span class=\"s1\">ere is a cool and rare word: Zythophile.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">“Phile,” as we all know, means “lover.” What does zythophile love? The same thing cerevisaphile loves, and if that synonym didn’t give it away, both words mean “the lover of beer.” The root “zytho” comes from the Greek “made from barley.” And “cerevisa” is Latin for “beer.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">On Aug 26, local zythophiles (or cerevisaphiles, if they so prefer) will gather on the Fonthill Castle grounds for the annual Fonthill Beer Festival to enjoy some crafted brews from the region in the one-of-a-kind setting.</span></p>\n<p class=\"p5\"><span class=\"s1\">A local favorite since 2014, this event brings together history, community, fundraising, and the craft beer scene. Guests will get a taste of T.H.E. Catering Company culinary delights and craft beverages from 15 craft breweries. The musical talents of Billy and Miles from Where’s Pete Band will bring a live musical touch to the event, all against the background of Henry Mercer’s famous historical architectural wonder. All the proceeds will benefit the Doylestown Historical Society’s preservation and educational initiatives.</span></p>\n<p class=\"p5\"><span class=\"s1\">Local brewers love the Fonthill Beerfest as it serves as a unique opportunity to connect with local customers. “Fonthill Castle is one of our all-time favorites,” says Maryana Ferguson, the owner of the Great Barn Brewery of Kintersville. “It provides a magical artsy setting that completely resonates with me. As a company owner, I get a great chance to meet with locals face to face and have an honest conversation about beers, local scene, and happenings. What can I say, I like me a great party and sure wouldn’t want to miss this castle event. It’s awesome!”</span></p>\n<p class=\"p5\"><span class=\"s1\">Mercer, a famous historian, and anthropologist, was known to love a good party himself. While some sources list champagne as his go-to beverage, his archives contained a personal recipe for an Ale. Last year, Drew Scott, brewmaster and owner of Geronimo Brewery, used that recipe to make that beer for the festival. Scott described the taste as “not like any other modern-day beer” and “a very dry English bitter” with some spruce flavoring.</span></p>\n<p class=\"p5\"><span class=\"s1\">Whatever beers zythophiles try on Aug. 26, safety should always come first. Bucks County Transport is providing free DART Bus services to all Beer Fest attendees who show their event wristbands. The three-stop loop between Fonthill Castle and the center of Doylestown allows visitors to enjoy the festival, as well as all of the shopping and dining options that Doylestown has to offer. The DART bus runs every 20 minutes between 3:30 p.m. and 10 p.m. and the stops are Fonthill Castle, the corner of S. Main Street and W. State Street (in front of Starbucks), and the corner of W. State Street and Hamilton Street.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The VIP hour kicks off the event from 1-2 p.m., and general admission takes place between 2 p.m. and 5 p.m. Tickets for this fundraising event are $175 for VIP, $75 for general admission, $65 for BCHS member general admission, and $25 for designated drivers, and are available now at <a href=\"http://mercermuseum.org/beerfest\" target=\"_blank\" rel=\"noopener noreferrer\">mercermuseum.org/beerfest</a>.</span></p>\n<p class=\"p5\"><span class=\"s1\">Fonthill Castle is located at 525 E. Court St., Doylestown. All drivers, including Uber/Lyft/taxis/personal vehicles, will use the Swamp Road/Route 313 entrance to the property to access the event’s parking area. No one under 21 is permitted to attend.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\"><strong>Participating Breweries this year include</strong> Aristaeus Craft Brewing, Artifact Brewing, Bitchin’ Kitten Brewery, Boston Beer Company, Free Will Brewing, Great Barn Brewery, Mad Princes Brewing, Manic Minds Brewing Co., McAllister Brewing Company, Round Guys Brewing Company, Triumph Brewing Co., Twelve78 Brewing Company, Understable Brewing, Warwick Farm Brewing, and Well Crafted Beer Company. Athletic Brewing Co. and Free Spirit will offer a variety of non-alcoholic options for all to also enjoy.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/08/6.-Fonthill-Castle-Beer-Fest-e1692027713466.jpg"
}