{
  "id": 18848,
  "title": "Culinary Gems in Lambertville and New Hope",
  "slug": "culinary-gems-in-lambertville-and-new-hope",
  "date": "2024-01-29T13:37:53",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Stay"
  ],
  "tags": [
    "Culinary Gems in Lambertville and New Hope"
  ],
  "excerpt": "<p>Story and Photos by Jay Garrison • The Cardinal Contributing Writer TAVERNA 54 One of the newest additions to the local culinary scene, Taverna 54 has been a big hit since its opening. Simply referred to as T54 by the locals, this Italian restaurant occupies the former location of the highly popular Deanna’s on Franklin [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>Story and Photos by Jay Garrison • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><strong>TAVERNA 54</strong></p>\n<p class=\"p4\"><span class=\"s1\">One of the newest additions to the local culinary scene, Taverna 54 has been a big hit since its opening. Simply referred to as T54 by the locals, this Italian restaurant occupies the former location of the highly popular Deanna’s on Franklin Street. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">After months of a complete renovation, this restaurant and bar has quickly earned a reputation for its quality of service and delicious food.<span class=\"Apple-converted-space\">  </span>A great start to your meal here might include their Tuna Tartare, Grilled Octopus or Grilled Prawn.<span class=\"Apple-converted-space\">  </span>Main dishes that will more than satisfy your cravings for authentic Italian cuisine include Trofie Pesto Genovese, Butternut Squash Gnocchi and Tuscan Roasted Chicken among another dozen or so choices. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">The menu features many gluten free and vegan choices.<span class=\"Apple-converted-space\">  </span>If you are going, reservations are recommended.<span class=\"Apple-converted-space\">  </span>Taverna 54, 54 N. Franklin Street, Lambertville<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><strong>D’FLORET<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p4\"><span class=\"s1\">Tucked away on a tiny side street in Lambertville, celebrity Chef Dennis Foy can often be found working in the open kitchen hours before opening preparing for the night ahead.<span class=\"Apple-converted-space\">  </span>Known as the originator of farm to table, Chef Foy has created an impeccable reputation in culinary circles for past 5 decades. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Opening his latest restaurant over a decade ago in Lambertville, the 24 seat D’floret is adorned with art from Chef Foy and his wife Estella Quionones.<span class=\"Apple-converted-space\">  </span>But the culinary art that is created each night in the kitchen will have you savoring every bite. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">In addition to the daily specials, the menu includes such favorites as Sautéed Florida Snapper, Roasted Rack of Lamb and Seared Ahi Tuna.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">No meal would be complete at D’floret without a few selections from the dessert menu.<span class=\"Apple-converted-space\">  </span>Strawberry Shortcake and Tahitian Vanilla Crème<span class=\"Apple-converted-space\">  </span>Brûlée are two of the amazing desserts you’ll find to complete your meal. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">You’ll definitely want reservations at this BYOB restaurant.<span class=\"Apple-converted-space\">  </span>D’Floret, 18 S. Main Street, Lambertville (door on Lilly Street)</span></p>\n<p class=\"p3\"><strong>BELL’S TAVERN<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p4\"><span class=\"s1\">In a town that is known to triple its population each day from tourists, where do locals enjoy their dining? Bell’s Tavern.<span class=\"Apple-converted-space\">  </span>Tucked in the middle of a residential block on N. Union Street, except for the bustling activity in front, you could easily pass this local favorite restaurant ten times and never known it was there. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">The bar and dining area is often filled with the who’s who from the local community and you won’t find a single local that isn’t more then happy to tell you about why Bell’s is such a favorite and what their favorite pasta dish is.<span class=\"Apple-converted-space\">  </span>Know for exceptional and friendly service, this eatery was established in 1938.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">A section of menu items include choices such as Farfalle Francesca, Bell’s Gambretti and Grilled New York Strip Steak.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Located at 183 North Union Street, Bell’s Tavern is open 7 days a week from 5pm to 9pm.<span class=\"Apple-converted-space\">  </span>Reservations are suggested. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><strong>OLDESTONE STEAKHOUSE<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p4\"><span class=\"s1\">Breathtaking is often used to describe the first impressions of the dining room at Oldestone Steakhouse in New Hope.<span class=\"Apple-converted-space\">  </span>Built in 1872, this stone church was once the home to Marsha Browns for nearly two decades.<span class=\"Apple-converted-space\">  </span>Much of the interior design and decor has been retained in the multi level steakhouse.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Foodies from as far away from NYC and Philadelphia have touted their dining experience at Oldestone with many celebrities sightings at this 2 year old Art Deco steakhouse. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">From a raw bar to a chef’s table to multiple bars, Oldestone is big city dining in New Hope.<span class=\"Apple-converted-space\">  </span>The Porterhouse Board for two is one of the most popular selections on a menu filled with Filet Mignon, New York Strip, Cowboy Ribeye among other choices cuts.<span class=\"Apple-converted-space\">  </span>For those not in the mood for steak, Vegetarian Napoleon, Garlic and Lemon Roasted Chicken and a handful of pasta dishes are also included on the menu. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">At 9,000 square feet and one of, if not the biggest dining rooms in the area, it’s hard to imagine you need reservations, but it’s recommended. <span class=\"Apple-converted-space\">  </span>Oldestone is located at 15 South Main Street, New Hope.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><strong>NOZOMU SUSHI</strong></p>\n<p class=\"p4\"><span class=\"s1\">In a town bustling with thousands of tourists on the weekends, the prayers for exceptional sushi in New Hope were finally answered at the end of 2022. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Chef Danny Nguyen and his team have created the ultimate menu for a light meal or for a multi course dinner experience. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">The two story restaurant with an outdoor deck on Mechanic Street is warm and welcoming with a staff that goes above and beyond to provide you with an exceptional experience. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">In addition to the signature rolls, such as the very popular New Hope Roll, the Kiss of Death Roll and the Ragin Cajun Roll, the menu features à la carte selections and sushi and sashimi selections.<span class=\"Apple-converted-space\">  </span>In addition, the Kalbi-Korean marinated Short Ribs is a can’t miss dish. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Reservations are recommended as this restaurant fills up quickly from the moment it opens.<span class=\"Apple-converted-space\">  </span>Located at 9 West Mechanic Street, New Hope, Nozomu is BYOB. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><strong>AMELIA<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p4\"><span class=\"s1\">Hidden gem.<span class=\"Apple-converted-space\">  </span>Tucked away on Ferry Street in New Hope, the very unassuming building hides what many would argue is one of the top 3 restaurants in a town packed with too many restaurants to choose from. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Sometimes you’ll come across a restaurant and wish you knew about it sooner.<span class=\"Apple-converted-space\">  </span>Amelia is one of those places. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">With Fradiavolo, Campanelle con salsiccia e pomodoro and Farfalle alla forrestiera as just some of the dishes on this menu, deciding on just one dish will be difficult at best.<span class=\"Apple-converted-space\">  </span>The menu also includes a handful of chicken, fish and steak choices as well but the insider tip here is to go with a pasta dish.<span class=\"Apple-converted-space\">  </span>But no matter which way you go be sure to leave room for dessert. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Amelia is located at 49 West Ferry Street, New Hope.<span class=\"Apple-converted-space\">  </span>You’ll absolutely want reservations.</span></p>\n<p class=\"p6\">And Don’t Forget a Favorite Drink!</p>\n<p class=\"p3\"><strong>THE BOAT HOUSE<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p4\"><span class=\"s1\">This nautical themed bar feels more like sitting in the boat captains living room than a place for signature cocktails. <span class=\"Apple-converted-space\">  </span>Can’t Miss: Margarita</span></p>\n<p class=\"p3\"><strong>LAMBERTVILLE HOUSE</strong></p>\n<p class=\"p4\"><span class=\"s1\">The bar in the historic Lambertville House Hotel on Bridge Street is typically bustling with activity most early evenings year round.<span class=\"Apple-converted-space\">  </span>Can’t Miss: Martini<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><strong>UNDER THE MOON<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p4\"><span class=\"s1\">The newly added bar is Lambertville’s go to late night spot for cocktails and light menu.<span class=\"Apple-converted-space\">  </span>This bar features many signature cocktails.<span class=\"Apple-converted-space\">  </span>Can’t Miss: Old Fashion<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><strong>FERRY + MAIN AT LOGAN INN</strong></p>\n<p class=\"p4\"><span class=\"s1\">Established in the early 1700’s, the Logan Inn recently completed a major renovation and addition.<span class=\"Apple-converted-space\">  </span>The huge bar and outdoor space is a perfect location to start or end your night.<span class=\"Apple-converted-space\">  </span>Can’t Miss: Wine selection</span></p>\n<p class=\"p3\"><strong>THE DUBLINER ON THE DELAWARE</strong></p>\n<p class=\"p4\"><span class=\"s1\">One step into this Irish pub and luck will be on your side.<span class=\"Apple-converted-space\">  </span>A favorite with locals and tourists in the heart of New Hope. Can’t Miss: The Guinness Pours.</span></p>\n<p class=\"p3\"><strong>RIVERHOUSE AT ODETTE’S<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p4\"><span class=\"s1\">The piano bar features live music on the weekends at this upscale boutique hotel on the Delaware River.<span class=\"Apple-converted-space\">  </span>Can’t Miss: Dirty Chai</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/01/Lambertville-House.jpeg"
}