{
  "id": 19887,
  "title": "Dave Sports Center Celebrates 70 Years in Business",
  "slug": "dave-sports-center-celebrates-70-years-in-business",
  "date": "2024-06-20T20:07:19",
  "author": "Staff",
  "category": [
    "Play"
  ],
  "tags": [],
  "excerpt": "<p>By Natalya Bucuy • Cardinal Managing Editor In the late spring of 1954, Dave Windholz had $900 and a dream in his pocket.  Two years out of the Air Force, the 25-year-old graduate of Doylestown High School, lived on Harvey Avenue and worked for a neighbor in a sporting goods and auto supply store. As the [&hellip;]</p>\n",
  "content": "<p><b>By Natalya Bucuy <em>• </em></b>Cardinal Managing Editor</p>\n<p><span style=\"font-weight: 400;\">In the late spring of 1954, Dave Windholz had $900 and a dream in his pocket. </span></p>\n<p><span style=\"font-weight: 400;\">Two years out of the Air Force, the 25-year-old graduate of Doylestown High School, lived on Harvey Avenue and worked for a neighbor in a sporting goods and auto supply store. As the owner of the store retired, Windholz took over. He sold off the inventory and purchased new merchandise that spoke to his heart of a hunter and fisherman. Dave’s Sporting Goods was born. It stood in the borough on the corner of Shewell and Court Street until 1963, then moving to its current location. </span></p>\n<p><span style=\"font-weight: 400;\">Today, Dave Sports Center on Easton Road, just north of town, continues to serve the area’s fishing enthusiasts. With time, it grew and evolved, responding to the community&#8217;s needs. But one thing remains the same &#8211; it’s still a family affair.</span></p>\n<p><span style=\"font-weight: 400;\">Windholz’s daughters, Diane Louden and Debbie Rufe run the two adjacent stores &#8211; Dave’s, which sells traditional gear and fishing tackle, and Mainstream Outfitters, a sister shop opened in 2000. It offers fly fishing equipment and lessons. Shawn Overturf, Windholz&#8217;s grandson, is the owner of another expansion, Dtown Disc Golf Store, which opened in 2012. </span></p>\n<p><span style=\"font-weight: 400;\">“My sister and I have been here our entire lives, fishing in our blood,” Louden says. “And customers are part of our family. We feel a strong connection to our community. New people get into fishing all the time, but we also have our regulars.” It’s not unusual to see three generations of local fishermen come in for supplies, she adds. </span></p>\n<p><span style=\"font-weight: 400;\">That connection to the community is what keeps the business going. The shop does not offer internet sales and stays competitive with excellent service, in-depth knowledge of the trade, and high-quality merchandise, Louden says. Friendly and personalized face-to-face interactions go a long way &#8211; seven decades long, in fact. </span></p>\n<p><span style=\"font-weight: 400;\">Through the pandemic, Dave’s Sports Center offered curbside pick-up. It saw a boost in business as people took the opportunity to enjoy outdoor recreation during the lockdown. “We’ve been going strong and steady since then,” Louden says.   </span></p>\n<p><span style=\"font-weight: 400;\">Besides supplying the local fishing community with quality goods, Windholz has been an active supporter of the sport in other ways. In 2022, Doylestown’s Borough Council recognized him for his work with the town’s fishing derby, a highly anticipated annual event.  </span></p>\n<p><span style=\"font-weight: 400;\">Windholz, 95, is still an active participant in the business. “Dave is here all the time,” Louden says. “He is a quiet man with a low-key personality. He is very excited that the business is still in the family and he is very proud of it. He can’t believe 70 years flew by.” </span></p>\n<p><span style=\"font-weight: 400;\">Windholz has three daughters, seven grandchildren, and eight great-grandchildren. And &#8211; no surprise there &#8211; everybody fishes. </span></p>\n<p><span style=\"font-weight: 400;\">For more information, visit <a href=\"http://davestackleshop.com\" target=\"_blank\" rel=\"noopener noreferrer\">davestackleshop.com</a> or 1127 N Easton Road.</span></p>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/06/Daves-Sports-Center.jpeg"
}