{
  "id": 12434,
  "title": "Do the Right Things NOW to Sell Your House FAST!",
  "slug": "do-the-right-things-now-to-sell-your-house-fast",
  "date": "2022-03-01T22:50:33",
  "author": "Staff",
  "category": [
    "Stay",
    "Style"
  ],
  "tags": [
    "Barb “Matty” Matyszczak",
    "doylestown cardinal",
    "doylestown real estate",
    "Nancy Vander Zwan",
    "victoria guillot"
  ],
  "excerpt": "<p>By Barb “Matty” Matyszczak and Nancy Vander Zwan • The Cardinal Contributing Writers Daffodils, robins, longer days…they’ll all be back soon. just as spring comes once a year, so does the most popular time for home selling: the spring market! “Spring is the traditional time during which most houses sell. The more houses listed for [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Barb “Matty” Matyszczak </b><b>and Nancy Vander Zwan • </b>The Cardinal Contributing Writers</p>\n<p class=\"p3\"><span class=\"s2\">D</span><span class=\"s3\">affodils, robins, longer days…they’ll all be back soon. just as spring comes once a year, so does the most popular time for home selling: the spring market! “Spring is the traditional time during which most houses sell. The more houses listed for sale, the more competition to get the best buyers and offers for your house, if you plan to sell.”</span></p>\n<p class=\"p5\"><span class=\"s3\">Why is good home preparation so important? Because over 90% of home buyers look at photos of properties on websites, like Realtor.com, before deciding which houses see in person. That’s right, the majority of home buyers no longer get in their cars to see a house for sale unless they’ve looked at photos of the house first.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The average length of time buyers look at any one house’s photos is between eight to fifteen SECONDS! Your house has to look amazing in the photos your realtor will take and post online. As that old TV commercial goes, “You never get a second chance to make a first impression.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">If you plan to sell your house this spring, right now is the best time to start the home staging process. Effective home preparation, or home staging, will make the difference between selling quickly or seeing your house linger on the market, sometimes even with a price drop.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Thanks to the popularity of home shows on HGTV, more consumers know about home staging. It is the science of preparing a house to appeal to any buyer and attract offers. Home staging isn’t just adding fresh linens, a new picture or two, and fluffy pillows to your sofa.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">StagingCraft specializes in working with realtors to advise home sellers on what they need to fix or update a house so that it sells quickly for top dollar. It’s simple: The house that is staged to look its best in any neighborhood will get more visitors, and offers, than all the other houses that haven’t been properly prepared and photographed.</span></p>\n<p class=\"p5\"><span class=\"s1\">Regular Cardinal contributing writer Victoria Guillot at <a href=\"http://StageCoachServices.com\" target=\"_blank\" rel=\"noopener noreferrer\">StageCoachServices.com</a> is also a great local source for staging your home for sale.</span></p>\n<p class=\"p5\"><strong><span class=\"s1\">Here are StagingCraft’s and RE/MAX 440’s proven tips for making your house the one buyers MUST have:</span></strong></p>\n<p class=\"p5\"><strong><span class=\"s4\">1. Fix the exterior.</span></strong><span class=\"s1\"> Weed and mulch gardens, cut back overgrown shrubbery, fix cracked sidewalks, and clean the house’s exterior.</span></p>\n<p class=\"p5\"><strong><span class=\"s4\">2. Repair</span></strong><span class=\"s1\"> any signs of moisture inside: wet basements, roof and window leaks, and cracks in walls. Water damage is often a sales killer.</span></p>\n<p class=\"p5\"><strong><span class=\"s5\">3. Update bathrooms</span></strong><span class=\"s3\"> if that is in your budget. Renovated bathrooms have a good return on investment at the sale price of your house, so you’ll get at least some of the expenses back when you sell.</span></p>\n<p class=\"p5\"><strong><span class=\"s4\">4. De-clutter!</span></strong><span class=\"s1\"> Buyers should be looking at your rooms, not your stuff. Pack away as much as possible and make sure rooms look bright and spacious.</span></p>\n<p class=\"p5\"><strong><span class=\"s4\">5. Paint walls</span></strong><span class=\"s1\"> white or a light, neutral color. Remove wallpaper borders and outdated wallpaper.</span></p>\n<p class=\"p5\"><strong><span class=\"s4\">6. Empty clothes</span></strong><span class=\"s1\"> and linen closets and food pantries as much as possible to make storage spaces look bigger.</span></p>\n<p class=\"p5\"><strong><span class=\"s4\">7. Have carpets,</span></strong><span class=\"s1\"> upholstered furniture, and draperies professionally cleaned to freshen the smell of the house.</span></p>\n<p class=\"p5\"><strong><span class=\"s5\">8. Let in the light!</span></strong><span class=\"s3\"> Pull window shades and blinds up and remove heavy draperies, valances, and sheers that block natural light.</span></p>\n<p class=\"p5\"><strong><span class=\"s5\">9. Replace</span></strong><span class=\"s3\"> outdated, dark, and/or heavily patterned bedding with white or off-white spreads and comforters. Bedrooms will look fresh, clean, and larger in photos.</span></p>\n<p class=\"p5\"><strong><span class=\"s6\">10. Clean, clean, CLEAN!</span></strong><span class=\"s7\"> Invest in a professional house cleaning service for a one-time, intensive, deep cleaning of your entire house. Buyers are turned off by dirty windows and grime in kitchens and bathrooms, light switches around doorknobs and baseboards. We often stop noticing areas in our house that need a good cleaning, so an outside cleaning professional will catch issues that you don’t.</span></p>\n<p class=\"p5\"><span class=\"s7\">In partnership with Realtors, accredited home stagers specialize in advising sellers on everything necessary to get a house ready for sale right from the start.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Attention to the issues listed above will create photos that make your house look bigger, brighter, and updated. Buyers will love what they see in the photos and have their realtors often show your property. If you’ve done the work ahead of time, your house won’t be on the market for long!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><span class=\"s8\"><i>Barb “Matty” Matyszczak is a REALTOR/Manager with over 32 yrs experience in the Bucks/Montgomery Real Estate Market. To learn more, visit <a href=\"http://www.BarbMatty.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.BarbMatty.com</a>, or call her at 215-348-7100, or email at <a href=\"mailto:barb@barbmatty.com\">barb@barbmatty.com</a></i></span></p>\n<p class=\"p7\"><i>Nancy Vander Zwan is owner of StagingCraft, a home staging company that has a warehouse full of furniture, décor, lighting, art, and rugs to make occupied and vacant houses look amazing in photos and create an emotional connection between a buyer and a house for sale. She can be reached at 215-262-7306 and by email at <a href=\"mailto:Nancy@StagingCraft.com\">Nancy@StagingCraft.com</a></i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/03/Sta_36-800x533.jpg"
}