{
  "id": 19727,
  "title": "Doylestown Music Fest Brings New Faces to the Scene",
  "slug": "doylestown-music-fest-2024",
  "date": "2024-05-31T17:00:35",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "Doylestown Music",
    "Doylestown Music Fest",
    "Music Festival"
  ],
  "excerpt": "<p>By Natalya Bucuy• Cardinal Managing Editor With the consistent presence of musical talent throughout the year, Doylestown kicks it up a notch the first week of the month with the annual Music Fest from June 1 to 8. For an entire week, local restaurants, bars, cafes, merchants, churches, and museums host an array of musical [&hellip;]</p>\n",
  "content": "<p><b><em>By Natalya Bucuy</em><em>• </em></b>Cardinal Managing Editor</p>\n<p><span style=\"font-weight: 400;\">With the consistent presence of musical talent throughout the year, Doylestown kicks it up a notch the first week of the month with the annual Music Fest from June 1 to 8. For an entire week, local restaurants, bars, cafes, merchants, churches, and museums host an array of musical acts throughout town. </span></p>\n<p><span style=\"font-weight: 400;\">A grassroots effort that supports and promotes live bands and musicians in the area, Doylestown Music Fest celebrates its seventh year. Since its inception, the Festival brought 325 performances to local audiences. This month, 42 acts through 13 venues liven spaces and offer a variety of genres &#8211; something for everyone. </span></p>\n<p><span style=\"font-weight: 400;\">“It’s an opportunity to give musicians work,” says Matt Mannino, owner of Villa Capri Restaurant and the man behind the idea of the Doylestown Music Festival. The event introduces new talent, while also bringing acts that everyone knows and loves, diversifying the music culture in town, Mannino says. “People play music, but they can feel afraid to put themselves out there. We try to make it not as scary as it seems. When young  artists play, we can see that we make an impact on their personal lives.”</span></p>\n<p><span style=\"font-weight: 400;\">Mannino, a musician himself, wanted to model the event after the famous Bethlehem Musikfest, with a touch of the Restaurant Week flare. Throughout the week, Doylestown restaurants feature food and drink specials and schedule extra music performances. With those efforts, the town transforms into a multifaceted entertainment hub.</span></p>\n<p><span style=\"font-weight: 400;\">“We’re blessed that we have been here so long, we have our regulars,” Mannino says. But bringing new faces &#8211; new musicians as well as new patrons, that puts us on the map as music venues.”</span></p>\n<p><span style=\"font-weight: 400;\">The Festival runs entirely on volunteer efforts, building partnerships between venues, musicians, and event promoters. “I like the idea that venues that normally compete with each other as many restaurants in town offer similar services, collaborate during the festival, working together,” Mannino says. “It’s an artistic town. The Festival identifies well with Doylestown as a community and as a brand.”</span></p>\n<p><span style=\"font-weight: 400;\">Heather Ransome, who has been involved with the festival promotion for the last two seasons, loves how the Festival brings people together. Multiple local artists join Mannino and Ransome to help promote the event this year, including Bob Byrne, Bruce Logan, and Michael Gallagher. “It’s fun to be around musicians. It’s joyful,” Ransome says. “We have a sense of community where we’re helping our local musicians to strive.” Holding music events at venues that do not normally host music, adds fresh flavor to the music scene in town, Ransome says. </span></p>\n<p><span style=\"font-weight: 400;\">This year, a Bingo Card adds a bit more energy and fun to the festivities. Patrons can participate with a hard copy of the card or play digitally. The Card suggests activities throughout the town and chances to win prizes. Check out the one below or scan the QR code to access the card online. </span></p>\n<figure id=\"attachment_19737\" aria-describedby=\"caption-attachment-19737\" style=\"width: 732px\" class=\"wp-caption alignnone\"><a href=\"/data/media/DMF-Bingo-Card_20240517_142942_0000.png\"><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-19737\" src=\"/data/media/DMF-Bingo-Card_20240517_142942_0000-732x1024.png\" alt=\"Music Fest Bingo Card\" width=\"732\" height=\"1024\" srcset=\"/data/media/DMF-Bingo-Card_20240517_142942_0000-732x1024.png 732w, /data/media/DMF-Bingo-Card_20240517_142942_0000-214x300.png 214w, /data/media/DMF-Bingo-Card_20240517_142942_0000-768x1075.png 768w, /data/media/DMF-Bingo-Card_20240517_142942_0000-990x1386.png 990w, /data/media/DMF-Bingo-Card_20240517_142942_0000-1320x1847.png 1320w, /data/media/DMF-Bingo-Card_20240517_142942_0000.png 1429w\" sizes=\"auto, (max-width: 732px) 100vw, 732px\" /></a><figcaption id=\"caption-attachment-19737\" class=\"wp-caption-text\">Music Fest Bingo Card</figcaption></figure>\n<p><span style=\"font-weight: 400;\">As for the future, the crew hopes to continue and grow, eventually creating a non-profit that can help organize and fund the event each year. To volunteer at the Festival, email, doylestownmusicfest@gmail.com. For more information and the complete schedule, visit <a href=\"https://www.dtownmusicfest.org/\">dtownmusicfest.org. </a></span></p>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/05/IMG_7523.jpeg"
}