{
  "id": 19459,
  "title": "Doylestown Farmers Market is Back!",
  "slug": "doylestown-farmers-market-is-back",
  "date": "2024-04-22T05:48:42",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Fit",
    "Live",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Doylestown Farmers Market"
  ],
  "excerpt": "<p>April 20th is Opening Day of the Doylestown Farmers Market and our 49th year of continuous operation.  Every Saturday from 8am to 1pm on South Hamilton Street is where you’ll find us, rain or shine, with live music every week! All of your favorite produce vendors are back &#8211; Trauger’s Farm, Pan’s Forest, Love Grows, [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">A</span><span class=\"s2\">pril 20th is Opening Day of the Doylestown Farmers Market and our 49th year of continuous operation.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Every Saturday from 8am to 1pm on South Hamilton Street is where you’ll find us, rain or shine, with live music every week! All of your favorite produce vendors are back &#8211; Trauger’s Farm, Pan’s Forest, Love Grows, Wildemore Farm, Bedminster Orchard, Spring Creek Farm &#8211; and Jersey Pickles of course, Apple Ridge Farm is our new sourdough bread and bakery vendor, Backyard Beans joins us this season with their amazing coffee, Noshes by Sherri, Hershberger Heritage Farm, Primordia Mushroom Farm, Solrig Farm Microgreens, Carol Cares Aromatherapy and Marie’s Soap Company round out our returning weekly regulars. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">We welcome back our favorite part-time vendors and lots of new vendors this season like: Molto Bene Ravioli Company, Live Hot Sauce, Blue Mountain Vineyards, The Confident Baker, The Confectionary, and more. In addition to the gorgeous produce and fruit our farmers are bringing us, you’ll find sourdough bread, soft pretzels, muffins, cookies, sweet and savory pies, granola. fruit breads, farmer grown popcorn, pierogies, maple syrup, cider, dog treats, hummus and prepared food goodies, sauerkraut and fermented vegetables, jams, jellies and condiments, freshly ground wheat flour, hand crafted ceramics, alpaca yarn and clothing, and so much more.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">We’ll also have a monthly kids craft and educational exhibits. And don’t forget our market merchandise, with a new market tote for the season, the perfect way to show that you support local! </span></p>\n<p class=\"p3\"><span class=\"s3\">With 50+ vendors this season, we are here to bring you the finest in locally grown and produced items. Find out who’s coming and what’s happening each week by signing up to receive our newsletter, with recipes and cooking tips, by heading to our website at <a href=\"https://doylestownfarmersmarket.bucksfoodshed.org\" target=\"_blank\" rel=\"noopener noreferrer\">https://doylestownfarmersmarket.bucksfoodshed.org</a>/.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">See you at the market!</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/04/DFM-market-shot-bedminster-peaches.jpg"
}