{
  "id": 16297,
  "title": "Doylestown barre3 Promotes Body Positive Community",
  "slug": "doylestown-barre3-promotes-body-positive-community",
  "date": "2023-01-10T00:16:18",
  "author": "Staff",
  "category": [
    "Fit"
  ],
  "tags": [
    "Angie Lee",
    "barre3 Doylestown",
    "Britt Around Town",
    "brittany brown",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Britt Around Town • Special to The Cardinal In October of 2022, barre3 Doylestown’ celebrated its eighth-year anniversary. I have been attending barre3 Doylestown since last January, and it quickly became my “happy place.” There was something special about this little community and the feeling of welcome the second I walked through the door.  [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Britt Around Town</strong> • Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">I</span><span class=\"s1\">n October of 2022, barre3 Doylestown’ celebrated its eighth-year anniversary. I have been attending barre3 Doylestown since last January, and it quickly became my “happy place.” There was something special about this little community and the feeling of welcome the second I walked through the door.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">I now would like to introduce you to Angie Lee &#8211; the owner of the Doylestown location &#8211; who has become a good friend of mine during my time at the studio, as well as our mutual involvement in the Pine2Pink foundation. Angie is a true gem and inspiration.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong>Q: Tell Me A Little About Yourself and Your Business?</strong></p>\n<p class=\"p5\"><span class=\"s1\"><strong>A:</strong> I was born and raised in Maine, I ventured to North Carolina, where I met my husband, and eventually relocated to Bucks County in 2006 to be closer to our families.<span class=\"Apple-converted-space\">  </span>My early career was in HR and Recruiting within various industries. However, my passion for health and wellness and helping others led my path to barre3. Barre3 was unlike any other fitness class that I had attended.<span class=\"Apple-converted-space\">  </span>We have a shame-free and body-positive approach to fitness, one that encourages modifications and empowers individuality.<span class=\"Apple-converted-space\">  </span>It also provided me with the sense of community and belonging I yearned for, being in a new town and as a stay-at-home mom.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong>Q: When Did You Start Your Business:</strong></p>\n<p class=\"p5\"><span class=\"s1\"><strong>A:</strong> I purchased the barre3 Doylestown studio in 2018, after instructing for three years at the Newtown location. We have been open and empowering the Doylestown community since 2014.</span></p>\n<p class=\"p6\"><strong>Q: What Made You Decide to Start Your Business?</strong></p>\n<p class=\"p5\"><span class=\"s1\"><strong>A:</strong> I knew the moment I walked through those doors in Newtown that barre3 was special. I felt that I had finally found my home and my people. I quickly realized that barre3 was so much more than just a fitness studio and class. It was about the relationships that were built in this space, the women who supported and lifted each other up, and the celebrations of being unique individuals. My love for teaching barre3 grew, and I found myself wanting to be at the studio at all hours. It was my ‘happy place,’ and I wanted more. When the opportunity presented itself to purchase the Doylestown studio, I never second-guessed. I knew it was my opportunity to build on my purpose.</span></p>\n<figure id=\"attachment_16299\" aria-describedby=\"caption-attachment-16299\" style=\"width: 1280px\" class=\"wp-caption alignnone\"><a href=\"/data/media/1280.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-16299\" src=\"/data/media/1280.jpg\" alt=\"\" width=\"1280\" height=\"1921\" srcset=\"/data/media/1280.jpg 1280w, /data/media/1280-200x300.jpg 200w, /data/media/1280-768x1153.jpg 768w, /data/media/1280-682x1024.jpg 682w, /data/media/1280-990x1486.jpg 990w\" sizes=\"auto, (max-width: 1280px) 100vw, 1280px\" /></a><figcaption id=\"caption-attachment-16299\" class=\"wp-caption-text\">Angie Lee</figcaption></figure>\n<p class=\"p6\"><strong>Q. What is Your Mission Statement or Objective?</strong></p>\n<p class=\"p5\"><span class=\"s1\"><strong>A:</strong> Our mission at barre3 is to teach people to be balanced in body and empowered from within. We’ve been conditioned to think that more is better, that pushing yourself past your limit and forcing your body to do things that feel wrong is how you get results. Barre3 teaches us that when we modify, we are our strongest selves in both body and mind.<span class=\"Apple-converted-space\">  </span>When we listen to those internal cues, we confidently stand up for ourselves.<span class=\"Apple-converted-space\">  </span>It’s okay to do something different and look different than the instructor and your neighbor. My hope is that we can help change our own body image perspectives to accepting and positive for the next generation.</span></p>\n<p class=\"p6\"><strong>Q: Give Us an Overview of Key Products or Services.</strong></p>\n<p class=\"p5\"><span class=\"s1\"><strong>A:</strong> Barre3 is a full-body balanced workout combining cardio, strength, and mindfulness. We offer 30-, 45-, and 60-minute classes on our schedule seven days a week.<span class=\"Apple-converted-space\">  </span>Our studio also includes a Play Lounge during the weekday mornings for kids from six weeks to 12 years.<span class=\"Apple-converted-space\">  </span>New clients can take advantage of discounted packages: three for $30, two weeks unlimited for $49, and one month unlimited for $99.<span class=\"Apple-converted-space\">  </span>You can choose between class packages or becoming a barre3 member.<span class=\"Apple-converted-space\">  </span>Our membership includes perks like free childcare, discounts on retail, and special VIP or exclusive member events.<span class=\"Apple-converted-space\">  </span>You can choose what best suits your schedule and needs!</span></p>\n<p class=\"p6\"><strong>Q: What is Your Favorite Thing About What You Do?</strong></p>\n<p class=\"p5\"><span class=\"s1\"><strong>A:</strong> One of the greatest benefits of becoming a barre3 owner is having the opportunity to instruct. When I teach, it’s the one hour of my day when I can truly let go of the outside world and focus on joyful movement with my clients. Once that music turns on, it’s fun, rewarding, and helps me shift my mindset to all things positive. That translates into the rest of my day. I’m a better mom, wife, and manager.</span></p>\n<p class=\"p6\"><strong>Q: What’s the Best Thing About Operating Your Business in Bucks County?</strong></p>\n<p class=\"p5\"><span class=\"s1\"><strong>A:</strong> Although I’m not originally from here, I’ve felt like the community has welcomed me with open arms. I consider Bucks County my home now.<span class=\"Apple-converted-space\">  </span>We have such a strong community of business owners who support, partner, and help each other all the time. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong>Q: Where Can People Go to Find Out More?</strong></p>\n<p class=\"p5\"><span class=\"s1\"><strong>A:</strong> You can visit our barre3 Doylestown Website, follow us on our Facebook Page or Instagram Page, and lastly, visit our website, <a href=\"http://linktr.ee/barre3doylestown\" target=\"_blank\" rel=\"noopener noreferrer\">linktr.ee/barre3doylestown</a>.<span class=\"Apple-converted-space\">  </span>We now have a ‘barre3 Studio App’ you can download, so there are plenty of ways we can connect.</span></p>\n<p class=\"p7\"><em>photos by: Jaclyn Du Chateau Photography</em></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/01/1280-1.jpg"
}