{
  "id": 14771,
  "title": "Doylestown Art Fest Enters its 31st Year",
  "slug": "doylestown-art-fest-enters-its-31st-year",
  "date": "2022-09-12T22:32:32",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Fit",
    "Live",
    "Play",
    "Taste"
  ],
  "tags": [
    "Doylestown Arts Festival",
    "Natalya Bucuy",
    "paul biger"
  ],
  "excerpt": "<p>By Natalya Bucuy • The Cardinal Contributing Writer Making art takes more than materials and talent. It takes one’s heart and soul to create a piece or an experience that moves audiences.  For Paul Boger, the Director of Doylestown Art Festival, the event itself creates such an experience. Last year, at the conclusion of the [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Natalya Bucuy • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">M</span><span class=\"s1\">aking art takes more than materials and talent. It takes one’s heart and soul to create a piece or an experience that moves audiences.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">For Paul Boger, the Director of Doylestown Art Festival, the event itself creates such an experience. Last year, at the conclusion of the festivities, a long-time participating artist came to Boger with a hug and a piece of great news &#8211; the festival saved him and his family from having to sell their home. Following the financial drought of the pandemic many independent artists struggled. The show, which celebrated its 30th anniversary in 2021, helped some of them make record sales and sustain their way of life.“Independent artists survive because of shows like this one,” Boger says. “To be able to have an impact like that, one that allows them to do what they love, it doesn’t get better than that.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">This year on Sept. 10-11, the Festival returns for yet another annual celebration of everything unique and creative. From 10 am to 5 pm the central streets and parking lots of Doylestown Borough will host artists of all types and mediums &#8211; painters, photographers, graphic artists, knitters, woodworkers, and even a gentleman who dismantles old pianos and makes them into art pieces.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s5\">The Festival has three distinct goals.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">First, it puts a spotlight on the diverse art scene in Bucks County and the surrounding region. The jury that selects each year’s participants ensures all art is of high quality, handmade, original, and is created by independent artists. The jurors focus on bringing a variety of art mediums and materials to ensure the best assortment of artistic creations. The show features 155 artists and hosts and five stages with 32 live music acts. Live art, which involves the artists creating within their booth space, interactive activities for both kids and adults, face painting, and balloon artists only add to the atmosphere of true artistic spirit.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">“The artists get a huge boost for what they do,” Boger says. “The response we get from the community is a real testament of the show’s success based on how many people come out each year.”</span></p>\n<p class=\"p5\"><span class=\"s1\">And so many do. Boger, who has been helping run the Festival for seven years, estimates between 15,000-25,000 attendees annually. This helps the organizers achieve another goal, which is to draw people into Doylestown. “Driving tourism and visitors to support our local businesses is our major objective,” Boger says. “The town really benefits from the Festival’s attendance.”</span></p>\n<p class=\"p5\"><span class=\"s1\">For the first time in recent years, the Art Festival is expanding. This year, artist’s stations will spread further down Oakland Ave to include the street block between Hamilton and Clinton Streets. Boger names the open-air public street setting of the Festival as a major factor in accomplishing yet another goal &#8211; accessibility. “The event is open to anyone,” he says. “That raises the bar of accessibility to the arts. There is no gallery to visit, no fees, it’s free for everyone in our community to experience and enjoy.”</span></p>\n<p class=\"p5\"><span class=\"s1\">For more information, including Festival map, parking information, artist and musician line up, and sponsorship and volunteer opportunities, visit </span><a href=\"https://dtownartsfestival.com\" target=\"_blank\" rel=\"noopener noreferrer\"><span class=\"s6\">https://dtownartsfestival.com</span></a><span class=\"s1\">.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/09/DAF-34.jpg"
}