{
  "id": 17337,
  "title": "Doylestown Celebrates Ramadan and Eid al-Fitr",
  "slug": "doylestown-celebrates-ramadan-and-eid-al-fitr",
  "date": "2023-04-12T14:46:04",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live",
    "Style",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Eid al-Fitr",
    "Ramadan",
    "Sheela Rai"
  ],
  "excerpt": "<p>By Sheela Rai  • The Cardinal Contributing Writer Ramadan, one of the five pillars of Islam, is a holy month of fasting. It is celebrated on the ninth month of the Muslim Calendar. This year it falls on the dates of March 22 – April 21. Ramadan originated in the seventh century, when Prophet Muhammad [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Sheela Rai</strong><span class=\"Apple-converted-space\">  • </span>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">R</span><span class=\"s1\">amadan, one of the five pillars of Islam, is a holy month of fasting. It is celebrated on the ninth month of the Muslim Calendar. This year it falls on the dates of March 22 – April 21. Ramadan originated in the seventh century, when Prophet Muhammad received the first verses of the holy book, the Qur’an, during this month, making it sacred.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Refraining from food and drink during the daylight hours serves as an act of deep personal worship. The month culminates with Eid al-Fitr, a celebration filled with prayer, giving, community, joy, and feasting.</span></p>\n<p class=\"p5\"><span class=\"s1\">Members of the Muslim community in Doylestown come from all parts of the world and thus celebrate in their own unique ways. I had the opportunity to speak to two local community members. They shared how their families celebrate, as well as their own personal reflections on what this holiday means to them.</span></p>\n<p class=\"p5\"><span class=\"s1\">Durriya Shamsi, a Behavior Analyst, grew up in Pakistan. Shamsi celebrates with her husband and two sons, ages 20 and 24. For her, Ramadan is a time of spiritual reflection and rejuvenation. Members of her family work to foster good habits and gratitude for what they have. They strive to help those around them and support the disenfranchised. Shamsi’s family begins Ramadan with Sehri, the meal eaten before the fast, at dawn. For them, it is often roti (bread) with ground beef. After the day of fasting, they break the fast with a Kajor (date), sweet lassi (yogurt drink), and potato pakora (battered fried potatoes). The day ends with the recital of Namaz – post-fasting prayers.</span></p>\n<p class=\"p5\"><span class=\"s1\">Iman Azeez, a Junior at Council Rock South High School, identifies as an Indian-American and Muslim. She says Ramadan shows her how much she has, including food and access to water. This time of year brings her family closer together and closer to God. Every evening they cook a big meal to end their fasting. She is always grateful for that big meal.</span></p>\n<p class=\"p5\"><span class=\"s1\">Eid al-Fitr is a joyful day for both Shamsi and Azeez. They both begin the day by going to their Mosque in Willow Grove. Shamsi gives her son Eidee a gift of money. Azeez and her brother get a present of their choice, as well as something they both like, such as a trip to Starbucks. To her, it is a celebration of gratitude for how much they have. Shamsi and her family usually celebrate with friends from the community, feasting together with Biryani, Korma, or other decadent foods.</span></p>\n<p class=\"p5\"><span class=\"s1\">Both Shamsi and Azeez came to Doylestown from cosmopolitan areas, from London and California respectively. They often miss the larger Muslim communities from which they came. Azeez worked with her school board to get Eid al-Fitr on the Council Rock school calendar. She finds educating others about the holiday very rewarding and empowering.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Shamsi and Azeez are thrilled that Doylestown will be holding its Second Annual Eid Celebration this year. Desis of Doylestown, a local not-for-profit organization, will host the event on<span class=\"Apple-converted-space\">  </span>April 30, location to be determined. Both attended the celebration last year. Azeez reflects that having people see the beauty in her culture felt amazing. “It made Doylestown feel more like home. Like we matter, and our voice matters,” she says. To those who celebrate Ramadan, Ramadan Mubarak &#8211; I wish you all the blessings of the holy month. May it bring joy, health, and wealth.</span></p>\n<p class=\"p5\"><span class=\"s1\">For updated information go to<span class=\"Apple-converted-space\">  </span><a href=\"https://desisofdoylestown.org/eid-ul-fitr-celebration\" target=\"_blank\" rel=\"noopener noreferrer\">https://desisofdoylestown.org/eid-ul-fitr-celebration</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/Ramadan-e1681325156596.jpg"
}