{
  "id": 12380,
  "title": "Easy Update for Your Living Room!",
  "slug": "easy-update-for-your-living-room",
  "date": "2022-03-01T22:06:34",
  "author": "Staff",
  "category": [
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "victoria guillot"
  ],
  "excerpt": "<p>By Victoria Guillot • The Cardinal Contributing Writer If you read my column last month, you know I’m a big believer in upcycling what you already have when possible. You can get a completely new look for your room without starting from scratch simply by changing a few key pieces. This philosophy reduces waste and [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Victoria Guillot • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">I</span><span class=\"s3\">f you read my column last month, you know I’m a big believer in upcycling what you already have when possible. <i>You can get a completely new look for your room without starting from scratch simply by changing a few key pieces. </i>This philosophy reduces waste and its burden on our environment. It also is kind to your wallet. Win, win!</span></p>\n<p class=\"p5\"><span class=\"s4\">Today let’s focus on one key piece—the ever-versatile pillow.</span></p>\n<p class=\"p6\"><strong><span class=\"s3\">Pretty pillows, how do I love thee? Let me count the ways…</span></strong></p>\n<p class=\"p5\"><span class=\"s4\">It never ceases to amaze me how much a pillow can change the entire feel of a room. Sometimes, all it takes is updated pillows to feel fresh if your room feels dated. If you like to decorate seasonally, you can swap winter pillows for lighter summer pillows. If you’ve become tired of your design, pillows represent an inexpensive and quick option to redecorate. There are pillows to fit every budget and style. And last but certainly not least, pillows are a means to inject your taste and personality into a room.</span></p>\n<p class=\"p5\"><span class=\"s4\">Do you ever marvel at the fact that we all wear blue jeans, yet somehow we don’t look like we’re all wearing the same thing? Sofas can be like blue jeans if they are a typical, popular design found in many homes. Pillows accomplish the same thing as different tops do for jeans. They add color, texture, shape, or pattern. They can read casual or dressy and determine the whole look.</span></p>\n<p class=\"p5\"><span class=\"s4\">As a stager/interior designer, I see a lot of living rooms that look very much alike, usually due to a lack of accessories.</span></p>\n<p class=\"p6\"><strong><span class=\"s3\">When we combine these same sofas with different area rugs, art, and pillows, we create a highly unique design expression.<span class=\"Apple-converted-space\"> </span></span></strong></p>\n<p class=\"p5\"><span class=\"s4\">Allow me to illustrate by changing just the pillows. Take the typical sofa shown here.</span></p>\n<p class=\"p7\"><span class=\"s3\">Many people leave the sofa bare, but that’s unlikely to happen if I’m around. Let’s shake it up a bit and add a layer of decor. Are you into contemporary design? Are you the traditional type? Do you like neutrals? Is color your thing? Do you prefer rustic or formal? <i>There’s a pillow for every taste and style.</i> All the examples that follow are using the same sofa. Already the room feels more exciting and unique. We haven’t even added the art or accent furniture, paint, or other accessories yet, which would take this room up several notches.</span></p>\n<p class=\"p5\"><span class=\"s4\">If you would like to see one of these rooms completed with accent tables, art and accessories, contact me through my website and let me know. I’ll do a shoppable design board. Send me a note if there is any other future content you would like to see in this column.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong><span class=\"s3\">You can shop the looks.</span></strong></p>\n<p class=\"p5\"><span class=\"s4\">This month I’ve curated a collection including the sofa, rug, and pillows shown plus lots more, granting you special designer trade access. Get the best internet pricing by using the shopping links at https://stagecoachservices.com/home-shop. (If you purchase through this link, I will receive a commission at no additional cost to you.)</span></p>\n<p class=\"p4\"><span class=\"s3\"><i>Victoria Guillot is a home stager/interior designer of 15 years based in Buckingham/Doylestown. A 6-time Best of Houzz winner, she has been featured on a 26-episode radio series and is the author of a book of tips on home staging. If you want more trade access or would enjoy her decorating or staging assistance, you can find her at <a href=\"http://stagecoachservices.com\" target=\"_blank\" rel=\"noopener noreferrer\">stagecoachservices.com</a>.</i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/03/sofa.jpg"
}