{
  "id": 16219,
  "title": "Entertainer Righteous Jolly:  From Grinch Adventures to New Music Album",
  "slug": "entertainer-righteous-jolly-from-grinch-adventures-to-new-music-album",
  "date": "2023-01-09T23:27:30",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "righteous jolly"
  ],
  "excerpt": "<p>So, the question on everyone’s mind: is your name really Righteous Jolly? Yes, it’s a common question I’ve gotten for the better part of my whole life! In fact, it’s the first question my now-wife asked me the very first time we met, and I probably answered it the same &#8211; “yes, and I have [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>So, the question on everyone’s mind: is your name really Righteous Jolly?</b></p>\n<p class=\"p2\"><span class=\"s1\">Yes, it’s a common question I’ve gotten for the better part of my whole life! In fact, it’s the first question my now-wife asked me the very first time we met, and I probably answered it the same &#8211; “yes, and I have all the emotional scars to prove it!” She Married me anyway, and we have two rad little dudes named Noble Leif and Rhonin Zeal. So, believe it or not, Righteous Jolly is on my birth certificate. I worked at Macaroni Grill for almost a decade and had to write my name on every single table I served, so I talked about it a lot.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">I am a “boy named Sue” to some degree. This subject and much more will be addressed on my first solo album, which should be out late spring this year, and it’s titled “What’s in a name.”</span></p>\n<p class=\"p1\"><b>You are an actor, a singer, a musician, a trivia host, the Grinch, and even drunk Santa, how do you prepare yourself for so many different roles?<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p2\"><span class=\"s1\">I am a bit of a dilettante. But I come by it, honestly. I am an entertainer when it gets down to it. So everything falls beneath that umbrella. (Grinch Gigs Included.)<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">Acting is and always will be first to me &#8211; I find the most comfort in it, and the reward of self-worth is always greater. I trained in New York City at Circle In The Square Conservatory, and that was transforming and life-altering. I carry that experience everywhere I go and in everything I do. What that place gave me, taught me, and instilled in me is profound.</span></p>\n<p class=\"p3\"><span class=\"s2\">I have been singing for as long as I’ve been acting and started playing guitar and writing songs for quite a while now too. It seems like it all came together during the pandemic for me. The lockdown afforded me the time to dig deep and get over some roadblocks.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>People love to see your live performances and plays. Do you have any upcoming gigs or plays to promote?<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p2\"><span class=\"s1\">Although I don’t prefer it to be on my headstone, I do host Trivia Mon., Tues., Wed. in Bucks County, with various gigs intermittent, both corporate and private. I am grateful for those gigs for many reasons; it does afford me much time on the mic, riffing, and improvising, which has been invaluable by way of confidence and computability. It’s two-part trivia, one part neurotic, self-centered comedy. I am the seventh Best Trivia Host in Bucks County, according to Best of Bucks 2003, and they can’t take that away from me!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">I just wrapped up a busy year of full production of God of Cornage with Pegasus Theatre Co. in Bordentown, NJ. I also just wrote, directed, produced, and starred in my own version of A Christmas Carol &#8211; A Levittown Christmas Carol, which was a live musical revue with a full band and a cast of nine actors at Broken Goblet that is set to come back next year.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s3\">On the docket this year is finishing up my album mentioned above. As well as a couple of EPs that I’m sitting on. I’ll pivot to St. Patricks Day in the new year as The Jolly Tinkers, my Irish Band with Greg McGarvey, as we have some shows lined up in March. I also have several weddings will be officiating.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>The Grinch this last holiday season was, to me, some of the best improv work I’ve seen you do. Both kids and adults love it. How was that experience?</b></p>\n<p class=\"p2\"><span class=\"s1\">This has been such a fun and wild holiday season because of The Grinch. Yes, thanks to Doylestown’s own Julie Druzak of “Once Upon a Dream Princess Parties,” I have been Grinching it up.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">What we do, which is a little different than most, is makeup. Shout out to Jayna Jolly. It gets intense when your wife is doing your Grinch makeup, and you keep trying to micro-manage. The makeup affords the freedom to interact, sing, and play. It may not sound like much, but you’d have to experience it to get the full effect. It would be a wildly different experience with a mask that wouldn’t allow me to talk and riff and be silly with the kids.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">The Doylestown Tree Lighting was a highlight. It is pretty freeing to just be a relatively miserable Curmudgeon. If I sense that the kids are too scared, I change the tactic and roll with it. It’s been a great experience through and through.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/01/Righteous-Jolly.jpg"
}