{
  "id": 15451,
  "title": "Evolution Candy: A One-Stop Shop for Candy, Props, and Nostalgia This Halloween",
  "slug": "evolution-candy-a-one-stop-shop-for-candy-props-and-nostalgia-this-halloween",
  "date": "2022-10-25T23:53:22",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "evolution candy"
  ],
  "excerpt": "<p>Taking a trip down memory lane to childhood Halloween nights can bring back such nostalgia. That fantasy of turning into your favorite character, that bit of freedom with friends, or maybe it’s just the extra sugar your parents allowed you to consume? Whatever that spark of joy was for you, as adults, we aim to [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">T</span><span class=\"s2\">aking a trip down memory lane to childhood Halloween nights can bring back such nostalgia. That fantasy of turning into your favorite character, that bit of freedom with friends, or maybe it’s just the extra sugar your parents allowed you to consume? Whatever that spark of joy was for you, as adults, we aim to create these same long-lasting memories for the special kids in our lives.</span></p>\n<p class=\"p3\"><span class=\"s3\">Whether it’s something extra for those special trick-or-treaters or the desire to be the coolest house on the block on Halloween night, Evolution Candy has it covered.</span></p>\n<p class=\"p4\"><span class=\"s2\">The store’s floor-to-ceiling stocked shelves have everyone’s favorite candies. Crybabies, Razzles, and Fun Dip are just a few of the nostalgic candy options found at this quaint, old-school candy shop. It also offers other favorites such as custom goodie bags, Halloween- themed gift baskets, and even the big candy bars (in case you want to be that house).</span></p>\n<p class=\"p4\"><span class=\"s4\">For friends and family, a gift card from Evolution Candy is always a good option &#8211; let them make a memorable trip and pick out their own favorites. Last-minute props, candy sticks, and wax lips are always a hit. Whatever the Halloween plans are, Evolution Candy is an excellent stop on the memory lane for the special people in your life.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/10/image_6487327.jpg"
}