{
  "id": 17467,
  "title": "Fanny Chapman Makes Summers More Fun",
  "slug": "fanny-chapman-makes-summers-more-fun",
  "date": "2023-04-16T15:12:09",
  "author": "Staff",
  "category": [
    "Fit",
    "Live",
    "Play"
  ],
  "tags": [
    "doylestown cardinal",
    "Fanny Chapman (FC) Pool",
    "lauren heine"
  ],
  "excerpt": "<p>By Lauren Heine • The Cardinal Contributing Writer Fins down, Doylestown is an exceptional place to reside and raise a family in any season. But there’s something magical about summer thanks to the Fanny Chapman (FC) Pool. The quintessential destination on a hot summer day has a special place in the heart of the community [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Lauren Hei</strong>ne • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">Fins down, Doylestown is an exceptional place to reside and raise a family in any season. But there’s something magical about summer thanks to the Fanny Chapman (FC) Pool. The quintessential destination on a hot summer day has a special place in the heart of the community that spans generations.</span></p>\n<p class=\"p4\"><span class=\"s3\">Legacy runs deep at FC Pool. Drew Sterner spent his summers there in the ’70s and ’80s. He recalls conquering the high dive and not letting anything keep him from his time at the pool. When he started a family of his own, he raised his kids at the same pool. This year marks Sterner’s inaugural year as Pool Manager with plans to maintain continuity established by James Foster who held the position for 17 years. “It’s a great place to spend the summer and be part of a great community tradition,” Sterner says. His wife Kim is the registrar and contributes years of experience as a member of the Parents of Fanny Chapman Swim and Dive Team Board.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Their young adult children Spencer and Courtney were once students of the swim program. Later, they became instructors and now return for their 3rd year as Directors of the Swim Lesson Program.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">The community feel and the exceptional staff keeps members coming back. Families come to unwind, connect, and make memories. Members reminisce about mommy and me swim class, passing the deep-water test, the high dive, Fanny Fest, Float Night, Fido Float, and the ice cream truck.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Sarah Peters praises the FC staff. “It’s great to have so many older kids in our community serving as role models through swim instruction, lifeguarding, and management,” she says.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">Laura Hoover values the affordability of FC for her family explaining, “Each year I price out the cost of camp for three kids, and it’s a no-brainer to come back to Fanny.” She also appreciates that going to FC is often a fun, unplanned, low-key playdate for her boys &#8211; when supplemented with snacks, a basketball, and a full tumbler of coffee.</span></p>\n<p class=\"p4\"><span class=\"s3\">In addition to FC Pool’s popular swim lesson program, its competitive swim and dive team is a sought-after experience. An essential component of this accolade is Sherry Petrakis, President of the Parents of Fanny Chapman Swim and Dive Team Board. Petrakis and her team coordinate activities, meet for the 320 team athletes, make improvements from feedback, and represent FC Pool within the BuxMont league. She credits that “the families are so incredibly supportive and have a strong desire to grow the program.” Adi Strigl’s daughters are passionate about being a part of the team. “They love their committed coaches, the team’s spirit, the adrenaline-induced meets. What we love most,” Strigl continues, “is how the entire family feels a part of the team, hanging out with the other families, volunteering at each meet, and the friendliness of the staff.”</span></p>\n<p class=\"p4\"><span class=\"s2\">As the community anticipates the opening of the FC Pool’s 96th season Memorial Day weekend, the Fanny Chapman Pool Board Members are committed to continuing the summer gold standard for generations of Doylestown families to come. They’ve created the Legacy Program that seeks memorials, bequests, and donations from the generous community.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">“The pool today is financially independent and operates without any tax dollars,” explains Rob Purdy, Fanny Chapman Pool Board Member. “It is a community investment and after 100 years of use it’s necessary to create a fund whose primary purpose is to meet the near and long-term needs of the pool facilities.” Drew Sterner adds, “Endowing [FC]’s future assures that we are able to simultaneously maintain affordable memberships and the many programs and traditions that have contributed to its legacy.” Consider giving back to the fundamental summer staple that makes Doylestown, Doylestown. Visit the Fanny Chapman Pool website at <a href=\"https://www.fannychapman.com\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.fannychapman.com</a> or contact pool manager, Drew Sterner at <a class=\"site-email\" href=\"mailto:poolmanager@doylestownborough.net\">poolmanager@doylestownborough.net</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/StriglPoolHairDontCare.jpg"
}