{
  "id": 12013,
  "title": "Forkfully Yours: FP = Food Personality: Are You What You Eat?",
  "slug": "forkfully-yours-fp-food-personality-are-you-what-you-eat",
  "date": "2022-01-11T17:42:59",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Forkfully Yours",
    "Kimberly Cambra"
  ],
  "excerpt": "<p>By Kimberly Cambra • The Cardinal Contributing Writer With the holidays behind us and short-lived work out more and eat healthier resolutions in place – there’s no time like the here and now of the post-season of celebrations to assess your food personality. Yes, if you can have emotional intelligence, a social barometer and a sixth [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By<span class=\"Apple-converted-space\"> </span>Kimberly Cambra</strong> • The Cardinal Contributing Writer</p>\n<p class=\"p1\"><span class=\"s1\">With the holidays behind us and short-lived work out more and eat healthier resolutions in place – there’s no time like the here and now of the post-season of celebrations to assess your food personality. Yes, if you can have emotional intelligence, a social barometer and a sixth sense – you can most definitely have a food personality.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><span class=\"s1\">Realistically, you are not born with this type of personality; it takes years to develop, influenced by many factors over the course of our lifetime. Although, at a young age we do begin to establish our eating habits which eventually contribute to our food personality.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><span class=\"s2\">The spectrum of personality traits could exceed the selections on a Chinese take-out menu when you consider picky eaters, people who eat quickly, people who don’t like their food to touch, almighty meat and potato eaters and on and on. One thing is for certain, our food personality, like our own actual personalities, are constantly evolving and can often reinvent themselves with exposure to new things or just wanting to be different.</span></p>\n<p class=\"p1\"><span class=\"s1\">Food like clothing now dictates trend on so many levels in society. It’s no surprise that the shirt and tie guy is the meat and potato man most cases and votes a certain way. However, an individual who expresses herself with a wildly colored silky off the shoulder blouse might desire a salad of organic hand-harvested greens with edible flowers and artisan goat cheese. In many ways, today’s expansive variety of “foodstuff” which a person can identify who they are with is equal to the vast array of fashion styles people have to express and adorn themselves. Food is fashion and fashion is food.</span></p>\n<p class=\"p1\"><span class=\"s1\">Over the past two decades – our gourmand love affair has been greatly enhanced since the inception of the Food Network to TV Chefs replacing the 80’s rock stars and the flocks of chef groupies that have ensued. Up until the late 70’s food for most was the proverbial continental menu of prime rib, french onion soup and the classic surf &amp; turf.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><span class=\"s2\">In the 80’s, glimmers of more imaginative food preparation, ingredients and European influences started emerging on the left coast with the induction of haute cuisine, thanks to founding forefathers and mothers such as Wolfgang Puck and Alice Waters in California.</span></p>\n<p class=\"p1\"><span class=\"s1\">This was the beginning of an epicurean paradigm for food preparation as we knew it and never to be the same again for the American diner.</span></p>\n<p class=\"p3\"><strong><span class=\"s3\">What influences your food personality?</span></strong></p>\n<p class=\"p1\"><span class=\"s1\">There aren’t really categorically food personality types per se. It’s a celebration of preferences that your palate and eye ultimately determine. It’s very much like with most things you invite into your life which personifies who you are. In the process, you might discover that your own FP is either more adventurous, very picky with a very limited repertoire of likings OR you just don’t care about food one way or the other (hopefully a very tiny population) and have NO food personality. Say it isn’t so.</span></p>\n<p class=\"p1\"><span class=\"s1\">Whether subtle or pronounced, mostly everyone has some kind of food personality. In today’s gastronomic climate there’s a growing population of people who embody the food culture as a lifestyle and their lives evolve around food, cooking and food culture taking vacations dedicated to furthering their knowledge and know-how about different cuisines. In these instances, it would be safe to consider this food personality type the extreme personality type and on the opposite end is the “please pull around to the window” which might suggest no real personal stake in the quality of food or where it come from as a factor.</span></p>\n<p class=\"p3\"><strong><span class=\"s3\">Who are you? What’s your food personality?</span></strong></p>\n<p class=\"p4\"><strong><span class=\"s3\">Sophisticate</span></strong></p>\n<p class=\"p1\"><span class=\"s1\">It’s about THE FOOD; its origin and quality of ingredients as well as preparation and presentation for this person. Presentation is everything for this personality, when the purse matches the shoes, the food matches the environment and for that matter so does the wine along with the quality of stemware. Snobby? You bet. But most capable of almost always knowing what you like at all times.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">Comfort Creator</span></strong></p>\n<p class=\"p1\"><span class=\"s4\">For this type, you eat what you know, familiar with and grew up on. Trying different foods may occur from time to time if you do stray from what you like and it’s within your comfort zone. Foods like frog legs, alligator and rattle snake, the “tastes like chicken” stuff might be an adventure for this creator but willing to take it on because it – tastes like chicken.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><strong><span class=\"s3\">Picky Picky Picky</span></strong></p>\n<p class=\"p1\"><span class=\"s1\">You are the sauce on the side, substitutions are your specialty and sends back your food as a full-time occupation. Most of the time its completely unintentional, picky people are just plain picky. Your distinctive tendency is on occasion an attempt to stand out to get attention versus going with the flow of a menu. Truth be told you should stay home, cook what you like and know what you’re getting.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">Bottom Feeder</span></strong></p>\n<p class=\"p1\"><span class=\"s1\">Save the last for last because this personality just enjoys crap. The anti-sophisticate who thrives on fast foods, food served in cardboard or Styrofoam containers. Pizza, hoagies, hot pockets, Lean cuisines, etc. Only to be paired with a 2-liter of some diet soda. Please pull around to the window translates to “your meal is now served” and the epicenter of your epicurean existence is your microwave.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><span class=\"s1\">The good news is you can change this food personality at anytime – IF you really really want to.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/01/Forkfully-Yours.jpg"
}