{
  "id": 11790,
  "title": "Forkfully Yours: Around the World with Gingerbread from Our House to Yours… Zingiber, Gingebras or Lebkuchen",
  "slug": "forkfully-yours-around-the-world-with-gingerbread-from-our-house-to-yours-zingiber-gingebras-or-lebkuchen",
  "date": "2021-12-10T11:15:52",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Kimberly Cambra"
  ],
  "excerpt": "<p>“We are pleased to introduce Forkfully Yours which promises to serve up delicious tidbits on food folklore and culinary culture for our readers. Kimberly Cambra an experienced and published food writer resides in Buckingham where she’s most content in her kitchen cooking or arranging flowers to celebrate the seasons.” By Kimberly Cambra • The Cardinal [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><i>“We are pleased to introduce Forkfully Yours which promises to serve up delicious tidbits on food folklore and culinary culture for our readers. Kimberly Cambra an experienced and published food writer resides in Buckingham where she’s most content in her kitchen cooking or arranging flowers to celebrate the seasons.”</i></p>\n<p><em><strong>By Kimberly Cambra • </strong>The Cardinal Contributing Writer</em></p>\n<p class=\"p3\"><span class=\"s2\">I</span><span class=\"s1\">nterestingly enough, gingerbread, the classic holiday treat has been around long before any one specific holiday and predates Christmas by about 2000 years. This iconic baked good which congers up instant images of brown houses with candy cane roofs piped with white icing trim also has a spicy legend beyond its candy coated door.</span></p>\n<p class=\"p5\"><span class=\"s1\">Gingerbread’s dense history goes as far back to ancient Greece where the wealthy would travel in pursuit of “spiced honey cakes” from the Isle of Rhodes. During this time both Egyptians and Greeks used a type of gingerbread for ceremonial purposes and transformed into a treat to show their love for someone much like today with candy and chocolate given as a tokens of affection for Valentine’s Day. Shakespeare, himself was sweet for gingerbread and was quoted saying, “And I had but one penny in the world thou should’st have it to buy gingerbread”.</span></p>\n<p class=\"p5\"><span class=\"s1\">In the year 992, gingerbread makes its first appearance on the culinary landscape of Europe, thanks mostly to Gregory of Nicopolis, an Armenian monk who spent many years in France teaching the art of making gingerbread, and the recipe didn’t include ginger. By the 11th century, the actual ingredient itself – ginger – hits Europe by way of Malaysia. Notably utilizing this spicy root were Catholic monks.<span class=\"Apple-converted-space\">  </span>They added it to their own cookie recipe and placed the dough into beautiful molds which depicted saints, churches and other religious images.</span></p>\n<p class=\"p5\"><span class=\"s1\">By 16th century, gingerbread transitioned into an assortment of different styles of baked goods and included soft, crisp and a warm cake with a glaze, a favorite of colonial settlers. At or about the same time, the foundation was being built in Germany with the emergence of the gingerbread house in a very elaborate fashion and embellished with foil and gold leaf to be forever associated with their Christmas tradition. The popularity grew with the tale from the Brothers Grimm of Hansel and Gretel, where in this legendary tale, they discover a house made of treats in the forest. In the following century, Queen Elizabeth I gave her distinguished visitors a gingerbread mold that resembles themselves as a special gift.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Across the pond in the early 18th century, early Colonial America brought this beloved recipe to the states with most of the ingredients readily available to the early settlers. The very first First Lady had a recipe for gingerbread that George Washington loved – and there’s not one cherry in it either. Martha Washington, known for her domestication of her home and especially her ability to bake, had an exceptional gingerbread recipe that is still used to this very day. Much like this original recipe for gingerbread “cake” coming from England to the States, the same held true for gingerbread houses which arrived in Pennsylvania with the German settlers more affectionately known as Pennsylvania Dutch.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">How has this tradition stood the test of time? A recipe and concoction from thousands of years ago? – because a savvy marketer of a large department store in the 1950’s decided to create Christmas scenes out of gingerbread and the retailers discovered the smell of gingerbread lured customers into the store and attracted more and more customers for the holiday shopping season. Stimulating the senses to attract shoppers = make cents for everybody.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Wishing everybody the best of times for the holidays from the FORK-1-1.</span></p>\n<p class=\"p1\"><span style=\"color: #ff0000;\"><b>MARTHA WASHINGTON’S GINGERBREAD</b></span></p>\n<p class=\"p1\"><b>INGREDIENTS:</b></p>\n<p class=\"p1\">1 c. butter, softened</p>\n<p class=\"p1\">1 c. light brown sugar</p>\n<p class=\"p1\">1 c. molasses</p>\n<p class=\"p1\">1/2 c. warm milk</p>\n<p class=\"p1\">2 tbsp. powdered ginger</p>\n<p class=\"p1\">1 tsp. cinnamon</p>\n<p class=\"p1\">2 tbsp. orange rind, grated</p>\n<p class=\"p1\">1 tsp. baking soda</p>\n<p class=\"p1\">1/4 c. warm water</p>\n<p class=\"p1\">1/2 tsp. nutmeg</p>\n<p class=\"p1\">1/8 tsp. mace</p>\n<p class=\"p1\">1/4 c. brandy</p>\n<p class=\"p1\">3 lg. eggs, well beaten</p>\n<p class=\"p1\">3 c. plus 1 tbsp. flour</p>\n<p class=\"p1\">1 c. raisin</p>\n<p class=\"p1\">1 c. sour cream</p>\n<p class=\"p1\"><b>DIRECTIONS:</b></p>\n<p class=\"p1\">Cream butter and sugar until fluffy. Add molasses, milk and spices; beat well. Add the brandy. Alternate adding the flour and beaten eggs on low speed of your electric mixer. Add the juice and rind. Add the baking soda dissolved in warm water; beat well. Flour the raisins with the 1 tablespoon flour held back and fold into the batter. Stir in the sour cream. Bake at 350 degrees for 35 &#8211; 45 minutes in a 13 x 9 inch pan. Serve with lemon sauce or whipped cream.</p>\n<p class=\"p1\"><b>LEMON SAUCE:</b></p>\n<p class=\"p1\">3 tbsp. cornstarch</p>\n<p class=\"p1\">1 c. granulated sugar</p>\n<p class=\"p1\">2 c. boiling water</p>\n<p class=\"p1\">Juice and grated rind of 1 lemon</p>\n<p class=\"p1\">1 tsp. butter</p>\n<p class=\"p1\">Combine the cornstarch and sugar; add boiling water. Cook over medium heat 8 minutes, stirring constantly. Add the lemon juice, rind and butter. Cook briefly. Serve over warm gingerbread. If it seems too thick, add a little more water.</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/12/Gingerbread.jpg"
}