{
  "id": 17758,
  "title": "Fourth Annual Doylestown Pridefest Hits the Streets in June",
  "slug": "fourth-annual-doylestown-pridefest-hits-the-streets-in-june",
  "date": "2023-06-16T16:59:51",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live",
    "Play",
    "Style",
    "Taste"
  ],
  "tags": [
    "dana roberts",
    "doylestown cardinal mercer museum",
    "Doylestown Pride Festival",
    "Genevieve’s Kitchen",
    "kris boger",
    "pridefest"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer Come out and celebrate the rainbow of humanity this June by joining any or all of the events of the Doylestown Pride Festival. This year marks the fourth anniversary of the Festival, which kicks off on June 1 with the raising of the Pride flag at the [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Dana Roberts</strong></em> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">C</span><span class=\"s1\">ome out and celebrate the rainbow of humanity this June by joining any or all of the events of the Doylestown Pride Festival. This year marks the fourth anniversary of the Festival, which kicks off on June 1 with the raising of the Pride flag at the Bucks County Administration Building and at Doylestown Borough Hall. The ceremony and short walk begin at 6 pm.</span></p>\n<p class=\"p5\"><span class=\"s1\">Pride Month, which honors Lesbian, Gay, Bisexual, Transgender, and Queer people, is marked each June in honor of the 1969 Stonewall Uprising in Manhattan, which was a tipping point for the Gay Liberation Movement in the U.S. Each June, Pride parades, picnics, parties, concerts, and memorials occur, all in recognition of the impact that LGBTQ individuals have on our communities and in our greater world. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Doylestown’s Pride Festival was started by a group of nonprofit organizations (including the Michener Art Museum, The Rainbow Room, Salem United Church of Christ, Borough Council, and the Doylestown Borough Human Relations Commission) in 2019. It celebrates the many diverse sexual orientations and gender identities in Doylestown and the surrounding communities.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Kris Boger, President of Discover Doylestown, said that the formal conversation started when a Borough Council Member asked about the logistics of creating a rainbow crosswalk near where the Rainbow Room meets at Salem Church after a hate group had visited CB West.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">“The public’s support of the students and the hate they were experiencing really acted as a catalyst for the creation of our group,” Boger said. “We hosted our first Doylestown Pride Festival in June 2019, on the 50th anniversary of the Stonewall Riots. We featured three films at the County Theater, a Block Party on E State Street, and some smaller pop-up events scattered throughout the downtown. Our committee wondered as we worked to set up the first Block Party if we’d have 50 or 100 people show up. We ended up with nearly 3,000 attendees throughout the day. We were absolutely, positively floored by the number of people.”</span></p>\n<p class=\"p5\"><span class=\"s1\">Though the pandemic presented challenges in hosting large events, Pride Festival continued and has grown since. “Coming out of the pandemic we found new ways to grow the event with the addition of our Pride Music Day, in partnership with Picnics on Pine, which featured an all LGBTQ+ lineup of original music and Drag Brunch at Genevieve’s Kitchen with sold-out seatings each year. “<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">This year’s lineup of events features something for everyone: music shows, film screenings, a bike ride, a cocktail contest, the Drag Brunch, and, of course, the Pride Block Party on June 24th, which encompasses the block of E. State Street between Pine and Main Streets.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">When asked about her favorite event, Boger simply couldn’t narrow one down. “They’re all truly amazing for totally different reasons. But there is a moment that happens at each of them, where someone wanders up to our information tent at the event and thanks our volunteers for offering a space where they can truly be themselves, proudly and openly,” she said. “While that alone might not feel like it’s a huge statement, for so many folks their journey to being comfortable enough to attend a pride event may not have always been easy, or they didn’t feel like they could be open about who they are. But seeing so many people of all ages &#8211; all gender identities, families with kids, allies &#8211; everyone coming together in our small town to say and show that folks are loved, it’s more amazing than I can ever describe. Such simple words of “thank you for this” covers so many emotions that aren’t always able to be articulated.”</span></p>\n<p class=\"p5\"><span class=\"s3\">This year marks another milestone to celebrate. The rainbow crosswalk, long-ago proposed by the Borough Council Member, just came to fruition this May, when it was installed at the intersection of Printer’s Alley and E. State Street, next to Evolution Candy. Boger expressed the significance of this for Doylestown and for our greater County. “We’re so very proud to share that we installed a permanent rainbow crosswalk in town with funds raised through sponsorship and event ticket sales, which helped us fund the initial painting and ongoing maintenance. Our rainbow crosswalk is the first in Bucks County.”</span></p>\n<p class=\"p5\"><span class=\"s1\">Those looking to be a part of Pride Month are welcome to join as volunteers. Anyone interested in volunteering on June 17 for the Music Party or on June 24 for the Block Party can sign up on the website <a href=\"https://www.dtownpride.com/\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.dtownpride.com/</a>. A full line-up of events can also be found on the website.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/06/Pridefest.jpg"
}