{
  "id": 19834,
  "title": "Healthy Hometown: Gaining Control Over Allergies",
  "slug": "gaining-control-over-allergies",
  "date": "2024-06-12T15:53:15",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [],
  "excerpt": "<p>By Jill Sonlin• Cardinal Contributing Writer Many adults and children suffer from mild to increasingly serious allergic reactions that can hinder their daily lives. Allergies are a chronic condition that one in three adults and one in four children experience according to the Center for Disease Control. Allergic responses can range from simple nuisances to [&hellip;]</p>\n",
  "content": "<p><b><em>By Jill Sonlin</em><em>• </em></b>Cardinal Contributing Writer</p>\n<p><span style=\"font-weight: 400;\">Many adults and children suffer from mild to increasingly serious allergic reactions that can hinder their daily lives. Allergies are a chronic condition that one in three adults and one in four children experience according to the Center for Disease Control.</span></p>\n<p><span style=\"font-weight: 400;\">Allergic responses can range from simple nuisances to emergency situations. It also can be difficult to avoid every exposure, which creates a lot of stress and anxiety for the person as well as family, teachers, babysitters, and friends. </span></p>\n<p><span style=\"font-weight: 400;\">Some common allergies include peanuts, shellfish, pets, dust, bees, and grasses. Many food allergies can be rather severe and can make eating out extremely stressful.</span></p>\n<p><span style=\"font-weight: 400;\">An allergy is defined as something that the body overreacts to and sees as a threat, overactivating the immune system. This can happen when this substance is consumed or the person comes in contact with it through touching, eating, or inhalation. </span></p>\n<p><span style=\"font-weight: 400;\">Symptoms of allergies are having a stuffy or runny nose, sniffly, sneezing, coughing, hives, rashes, itchy watery eyes, hay fever, and recurrent sinus infections. </span></p>\n<p><span style=\"font-weight: 400;\">Many people use over-the-counter antihistamines to control their allergies. The problem with these medications is that all too often they give only minimal relief of symptoms. Additionally, uncontrolled allergies can also trigger asthma attacks and breathing difficulties, requiring rescue inhalers.</span></p>\n<p><span style=\"font-weight: 400;\">Severe allergic reactions can even escalate to life-threatening emergency situations requiring 911 calls and needing immediate medical intervention. Some serious allergic symptoms are airway tightness, difficulty breathing, swelling of the lips, tongue, or throat, asthma attack, or death if not treated immediately.</span></p>\n<p><span style=\"font-weight: 400;\">Dr. Neetu Dhawan, DO, and board certified Allergist and Immunologist of PURE Allergy and Asthma of Bucks County, offers a revolutionary allergy treatment called Rapid Accelerated Immunology for adult and pediatric patients. She is one of the few doctors in the state trained in this specific treatment method.</span></p>\n<p><span style=\"font-weight: 400;\">Accelerated Immunotherapy is similar to allergy shots, except it doesn’t take an entire year to offer relief from symptoms. The injections are more concentrated per dose, and the shots are given twice weekly under close supervision by the doctor in the office. </span></p>\n<p><span style=\"font-weight: 400;\">In most cases, patients can complete the accelerated allergy treatments within two to three months. This is highly beneficial because the patient can feel better faster. This, in turn, reduces stress with upcoming holidays, weddings, summer picnics, camps, and time spent out with friends.</span></p>\n<p><span style=\"font-weight: 400;\">When should a person see an allergist? Dr. Dhawan advises that anyone suffering from seasonal allergies, food allergies, severe allergic reactions, or asthma can benefit from a consult with an allergy specialist. Dr Dhawan treats patients three months of age to adult. </span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/06/pexels-towfiqu-barbhuiya-3440682-9882204.jpg"
}