{
  "id": 12095,
  "title": "GET YOUR HEALTH ON: How Our Local Businesses Can Improve Your Health",
  "slug": "get-your-health-on-how-our-local-businesses-can-improve-your-health",
  "date": "2022-01-14T15:46:38",
  "author": "Staff",
  "category": [
    "Fit",
    "Live",
    "Play",
    "Style"
  ],
  "tags": [
    "dana roberts",
    "doylestown cardinal",
    "health in new year"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer The New Year is known as the time that people embrace lifestyle changes and make resolutions for themselves that have health-positive effects- join a gym, go to yoga, start a meditation practice, eliminate sugar. While it’s widely known that strict New Years’ resolutions often peter out, we [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Dana Roberts • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">The New Year is known as the time that people embrace lifestyle changes and make resolutions for themselves that have health-positive effects- join a gym, go to yoga, start a meditation practice, eliminate sugar. While it’s widely known that strict New Years’ resolutions often peter out, we firmly believe that taking even baby steps towards incorporating healthy living into your life is a great goal, that can be introduced at any time of the year.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">We have the unique advantage of living in an area full of health-conscious entrepreneurs whose establishments target healthy living in a multitude of ways. Why not take advantage of all that they have to offer and make the goal to visit one (or all!) in 2022 to incorporate a new element of health into your life?</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">Relax in a Float-ally Different Way</span></strong></p>\n<p class=\"p4\"><span class=\"s4\">At Doylestown Float Studio, take the opportunity to relax in a unique way—by floating in a Float Pod. Envision a lovely little pod filled with water with a high density of Epsom salt (the reason floating can occur), which you step into and can then float into a state of relaxation. The experience is spa-like, with a shower pre- and post-float, calming music playing, and a soothing, lovely environment. Floating has been around for over 60 years, and can help those who utilize it relieve stress, recover from injuries, fight addiction, eliminate chronic pain, and boost mood. Float sessions are 60 or 90 minutes, and packages and memberships are available, in addition to energy healing. Take advantage of the Intro to Floating package, through which new guests can receive 3 floats for the price of 2. The benefits build on each other so you’re encouraged to use the 3 floats within 30 days. Make time for you and get your float on!</span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Doylestown Float Studio, The Atrium, 301 S. Main Street, North Building, Suite 3,<span class=\"Apple-converted-space\"> </span></i></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Doylestown •<span class=\"Apple-converted-space\">  </span>215-340-2358 <span class=\"Apple-converted-space\">  </span><a href=\"http://doylestownfloat.com\" target=\"_blank\" rel=\"noopener noreferrer\">doylestownfloat.com</a></i></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">Move Your Body in a New Way</span></strong></p>\n<p class=\"p4\"><span class=\"s4\">If you’re looking to begin moving your body more, if you’ve been exercising for the same way for years and need a change, or if you’re curious about how to move your body to feel your best, then Koru Real Wellness is a must to visit. Koru, an education and wellness center, specializes in movement coaching and helping people incorporate movement more easily into their lives. Colin Kirts, co-owner and co-founder of Koru and a somatic education teacher, and his staff utilize the concept of neuroplasticity to help others make great changes in the way they move.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s5\">Koru, which means “growth,” offers one-to-one movement coaching (aka “personal training”) and wellness support, a private gym and sauna access, in addition to a wide variety of other services: gait analysis and education on basic biomechanics, breathwork coaching and the Wim Hof method, XPT curriculum, nutrition consultations, and ice baths. Koru offers private sessions or a basic membership, including use of the gym, sauna, and communal areas. Take advantage of a sauna 10-pack and discounted rates now!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Koru Real Wellness, Skyrun II Business Park, 4050 Skyron Drive, Ste. D1, Doylestown<span class=\"Apple-converted-space\"> </span></i></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>215-348-5977 <span class=\"Apple-converted-space\">  </span><a href=\"http://wearekoru.com\" target=\"_blank\" rel=\"noopener noreferrer\">wearekoru.com</a></i></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">Nosh on Something (Deliciously) Healthy</span></strong></p>\n<p class=\"p4\"><span class=\"s4\">Finding something healthy to eat when dining out for lunch is typically a struggle, especially when you’re in a time crunch. Lucky for us, that problem was solved when Kendall Bajek, owner of Empanada Mama, opened Nourish by MAMA, a fast-casual establishment on State Street, by the County Theater. Nourish offers food that is 100% non-GMO, vegetarian and vegan, local and organic, and made with love.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">The team of chefs has capitalized on their different ethnic backgrounds to experiment with flavor, fusing cooking techniques and ingredients from around the world to create unique meals, where fresh vegetables are always the star. The team at Nourish has a passion for serving the community real food and seeks out to give back to the community as well. Do not miss out on the opportunity to order the Fajita veggie burrito, Thai noodle bowl, or any of the smoothies and drinks- your taste buds will be delighted. The daily specials are always a treat too!</span></p>\n<p class=\"p6\"><span class=\"s6\"><i>Nourish by MAMA, 34 East State Street, Doylestown • 215-230-3306</i></span></p>\n<p class=\"p6\"><a href=\"http://nourishbymama.com\" target=\"_blank\" rel=\"noopener noreferrer\"><span class=\"s6\"><i>nourishbymama.com</i></span></a><span class=\"s3\"><i> <span class=\"Apple-converted-space\">  </span>Open Monday-Friday, 10am-4pm.</i></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">Take a Hike (or Run, or Walk, or Leisurely Stroll)</span></strong></p>\n<p class=\"p4\"><span class=\"s4\">Just because it’s cold out doesn’t mean you can’t enjoy Mother Nature’s beauty. Moving your body outdoors in nature, whether by hiking, running, or walking, can not only help improve your cardiovascular health and get your body moving, but also offers a certain element of peace and perspective that only being outdoors in brisker weather can offer. Doylestown has a network of 30 miles of completed trails through the Doylestown Community Bike and Hike System, plus wonderful local parks and green spaces to explore by foot (Font Hill, Peace Valley, Central Park, Ralph Stover, and Ringing Rocks are just a few). And there’s no excuse to stay inside because of the temperature when you can easily outfit yourself in great gear to keep you cozy and supported.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">Bucks County Running Co., located right in the borough, is the place to go to obtain outdoor apparel, safety gear such as lights and reflective gear, and shoes for whatever activity you’re into. Opened by Rick McGarry in December 2006, Bucks County Running Co. is a well-loved local business that offers excellent customer service and custom footwear fits, plus group runs that are open to everyone and feature runners of every level. Current group run offerings include a Tuesday morning interval-based track run at 9 am at CB West High School, and a Saturday morning 8-miler at 8 am, meeting at Starbucks<span class=\"Apple-converted-space\">  </span>in the borough.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Bucks County Running Co., 25 West State Street, Doylestown</i></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>215-230-9606 <span class=\"Apple-converted-space\">  </span><a href=\"http://buckscountyrunningcompany.com\" target=\"_blank\" rel=\"noopener noreferrer\">buckscountyrunningcompany.com</a></i></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">Give CBD a Try</span></strong></p>\n<p class=\"p4\"><span class=\"s4\">Whether in drop form, as a gummy, in chocolate, or in body products, CBD is a wonderful tool to help support your overall health. CBD can help with pain, depression, anxiety, sleep, and overall heart health, among many other things. CBD, short for cannabinoid, comes from the hemp plant, and can help support our Endocannabinoid system. Researchers discovered the Endocannabinoid System in the late 1980s. It is located throughout the central and peripheral nervous systems and helps regulate the body in a bid to create balance or homeostasis.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">The cannabinoids in Hemp can bind to the CB1 receptor sites (primarily in the brain), and CB2 receptor sites (mainly in the body). Cannabis strains contain a massive array of cannabinoids that bind to these sites once consumed, producing varying effects depending on which receptor site they bind to. With over 120 cannabinoids in the hemp plant, CBD, as the most famous to date, has gained worldwide popularity.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">A few more powerful healing cannabinoids gaining momentum, including CBG, CBN and CBC, have a similar effect but also have their very own healing properties. Doylestown is home to two amazing companies that offer CBD and related products: Lotus 8 and Doylestown Hemp Company. Owned by Renee Bergere, Lotus 8 is a brick-and-mortar store on State Street that opened in 2015 and offers a variety of CBD products, including drops, chocolate, gummies, face oil, muscle salve, and even CBD for cats and dogs!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">Lotus 8 offers products that are certified organic, all natural (no synthetic fragrances) and always fresh, made weekly or monthly. Doylestown Hemp Company is one of the first permitted Hemp growers in the area and offers a signature sublingual (taken under the tongue) tinctures formula, which is organically extracted from USDA organic certified hemp and blended with organic certified ingredients.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">In addition to raw supplies, Doylestown Hemp Company also offers waxes, fragrance oils, personal care products, soaps, candles and kits. Fun fact: Doylestown Hemp Company has a national podcast, the PBN podcast, which airs on select Tuesdays. Doylestown Hemp products are available on their website through Amazon and are expected to be available in local businesses in January.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Lotus 8, 51 West State Street, Doylestown • 267-576-2383 <span class=\"Apple-converted-space\">  </span><a href=\"http://lotus8.com\" target=\"_blank\" rel=\"noopener noreferrer\">lotus8.com.</a></i></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Doylestown Hemp Company, 205 Doyle Street, Doylestown •<span class=\"Apple-converted-space\">  </span><a href=\"http://dhempco.com\" target=\"_blank\" rel=\"noopener noreferrer\">dhempco.com.</a></i></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">Pamper Your Skin</span></strong></p>\n<p class=\"p4\"><span class=\"s4\">Winter can be harsh on our skin, and by January we are all feeling and showing the “blahs” on our faces. That’s where a visit to a medical aesthetician can really be beneficial. Medical aesthetics has both cosmetic and health benefits, and Victoria Capozzoli, a licensed aesthetician with 30 years of experience, is one of the best around to address all your skin needs. Victoria performs medical grade facials, laser skin resurfacing and laser hair removal treatments. January is the best time to begin a laser series as your skin must be your level of “fair”, with limited sun exposure post treatment.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">Victoria operates out of the office of Lindsay V. Knight, DMD &amp; Associates, a surprising but ingenious partnership. The dental office’s goal is to have an atmosphere that brings more joy into its patients’ lives while providing exceptional dental care. Having an aesthetician on board offers exactly that element of joy and self-care that both patients of the practice and the general public can experience. Call today to book your appointment, and lock in pricing, prior to February 1 price increase.</span></p>\n<p class=\"p6\"><span class=\"s7\"><i>350 South Main Street Suite 105 A, Doylestown •<span class=\"Apple-converted-space\">  </span>215-348-1192 <span class=\"Apple-converted-space\">  </span><a href=\"http://www.drknightdental.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.drknightdental.com</a></i></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">Go with the Flow..</span></strong></p>\n<p class=\"p4\"><span class=\"s4\">The yoga flow that is! Yoga is a sure-fire way to decrease stress, increase flexibility and strength and leave you feeling more centered and balanced.<span class=\"Apple-converted-space\">  </span>Our very own Sun Dog Yoga has been adding the art of Yoga to the Doylestown community since 2006. Owner and instructor, Shari, had a dream to “create a space to offer her deep love of Ashtanga Yoga with as many people as possible, including training many to become teachers of Ashtanga, thereby ‘spreading the love’.” </span></p>\n<p class=\"p4\"><span class=\"s4\">Sun Dog Yoga offers classes for all fitness levels. Check their website to see a schedule of classes that include: Foundations, Primary Series, Mysore Class, Vinyasa Lite, Gentle Yoga, Ashtanga Yoga Basics and Yin! Also, check out their various workshops offered to all levels of students. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><i>17 West State Street, Doylestown •<span class=\"Apple-converted-space\">  </span>215-230-4031 <span class=\"Apple-converted-space\">  </span><a href=\"https://www.sundogyogastudio.com\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.sundogyogastudio.com</a></i></p>\n<p class=\"p5\"><strong><span class=\"s3\">Embrace Your Salty Self</span></strong></p>\n<p class=\"p4\"><span class=\"s4\">The Salt Cave is the place to go if you need a mental health and overall wellbeing boost. The Salt Cave is tucked away on the tiny alley off State Street and is a lovely little store that offers a variety of delightful bath and body products, salt lamps, candles, a crystal bar, as well as sessions in their featured salt cave, facials, massage therapy, Reiki healing therapy, and reflexology. The salt cave consists of nearly 5000 pounds of Pink Himalayan Salt. A salt therapy session involves relaxing and detoxing in a tranquil and beautiful environment, in a zero gravity recliner. Salt therapy is incredibly beneficial and can boost your immunity, relieve stress, provides relief and reduces symptoms of allergies, asthma, respiratory issues, and inflammatory skin conditions.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s6\"><i>The Salt Cave, 46 E. State Street, Doylestown<span class=\"Apple-converted-space\"> </span></i></span></p>\n<p class=\"p6\"><span class=\"s6\"><i>215-515-SALT <span class=\"Apple-converted-space\">  </span><a href=\"http://buckscountysaltcave.com\" target=\"_blank\" rel=\"noopener noreferrer\">buckscountysaltcave.com</a></i></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">Climb to New Heights</span></strong></p>\n<p class=\"p4\"><span class=\"s4\">If you’re looking for a physical activity that challenges both your body and mind and gets you out of the typical “gym” routine, look no further than Doylestown Rock Gym. Rock climbing is a full body workout and improves flexibility, endurance, balance, and cardio fitness, while being low impact. Additionally, the mental benefits of climbing abound. It improves focus, has meditative effects, provides stress relief, and promotes problem solving, ambition, confidence, and personal challenge. Doylestown Rock Gym provides quality indoor, outdoor, and adventure climbing experiences where seasoned climbers as well as newcomers to the sport can practice, train, and learn to climb safely. The gym is located in one of the original airport hangars for the Doylestown Airport and has slowly expanded since its opening in 1995. The gym is open daily and offers day passes and membership options. If climbing is totally new to you, the gym offers 1-2 hour introductory packages for $19 or $25 per climber. The gym also offers climbing lessons and classes for all levels, as well as youth and family classes, with group rates available.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Doylestown Rock Gym, 3853 Old Easton Road, Doylestown <span class=\"Apple-converted-space\"> </span></i></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>215-230-9085 <span class=\"Apple-converted-space\">  </span><a href=\"http://doylestownrockgym.com\" target=\"_blank\" rel=\"noopener noreferrer\">doylestownrockgym.com</a></i></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">Get Oily…</span></strong></p>\n<p class=\"p4\"><span class=\"s4\">…With essential oils, that is. A balanced approach to health comes when the mind, body and soul are each fully supported and working in unison. So often, a focus on our body may temporarily allow us to lose weight, but the efforts drain our mental health; or, we find that our body is more prone to illness when we minimize our spiritual or mental health needs. Essential oils harness the healing properties of plants to form concentrated and powerful tools to dynamically and holistically support the body, mind and spirit.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">Oils can be used for aromatherapy, personal care, or as household solutions, and Young Living Essential Oils is a lead brand to turn to. If you would be interested in talking more about your health goals and how essential oils may be able to support you, reach out to Young Living Brand Partner Maura at <a href=\"mailto:hearthandharmony8@gmail.com\">hearthandharmony8@gmail.com</a> to schedule a free, 15-minute consultation where a plan can be created to help address your needs from a holistic perspective.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/01/Doylestown-Float-Studio-0002_websize.jpg"
}