{
  "id": 14125,
  "title": "Get to Know a Doylestownian: James “Jim” Foster",
  "slug": "get-to-know-a-doylestownian-james-jim-foster",
  "date": "2022-07-13T17:06:39",
  "author": "Staff",
  "category": [
    "Fit",
    "Play"
  ],
  "tags": [
    "dana roberts",
    "doylestown cardinal",
    "Fanny Chapman Pool",
    "Jim Foster"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer Get to Know a Doylestownian is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide, in any way they see fit. For July, we interviewed James, “Jim,” Foster, General Pool Manager of [&hellip;]</p>\n",
  "content": "<p>By Dana Roberts • The Cardinal Contributing Writer</p>\n<p class=\"p3\">G<span class=\"s2\">et to Know a Doylestownian </span><i>is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide, in any way they see fit. For July, we interviewed James, “Jim,” Foster, General Pool Manager of Fanny Chapman Memorial Pool, Doylestown’s community pool, which was first opened to the public on a membership basis on June 21, 1927.</i></p>\n<p class=\"p5\"><strong><span class=\"s2\">I moved to the Doylestown area</span></strong><span class=\"s1\">… in 2005, from Georgia, where I was teaching middle school science and coaching wrestling.<span class=\"Apple-converted-space\">  </span>I moved back into the area to take a teaching position at Pennwood Middle School in the Pennsbury District.<span class=\"Apple-converted-space\">  </span>For the next four years I lived in the Borough of Doylestown.</span></p>\n<p class=\"p1\"><span class=\"s1\"><b>I became the Pool Manager of Fanny Chapman</b></span><span class=\"s2\">…after in¯itially just wanting to become a member. In July of 2005 I decided to join Fanny Chapman Pool but was turned away due to memberships being closed. I love to swim and decided to apply to the Fanny Chapman Board to become a Board Member and was accepted. During 2006, I served as a Member of the Fanny Board. In 2007 the Pool Manager’s position became available and I accepted the position. I am now in my 16th year as Pool Manager.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My responsibilities as Pool Manager include</span></strong><span class=\"s1\">… preparing all the off-season information and schedules, hiring of the staff, preparing the pools for the season, ordering equipment and supplies, program promotion and advertising, preparing the online registration website and responding to membership and program inquiries.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My experience with swimming and lifeguarding started</span></strong><span class=\"s1\">… when I was a teenager.<span class=\"Apple-converted-space\">  </span>As a young adult, lifeguarding was my passion. I was a lifeguard at my community pool in high school, guarded at the pools at the University of South Carolina and Virginia Commonwealth University, and spent summers as part of the water activity staff guarding and teaching water activities at camp or guarding at the nearby lake. A highlight of my VCU college career was being recommended to Southern Illinois University graduate school by a professor and former SIU All American Swimmer for a graduate teaching assistant position, for which I was accepted.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My other career was</span></strong><span class=\"s1\">… teaching middle school science during the school year. Working at Fanny Chapman was my summer job.<span class=\"Apple-converted-space\">  </span>I have always loved working with middle school, high school and college-age students.<span class=\"Apple-converted-space\">  </span>In the 15 years I spent working at Pennwood Middle School, I was involved in leading the character development program.<span class=\"Apple-converted-space\">  </span>I worked on programs including “No Place for Hate”, Say No to Drugs, Leadership training with Student Council, and fundraising with our annual walk-a-thon, which funded many of the programs we offered to students. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">The award for students that was renamed after me following my retirement is</span></strong><span class=\"s4\">…the Pennwood Middle School Fostering Unity Award. As part of the Unity Team, we presented awards to students for outstanding character, leading by example, and showing an inherent ability to lead and work with other students. One such award was the Unity Award, which went to an outstanding eighth grade student for their school involvement and outward show of outstanding character and leadership. I retired from teaching in 2017. In 2019, I was asked to return to Pennwood to present the Unity Award to an outstanding 8th grade student. Little did I know that the Pennwood Unity Team had renamed the award in my honor. It was one of the most rewarding moments of my teaching career.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">During the school year now</span></strong><span class=\"s1\">… I am a fulltime school substitute in the Pennridge School District at South Middle School.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My family includes</span></strong><span class=\"s1\">… my wife, Barbara, and our blended family of 6 children. Three are teachers, one does internet sales for Thompson BMW, one is a real estate agent, and one is in construction. Over the years, two have been employed as Fanny Chapman lifeguards.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">Fanny Chapman was founded in 1927</span></strong><span class=\"s1\">… by William and Martha Mercer, with a mission to teach the community to swim. Today we still stand by that mission. In the late 1950’s, Martha Mercer donated the pool complex to the Borough of Doylestown.<span class=\"Apple-converted-space\">  </span>The pool is celebrating its 95th birthday this season.</span></p>\n<p class=\"p5\"><span class=\"s1\"><strong>The pool complex is</strong>… owned by the Borough of Doylestown and operated by a Board of Managers, who employ a pool general manager.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">Each summer, the pool employs</span></strong><span class=\"s1\">… approximately 90 to 100 lifeguards, coaches, and swim instructors.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">The question I always ask teenagers applying for a job at Fanny Chapman is</span></strong><span class=\"s1\">… “Using one-word adjectives, tell me who you are as a person”.<span class=\"Apple-converted-space\">  </span>From someone’s application, I know they if they are certified or skilled in swimming. What I want to find out is if they will fit with the personality and work ethic of the pool environment at Fanny Chapman. <span class=\"Apple-converted-space\">  </span>For a lot of our staff, it is their first job.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">One of the things I love about working with young people is</span></strong><span class=\"s1\">… their ability to grow and develop into mature, responsible adults. Being at Fanny for the past 16 years, I have watched toddlers grow through our swim lesson program who are now running our swim lesson program. I see former guards and instructors bringing their families to Fanny. I love having those “Ah, Ha” moments when they “finally get it”…oh, so that’s why we do it that way.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">My typical summer daily schedule</span></strong><span class=\"s1\">… varies day-to-day with programs, swim meets, and other events. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">Most people don’t know that Fanny Chapman</span></strong><span class=\"s1\">… is owned by the Borough but operates solely on the funds generated by membership and programs. This is why we do not have residency requirements to belong to the pool. Also, not this past Olympics, but the previous summer Olympics, there were three former Fanny Chapman swimmers who qualified for the Olympic trials.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">On Memorial Day weekend</span></strong><span class=\"s1\">… we had gorgeous weather and approximately 1600 people visited the pool throughout the weekend.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">The quietest time at the pool is</span></strong><span class=\"s1\">… I am not sure there is a quiet time.<span class=\"Apple-converted-space\">  </span>Swim team starts at 7am and we soon will be closing at 9pm.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">The busiest time at the pool is</span></strong><span class=\"s1\">… during swim lessons and swim/dive meets.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">Of the five pools in our complex, my favorite pool is</span></strong><span class=\"s1\">… the dive pool.<span class=\"Apple-converted-space\">  </span>I love to watch the young divers learn new dives and work to perfect them.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">One of my favorite traditions at Fanny Chapman is</span></strong><span class=\"s1\">… the swim/dive team cheers and chants at swim meets. The friendships that are made swimming usually last a lifetime. On numerous occasions I have had wedding parties on the pool deck taking photos because Fanny Chapman was where they met and grew up swimming…now they and their families vacation together, and celebrate holidays and birthdays together.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">The water temperature</span></strong><span class=\"s1\">….was 76 degrees on Memorial Day, and by the end of the season is usually in the low 80’s.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">Good pool etiquette is</span></strong><span class=\"s1\">… “playing nice with others”.</span></p>\n<p class=\"p6\"><strong>A song that captures summer for me is</strong><span class=\"s1\">… any Beach Boys’ song.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">On the job, it always makes me smile when</span></strong><span class=\"s1\">… I see the toddlers smiling and energetic to enter the pool and unhappy when they are told it is time to go home because they love Fanny Chapman Pool.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/07/James-Foster.jpg"
}