{
  "id": 12425,
  "title": "Get to Know a Doylestownian: Jonathan H. Lewis",
  "slug": "get-to-know-a-doylestownian-jonathan-h-lewis",
  "date": "2022-03-01T22:41:04",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "dana roberts",
    "doylestown cardinal",
    "Jonathan H. Lewis",
    "Life Abundant"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer Get to Know a Doylestownian is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide in any way they see fit. For this month’s edition, we chatted with Jonathan H. Lewis. He [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong><span class=\"s1\">By Dana Roberts • </span></strong><span class=\"s1\">The Cardinal Contributing Writer</span></p>\n<p class=\"p3\"><span class=\"s1\">G</span><span class=\"s3\">et to Know a Doylestownian </span><span class=\"s1\"><i>is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide in any way they see fit. For this month’s edition, we chatted with Jonathan H. Lewis. He is the Executive Director of Life Abundant, Inc., a registered 501©(3) nonprofit that assists inmates, ex-offenders, and their families in developing Christian principles in their social, economic, and spiritual lives and becoming productive members of society. Life Abundant primarily serves inmates at the Bucks County Correctional Facility and the Bucks County Community Corrections (aka work release).</i></span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>My position as Executive Director at Life Abundant involves</strong>&#8230; </span><span class=\"s2\">coordinating all volunteer programs and services at the Bucks County Correctional Facility (BCCF), 1-on-1 mentoring of male inmates and returning citizens, facilitation of classes at BCCF, fundraising, organizational development, maintaining compliance with legal and ethical standards, interceding in prayer for all the stakeholders, etc.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>My passion for prison ministry started</strong>&#8230; </span><span class=\"s2\">when I realized how much of a lasting impact a small act of kindness could have on someone’s life. I witnessed men and women live in radically different ways after being treated with decency and kindness. Soon after, I realized that I needed to do more; I needed to take those acts of service into the prison. I have been meeting with incarcerated men through teaching and mentoring since 2003.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>I grew up</strong>&#8230;. </span><span class=\"s2\">in South Philadelphia, not too far from the old Veterans Stadium and The Spectrum. Yes, the home of the Philadelphia Cheesesteak!</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>If you had told me as a young adult what my career today would be, I would have</strong>&#8230;</span><span class=\"s2\"> said, “No way.” Being an introvert and relatively private person, I could not imagine myself as someone who would be consistently in public and working with countless people and organizations. Moreover, this work requires a great deal of faith and patience, neither of which were strong attributes early in my adulthood.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>I got my degree</strong>&#8230;</span><span class=\"s2\">for my undergraduate from Wheaton College, in Wheaton, Illinois, in Sociology, with a minor concentration in Urban Studies. I received my graduate degree from Eastern University in Nonprofit Management.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>The best part of my work is</strong>&#8230;. </span><span class=\"s2\">that I get to see lives change. When a man or woman finally understands who they are, it is a glorious sight to behold. There is nothing quite like it.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>The hardest part of my work is</strong>&#8230; </span><span class=\"s2\">trying to communicate the effectiveness of a faith-based approach to crime prevention and reducing recidivism. In short, we recognize that none of us can conduct ourselves at a higher level than our beliefs; beliefs = behavior. So, we are simply trying to influence beliefs knowing that behavior will soon follow positively.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>A big misconception people have about working with those who are incarcerated</strong>&#8230; </span><span class=\"s2\">is that they somehow won’t be able to relate to someone in jail or prison. People often forget that the incarcerated population is just a make-up of sons and fathers, mothers and daughters, neighbors, local workers, etc. The prison system is as diverse as the world we live in, so there is always a point of connection that can be made.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>One thing most people don’t know about the Bucks County Correctional Facility is</strong>&#8230;</span><span class=\"s2\"> that it is right off 611, across from Kohl’s and Applebee’s, located in the Barn Plaza.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>My biggest passions are</strong>&#8230; </span><span class=\"s2\">to be a loving husband, a caring father, a thoughtful son, and a good neighbor. The legacy of a life well-lived is what I desire to leave behind.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>I am really good at</strong>&#8230; </span><span class=\"s2\">strategic planning and following through on commitments.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>In my downtime, I</strong>&#8230;</span><span class=\"s2\"> spend time with my family and decompress. Most days are rather hectic and unpredictable. Spending quality time with those I love helps to reduce the chaos a bit. I also enjoy spending time alone and listening to classical music.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>I’m currently reading</strong>&#8230; </span><span class=\"s2\">(re-reading) Sacred Marriage by Gary Thomas.</span></p>\n<p class=\"p6\"><span class=\"s1\"><strong>If I could only listen to one song for the rest of my life, it would be</strong>&#8230; </span><span class=\"s2\">I Can Only Imagine by MercyMe.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>My favorite meal is</strong>&#8230; </span><span class=\"s2\">shrimp and some other things, e.g. shrimp scampi, fried shrimp, shrimp and grits, shrimp bisque, shrimp creole. Did I say shrimp cocktail?</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>I met my wife</strong>&#8230; </span><span class=\"s2\">at our former church. She and I were both chaperones and had to stay in contact with one another during a few outings with the youth of the church. After several chats and longer discussions, we were engaged and then married.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>My favorite thing to do with my family is</strong>&#8230;</span><span class=\"s2\"> vacation in Ocean City, MD. We traveled with family one year, and every year after found ourselves back in the same area. It has become sort of like a family tradition.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>Raising my daughter is</strong>&#8230;. </span><span class=\"s2\">one of the greatest responsibilities and privileges of my life. I am beyond blessed to call Gabrielle my daughter. She is daddy’s little peanut.</span></p>\n<p class=\"p5\"><span class=\"s4\"><strong>I hope to teach my daughter</strong>&#8230; </span><span class=\"s5\">to be a Godly woman above all else. I hope that she will learn how to value herself and appreciate every precious moment. I hope she will know how much she is loved and will find both simple and profound ways to reflect that love into the world.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>The best way to support those who are incarcerated is</strong>&#8230; </span><span class=\"s2\">to volunteer to help with prison ministries and reentry programs and services, support efforts to educate and house returning citizens and help to destigmatize incarceration, and openly talk about ways that we can help returning citizens be successful.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>Life Abundant’s mission is to</strong>&#8230; </span><span class=\"s2\">assist inmates, ex-offenders, and their families in developing Christian principles in their social, economic, and spiritual lives and become productive members of society.</span></p>\n<p class=\"p5\"><span class=\"s2\">You can find us at: <a href=\"http://lifeabundantinc.org\" target=\"_blank\" rel=\"noopener noreferrer\">lifeabundantinc.org</a> and on FaceBook, Instagram, and Twitter (look for Life Abundant and/or prisonANDbeyond).</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/03/Jonathan-Lewis.jpg"
}