{
  "id": 16253,
  "title": "Get to Know a Doylestownian: Sisters of Fieldstone Lane",
  "slug": "get-to-know-a-doylestownian-sisters-of-fieldstone-lane",
  "date": "2023-01-09T23:50:13",
  "author": "Staff",
  "category": [
    "Live",
    "Style"
  ],
  "tags": [
    "dana roberts",
    "doylestown cardinal",
    "Megan Thorne",
    "Sisters of Fieldstone Lane",
    "Stacey Wilson"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer “Get to Know a Doylestownian” is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide; in any way they see fit. This month, we interviewed Stacey Wilson and Megan Thorne, the sisters [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Dana Roberts • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s1\"><b><i>“Get to Know a Doylestownian” </i></b>is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide; in any way they see fit. This month, we interviewed Stacey Wilson and Megan Thorne, the sisters who started Fieldstone Lane, a home organization company based in Doylestown. These women have great advice for creating calm in your home and life in the New Year. Stacey and Megan, Megan’s twin Michelle, and their brothers Greg and Mark are also the siblings of Corinne Transue Sikora. A beloved Doylestown resident and educator in Central Bucks, Sikora died on November 25th, 2020, after battling brain and breast cancer. Corinne’s vision for a comprehensive support place for those in the cancer community became the basis of Kin Wellness and Support Center in Furlong. Corinne’s diagnosis also shaped her sisters’ decision to start Fieldstone Lane, a business that would allow them to do what they loved together. Visit their website at <a href=\"http://fieldstonelane.com\" target=\"_blank\" rel=\"noopener noreferrer\">fieldstonelane.com</a>.</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>The name Fieldstone Lane came from</b>&#8230;the road we grew up on. We were fortunate to live a simple life with neighbors that were like family. We played outside past dark and had only the things we needed to make us happy.</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>The services we offer include</b>…in-home, hands-on organizing. We assist our clients through the decluttering and organizing process, whether it be one room or their whole house. This might look like decluttering one pantry or closet, creating paperwork systems for busy families, or helping a client through a whole home downsizing. We also help our clients shop for organizing products, haul away donations, and set up junk removal services.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>One of our favorite jobs that we’ve done was</b>&#8230;one of our first big downsizing clients, with whom we worked for months. We went through every memory and especially loved when we pulled out the stroller of her now 25-year-old son from the attic. It still had a picture he had colored on a restaurant placemat, some sticks, and a rock in it. It was fun reliving those memories and then assisting in passing that item on to a new family through donation. Helping our clients to turn what could be a very stressful process into a more joyful one is our motivation.</p>\n<p class=\"p1\"><b>The best items we’ve found are</b>&#8230; the lost items that a client has been looking for, sometimes for years. One of the most interesting and emotional items we’ve uncovered was a client’s pair of work shoes he wore while working in NYC on 9/11. They still had debris and dust on them.</p>\n<p class=\"p1\"><b>The easiest and most difficult part of working together as sisters is</b>&#8230;we have the same work ethic and expectations of what we want to offer. That can also be difficult because we have no one to rein us in to ensure a good balance with work.</p>\n<p class=\"p1\"><b>Our experience from our previous careers has informed us because</b>&#8230;it has contributed to what we can offer our clients. First is the efficiency and customer service skills we learned growing up in the restaurant business. Stacey’s 15 years of an Occupational Therapist experience in home care brings the knowledge of evaluating the “why” behind the disorganization. This helps to create a plan to assist each client in creating spaces and systems that encourage optimal function. Megan brings years of experience in early childhood education, with knowledge of creating family spaces that encourage learning, kids’ independence, and fun.</p>\n<p class=\"p1\"><b>Growing up in Bucks County and now living and working here in adulthood is</b>&#8230; wonderful! Because we have a big family, it’s common that we discover connections to clients on an almost daily business. We all still live within a ten-mile radius of where we grew up.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>Our favorite home organization show is</b>&#8230;Tidying Up with Marie Kondo, on Netflix. We love the process she uses to empower families to determine the “why” behind wanting to become organized and to teach them how to declutter their belongings.</p>\n<p><a href=\"/data/media/fieldstone-lane-closet.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-16265\" src=\"/data/media/fieldstone-lane-closet.jpg\" alt=\"\" width=\"1470\" height=\"1960\" srcset=\"/data/media/fieldstone-lane-closet.jpg 1470w, /data/media/fieldstone-lane-closet-225x300.jpg 225w, /data/media/fieldstone-lane-closet-768x1024.jpg 768w, /data/media/fieldstone-lane-closet-990x1320.jpg 990w, /data/media/fieldstone-lane-closet-1320x1760.jpg 1320w\" sizes=\"auto, (max-width: 1470px) 100vw, 1470px\" /></a></p>\n<p class=\"p1\"><b>The easiest and highest-impact way someone can make a difference in their home is</b>&#8230;making a habit of decluttering and becoming mindful of what comes into the home. The pretty bins and spaces are the icing on the cake after you go through the editing process. First, you should make sure you only have the things you truly need and love.</p>\n<p class=\"p1\"><b>The most difficult areas to organize for clients are</b>…drop zones (mud room or kitchen island) that witness the constant in-and-out of everyday items such as mail, packages, and kids’ schoolwork.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>The easiest space to organize is</b>…under a kitchen or bathroom sink. This is often a spot where we encourage people to start if they want to tackle an organizing job.</p>\n<p class=\"p1\"><b>If you have company coming over and only have 5 minutes to clean up, our best advice is to</b>&#8230;clear the flat surfaces. Get into the routine of simply having clear countertops in the kitchen and bathroom. That can make a huge difference.</p>\n<p class=\"p1\"><b>The rooms and areas in our own homes that are hardest to keep organized are</b>&#8230;kids’ rooms and play spaces. But&#8230;we always tell our clients to give priority to making sure that their own personal spaces are organized and decluttered. Then it’s easier to tolerate the kids’ messes.</p>\n<p><a href=\"/data/media/fieldstone-lane-pantry.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-16266\" src=\"/data/media/fieldstone-lane-pantry.jpg\" alt=\"\" width=\"1470\" height=\"1491\" srcset=\"/data/media/fieldstone-lane-pantry.jpg 1470w, /data/media/fieldstone-lane-pantry-296x300.jpg 296w, /data/media/fieldstone-lane-pantry-768x779.jpg 768w, /data/media/fieldstone-lane-pantry-1010x1024.jpg 1010w, /data/media/fieldstone-lane-pantry-65x65.jpg 65w, /data/media/fieldstone-lane-pantry-990x1004.jpg 990w, /data/media/fieldstone-lane-pantry-1320x1339.jpg 1320w\" sizes=\"auto, (max-width: 1470px) 100vw, 1470px\" /></a></p>\n<p class=\"p1\"><b>Our favorite thing to listen to while working is</b>&#8230; a podcast. We love podcasts on organizing. We often suggest podcasts to clients at the start of their organizing journey to help adjust their mindset. One of our favorites is Clutterbug Podcast with Cas Aarssen.</p>\n<p class=\"p1\"><b>The home organization product we could not live without is</b>&#8230;a clearly labeled bin. Essentially, this is our process: after decluttering, we work with our client to contain the remaining items in boxes labeled by categories to ensure everyone knows where to find and put back those items.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>Our thoughts on garage sales are</b>&#8230;go for it! They can be a lot of work but are a great way for a family to work together. We love the idea of rewarding yourself with something fun, like an activity or an item for a newly organized space, as a motivator for decluttering.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>In a given month, we typically work with</b>&#8230;5-7 families.</p>\n<p class=\"p1\"><b>If you’re interested in our home organization services, our free 30-minute phone consult.</b>..will allow you to tell us about your organizing goals. We want to hear about what is causing stress in your home and then help you make a plan to tackle that. Often in this first phone call, we can feel the shift from overwhelmed to hopeful in our clients.</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/01/fieldstone-lane-sisters.jpeg"
}