{
  "id": 12736,
  "title": "Get to Know a Doylestownian: Elizabeth Tolis",
  "slug": "get-to-know-a-doylestownian-elizabeth-tolis",
  "date": "2022-04-12T13:51:09",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "Autism Spectrum Disorder",
    "dana roberts",
    "doylestown cardinal",
    "Elizabeth Tolis"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer Get to Know a Doylestownian is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide, in any way they see fit. In honor of April being Autism Awareness month, we wanted to [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong><span class=\"s1\">By Dana Roberts • </span></strong><span class=\"s1\">The Cardinal Contributing Writer</span></p>\n<p class=\"p3\"><span class=\"s3\">G</span><span class=\"s4\">et to Know a Doylestownian </span><span class=\"s3\"><i>is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide, in any way they see fit. In honor of April being Autism Awareness month, we wanted to feature a family whose lives are directly touched by Autism. We had the honor of chatting with Elizabeth Tolis, mother to three boys, whose youngest son, Emmett, age 12, has a diagnosis of Autism Spectrum Disorder.<span class=\"Apple-converted-space\"> </span></i></span></p>\n<p class=\"p5\"><strong><span class=\"s6\">I became a mom</span></strong><span class=\"s7\">&#8230;in January 2007 to twin boys.</span></p>\n<p class=\"p5\"><strong><span class=\"s6\">My three sons are</span></strong><span class=\"s7\">…each unique in their own way and that keeps me on my toes.</span></p>\n<p class=\"p5\"><strong><span class=\"s8\">Besides being a mom, I</span></strong><span class=\"s2\">… volunteer as the VP board member for the Parents Football Club for Central Bucks East.<span class=\"Apple-converted-space\">  </span>I just finished work on the Production Team of Central Bucks South’s Spring Musical, Little Shop of Horrors, as producer and choreographer.<span class=\"Apple-converted-space\">  </span>In Summer of 2021 I closed the doors on my 19-year Dance Studio business(Stage Dance Academy in Hatboro) to better meet the needs of my family and prepare for the road ahead with Emmett.</span></p>\n<p class=\"p7\"><strong>My youngest son Emmett was diagnosed with autism</strong><span class=\"s7\">&#8230;. around 18 months of age.</span></p>\n<p class=\"p5\"><strong><span class=\"s8\">When Emmett was diagnosed, my husband and I</span></strong><span class=\"s2\">…were not surprised.<span class=\"Apple-converted-space\">  </span>We had seen several signs that included: lack of eye contact and limited showing of emotions, especially when it was well past mealtime, and a baby/toddler would typically be screaming and crying for a bottle or snack. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s4\">Before I was a mother and our son was diagnosed, our experience with autism was</span></strong><span class=\"s5\">&#8230;minimal.<span class=\"Apple-converted-space\">  </span>As a teacher of dance, I had a few students that I had worked with on the spectrum.</span></p>\n<p class=\"p5\"><strong><span class=\"s6\">Autism is a spectrum disorder, and for Emmett, autism presents as</span></strong><span class=\"s7\">&#8230;a processing disorder, a communication delay, extreme sensory aversions with food, intellectual disability, and severe aggression that can cause injury and property destruction. This includes but is not limited to scratching and bruise-causing pinching (at times near the neck), ripping clothing, breaking jewelry, black eyes and holes in walls and windows. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s8\">Since Emmett’s diagnosis, he has received</span></strong><span class=\"s2\">&#8230;Occupational Therapy, Speech Therapy, Physical Therapy, Mobile Therapy, Blended Case Management, admission and treatment at the Feeding &amp; Swallowing Clinic at CHOP, in-home Behavioral Support and Home Health Aides to manage care. However, at varying times Emmett has had only a few or sometimes none of the services prescribed due to no staff available.</span></p>\n<figure id=\"attachment_12738\" aria-describedby=\"caption-attachment-12738\" style=\"width: 1257px\" class=\"wp-caption alignnone\"><a href=\"/data/media/Elizabeth-and-Emmett-Tolis.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-12738\" src=\"/data/media/Elizabeth-and-Emmett-Tolis.jpg\" alt=\"\" width=\"1257\" height=\"943\" srcset=\"/data/media/Elizabeth-and-Emmett-Tolis.jpg 1257w, /data/media/Elizabeth-and-Emmett-Tolis-300x225.jpg 300w, /data/media/Elizabeth-and-Emmett-Tolis-768x576.jpg 768w, /data/media/Elizabeth-and-Emmett-Tolis-1024x768.jpg 1024w, /data/media/Elizabeth-and-Emmett-Tolis-74x55.jpg 74w, /data/media/Elizabeth-and-Emmett-Tolis-111x83.jpg 111w, /data/media/Elizabeth-and-Emmett-Tolis-215x161.jpg 215w, /data/media/Elizabeth-and-Emmett-Tolis-990x743.jpg 990w\" sizes=\"auto, (max-width: 1257px) 100vw, 1257px\" /></a><figcaption id=\"caption-attachment-12738\" class=\"wp-caption-text\">Elizabeth and Emmett Tolis</figcaption></figure>\n<p class=\"p5\"><strong><span class=\"s6\">Autism affects our family in so many ways, including things people might not consider, like</span></strong><span class=\"s7\">&#8230;being unable to invite guests to our home. Our family of 5 cannot travel in one vehicle together because Emmett is unable to manage in a close group of that many people. I closed my business of 19 years to focus on how his needs affect our entire family, in addition to managing Emmett’s care needs. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s6\">For my other sons, having a brother who has autism is</span></strong><span class=\"s7\">&#8230;extremely difficult. Emmett’s behaviors prohibit them from striking up a conversation at any time and often force them to be completely silent until Emmett can be removed from the room. Emmett doesn’t allow for blending into the crowd. When we used to go out, it would often result in the entire store watching me lay on the ground holding Emmett down until he was calm enough to be safe…not the type of attention you want EVERY TIME you are in public. Emmett has not been out on a spontaneous public outing with his brothers in almost a year. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s8\">I am so proud of Emmett because</span></strong><span class=\"s2\">…there is not a single skill, from coloring, to eating with utensils, to eating foods with texture, buttoning a shirt, putting on socks, and the list goes on&#8230;Every single daily living activity that he is successful doing, he has had to learn and try hard to accomplish. Many of those skills came 3, 4, 5, 6 years and longer past the majority of his neurotypical peers.<span class=\"Apple-converted-space\">  </span>He not only makes me proud; he inspires me to keep working hard, have patience and slow down and recognize the hidden joys in life.</span></p>\n<p class=\"p5\"><strong><span class=\"s4\">The most difficult thing in parenting Emmett is</span></strong><span class=\"s5\">&#8230;letting go of the preconceived ideas I had of what parenting would look like. Every now and then, I have “if only he…” moments, but when I think about the wisdom I have gained, and how I have transformed because of being his parent, I feel blessed to be his mom. For me, the most difficult thing is not parenting him in the “now,” aggressive behaviors and all, but it’s not knowing who will care for him when his father and I are not able to.</span></p>\n<p class=\"p5\"><strong><span class=\"s6\">I am really good at</span></strong><span class=\"s7\">&#8230;reframing a difficult situation in a positive way to help me get through the hard stuff. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s8\">We decided to share Emmett’s story because</span></strong><span class=\"s2\">&#8230;individuals with Profound Autism and Intellectual Disabilities do not have adequate care options available when they are in crisis. Many caregivers are so overwhelmed that the number of cases like Emmett are often not spoken about.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s6\">When Emmett was hospitalized in summer and fall of 2021 during a crisis point</span></strong><span class=\"s7\">&#8230;he stayed 4 months in holding at the Children’s Hospital of Philadelphia. He was denied from over 35 psychiatric short term med stabilization programs, multiple long term residential care facilities, and finally discharged home to wait for services. During his stay, he was routinely strapped to the bed if he became aggressive, which was often. He was not deemed safe to be outside in any capacity, so he did not breathe outside air for the entire summer. He received no behavioral interventions until the hospital creatively placed him in a Medical Behavior Unit where they deemed him safe to wait for a placement from home, even though he was placed in straps just days before discharge.</span></p>\n<p class=\"p5\"><strong><span class=\"s6\">The idea to make greeting cards out of the many drawings Emmett made during his hospital stay</span></strong><span class=\"s7\">&#8230;came from followers of his blog. To pass time and keep Emmett calm while he waited inpatient at CHOP for a treatment center to accept him, Emmett began painting with watercolors. Very quickly, followers of his blog asked if his artwork would be available, and things took off from there.</span></p>\n<p class=\"p5\"><strong><span class=\"s6\">My biggest hope for Emmett is</span></strong><span class=\"s7\">&#8230;. quality of life. I wish for him to be surrounded by a strong and cohesive team that can support him on his journey to be successful and safe in our home, school and community.<span class=\"Apple-converted-space\">   </span></span></p>\n<p class=\"p5\"><strong><span class=\"s6\">The best way anyone can support parents or caregivers whose children have autism is</span></strong><span class=\"s7\">&#8230;check in with them, even if it’s a text. And the absolute worst thing you can do is to offer to help with an empty promise.<span class=\"Apple-converted-space\">  </span>It can be unimaginably lonely as a parent/caregiver. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s4\">The best advice I could offer a family whose child is newly diagnosed is</span></strong><span class=\"s5\">&#8230; follow your instincts and don’t listen to your friends and family members reassure you that it will be ok. Honestly, it might be ok, but it might not be. Remember, you are entitled to go through all the emotions that will surface along the way without being told “he/she will be fine.”<span class=\"Apple-converted-space\">  </span>Sometimes you don’t need reassurance, but you do need to get the tears out so you can move on and keep advocating for your child. You are your child’s best advocate.<span class=\"Apple-converted-space\">  </span>Autism may not significantly impair your child. For some individuals, it may eventually go unnoticed. For others, like Emmett and our family, it could turn your world upside down.<span class=\"Apple-converted-space\">  </span>But raising Emmett, difficult moments and all, has blessed my life in ways I could never have dreamt in a million years! <span class=\"Apple-converted-space\">   </span></span></p>\n<p class=\"p4\"><i>If you are interested in learning more about Emmett, please visit <a href=\"http://EmmettsJourney.com\" target=\"_blank\" rel=\"noopener noreferrer\">EmmettsJourney.com</a>. Greeting cards featuring his artwork are available through the website and are also available at Monkey’s Uncle in Doylestown borough. If your business is interested in featuring Emmett’s work in your shop, please reach out via the website or by emailing <a href=\"mailto:info@EmmettsJourney.com\">info@EmmettsJourney.com</a>.</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/04/Emmett-Tolis.jpg"
}