{
  "id": 18094,
  "title": "Get to Know a Doylestownian: County Theater&#8217;s Justin Jagoe",
  "slug": "get-to-know-a-doylestownian",
  "date": "2023-08-14T11:30:54",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Taste"
  ],
  "tags": [
    "dana roberts",
    "doylestown cardinal",
    "Justin Jagoe",
    "the county theater"
  ],
  "excerpt": "<p>The Man Behind the Curtain: County Theater’s Justin Jagoe By Dana Roberts • The Cardinal Contributing Writer Get to Know a Doylestownian is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide; in any way they see fit. This month, [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong><span class=\"s1\">The Man Behind the Curtain:</span> County Theater’s Justin Jagoe</strong></p>\n<p class=\"p1\"><b>By Dana Roberts • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><em>Get to Know a Doylestownian is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide; in any way they see fit. This month, we chatted with Justin Jagoe, Head Manager of the County Theater, Doylestown’s well-known and much-loved cinema haven. Justin gives the lowdown on what it’s like to work at the County and highlights that August is the perfect month to take advantage of some great new releases, catch one of the Movies at the Mercer and escape the heat in one of the lovely theaters while chowing down on delicious popcorn.<span class=\"Apple-converted-space\"> </span></em></p>\n<p class=\"p4\"><span class=\"s2\"><b>The County Theater has been around since</b></span><span class=\"s3\"><b>…</b>1938, which means we turned 85 this year.</span></p>\n<p class=\"p4\"><span class=\"s2\"><b>Most people don’t know that the County</b></span><span class=\"s3\"><b>…</b>has been operating as a community and member-supported nonprofit movie theater for thirty of its 85 years. Our nonprofit theater business model enables us to serve the Doylestown community primarily as an arts organization; specifically, the cinematic arts. We make room for independent, international, classic, and sometimes even local movies. Titles you wouldn’t necessarily expect to see playing at a chain multiplex.</span></p>\n<p class=\"p6\"><span class=\"s4\"><b>My role at the County is</b></span><span class=\"s5\"><b>…</b>Head Manager of the County, which means I am in charge of all staffing and operations at our theater. I hire and manage our theater staff, with the assistance of my management team. I am also in charge of managing our film and digital projector work, collaborating with our brilliant programmers to ensure every movie we show gets a stellar theatrical presentation. </span></p>\n<p class=\"p6\"><span class=\"s4\"><b>I have been working here since</b></span><span class=\"s5\"><b>…</b>2019, when I started as a theater staff person, scooping popcorn and selling tickets, and sweeping auditoriums. I had just moved to Doylestown and wasn’t sure what to do with my days. Working at the County was only ever meant as a side gig for some extra money and free movies. But it’s since become the most rewarding job I’ve ever had.</span></p>\n<p class=\"p6\"><span class=\"s4\"><b>My previous work and education experience includes</b></span><span class=\"s5\"><b>… </b>accounting, bookkeeping, and administration. I also have an MFA in Creative writing and will occasionally write about film as a personal hobby.</span></p>\n<p class=\"p6\"><span class=\"s4\"><b>My favorite part of working at the County is</b></span><span class=\"s5\"><b>… </b>Besides my staff, who are easily the brightest and most delightful workers in Doylestown, I love working in a place that cares as much as I do about movies, and that knows the value of the theatrical experience. As much as I like being able to stream movies at home, truly nothing beats movies on the big screen for me.</span></p>\n<p class=\"p6\"><span class=\"s4\"><b>A surprising thing about working at the County is</b></span><span class=\"s5\"><b>…</b>the patrons are always friendly and a delight to serve. You can’t always say that about some service jobs, but it truly feels like a blessing to interact with our patrons every day. They love moviegoing as much as we do, and they clearly cherish the time they spend in our theater.</span></p>\n<p class=\"p6\"><span class=\"s4\"><b>The County employs</b></span><span class=\"s5\"><b>… </b>At any given time, the theater itself has about eight part-time staff on hand and three or four managers to guide our staff and serve as digital projectionists. When we add new staff, we look for folks who have a friendly attitude, know how to handle money and stressful days, and are available to assist us during our busiest times, which are nights and weekends. </span></p>\n<p class=\"p6\"><span class=\"s4\"><b>Movies at the Mercer started</b></span><span class=\"s5\"><b>…</b>a few years ago, just before the theater itself re-opened in 2021 after COVID and our renovations were completed. We wanted a way for our patrons to be able to enjoy communal moviegoing, especially if they were still hesitant to enter a movie theater again. Our friends and partners over at the Mercer Museum and The Moving Picture Cinema have done wonders to help us bring movie magic outdoors.</span></p>\n<p class=\"p6\"><span class=\"s2\"><b>The recent renovation at the County</b></span><span class=\"s3\"><b>…</b>was an endeavor six years in the making! We were so relieved to open our doors once again in 2021, after fifteen months of closure and renovations. But to see just how enthusiastic patrons have been about the new County Theater was incredible. Our new auditorium, which has stadium-style seating, sharp laser projection, and a Dolby 7.1 sound system, is nothing less than my favorite place in the world to watch a movie.</span></p>\n<p class=\"p6\"><span class=\"s4\"><b>Birthday parties and special events at the County are</b></span><span class=\"s5\"><b>… </b>hosted regularly. The County Theater hosts special events of all sizes, be they children’s birthday parties, catered corporate events, or movie premieres for local filmmakers. We have more information about renting our auditoriums on our website, <a href=\"http://countytheater.org\" target=\"_blank\" rel=\"noopener noreferrer\">countytheater.org</a>.</span></p>\n<p class=\"p6\"><span class=\"s4\"><b>Members of the County Theater</b></span><span class=\"s5\"><b>… </b>are entitled to several benefits, starting with a reduced price of admission. Members also get invitations throughout the year to several member-exclusive screenings and online seminars, as well as discounts for private theater rentals. Membership also transfers to our sister theaters: The Ambler Theater, Jenkintown’s Hiway Theater, and the Garden Theater in Princeton NJ.</span></p>\n<p class=\"p6\"><span class=\"s4\"><b>The best movie I’ve seen at the County in the past year is</b></span><span class=\"s5\"><b>… </b>a tie. Last fall we showed Steven Spielberg’s The Fabelmans, which I thought was a wonderful self-examination of the director’s childhood and emerging love of movies. A few weeks ago, thanks to our Hollywood Summer Nights classic film lineup, I got to see a 4K restoration of my all-time favorite movie musical, Singin’ in the Rain. I’d never seen it in a theater before, and I’m so happy I finally got to.</span></p>\n<p class=\"p6\"><span class=\"s4\"><b>I estimate that I watch</b></span><span class=\"s5\"><b>… </b>entirely too many movies each year. I saw 125 movies last year. At least half of those are likely movies I screened at the County.</span></p>\n<p class=\"p6\"><span class=\"s7\"><b>The movie I have watched over and over is</b></span><span class=\"s8\"><b>…</b>Crouching Tiger, Hidden Dragon, the 2000 martial arts film from Taiwan. I first watched it in the theaters when I was a teen. I was so blown away by its love story, its action, and its tragic ending that I have never gotten tired of revisiting it. It’s the movie that made me fall in love with movies.</span></p>\n<p class=\"p6\"><span class=\"s4\"><b>If I need a good laugh, a movie that always makes that happen is</b></span><span class=\"s5\"><b>…</b>I’ll give two suggestions. First is the comedy classic Monty Python and the Holy Grail. Endlessly quotable and utterly hilarious. I love that we screen it every June for PythonFest, one of our biggest regular annual events. A new comedy I would love more people to see is Barb and Star Go to Vista Del Mar. It’s a bizarre movie, but if the humor resonates with you, you will never stop laughing. I think it’s a cult classic in the making.</span></p>\n<p class=\"p6\"><span class=\"s4\"><b>In my opinion, the snacks we offer that are must-haves for movie-watching include: </b></span><span class=\"s5\">We have Boylan’s on tap, and I love their black cherry soda. To eat, I can never resist our chocolate-dipped almond biscotti, which are made locally by our good friends at Bucks County Biscotti.</span></p>\n<p class=\"p6\"><span class=\"s4\"><b>Upcoming movies I’m looking forward to include</b></span><span class=\"s5\"><b>… s</b>ome exciting movies coming out this fall. I’m probably most pumped for Martin Scorsese’s Killers of the Flower Moon starring Lily Gladstone, Robert De Niro, and Leonardo DiCaprio. On August 31, though, we will be showing 2001: A Space Odyssey, arguably the greatest science fiction film ever made. We expect a great turnout, and I hope to see some of your readers in attendance.</span></p>\n<p class=\"p6\"><span class=\"s4\"><b>Sell-out shows for the theater in the past have included:</b></span><span class=\"s5\"> Most recently we brought both Barbie and Oppenheimer to our screens, and the excitement for both those movies has been overwhelming. Sold-out auditoriums through opening weekend, filled with patrons who just had to see Hollywood’s most talented directors giving splashy, well-made entertainment.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s4\"><b>The best thing about the County, in my opinion, is</b></span><span class=\"s5\"><b>…</b>our popcorn. Nobody makes better popcorn than the County Theater.</span></p>\n<p class=\"p6\"><span class=\"s4\"><b>My favorite thing about Doylestown is</b></span><span class=\"s5\"><b>…</b>how much the people here care about their hometown. I could tell right away when I moved here. There is so much passion, history, and heritage to be celebrated. And the number of cultural institutions (not just the County, but the Mercer and Michener and Fonthill Castle) means I never run out of ways to entertain out-of-town visitors.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/08/County-Theater.jpg"
}