{
  "id": 14203,
  "title": "Getting To Know The Points Guy – Brian Kelly",
  "slug": "getting-to-know-the-points-guy-brian-kelly",
  "date": "2022-08-04T21:00:29",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "brian kelly",
    "doylestown cardinal",
    "lily appleby"
  ],
  "excerpt": "<p>By Lily Appleby  •  The Cardinal Editorial Intern Get to know 2022’s Bucks Happening Best Social Media Personality, Brian Kelly.  He has over 275,000 followers on his personal Instagram account (@briankelly), and over 700,000 on his business Instagram account(@thepointsguy), where he gives advise on traveling with points and miles!  Brian documents his world travels and gives great [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Lily Appleby  •  </strong>The Cardinal Editorial Intern</p>\n<p class=\"p3\"><span class=\"s2\"><i>G</i></span><span class=\"s2\"><i>et to know 2022’s Bucks Happening Best Social Media Personality, Brian Kelly.  He has over 275,000 followers on his personal Instagram account (@briankelly), and over 700,000 on his business Instagram account(@thepointsguy), where he gives advise on traveling with points and miles!  Brian documents his world travels and gives great tips along the way! He’s been featured on many news outlets sharing his travel wisdom. Following him will make you want to quit your job and travel the world, so do so with caution!</i></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">I grew up in</span></strong><span class=\"s1\">…Jamison, PA, and graduated from Central Bucks East in 2001.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">My first international trip was</span></strong><span class=\"s1\">…to the Cayman Islands in 1996. That was the first trip I used my dad’s frequent flyer miles to fly our family of six for free, which was pretty amazing.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">My passion for travel developed when</span></strong><span class=\"s1\">…I studied abroad in Madrid in 2005 and fell in love with travelling around Europe.</span></p>\n<p class=\"p1\"><strong>My favorite and least favorite travel experience abroad</strong><span class=\"s1\">…<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">My favorite experience</span><span class=\"s1\"> is doing charity work with an organization called Peace Champ, where we bring Nobel Peace Prize winners to kids and youth around the world, and the Points Guy sponsors these conferences in Ghana, Guatemala, Liberia, and South Africa. Those are my favorite types of trips.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s5\">My least favorite experience abroad is</span></strong><span class=\"s6\">… I would say I generally see the good in every destination, but I’m not a huge fan of Bali. It’s so far away, and I didn’t think the beaches were that nice. I highly recommend going places much closer, the Caribbean and Hawaii come to mind.</span></p>\n<p class=\"p1\"><strong>My 3 best travel tips are</strong>…<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\"><strong><span class=\"s3\">1. Put air tags in your luggage </span></strong><span class=\"s1\">so you can track them in real time. So, when the airline loses them, you can tell them exactly where they are.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>2. Use your frequent flyer miles</strong>.</span><span class=\"s1\"> They lose value over time, so use them now, and also when you use them, they give you added flexibility.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">3. Book flights on travel credit cards </span></strong><span class=\"s1\">like Chase Sapphire and AmEx Platinum that give trip delay and interruption coverage, these days with so many delays and cancellations, your credit card with help reimburse you if anything goes wrong.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">The must have item I always bring traveling is</span></strong><span class=\"s1\">… My Apple Air pods max noise cancelling head phones (Bose QC38 are also great). Screaming babies and annoying seat mates are just a factor of travel, so bringing your own form of noise cancelling headphones is a must.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>My dream trip (or place you haven’t visited yet that you really want to) is</strong>&#8230;<span class=\"s1\"> A cruise to Antarctica, to kayak with whales.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">The Points Guy is</span></strong><span class=\"s1\">… A travel website that helps millions of people travel smarter and maximize their frequent flyer miles and credit card points.</span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>A celebrity/public figure that I’ve gotten to interact with through my Instagram/work who I really enjoyed was</strong>.</span><span class=\"s1\">.. After going on the View, Whoopie Goldberg reached out, she’s a TPG reader, and I often give her travel tips and she’s just an all-around amazing human and fun person to be friends with.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">The Carbon Ridge is</span></strong><span class=\"s1\">…. A personal sanctuary, it’s my farm in Solebury where I ride horses. I have goats, llamas, chickens, and by the time this article prints, probably another new animal because, like someone once told me, having horses and animals is like having potato chips, you can’t just have one.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">This passion (for horses/rescuing animals) came from</span></strong><span class=\"s1\">… In college, at the University of Pittsburgh, I volunteered at the animal rescue league, and realized that just being around animals brings my stress down and I also realized that so many animals are neglected, and even just volunteering to go walking dogs, and often the ones that people think are the meanest are the sweetest. Like Pitbull mixes, who are truly just the most soulful dogs out there.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">I tell people who are traveling to Bucks County to make sure to visit</span></strong><span class=\"s1\">… The Delaware River, kayaking is one of my favorite things to do in the world, especially now with so many bald eagles it’s just an absolutely spectacular experience, the rivers clean and the bald eagles are simply majestic.<span class=\"Apple-converted-space\"> </span></span><span class=\"s1\"> </span></p>\n<p class=\"p1\"><strong>My favorite places to go in Doylestown are</strong><span class=\"s1\">&#8230; I would say… OOKA sushi bar.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">If planning an upcoming trip</span></strong><span class=\"s1\">&#8230; allow ample time at the airport, especially if you have a connection; avoid checking a bag, but if you must, use an AirTag to track it; and consider going to off the beaten path destinations and airports to avoid high levels of chaos.” “The strong demand to travel combined with the ongoing issues of staffing shortages and flight cancellations has led to a crazy summer for the travel industry.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/08/Brian-Kelly_headshot.jpg"
}