{
  "id": 15429,
  "title": "Harper &#038;  Penny’s",
  "slug": "harper-pennys",
  "date": "2022-10-25T23:39:41",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Harper &amp; Penny’s"
  ],
  "excerpt": "<p>By Jules from @FortheLoveofDoylestown • The Cardinal Contributing Writer Nothing about the menu of Harper &amp; Penny’s is basic, which is an intentional feature.  The restaurant, formerly Andre’s, opened its doors June of 2021. Co-owners Chef Jamal Harper and Lyndsay Williams offer the type of menu you don’t see anywhere else in town. Located in [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Jules from @FortheLoveofDoylestown • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">N</span><span class=\"s3\">othing about the menu of Harper &amp; Penny’s is basic, which is an intentional feature. </span></p>\n<p class=\"p5\"><span class=\"s1\">The restaurant, formerly Andre’s, opened its doors June of 2021. Co-owners Chef Jamal Harper and Lyndsay Williams offer the type of menu you don’t see anywhere else in town. Located in the Doylestown Marketplace at 22 South Main Street, the eatery is warm, cozy, and includes a beautiful bar.   </span></p>\n<p class=\"p5\"><span class=\"s3\">Chef Harper likes the food options to be fresh, new, and fearless. Popular menu items include the incredibly delicious wings, freshly made hummus, and the charcuterie boards. Harper makes the house Caesar salad with half a head of lightly grilled lettuce and tops it with blood orange olive oil from Olive Oil Etcetera, located next door. And, of course, the freshly made from scratch burgers are an all-time favorite.  </span></p>\n<p class=\"p5\"><span class=\"s3\">The fresh herbs and vegetables the chef uses in all his creations come from general manager, bartender, and expert gardener, John Kelly. Both Harper and Williams rave about him in his role at the restaurant. “He really keeps us organized,” Williams says.  </span></p>\n<p class=\"p5\"><span class=\"s3\">Harper &amp; Penny’s is all about keeping it local. The wine served in the restaurant is from Wycombe Vineyards and all of the liquor is from Pennsylvania. The wall decor features local artists Michael Lever and David Ohlerking. It is very important for the restaurant to include the community as much as possible, Harper says. </span></p>\n<p class=\"p5\"><span class=\"s3\">Harper’s own kitchen experience includes his work at a variety of local eateries. He has worked at Jules Pizza, Pennsylvania Soup and Seafood, Penn Tap Room, 86 West, and The Bucks Club. He credits his expertise to extensive experience, reading, researching, and trying new things.  </span></p>\n<p class=\"p5\"><span class=\"s3\">This year, the restaurant is planning to introduce a new menu and expand its services. In line with Harper’s vision, the menu will feature upscale items and will include fusions of southern food and other cultures. “I just don’t want to be like anyone else,” Harper says. “I am not fearful of change and I never want to be boring.”</span></p>\n<p class=\"p5\"><span class=\"s3\">Short term goals include continuing to cater parties. Customers can rent the downstairs space of next door bar, Hopscotch, to which some refer as The Lion’s Den. Harper also owns his own catering company, Jamal Harper Cooks and Caters. (<a href=\"http://jamalharpercooks.com\" target=\"_blank\" rel=\"noopener noreferrer\">jamalharpercooks.com</a>)</span></p>\n<p class=\"p5\"><span class=\"s3\">Long term goals include new locations, a food truck, and possibly packaging their goods for sale in grocery stores and co-ops. The team plans to slowly grow without overstepping its capabilities. In the year since the opening, staff has been through a lot of learning and growth.  </span></p>\n<p class=\"p5\"><span class=\"s3\">If you’re wondering who Penny is, it is Lyndsay’s alter-ego. She says she has always loved the name and has used it to help her with personal growth, development, and to challenge herself.  </span></p>\n<p class=\"p5\"><span class=\"s3\">I am excited to see what will be on the menu next. For now though, I took home two pounds of coffee dry-rubbed chicken wings for dinner.  And to be honest with you, they were gone rather quickly. </span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/10/PastedGraphic-1.jpg"
}