{
  "id": 12774,
  "title": "Holi: Festival of Colors, Spring, and Love!",
  "slug": "holi-festival-of-colors-spring-and-love",
  "date": "2022-04-14T21:50:35",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Play",
    "Style",
    "Taste"
  ],
  "tags": [
    "and Love!",
    "Burpee Park",
    "doylestown cardinal",
    "Holi: Festival of Colors",
    "Spring"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer On Saturday, April 23rd, from 1:30-4:30 pm, bring your children, your friends, your family and your neighbors to the most colorful and fun event you can imagine: the Holi celebration at Burpee Park.  This inaugural celebration, which is free to the public, marks the Indian festival Holi. [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Dana Roberts • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">O</span><span class=\"s1\">n Saturday, April 23rd, from 1:30-4:30 pm, bring your children, your friends, your family and your neighbors to the most colorful and fun event you can imagine: the Holi celebration at Burpee Park.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">This inaugural celebration, which is free to the public, marks the Indian festival Holi. The event is hosted by Desis of Doylestown, a newly formed non-profit that brought the amazing Diwali celebration to Burpee Park in November 2021.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Where does the name Desis of Doylestown come from? A Desi is a person of Indian, Pakistani, Bangladeshi, Sri Lankan or Nepali descent. Desis of Doylestown was created in the fall of 2021, after being inspired by the activism and dedication of Central Bucks student Paree Pasi. Pasi, now 17 years old and a junior, had petitioned to have Diwali, the festival of lights and one of the major festivals celebrated by Hindus, Jains, and Sikhs, recognized as a holiday on the school calendar at the end of the 2020-2021 school year.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Upon learning in September of 2021 that Diwali would in fact be recognized, community members were so excited and joined together to harness that excitement into a community-wide celebration of Diwali. Local residents and members of the Indian community Sheela Rai and Silvi Haldipur were joined by Doylestown borough resident Larissa, ‘Lolly,’ Hopwood, a children’s musician and activist, and Marlene Pray, human rights advocate and community organizer. These women met with Paree Pasi, the student who had set it all into motion, and between them, the idea for the Diwali event at Burpee </span><span class=\"s3\">Park took shape. The event, brainstormed only three weeks before the actual holiday, was embraced by Borough Council, and many members of the community came together to support it. It featured food, music, children’s activities, BollyX dance lessons, and henna art, and drew a large, diverse crowd.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">While planning the Diwali event, Desis of Doylestown was born, and now has 57 members. At their first group meeting in December 2021, the group established the common goal of raising awareness, educating, and opening hearts and minds in Bucks and Montgomery counties to the Desi community.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Their aim is to do so by sharing their rich culture, traditions, and customs, while also creating a space and place for their small community to foster a sense of belonging through community engagement. Being that Holi was the next big festival following Diwali, the group made it part of their mission to plan a wonderful celebration.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Holi is the festival of colors. It is celebrated as a two-day festival in India, typically in March or April (depending on the Lunar calendar). The first day is celebrated as Holika Dahan. After sunset, people gather around a bonfire, perform prayers (called puja) and then light it. People sing and dance around the bonfire as it symbolizes the triumph of good over evil.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">The second day of Holi is called Dhulandi. This is the day people apply colors to one another. Kids play with dry colors called Gulal. Groups of people also sing and dance on the streets, going from one place to another.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">At the Holi celebration at Burpee Park on April 23rd, attendees can expect dancing, food, music, children’s activities, canvas painting, and playing with color (cornstarch-based powder of all different hues). Much like the colors you might experience if you’ve ever raced in a Color Run (whose premise was borrowed from Holi!), attendees of this colorful party can expect to emerge wearing a rainbow.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Sheela Rai, founding member of Desis says: “We’re going to be throwing colors at each other. It’s going to be a party!” It’s an event to wear your knock-around clothes (or your tie-dye) to, not your best attire. More importantly, it’s an event that will inspire you to embrace love and happiness.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">As Desis member and group leader Darshana Patel said about the Holi holiday: “We laugh. We forget, we forgive. We repair any broken relationships. Holi symbolizes good over evil. We want to spread happiness and love through this.”<span class=\"Apple-converted-space\">  </span>This is certainly a message we can all benefit from.</span></p>\n<p class=\"p5\"><span class=\"s1\">For more information regarding the event (including parking, schedule of events, and weather updates) or Desis of Doylestown, please visit <a href=\"http://desisofdoylestown.org\" target=\"_blank\" rel=\"noopener noreferrer\">desisofdoylestown.org</a>, or follow Desis of Doylestown on Instagram or Facebook.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/04/Holi-Photo.jpg"
}