{
  "id": 11738,
  "title": "Holidays at Fonthill Castle",
  "slug": "holidays-at-fonthill-castle-2",
  "date": "2021-12-09T15:41:50",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Style",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Fonthill Castle",
    "mercer museum"
  ],
  "excerpt": "<p>The Mercer Museum &amp; Fonthill Castle are pleased to present their 2021 Holiday programming schedule with community events that will take place throughout the holiday season at Fonthill Castle (525 East Court Street, Doylestown), the home and showplace of Henry Chapman Mercer, located in Doylestown, the heart of Bucks County, PA. This year, there are [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">T</span><span class=\"s2\">he Mercer Museum &amp; Fonthill Castle are pleased to present their 2021 Holiday programming schedule with community events that will take place throughout the holiday season at Fonthill Castle (525 East Court Street, Doylestown), the home and showplace of Henry Chapman Mercer, located in Doylestown, the heart of Bucks County, PA.</span></p>\n<p class=\"p3\"><span class=\"s2\">This year, there are three different ways to visit Fonthill Castle during the holiday season:</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">Fonthill Castle Daily One-Hour Guided Tours</span></strong></p>\n<p class=\"p6\"><i>Select dates began on November 19, 2021 • $15 Adults/Free Members/$13 Senior (65 and up)/$10 Student/$8 Youth (6-17)/Free Ages 5 and under<span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p3\"><span class=\"s2\">Throughout the holiday season, our daily one-hour guided tours of historic Fonthill Castle showcase Henry Mercer’s home decked out for the holidays while sharing the history of Mercer and the construction of this unbelievable property. Fonthill Castle’s interior features Mercer’s renowned, handcrafted ceramic tiles designed at the height of the Arts and Crafts movement, and the castle serves as an early example of reinforced concrete architecture with forty-four rooms, two hundred windows, and eighteen fireplaces.</span></p>\n<p class=\"p5\"><strong>Holiday Lights Meander: 30-Minute “On Your Own” Timed Holiday Experience</strong></p>\n<p class=\"p6\"><i>Saturdays &amp; Sundays: December 4 &amp; 5, 2021 December 11 &amp; 12, 2021 December 18 &amp; 19, 2021 10:00 a.m. – 7:30 p.m. 30-minute timed entry slots, every 10 minutes</i></p>\n<p class=\"p6\"><i>Special Dates &amp; Times: December 24, 2021 (Christmas Eve Day) December 31, 2021 (New Year’s Eve Day)</i></p>\n<p class=\"p6\"><i>10:00 a.m. – 1:00 p.m. 30-minute timed entry slots, every 10 minutes</i></p>\n<p class=\"p6\"><i>$25 Adults/$20 Member Adults/$10 Youth (6-17)/$5 Child (5 and under)</i></p>\n<p class=\"p3\"><span class=\"s2\">Explore the special 2021 Holiday Lights Meander route with your loved ones and spend 30 minutes gazing at the splendor of the holiday decorations of historic Fonthill Castle on your own. Our knowledgeable tour guides will be available along the holiday route to answer your questions and make this a seasonal experience to remember for the whole family.</span></p>\n<p class=\"p5\"><strong>Fonthill Castle Guided Evening Tours</strong></p>\n<p class=\"p6\"><i>Tuesdays &amp; Wednesdays: December 7 &amp; December 8, 2021 December 28 &amp; December 29, 2021</i></p>\n<p class=\"p6\"><i>Tour times begin at 5:00 p.m. Last tour is at 6:45 p.m.</i></p>\n<p class=\"p6\"><i>$25 Adults/$20 Member Adults/$10 Youth (6-17)/$5 Child (5 and under)</i></p>\n<p class=\"p3\"><span class=\"s2\">Delight in the splendor of a guided historic evening tour at Fonthill Castle decked out for the holidays. Fonthill Castle was the home of Henry Chapman Mercer and an early example of reinforced concrete architecture. Discover Mercer’s renowned ceramic tiles during these intimate 45-minute guided historic tours of the castle’s unique rooms and artifacts.</span></p>\n<p class=\"p3\"><span class=\"s2\">Holidays at Fonthill Castle has been supported by Penn Color and Bountiful Acres.</span></p>\n<p class=\"p3\"><span class=\"s2\">Advanced tickets are highly recommended for all of these holiday events as they sell out every year. Please book early to avoid disappointment. Tickets are non-refundable and non-transferable and cannot be exchanged for a new date or time.</span></p>\n<p class=\"p3\"><span class=\"s2\">Guests should arrive 10 minutes prior to their start time, as late arrivals may not be accommodated. Parking is available in the Fonthill Castle parking lot off of the main site entrance on Swamp Road (Rt. 313), and check-in is located at the Fonthill Castle Welcome Center.</span></p>\n<p class=\"p3\"><span class=\"s2\">Due to its historic nature, Fonthill Castle has limited accessibility with steep stairs and narrow, uneven passages throughout the site. Fonthill Castle is open Tuesday through Sunday from 10:00 a.m. – 5:00 p.m., and is closed on Thursday, November 25, 2021 (Thanksgiving Day), Saturday, December 25, 2021 (Christmas Day), Saturday, January 1, 2022 (New Year’s Day), and Sunday, January 2, 2022.</span></p>\n<p class=\"p3\"><span class=\"s2\">Tickets to all three experiences are available now at <a href=\"http://mercermuseum.org/holidays\" target=\"_blank\" rel=\"noopener noreferrer\">mercermuseum.org/holidays</a>.</span></p>\n<p class=\"p7\"><strong>The Mercer Museum &amp; Fonthill Castle</strong></p>\n<p class=\"p3\"><span class=\"s2\">Located in Doylestown, Bucks County, PA, the Mercer Museum and Fonthill Castle are historic castles celebrating the legacy of Henry Chapman Mercer (1856-1930), American archaeologist, anthropologist, ceramicist and scholar. Both sites are operated by the Bucks County Historical Society (BCHS).</span></p>\n<p class=\"p3\"><span class=\"s2\">The Mercer Museum, one of Bucks County’s premier cultural attractions and a Smithsonian affiliate, features both local and national seasonal exhibits as well as a core museum collection of over 50,000 pre-Industrial tools. This permanent collection offers visitors a unique window into pre-Industrial America through sixty different crafts and trades, and is one of the world’s most comprehensive portraits of American material culture.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">The Mercer Museum is located at 84 South Pine Street, Doylestown, PA, 18901. Fonthill Castle is located at 525 East Court Street in Doylestown, PA, 18901.</span></p>\n<p class=\"p3\"><span class=\"s4\">For up-to-date ticket and schedule information, please visit <a href=\"http://mercermuseum.org\" target=\"_blank\" rel=\"noopener noreferrer\">mercermuseum.org</a>.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/12/Holidays-at-Fonthill-Castle.jpg"
}