{
  "id": 18874,
  "title": "Honest To Betsy: “What Makes Me Different Also Makes Me Creative”",
  "slug": "honest-to-betsy-what-makes-me-different-also-makes-me-creative",
  "date": "2024-01-30T15:57:36",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Play"
  ],
  "tags": [
    "doylestown cardinal",
    "Kira Coviello"
  ],
  "excerpt": "<p>By Julie Jules • The Cardinal Contributing Writer It all started with a joke. Laughing with friends on a group text, Doylestown resident Kira Coviello commented about how she was a housewife now and sent a video of herself darning her husband Noah’s socks. Her friends found it hilarious and said to “put that on [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Julie Jules • </strong></em>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">It all started with a joke. Laughing with friends on a group text, Doylestown resident Kira Coviello commented about how she was a housewife now and sent a video of herself darning her husband Noah’s socks. Her friends found it hilarious and said to “put that on the internet”.  This is, quite simply,  how Honest to Betsy was born.  </span></p>\n<p class=\"p4\"><span class=\"s2\">It happened very fast.  Within six months or so, Honest to Betsy has become a TikTok and Instagram sensation with 51K and 122K followers. The star of the show is Betsy, a 1950s housewife who Coviello describes as “innocent, but not.” She’s beautiful, impeccably dressed, multi-talented, and, most of all, incredibly funny.  Betsy dresses in gorgeous vintage outfits and is seen doing various comedic skits involving music, cooking, reading, and even chickens. </span></p>\n<p class=\"p4\"><span class=\"s3\">Coviello has been an actor, performer, and dancer all of her life.  Recently, she had to leave a job that she loved for personal reasons. She had never stopped working in her adult life, even while having her babies strapped onto her back. This was a very new experience for her. With Honest to Betsy, she found a new adventure to channel her creativity.  </span></p>\n<p><a href=\"/data/media/image12.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-large wp-image-18880\" src=\"/data/media/image12-942x1024.jpeg\" alt=\"\" width=\"942\" height=\"1024\" srcset=\"/data/media/image12-942x1024.jpeg 942w, /data/media/image12-276x300.jpeg 276w, /data/media/image12-768x835.jpeg 768w, /data/media/image12-990x1076.jpeg 990w, /data/media/image12.jpeg 1170w\" sizes=\"auto, (max-width: 942px) 100vw, 942px\" /></a></p>\n<p class=\"p4\"><span class=\"s2\">“I thought my performing career was over,” Coviello said. Instead, she is having the time of her life, creating almost daily skits and constantly wowing her audience.</span></p>\n<p class=\"p4\"><span class=\"s2\">In some of the videos, Betsy is dancing (and boy, can she dance!) to Tom Lehrer and other old-time musicians who sang very suggestive songs that were not at all what you would imagine to even exist during that time period. “People have always had this hilariously dirty mind,” Coviello says. “No one has ever been pure in the music industry. I love history, I love learning about this kind of thing so this is right up my alley.” </span></p>\n<p class=\"p4\"><span class=\"s2\">As her friend Adi Strigl remarked, Coviello “is the only person I know who can crochet a gigantic octopus, play the accordion after one day of learning, turn into a method actress without breaking character, lift their sexy leg up high while talking to chickens and puppets, master pantomime with various background music and sounds, light up a whole room of seniors playing the violin, make pesto sauce from scratch… and this is just scratching the surface of all her multi-talents!”</span></p>\n<p><a href=\"/data/media/image10.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-large wp-image-18878\" src=\"/data/media/image10-819x1024.jpeg\" alt=\"\" width=\"819\" height=\"1024\" srcset=\"/data/media/image10-819x1024.jpeg 819w, /data/media/image10-240x300.jpeg 240w, /data/media/image10-768x960.jpeg 768w, /data/media/image10-990x1238.jpeg 990w, /data/media/image10.jpeg 1000w\" sizes=\"auto, (max-width: 819px) 100vw, 819px\" /></a></p>\n<p class=\"p4\"><span class=\"s2\">What’s her secret? “It’s because I’m neurodivergent,” Coviello explains. “I have ADHD. I take great pride in it. It’s taken my whole life to figure out that what makes me different also makes me creative. I’m learning how to harness that, hone in on it, and embrace it. I’m following the dopamine.” </span></p>\n<p class=\"p4\"><span class=\"s2\">The hardest part for her is doing hair and make-up each day,” Coviello says. As a self-described “sweatpants goblin,” she finds getting ready tasks to be time-consuming. “The rest of it is just fun,” she says. </span></p>\n<p class=\"p4\"><span class=\"s2\">What does the future hold? Coviello says she is simply seeing where the wind blows. And the wind is blowing her in many exciting directions. A vintage clothing company sent her accessories so that she could make a reel featuring them. Podcast interviews (one of which is Make Do and Mend which will be out soon) and a few exciting offers are also in the works.</span></p>\n<p class=\"p4\"><span class=\"s2\"> “I’m having fun with Betsy and now I’m learning the accordion,” Coviello says. “Never in my life did I think I would learn the accordion. But watch out Weird Al, I’m coming for you because I am going to start writing satire songs!” </span></p>\n<p class=\"p4\"><span class=\"s2\">Her goal is simple: to keep making art that makes her happy and that brings joy to others. Goal achieved, Betsy.  </span></p>\n<p class=\"p5\">Instagram: @honest2betsy</p>\n<p class=\"p5\">TikTok: honest_2_betsy</p>\n<p class=\"p5\">Facebook: Honest 2 Betsy</p>\n<p class=\"p5\"><a href=\"http://www.honest2betsy.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.honest2betsy.com</a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/01/image7.jpeg"
}