{
  "id": 12871,
  "title": "Honoring Mothers Who Experience Miscarriage",
  "slug": "honoring-mothers-who-experience-miscarriage",
  "date": "2022-04-27T09:42:37",
  "author": "Staff",
  "category": [
    "Fit"
  ],
  "tags": [
    "Britt Around Town",
    "brittany brown",
    "doylestown cardinal",
    "miscarriage",
    "mother's day"
  ],
  "excerpt": "<p>While May is the month that we celebrate mothers, it&#8217;s important to recognize that Mother&#8217;s Day can be a complicated day for many people. For those who are yearning to be mothers but haven&#8217;t yet had their child enter their lives, for those who no longer have a mother, or for those mothers who are [&hellip;]</p>\n",
  "content": "<p class=\"p1\">While May is the month that we celebrate mothers, it&#8217;s important to recognize that Mother&#8217;s Day can be a complicated day for many people. For those who are yearning to be mothers but haven&#8217;t yet had their child enter their lives, for those who no longer have a mother, or for those mothers who are in a difficult phase of mothering, celebrating might be the last thing they want to do on Sunday, May 8th. For women who have experienced miscarriage, this day, in particular, might be fraught with emotion: grappling with the mixed emotions of recognizing the beauty of the little one they carried within while also remembering and mourning that loss.</p>\n<p class=\"p1\">Miscarriage, once an experience rarely discussed, has, in recent years, become more widely talked about and recognized. Having an open conversation is vital as it is so common: more than 3 million cases of miscarriage occur in the U.S. each year, and about 10 to 20 percent of known pregnancies end in miscarriage. Yet knowing the frequency of miscarriage can&#8217;t assuage the tremendous amount of pain and the personal rollercoaster of emotions a woman (and her partner and loved ones) experiences. Every woman who has experienced a miscarriage has a different story to share. Brittany Brown, the woman behind Britt Around Town, has bravely and eloquently opened up about her miscarriages and her path to motherhood.</p>\n<p><a href=\"/data/media/image0.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-12872\" src=\"/data/media/image0.jpeg\" alt=\"\" width=\"1373\" height=\"2048\" srcset=\"/data/media/image0.jpeg 1373w, /data/media/image0-201x300.jpeg 201w, /data/media/image0-768x1146.jpeg 768w, /data/media/image0-687x1024.jpeg 687w, /data/media/image0-990x1477.jpeg 990w, /data/media/image0-1320x1969.jpeg 1320w\" sizes=\"auto, (max-width: 1373px) 100vw, 1373px\" /></a></p>\n<p class=\"p1\">Brittany and her husband, Pete, had been trying to conceive for some time when they learned they were pregnant for the first time in early October 2019. They were elated when they discovered this news. Brittany had had an inkling she was pregnant because she felt very short of breath, which was unlike her. She got swept up in the excitement of being pregnant but then experienced a traumatic turn of events: she started bleeding between weeks 8-9 of pregnancy. She went into her doctor&#8217;s office and was told there was no heartbeat upon having an ultrasound. Brittany was scheduled for a dilation and curettage, the medical procedure that removes tissue from inside the uterus, but the night before, her body fully engaged in miscarrying. Brittany said it felt like she was dying, and she wound up calling the emergency line for her doctor and was informed that her body was essentially going into labor. She still had to have the medical procedure the next day, and she and her husband were devastated by the loss.</p>\n<p class=\"p1\">Still, they began trying to conceive again intermittently through the remainder of 2019 and into 2020. In September 2020, Brittany learned she was pregnant again while traveling. However, she sensed that the pregnancy wasn&#8217;t going to last. Brittany didn&#8217;t feel &#8220;pregnant&#8221; this time, and when she took a test, the line indicating that she was pregnant was very, very faint. She tested every day for 4-5 days, but the line indicating pregnancy didn&#8217;t get darker. Upon returning home, she had bloodwork drawn and learned that she was no longer pregnant. She had experienced a chemical pregnancy, a very early miscarriage that happens within the first five weeks of pregnancy. She and her husband again found themselves grieving.</p>\n<p class=\"p1\">On September 12th, 2021, Brittany and her husband learned that she was pregnant again. At this point, they had been trying to conceive for more than two years. She knew her body&#8217;s cycle and had been testing and monitoring her ovulation pattern. They were overjoyed and shared the news with their community. But tragically, that pregnancy ended in a miscarriage as well. Following that loss, Brittany bravely shared the news on social media, saying, &#8220;And just like that… my magical moment is over, and once again, I am a mommy to yet another angel baby. My husband and I now have three little angels that have come to watch over us over the span of this two-year journey so far.&#8221;</p>\n<p><a href=\"/data/media/image1.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-12873\" src=\"/data/media/image1.jpeg\" alt=\"\" width=\"1280\" height=\"818\" srcset=\"/data/media/image1.jpeg 1280w, /data/media/image1-300x192.jpeg 300w, /data/media/image1-768x491.jpeg 768w, /data/media/image1-1024x654.jpeg 1024w, /data/media/image1-990x633.jpeg 990w\" sizes=\"auto, (max-width: 1280px) 100vw, 1280px\" /></a></p>\n<p class=\"p1\">For Brittany, her miscarriages have been a shattering experience. When she got pregnant the first time, Brittany was the healthiest she&#8217;d ever been, exercising and maintaining a healthy weight. But once she had her first miscarriage, Brittany felt deceived by her body, confounded as to why she couldn&#8217;t maintain the pregnancy when she was at her healthiest, and dissuaded from the desire to keep up her healthy habits. Within the first 6-8 months after her first miscarriage, she gained 65-70 pounds. It was an incredibly stressful and difficult time.</p>\n<p class=\"p1\">Recently, Brittany&#8217;s mindset has shifted. She realized that by not living a healthier lifestyle, she wasn&#8217;t giving her future babies a chance and wasn&#8217;t giving herself the life she felt best and happiest in. She knows she needs and wants to be as healthy as possible, as it gives her the most energy and confidence. She and her husband are currently taking a hiatus from trying to conceive, and she is focusing on regaining her health and losing weight. There have been a lot of changes in her life, including a new full-time job and the expansion of Britt Around Town, and she says that she wants to be in a period of greater stability when she tries to conceive again.</p>\n<p class=\"p1\">While her miscarriages and the experience of trying to conceive over the past few years have been incredibly stressful, she is glad that she&#8217;s been able to share her story and help to encourage others to share theirs, as well. Brittany says that she never wants her angels to be a secret. They were in her life and are a part of her. She wants others who experience miscarriage to know that they are not alone, and miscarrying wasn&#8217;t the result of something they did wrong. She reminds all women who endure miscarriage that it&#8217;s okay to feel sad and grieve and allow themselves to experience any emotions they might feel, especially surrounding children or pregnancy. The pain of miscarriage is incredibly difficult, but Britt has shown that both finding a path forward and holding the grief in your heart is possible.</p>\n<p><a href=\"/data/media/image4.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-12875\" src=\"/data/media/image4.jpeg\" alt=\"\" width=\"1360\" height=\"2047\" srcset=\"/data/media/image4.jpeg 1360w, /data/media/image4-199x300.jpeg 199w, /data/media/image4-768x1156.jpeg 768w, /data/media/image4-680x1024.jpeg 680w, /data/media/image4-990x1490.jpeg 990w, /data/media/image4-1320x1987.jpeg 1320w\" sizes=\"auto, (max-width: 1360px) 100vw, 1360px\" /></a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/04/image2.jpeg"
}