{
  "id": 12718,
  "title": "How to Start Your Personal Development Journey",
  "slug": "how-to-start-your-personal-development-journey",
  "date": "2022-04-12T14:27:09",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "julie druzak"
  ],
  "excerpt": "<p>By Julie Druzak • The Cardinal Contributing Writer It’s Springtime, which means symbolizes beginnings.  The weather is beginning to warm up, the flowers are beginning to bloom and all around us our neighbors are coming back to life! This is a change to rid yourself of all the bad winter habits and start fresh.  Here [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Julie Druzak • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">It’s Springtime, which means symbolizes beginnings.<span class=\"Apple-converted-space\">  </span>The weather is beginning to warm up, the flowers are beginning to bloom and all around us our neighbors are coming back to life! This is a change to rid yourself of all the bad winter habits and start fresh.<span class=\"Apple-converted-space\">  </span>Here are five personal development goals you can use to start your Spring off right! </span><span class=\"s3\"><span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><strong><span class=\"s4\">1.</span></strong><span class=\"s2\"><strong> Seek guidance through entertainment.</strong> Find a motivating and positive podcast that inspires you. I would recommend Lewis Howes School of Greatness at https://lewishowes.com/sogpodcast, though there are many other great ones out there! Another great way to seek guidance and continue developing yourself is through self-help books. Try reading one personal development-oriented book a month and see how the advice helps you!</span></p>\n<p class=\"p3\"><strong><span class=\"s5\">2.</span></strong><span class=\"s6\"><strong> Surround yourself with positivity.</strong> With social media being such a prominent part of our daily lives, controlling what you see can be a great step towards improving your overall wellbeing. Fill your social medias, whether it be TikTok, Instagram, Twitter, or Facebook, with positive affirmations and influences by following people and leaders who inspire you!</span></p>\n<p class=\"p3\"><strong><span class=\"s4\">3</span><span class=\"s7\">. </span></strong><span class=\"s2\"><strong>Start a gratitude journal.</strong> Take a moment to reflect on 5 things that you are grateful for every morning.<span class=\"Apple-converted-space\">  </span>This will start your day off with the right mindset. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><strong><span class=\"s4\">4.</span> </strong><span class=\"s2\"><strong>Create a strong practice regime.</strong> Creating a routine full of consistency will not only help improve aspects of your daily life, it’ll also help build self-discipline and a stronger mindset.</span></p>\n<p class=\"p3\"><strong><span class=\"s4\">5.</span> </strong><span class=\"s2\"><strong>Stay honest with yourself.</strong> Self-development is achieved through prioritizing yourself and your needs. Establishing a set of boundaries that will aid in making life less stressful is just one of the ways you can put yourself first.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s10\"><i>Julie Druzak, a Doylestown native, is passionate about overall health. She has had various careers in the health industry, including as an aerobics instructor, personal trainer and developing children’s health programs at the YMCA. She has also taught in the New Hope-Solebury district and Bucks County Community College. Find her on Instagram at julie333dance or email her at <a href=\"mailto:juliedruzakhealthandwellness@gmail.com\">juliedruzakhealthandwellness@gmail.com</a>. <span class=\"Apple-converted-space\"> </span></i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/04/I-Can-Do-It.jpg"
}