{
  "id": 16281,
  "title": "Immigrant Rights Action",
  "slug": "immigrant-rights-action",
  "date": "2023-01-10T00:04:35",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "Immigrant Rights Action",
    "Sheela Rai"
  ],
  "excerpt": "<p>By Sheela Rai  • Special to The Cardinal On a cold day in December, I walked into the Immigrant Rights Action office located in Doylestown Borough. I was met with cozy armchairs, a table with toys and books for children, a bookshelf with books I immediately wanted to read, art, and a board of packets [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Sheela Rai<span class=\"Apple-converted-space\">  • </span></strong>Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">O</span><span class=\"s1\">n a cold day in December, I walked into the Immigrant Rights Action office located in Doylestown Borough. I was met with cozy armchairs, a table with toys and books for children, a bookshelf with books I immediately wanted to read, art, and a board of packets and resources. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Three women invited me inside &#8211; Executive Director Heidi Roux, Community Organizer Andrea Lawton, and Service Coordinator Angie Forero. These leaders are also immigrants, who come from El Salvador, Guatemala, and Colombia, respectively. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">They offered me coffee, and within minutes I felt at home. This caring environment is essential, they told me. People come in with sensitive issues; making each person feel safe in a judge-free environment is the organization’s primary goal. For many, it is the first time they can express themselves in their native language to someone who understands them: both their language and their cultural background.</span></p>\n<p class=\"p5\"><span class=\"s1\">Rouz shared a story of a family, recent arrivals from Ecuador. It was a winter day, and the four-year-old girl only had a zip-up hoodie. Roux reached out to volunteers, and they found a local resident who was able to provide her with winter clothing. Lawton explains that before folks can even get to the heart of their problem, the organization ensures basic needs are met &#8211; access to food, clothing, healthcare, and school enrollment.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">With these needs addressed, the organization can offer a screening. This screening is from 30-60 minutes with one of the members of the Immigrant Rights Action team. They gather all the needed information and set up a free consultation with a lawyer to determine if there is a path to regularize the person’s or family’s status. This initial screening and first meeting with a lawyer are essential services. It is often the initial fees, which can range from $150-$250, that present an obstacle for many people.</span></p>\n<p class=\"p5\"><span class=\"s1\">After this initial consultation, Immigrant Rights Action sets a follow-up to review one of three scenarios the clients may fall into:</span></p>\n<p class=\"p5\"><span class=\"s1\">• An attorney has identified an application path to regularize status, and Immigrant Rights Action helps with funds crowd-sourced from their Legal Defense Fund.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">• An attorney has identified an application path, but the clients cannot commit to costs, which can be $3K to $12K; when ready, they can come back.</span></p>\n<p class=\"p5\"><span class=\"s1\">• If no path is identified, they are reminded they are not alone. There are 11 million other undocumented immigrants, and they are provided a know-your-rights training session.</span></p>\n<p class=\"p5\"><span class=\"s1\">The organization also provides free legal clinics every other month, available to anyone on its mailing list.</span></p>\n<p class=\"p5\"><span class=\"s1\">Roux, Lawton, and Forero have extensive backgrounds in immigration advocacy. Forero started Topantiqua, a not-for-profit organization in Guatemala for youth to help them gain confidence through sport. Lawton began Redgua, a network of over 250 Guatemalans in Denver, Co.<span class=\"Apple-converted-space\">  </span>All three began as volunteers for Immigrant Rights Action before taking leadership positions within the organization.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The grassroots organization originated in 2017 when local residents saw a need to support immigrants in our community. From a small group of concerned folks, it evolved into a not-for-profit organization with a board of directors and staff, assisting over 700 immigrants a year.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Immigrant Rights Action also began the Community Leadership Committee, which started with nine and now has a network of over 120 members. Many immigrants feel they need to be “invisible.” This group works to empower each other to hold their heads up high and be active in the community. Some even meet with political leaders, feeling pride in making a difference in our community. This has allowed for a new group to develop called Jovenes Unidos- a group for immigrant and first-generation youth.</span></p>\n<p class=\"p5\"><span class=\"s1\">When asked what their biggest needs are, the three unanimously said: funding. The organization doesn’t receive state or federal funding yet and relies heavily on individual donors. More diversity on the board of directors is another item on the wishlist. Immigrant Rights Actions also seeks members with fundraising and public relations backgrounds to gain the funding needed to support clients.</span></p>\n<p class=\"p5\"><span class=\"s1\">Before leaving the three leaders, I asked them why they do what they do. They lit up as they replied. Roux feels passionate about creating the community she craves for the next generation. A generation that is celebratory of diversity and inclusive of all our neighbors.</span></p>\n<p class=\"p5\"><span class=\"s1\">Lawton enjoys empowering the community and being able to serve as a resource to those in need. Forero welcomes the ability to help, even with the small things. “In giving access to health insurance or clothes, I was able to provide a small relief,” she says. “To my clients, I can say, ‘I know you have a sea of problems, but I can give you this small boat to hold on to’.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">If you are an immigrant or know an immigrant who needs support, the Immigrant Rights Action located at 70 West Oakland Avenue, suite 200 in Doylestown, welcomes all during walk-in hours (Tues, Wed, Thurs 10 am-2 pm). Email <a href=\"mailto:info@immigrantsrightsaction.org\">info@immigrantsrightsaction.org</a> or call 267-910-9030 can also be ways to get assistance.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The folks at Immigrant Rights Action will find a way to provide support. They have provided help and resources for immigrants from Guatemala, Mexico, Honduras, El Salvador, Colombia, Venezuela, Ukraine, Syria, Sri Lanka, Vietnam, Korea, Algeria, Afghanistan, and more.</span></p>\n<p class=\"p5\"><span class=\"s1\">Si usted es un inmigrante o conoce a un inmigrante que necesita apoyo, puede ir a la oficina en 70 West Oakland Avenue, Suite 200 Doylestown PA, durante horas comunitarias (mar, mier, jueves de 10am-2pm) email a <a href=\"mailto:info@immigrantrightsaction.org\">info@immigrantrightsaction.org</a>, o llamar a 267-910-9030 para obtener ayuda. La gente de Immigrant Rights Action encontrará una manera de apoyarlo. Han proporcionado ayuda y recursos para inmigrantes de: Guatemala, Mexico, Honduras, El Salvador, Colombia, Venezuela, Ucrania, Siria, Sri Lanka, Vietnam, Corea, Argelia, Afganistán y más.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/01/Immigration.jpeg"
}