{
  "id": 11729,
  "title": "Kin Wellness and Support Center",
  "slug": "kin-wellness-and-support-center",
  "date": "2021-12-09T15:34:45",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "Keith Fenimore",
    "Kin Wellness and Support Center"
  ],
  "excerpt": "<p>By Jessica Ramoy • The Cardinal Managing Editor Pine2Pink is probably familiar to most locals. For the past 4 years, Keith Fenimore and his family have led the charge as Pine2Pink has “taken over” several towns across Bucks County every October.  For Breast Cancer Awareness Month, Pine2Pink holds several events, changes light colors to pink [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Jessica Ramoy • </b>The Cardinal Managing Editor</p>\n<p class=\"p3\"><span class=\"s2\"><i>P</i></span><span class=\"s2\"><i>ine2Pink is probably familiar to most locals. For the past 4 years, Keith Fenimore and his family have led the charge as Pine2Pink has “taken over” several towns across Bucks County every October.<span class=\"Apple-converted-space\">  </span>For Breast Cancer Awareness Month, Pine2Pink holds several events, changes light colors to pink and partners with local businesses to raise awareness and money for LOCAL breast cancer patients.<span class=\"Apple-converted-space\"> </span></i></span></p>\n<p class=\"p5\"><span class=\"s3\"><i>Already busy with a full-time job, a wife, 2 adorable kids, and the non-profit, Keith was given a request he could not turn down. This request changed the course of his life. He quit his full-time job and started a second non-profit in order to carry out the vision of local cancer patient Corinne Sikora. This vision is a holistic healing center that is free for ALL cancer patients and their care takers.<span class=\"Apple-converted-space\"> </span></i></span></p>\n<p class=\"p5\"><span class=\"s3\"><i>The Cardinal had the pleasure of sitting down with Keith this month to learn more about the Kin Wellness and Support Center inspired by Corinne Sikora. <span class=\"Apple-converted-space\"> </span></i></span></p>\n<p class=\"p1\"><b>What started you on your path to build a non-profit? Why cancer?</b></p>\n<p class=\"p6\"><span class=\"s1\">Every non-profit leader needs a motivation, in my case I had several!<span class=\"Apple-converted-space\">  </span>I launched my first 501(c)(3) Pine2Pink with my family in 2018.<span class=\"Apple-converted-space\">  </span>I wanted to memorialize my grandmother and honor my mom who is a breast cancer survivor.<span class=\"Apple-converted-space\">  </span>I wanted to channel my energy and talents toward helping the greater good in my Community. I wanted to show my kids, rather than preach to them and I wanted to innovate in the fundraising space as I felt it was antiquated in a lot of ways. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">So for a handful of years, my family and I (and Brittany Brown), grew Pine2Pink and before we knew it we were in six towns across Bucks County and have helped over 1000 breast cancer patients. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">The next chapter of the non-profit journey began when a woman I never met literally changed the course of my life. From a hospital room bed, while battling breast and brain cancer, Corinne Sikora outlined details of a non-medical, all-inclusive wellness and support center for cancer patients.<span class=\"Apple-converted-space\">  </span>Beyond the services and support, she wanted it to be free to all who needed it across Bucks County. Corinne shared the details with her lifelong friend Alyssa Walloff and instructed Alyssa to get in touch with Pine2Pink, to see if they could make the Center a reality.<span class=\"Apple-converted-space\">  </span>Corinne passed November 25, 2020 and a year later the Center opened its doors. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">Because of her selflessness and her community-minded focus, Corinne Transue Sikora inspired; Kin Wellness and Support. I often say the Center is not in Corinne’s memory, but because of her vision.</span></p>\n<p class=\"p1\"><b>What was the vision for this center?<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p6\"><span class=\"s1\">Corinne envisioned a warm and welcoming environment. A place where cancer patients AND their caregivers could congregate and talk. Easy access, one-level and centrally located in Bucks County. She wanted everything under one roof; integrative services, support, fitness and therapy.She requested ample outdoor space to support gardening as a therapy, live music for date nights, a nutrition program with food demonstrations and a place to unplug from the day-to-day doctor visits and reconnect with one’s self. </span></p>\n<p class=\"p1\"><b>What were your first thoughts when Corinne’s friend Alyssa Walloff came to you with this grand task?  Give us a brief timeline of events of how her vision turned into reality.</b></p>\n<p class=\"p6\"><span class=\"s1\">When I was first contacted by Alyssa and read Corinne’s wish I went through a lot of emotions. I was heartbroken, honored, overwhelmed, invigorated and determined almost all at the same time. I immediately tried to answer Alyssa’s message and give some advice that I thought was useful, but soon realized a response that started “If I were you, this is what I would do” wouldn’t do justice, so I did the only sensible thing, and dove in headfirst. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s4\">In February we started a new non-profit to run the Center called Main St. Missions. We launched with an announcement press release on February 17, 2021. Then we did a budget forecast which led the course of our fundraising efforts and by July we had over $245,000!<span class=\"Apple-converted-space\">  </span>We secured a 5,000 sq. ft. location in August. We began renovations and opened in December.<span class=\"Apple-converted-space\">  </span>It has been a whirlwind.</span></p>\n<p class=\"p6\"><span class=\"s1\">Along the way we were advised by some amazing people who were early adopters to the project; Dr. Shelly Hayes, Alyssa Walloff, Jean Transue, Matt Sikora, Jeff Sklar, Kristina Fenimore and Nancy Catricks.</span></p>\n<p class=\"p1\"><b>Everything in the center was donated… can you tell us about the community involvement?</b></p>\n<p class=\"p6\"><span class=\"s1\">If people aren’t convinced we live in a special place, I am sure what they are about to read will change that…</span></p>\n<p class=\"p8\"><b>• Hendrixson Furniture &#8211; </b>The Center’s furniture</p>\n<p class=\"p8\"><b>• Indigenous Ingenuities</b><span class=\"Apple-converted-space\">  &#8211; </span>Building Zen garden and labyrinth which will provide 2,200 sq ft of outdoor space</p>\n<p class=\"p8\"><b>• Organnons Natural Market &#8211; </b>Providing all our organic food and juice</p>\n<p class=\"p8\"><b>• JR Maxwell and Mink Run Millwork</b> &#8211; Kitchen</p>\n<p class=\"p8\"><b>• Jarrett Vaughan Builders</b><span class=\"Apple-converted-space\">  &#8211; </span>Custom welcome desk and store front</p>\n<p class=\"p8\"><b>• Green St. Real Estate</b><span class=\"Apple-converted-space\">  &#8211; </span>$120,000 in-kind donation</p>\n<p class=\"p8\"><b>• Ralph Fey</b> &#8211; Architectural services</p>\n<p class=\"p8\"><b>• Marble Source Inc.</b> &#8211; Counter tops</p>\n<p class=\"p8\"><b>• Greenleaf Nursery</b> &#8211; Interior plants</p>\n<p class=\"p8\"><b>• Doylestown Bookshop &#8211; </b>Hosting book drives for our library and is donating 10 new books per month</p>\n<p class=\"p8\"><b>• The Larder</b> &#8211; Unlimited supply of tea</p>\n<p class=\"p8\"><b>• Facenda Renovations</b> &#8211; Plumbing work<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p8\"><b>• Nickum Schneider Electric</b><span class=\"Apple-converted-space\">  &#8211; </span>Electrical work<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p8\"><b>• Tom Adams</b> &#8211; Kitchen floor and fire door</p>\n<p class=\"p8\"><b>• Thomas Woollam &amp; Steve Feevish</b> Painting services for the main room and the bathroom</p>\n<p class=\"p8\"><b>• Vandergrift Appliances &#8211; </b>Kitchen appliances</p>\n<p class=\"p8\"><b>• Stone Hill Contracting &#8211; </b>Reverse osmosis drinking system</p>\n<p class=\"p8\"><b>• Michael J. Brooks Esquire &#8211; </b>Legal services</p>\n<p class=\"p8\"><b>• Archetype Advisors/Yacht CFO</b><span class=\"Apple-converted-space\">  &#8211; </span>Financial advisement</p>\n<p class=\"p8\"><b>• Gina Alvarez and Stefan Boublil</b><span class=\"Apple-converted-space\">  &#8211; </span>Ongoing design and marketing services and building a new website</p>\n<p class=\"p8\"><b>• Bucks Digital</b> &#8211; All of our printing</p>\n<p class=\"p8\"><b>• New Hope Carpet Cleaners &#8211; </b>Maintenance for our carpets</p>\n<p class=\"p8\"><b>• CP Printing Solutions</b><span class=\"Apple-converted-space\">  &#8211; </span>Marketing and promo materials</p>\n<p class=\"p6\"><span class=\"s1\">The best way to thank these amazing people and businesses is to seek their services when the need arises.<span class=\"Apple-converted-space\">  </span>They certainly have risen to the occasion for our community!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>Tell us about the center? <span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p6\"><span class=\"s1\">Imagine a welcoming spa like environment that feels like a retreat. The flow of the Center features one side that is more frenetic and another that is more of a relaxing lounge. When you walk in, you can pass through one of two doors. Straight ahead will take you to our event space and yoga studio, also a place dedicated as a research station and a small library. The door to the right leads to a large living space with three comfortable seating areas, a kitchen featuring a peninsula that seats seven as well as four practitioner rooms. The outside space that surrounds the Center has four designated seating areas, gardens, raised herb and flower beds, built in benches and our walking meditative labyrinth.</span></p>\n<p class=\"p6\"><span class=\"s1\">A lot of love and kindness has gone into preparing this space, we hope it will resonate with all who visit.</span></p>\n<p class=\"p6\"><span class=\"s1\">If you, or someone you know is in treatment and recovery and interested in enrolling as a guest of the Center visit www.welcometokin.org.<span class=\"Apple-converted-space\">  </span>We also accept patients up to one year clear, as well as special accommodations for our metastatic friends.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>Please tell us about the services that will be available.<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p6\"><span class=\"s1\">Success for us at Kin is defined by our ability to create a place where people feel at ease and where we can curb anxiety and stress and help people get centered.</span></p>\n<p class=\"p6\"><span class=\"s1\">Patients, which we refer to as guests, of Kin can come to the Center for a support group or fitness class or other integrative service, but it is our hope that people will also come to just have a tea, read a book and meet with other guests. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">We have therapy dogs visiting, a guest harpist on rotation, art exhibitions, crafting, gardening, local makers selling goods in our shop and a steady flow of workshops and guest speakers.</span></p>\n<p class=\"p6\"><span class=\"s1\">Our nutrition program pairs top local chefs with nutritionist and dieticians allowing us to provide live cooking demonstrations and give our guests raw food materials to take home and replicate the meals.</span></p>\n<p class=\"p6\"><span class=\"s1\">We even have date nights with live music curated by our musical director, Joe Montone and many other cultural events.</span></p>\n<p class=\"p1\">Our ever-expanding list of services include:</p>\n<p class=\"p6\"><span class=\"s1\">Reflexology, Oncology Massage, Esthetician/Facials, Chiropractic, Acupuncture, Reiki, Meditation, Yoga, Ballet (modified), Barre3 (modified), Pilates (modified), Zumba (modified), Dance Therapy, Tai-Chi</span></p>\n<p class=\"p6\"><span class=\"s1\">To maintain this full slate of amazing offerings, we are constantly on the lookout for local practitioners and experts who want to donate their time and giveback. We encourage practitioners to get in touch with us (267) 544-5981.</span></p>\n<p class=\"p1\"><b>What is the meaning behind the name, Kin?  </b></p>\n<p class=\"p6\"><span class=\"s1\">Kin embraces the community as family and our guests form bonds with others that are intimate and special, and an extension of family. Kin is the embodiment of family and kinship and is a great word to express our essence.</span></p>\n<p class=\"p6\"><span class=\"s5\">The circle around the word Kin in our logo symbolizes the community and peers collectively surrounding the patient and providing uplifting comfort and support; they are not alone. The use of a handwritten font reminds us that this Center is driven by people who are compassionate, real and present.</span></p>\n<p class=\"p1\"><b>Share details about the registry?</b></p>\n<p class=\"p6\"><span class=\"s1\">We have a long list of items we need for the Center, 243 to be exact.<span class=\"Apple-converted-space\">  </span>We figured if people can start a registry for a baby shower or a wedding, why can’t we start one for the non-profit, so we did. Giving is always amplified when a person knows how their donation is being used. So being able to donate something real and tangible, is the perfect way for people to contribute in a meaningful way. We’ve identified everything from folding tables, to cleaning supplies and larger items like computers and treatment chairs. So far 101 items have been purchased off the registry by people in our Community. Anyone interested in donating through the registry can visit:<span class=\"Apple-converted-space\">  </span><a href=\"http://www.myregsitry.com/giftlist/corinnesikoracenter\" target=\"_blank\" rel=\"noopener noreferrer\">www.myregsitry.com/giftlist/corinnesikoracenter</a>.</span></p>\n<p class=\"p1\"><b>How are our local health care institutions getting involved?</b></p>\n<p class=\"p6\"><span class=\"s1\">We are inviting all our local health care providers to collaborate with us. At present Grand View Hospital and Fox Chase Cancer Center are already official sponsors of the Center and we are in active talks with Trinity Health and Penn. Our goal is to be sponsored by all the local Bucks County based hospitals and those outside of our immediate area who care for Bucks County based patients. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>What can the community do to help with Corinne’s vision?<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p6\"><span class=\"s1\">The mantra of our non-profit is “By the Community, For the community.”<span class=\"Apple-converted-space\">  </span>We survive and thrive through the kindness and giving of the Community.<span class=\"Apple-converted-space\">  </span>Local survivor Helen Brown spoke at one of our recent events and said, “Remember the three T’s; time, talent, treasure… every one of us have either Time or Talent or Treasure to give.”<span class=\"Apple-converted-space\">  </span>No truer words could be spoken.<span class=\"Apple-converted-space\">  </span>I’d ask your readers to reflect and decide how they can make an impact!</span></p>\n<p class=\"p6\"><span class=\"s1\">Kin will be fundraising by hosting various events throughout the year. We will rekindle our Restore Tour this Spring, which are beautiful garden parties hosted at feature homes across Bucks County Sponsored by Indigenous Ingenuities. We have a golf outing planned for May 21, and we are looking for sponsors (<a href=\"http://www.kin-golf.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.kin-golf.com</a>) and more events will be announced throughout the year.</span></p>\n<p class=\"p6\"><span class=\"s1\">The creativity within the community to fundraise for the Center has been remarkable. We encourage people to host classes or events for the Center, initiate dress down days at work, and organize local neighborhood or family events that bring people together to help raise money for Kin.</span></p>\n<p class=\"p1\"><b>What other ways can people give? Are you offering Sponsorship?</b></p>\n<p class=\"p6\"><span class=\"s1\">We are inviting people and businesses across Bucks County to join us and become an official Kin Sponsor.<span class=\"Apple-converted-space\">  </span>These annually recurring sponsorships range from $1,500 to $100,000. The $100,000 donation designates a person or business as a Founding Partner. We also have a brokerage account allowing us to accept stock/equity gifts. And in-kind donations are welcomed, depending on the need, for a specific service or item. Inquiries can be made at: <a href=\"http://www.welcometokin.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.welcometokin.org</a> or people can call 267-544-5981</span></p>\n<p class=\"p9\"><b>A word from Corinne’s mom:</b></p>\n<p class=\"p6\"><span class=\"s1\">Jean Transue, Corinne’s mom shares, “Corinne has always been a doer. She got things done. She loved her family and the people in her life. I am blessed to have the family and friends that I do – my children, their spouses and my grandchildren. They have been a great support to me and I feel that Kin will impart that same inclusive feeling to everyone who will benefit from its services. This was Corinne’s dream and I thank everyone who is making this happen.”</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/12/Kin-Wellness-Center.jpg"
}