{
  "id": 11843,
  "title": "Kindness Korner",
  "slug": "kindness-korner",
  "date": "2021-12-15T08:58:58",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "dana roberts",
    "doylestown cardinal",
    "kindness korner"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer In Kindness Korner we want to hear about random acts of kindness you’ve experienced recently. This can be acts from a stranger, a business owner or employee, a teacher, a child . . . anyone. Send your story to jess@doylestowncardinal.com. Please include a picture of the kind [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Dana Roberts • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p1\"><em><span class=\"s1\">I</span><span class=\"s1\">n Kindness Korner we want to hear about random acts of kindness you’ve experienced recently. This can be acts from a stranger, a business owner or employee, a teacher, a child . . . anyone. Send your story to <a href=\"mailto:jess@doylestowncardinal.com\">jess@doylestowncardinal.com</a>. Please include a picture of the kind person if possible (with their permission).<span class=\"Apple-converted-space\"> </span></span></em></p>\n<p class=\"p3\"><span class=\"s2\">T</span><span class=\"s3\">his month’s story of kindness isn’t about a single act, but instead about how kindness and love in their truest form can move from one person, to another, and then carry, through a neighborhood and a community. There is sadness in this story too, but such is life these days &#8211; holding a difficult feeling alongside a beautiful one and realizing that this is sometimes how we must exist in this world, experiencing love and pain simultaneously.</span></p>\n<p class=\"p5\"><span class=\"s3\">This story is about my neighbor Elaine. I met Elaine at the height of the pandemic, when I had a 16-month-old and an infant and took the same loop around our neighborhood every day, letting my toddler stretch her legs while my younger daughter was strapped to my chest in the baby carrier.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">We saw Elaine sitting inside her house on Court Street one day, coloring on her couch, just beyond the front porch. My daughter toddled up the ramp leading up to her front door and banged on the glass, and we introduced ourselves. Elaine smiled at us and asked my children’s names and showed my daughter the picture she’d been coloring through the door.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">I told her we’d be back to visit the next day, because in the spring of 2020, every day was Groundhog Day and our schedule was wide open. And we did go back, several times a week over the next year and a half, and we grew to know Elaine and the neighbors, friends and family that loved and cared for her.</span></p>\n<p class=\"p5\"><span class=\"s3\">Elaine was 92 when we met and told me that she’d lived in Doylestown for much of her life. She was a nurse at Doylestown Hospital for more than 30 years in the Delivery and Recovery Department, and then a private duty and office nurse thereafter. Only recently did I learn that she had delivered over 50 babies herself in her early hospital days!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Elaine was living again in the house she’d grown up in and had cared for her own mother in. She was a well-loved person in the neighborhood, sharing her kindness readily with all. Her father had been a postal worker, and she had a particular fondness for the carriers who delivered her mail. She knew them all by name and gave them Ziploc bags of fancy chocolates. She knit baby blankets for her neighbors’ children and watched their homes when they were away.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Her door was always open, and she was always available to chat, with friends and strangers alike. One man introduced himself to Elaine after months of walking by her home and seeing her sitting on her couch day after day. He dropped off a Phillies visor when she said she loved the Phillies.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Because of her age and a previous fall, Elaine did not venture out of her house much. Instead, the friends and neighbors who Elaine had cared for and loved came to her, checking in on her, bringing her books and puzzles and groceries. A group of ladies from Aunt Judy’s Restaurant, where Elaine had eaten every day for lunch during her retirement, brought her lunch, and her best friend Betty came and sat with her to chat and reminisce.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">During the early days of the pandemic, Elaine couldn’t see her own family, who she loved dearly and spoke with on the phone every day. It was a gift to get to watch a community be there for someone, even if many interactions had to be through the door or masked and brief.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">I met her immediate neighbors, in the twin home she shared a wall with, who brought in her mail and took out her trash and did what they lovingly referred to as a nightly “tuck in service.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">I grew to know her neighbors across the street, a doctor at Doylestown Hospital and his wife, also a former nurse at the hospital, who brought their dog Midge over to sit with Elaine, watched sports with her on TV, and attended to any medical needs she had. All the neighbors on her block on Court Street knew Elaine, and we all treasured her. She knew the history of the block and shared tidbits about each of the homes and their previous owners.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Elaine had a lovely spirit about her. She was even-keeled and calm, curious and loving, inclusive and open-minded. She had a beautiful way of viewing and living out her later years. Even limited to staying on the first floor of her own home, she kept herself busy and her mind active.</span></p>\n<p class=\"p5\"><span class=\"s3\">Elaine passed away recently, at the age of 94, on November 7, 2021. Her passing was sudden and unexpected- one day she was with us, the next day, gone. It felt like a little flame lighting the neighborhood went out.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Sitting at her service the other day, gathered with the friends and family she loved and cared for and who cared for her, it was amazing to see how one woman’s kindness had sparked so much love and kindness in others, as her family and neighbors shared stories about their time with her.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">When my husband and I arrived at the luncheon, of course at Elaine’s beloved Aunt Judy’s Restaurant, the sign on the door said, “We will be closing at 11:30 am Saturday due to the passing of one of our dearest customers,” a true testament to her person (and patronage).<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">Last week was the first time my girls and I walked past Elaine’s house since she moved on from this world. This time, both girls were running, and my younger daughter Lucy, now 20 months old, was shouting “E-aine, E-aine!” as she moved up the ramp. Her older sister Bonnie, who we had explained as best we could about Elaine, turned to her and said “I’m sorry Lucy, Elaine’s not in there now. She’s in Heaven, with God.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">I, of course, turned into a puddle hearing this, but smiled through my tears thinking about how much this kind and wonderful woman had impacted us, and so many others in Doylestown and beyond, and about where a life of kindness ultimately brings us.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/12/Elaine.jpg"
}