{
  "id": 19388,
  "title": "Local Realtor Patrick Mencel Rocks More Than Real Estate",
  "slug": "local-realtor-patrick-mencel-rocks-more-than-real-estate",
  "date": "2024-04-15T23:37:03",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "patrick mencelm doylestown cardinal newspaper"
  ],
  "excerpt": "<p>Question: Tell us about yourself and your music. Answer: Music has always been and will always be a huge part of me. Ever since I can remember I wanted to be recognized for the songs I wrote and the tone of my guitar. Nothing else really sparked my interest. I wanted it so much. I [&hellip;]</p>\n",
  "content": "<p class=\"p3\"><b>Question: Tell us about yourself and your music.</b></p>\n<p class=\"p4\"><span class=\"s1\"><b>Answer: </b>Music has always been and will always be a huge part of me. Ever since I can remember I wanted to be recognized for the songs I wrote and the tone of my guitar. Nothing else really sparked my interest. I wanted it so much. I wanted to be U2, Kings of Leon, Coldplay&#8230; I wanted it so bad it hurt. And I realized that those guys weren’t just playing guitar and writing songs they were creating something so much more. An identity, a brand, and that’s what changed my life forever.</span></p>\n<p class=\"p3\"><b>Q: When did you first get into music and what was your journey like to get to where you are today?</b></p>\n<p class=\"p4\"><span class=\"s1\"><b>A: </b>When I first started playing guitar I had no idea the effect it would have on me. As a young teen, all I ever dreamed of was sounding like Eric Clapton and writing like John Mayer. The more I tried the more obsessed I became. I told myself that I had to be great, there was no alternative. It wasn’t until I was about 25 that I came into my real stride. That’s when the shows I started playing mattered and people wanted to hear the music I recorded. It was that same year I wrote a song, Kiss The Devil, with my band Bel Heir and it went viral. That same year we signed a major label record deal with RCA Records with the same AR as King of Leon and Cage the Elephant.</span></p>\n<p class=\"p3\"><b>Q: You traveled quite a bit before family life, tell us about your travels and your experiences being on the road.</b></p>\n<p class=\"p4\"><span class=\"s1\"><b>A: </b>I spent most of my twenties on the road or in the studio, playing in cities I probably wouldn’t have otherwise ever visited, meeting people, and selling them my band’s merchandise and records. Most of it I spent broke in a van driving eight-hour shifts just to get to the next gig. But all the while inspired and eager to get to the next level &#8211; bigger stage, better hotels, fancier dinners. Whenever I was home I’d be counting down the days to get back on tour. Being in a band was the best education I ever got. I knew no matter what happened in the future that I was living an education that would build my entrepreneurial foundation for the rest of my life. They can tell you about it in school, but they can’t show you.</span></p>\n<p class=\"p3\"><b>Q: You met your wife when you were 16! You now have two beautiful children. How has having a family impacted your music?<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p4\"><span class=\"s2\"><b>A: </b>I knew she was the one because all she ever did was inspire me. Never once did she tell me that my wildest dreams or aspirations were unachievable, instead she swore they were. And she was so sure I would accomplish them. I always knew I’d marry her, not sure why it took as long as it did&#8230; but here we are with two kids and three homes. Every day I pinch myself. And it all stemmed from the first moment I picked up the guitar. I owe everything to music. Though my love for music will never end, the journey of pursuing it professionally has.</span></p>\n<p class=\"p3\"><b>Q: Why Doylestown? How is it for you to be a musician in this community? <span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p4\"><span class=\"s2\"><b>A: </b>Doylestown was where I grew up, though I was a North Penn graduate and my parents raised me in North Wales I was always stumbling into shows at Siren Records or Moose Lodge. I remember trying out new riffs and songs I learned at the open mic Puck Live when I was barely old enough to drive. I remember the giant Xs on my hands written in Sharpies for not being 21 which meant you could play your set then but then immediately leave. Doylestown had a culture that I was attracted to, it felt authentic. Fast forward 20 years and I’m a resident in town, opening my own office. So whatever it was, my 16-year-old self was telling me this would be the place.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/04/Patrick-Mencel.jpg"
}