{
  "id": 17673,
  "title": "Local Spotlight with Danielle: Trenton Thunder",
  "slug": "local-spotlight-with-danielle-trenton-thunder",
  "date": "2023-06-14T17:23:27",
  "author": "Staff",
  "category": [
    "Fit",
    "Live",
    "Play",
    "Taste"
  ],
  "tags": [
    "Danielle Gannon",
    "doylestown cardinal",
    "trenton thunder"
  ],
  "excerpt": "<p>By Danielle Gannon  •  The Cardinal Contributing Writer I met Bernadette, the ballpark’s Director of Memberships for a nice breakfast in Lambertville to discuss.  the Minor League Baseball team, The Trenton Thunder. I have seen the ballpark for years, driving past it on my way to various parts of New Jersey. The big ball field, [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Danielle Gannon  •  </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">I </span><span class=\"s3\">met Bernadette, the ballpark’s Director of Memberships for a nice breakfast in Lambertville to discuss.<span class=\"Apple-converted-space\">  </span>the Minor League Baseball team, The Trenton Thunder. I have seen the ballpark for years, driving past it on my way to various parts of New Jersey. The big ball field, the main sign, and all the advertisers are beautifully visible from the road.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The Trenton Thunder Ballpark opened on May 9, 1994. They were a Minor League Baseball team of the Double-A Eastern League until Major League Baseball reorganized the minors following the 2020 season. Before this, they were affiliates of the Detroit Tigers (1994), Boston Red Sox (1995–2002), and New York Yankees (2003–2020).<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The seating capacity is 6,440. The Park offers regular ballpark seating, suites, and luxury suites. I went out to visit the ballpark on 1 Thunder Road and was thrown into the nostalgia of it all.</span></p>\n<p class=\"p5\"><span class=\"s3\">The price is right! With tickets starting at $12 per seat, you can see how this is a nice fun, and affordable way to see a game. Remember back in the day, when heading to the Phillies was in the same “ballpark” (no pun intended)? Trenton Thunder, a local minor league baseball team is just 20-30 minutes outside Bucks County. It offers convenient parking, affordable tickets, and concessions, a super cute mascot Boomer, luxury suites, and a packed-themed calendar for every home game.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The field is positioned adequately. It allows for any seat in the house to have a good view of the ball field. The suites were cool and I could envision a small business renting one out for its staff. The suites fit 25-30 people. Medium to large suites, equipped with a full bar, seat 50-120. Each suite comes with indoor and outdoor seating.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The menu can be catered in a few different ways: picnic style &#8211; think true baseball foods like hot dogs, burgers, popcorn, and soda, to a finer menu like grilled chicken breast and salads. The Park offers options of a full bar with a tender that can be paid for by the host or a cash bar. I can see how these spaces would make for such an excellent staff appreciation, team building event, family reunion, friends gathering, big birthday celebration, and more.</span></p>\n<p class=\"p5\"><span class=\"s3\">Every game, there is a super sweet, really cool theme. The season kicks off June 1, with an opening day party and postgame fireworks. The following night is superhero night, July 14. “Philly Night” features giveaway bobbleheads of Tom McCarthy, the Phillies announcer. Tuesdays are “Kids Eat Free” nights and $1 dog nights. Wednesdays are “Wine Wednesdays” with select specials on wine. Thursdays are “Thirsty Thursdays.” Every Thursday and Friday there are fireworks. Fridays are “Pork Roll Fridays.” Sangria takes the spotlight on Sundays.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The river backs right up to the stadium so it’s common to see boats dock to come in.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">I found this field to be so refreshing. I liked that it was easy to access and is affordable. The entertainment is well-planned and thought out. I can’t forget to mention the adorable “Bat Dog” who is the third generation of the Thunders, Rookie. He’s a beautiful Golden Retriever who graces the crowd and players with his presence each game.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">For more information, see the schedule, and to purchase tickets, visit <a href=\"http://mlbdraftleague.com\" target=\"_blank\" rel=\"noopener noreferrer\">mlbdraftleague.com<span class=\"Apple-converted-space\"> </span></a></span></p>\n<p class=\"p5\"><span class=\"s3\">To rent a suite or luxury suite please email Bernadette Marco, <a href=\"mailto:bmarco@trentonthunder.com\">bmarco@trentonthunder.com<span class=\"Apple-converted-space\"> </span></a></span></p>\n<p class=\"p7\"><i>Danielle Gannon is a local Bucks County entrepreneur. Mom to three, she is co-owner of Organnons Natural Market and Founder &amp; Managing Director of Local Spotlight with Danielle. Her passion is connecting people and creating community. Residing in Ivyland, writing has always been a passion of hers. Find her on IG @localspotlightwithdanielle</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/06/8C69472C-590B-4254-A66E-03EC4A52F11B-e1686777798695.jpeg"
}