{
  "id": 11401,
  "title": "Local Delight: The Pasta Lady!",
  "slug": "local-delight-the-pasta-lady",
  "date": "2021-09-10T15:24:22",
  "author": "Staff",
  "category": [
    "Live",
    "Style",
    "Taste"
  ],
  "tags": [
    "Andrea Celentano",
    "Angelina’s Taste of Italy",
    "doylestown cardinal",
    "the pasta lady",
    "Villa Capri"
  ],
  "excerpt": "<p>By Dakota Latorre • The Cardinal Contributing Writer The Cardinal sat down recently with one of our community’s truly engaging personalities and had a chance to get to know one of Doylestown’s real trend-setters upclose and personal. Give us a little background on yourself? Where you’re from, what brought/attracted you to Doylestown, etc.? Hi, my [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Dakota Latorre • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><i>The Cardinal sat down recently with one of our community’s truly engaging personalities and had a chance to get to know one of Doylestown’s real trend-setters upclose and personal.</i></p>\n<p class=\"p1\"><b>Give us a little background on yourself? Where you’re from, what brought/attracted you to Doylestown, etc.?</b></p>\n<p class=\"p5\"><span class=\"s2\">Hi, my name is Andrea Celentano and I was born in Brooklyn, New York. At 14 I moved to the Poconos Mountains where I attended high school, and raised my two beautiful children. After my children were fully out of the nest, I decided to move out of the Poconos, and on to Doylestown. I’ve been here for about 11 years now.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">I decided to settle here in Doylestown because of how beautiful it is, how close it is to both of my children, and how much I love the community.</span></p>\n<p class=\"p1\"><b>What is the name of your company and how long have you been in business?</b></p>\n<p class=\"p5\"><span class=\"s1\">My business is Angelina’s Taste of Italy, and it just launched this August.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>What are the types of pasta you make and where can people find it? What events do you host?<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p5\"><span class=\"s1\">As of right now, we make pasta made-to-order. By going to our website <a href=\"http://www.angelinaitaly.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.angelinaitaly.com</a>, you can make an order for yourself or an event. All pastas will be custom made for your party. All orders must be made by Sunday for pick up at the Villa Capri on Friday. This gives me the opportunity to make your pasta fresh.</span></p>\n<p class=\"p5\"><span class=\"s1\">Angelina’s offers lasagna noodle sheets, tortellini, fettuccine, pappardelle, spaghetti, both potato and ricotta gnocchi, and our family recipe ravioli; filled with mascarpone cheese, pecorino Romano and spinach. We also have seasonal specials using local and seasonal ingredients, made in limited batches. In the fall our menu will also include macaroni.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">You can find Angelina’s pastas every week at The Villa Capri, plus every Friday and Saturday, Chef Scott will feature an Angelina’s pasta special for eat-in or take-out. This special is Chef’s choice and changes weekly.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">You can see all upcoming events on our website.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>What made you get into this business and how long have you been doing it?<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p5\"><span class=\"s1\">My love of cooking and watching people enjoy my food is one of my greatest joys in life. My Grandmother was the same way. Every Sunday my Nonna, Angelina, would make pasta and sauce and invite our family and neighbors to come together and enjoy dinner. Back then, the whole community felt like an extended family. Angelina gave me my love of cooking, and that’s why I dedicated my business to her.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">I miss having a family meal at the table over a fresh-made pasta. Fresh; not made by a machine. I make my dough by hand, knead it by hand, cut it by hand, and you can tell the difference.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Before branching out on my own, I helped my mother with her restaurant business. My Mother, Gracie, had her own restaurant in the Pocono Mountains for many years. I would help with just about everything. I served when I was in my teens and as a young adult I baked, cooked, and hosted.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">I’ve been a hairstylist for 40 years now. I found a different love, while working with hair, but now that I’m 60, I’ve decided it’s time to go back to my true passion and return to my roots. I want to make something for my family. Leave something behind for my kids. This last year and a half has let me reflect on what is important in life, and I decided it’s time to take a risk and do what I love.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>Where does most of your clientele come from?</b></p>\n<p class=\"p5\"><span class=\"s1\">Most of my clientele comes from Doylestown. Being a hairstylist here in Doylestown, my customers have been extremely supportive and have been my base clientele as I started to figure out my business.</span></p>\n<p class=\"p5\"><span class=\"s1\">I also have all of my friends and old customers, who have been paying me to make food for them for years. Honestly, I’ve had clients long before I even had my business.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>Were there any challenges that you encountered while going through the process of launching your pasta? If so, what were they and how did you overcome them?</b></p>\n<p class=\"p5\"><span class=\"s1\">Because of the generosity and leadership I have received from Matt Mannino, the owner of The Villa Capri, and Scott Borghi, The Villa’s Chef, my startup was easier than I planned. When Matt listened to my business plan, and tasted my pasta, he was immediately onboard to help my business grow. He offered me the use of his prep kitchen while it wasn’t in use, which helped a lot with lowering my initial startup costs and challenges. That in itself was the biggest gift for me to move forward much faster, as that was my biggest hurdle. I’m grateful for the generosity of these two local Italians, who believed in me so much that they helped to make this all possible.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>Where are the sources from where your products come from? Are they locally sourced?<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p5\"><span class=\"s1\">I try to keep as much of what I make as local as possible. While my Italian cheeses are purchased from Coluccio’s in Brooklyn, New York, my vegetables are purchased at the local produce market in Doylestown. Everything else is purchased from Bova Foods in Chalfont.<span class=\"Apple-converted-space\"> </span></span><span class=\"s1\"><span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>How many employees do you have? Do you expect to bring more people on staff in the future? Any plans for expanding?</b></p>\n<p class=\"p5\"><span class=\"s2\">Currently I am the only employee of Angelina’s Taste of Italy. I hope to soon expand, and be able to make this company into a full time job. Once Angelina’s grows to the point I can’t do it on my own, my daughter Eve will be joining me in the kitchen. I’m looking forward to that day, because Angelina’s will truly become a family business.</span></p>\n<p class=\"p1\"><b>What’s the most exciting element of owning your business?</b></p>\n<p class=\"p5\"><span class=\"s1\">The most exciting aspect of starting a new business is I get to see my passion for cooking and my hard work create something new. I have always been a hard worker, but it is finally my time to have my talents benefit my personal business. I’ve worked for many people before, but this is the first time I work for myself.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>Is there anything specific that you’d like to mention about your business?</b></p>\n<p class=\"p5\"><span class=\"s1\">Angelina’s Taste of Italy is creating an authentic experience. Artisan pasta, no preservatives or fillers, made with the highest quality ingredients and crafted the way my family taught me and the way it was taught to them through generations of family and tradition.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>What does the future look like for your business? Do you have any special events coming up?</b></p>\n<p class=\"p5\"><span class=\"s1\">Honestly, if my community and The Villa Capri keep supporting me and buying my pasta like they have been, the future looks bright! My business has only just started, and I’m already overwhelmed with how positive the feedback has been.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">I’m excited to start opening the books to cater some parties. I’ve already had people inquire about catering events, but I don’t have anything on the books just yet. I’m sure that will be changing very soon!</span></p>\n<p class=\"p1\"><b>How do you market your business and attract customers?</b></p>\n<p class=\"p5\"><span class=\"s1\">The main way I’ve been getting the word out about my business has been word of mouth. It has just been me on my soapbox, but I’m looking into attending festivals in the near future.</span></p>\n<p class=\"p1\"><b>What do you love most about Doylestown?</b></p>\n<p class=\"p5\"><span class=\"s1\">What I love most about Doylestown are the people. The people here love their community, and support their local businesses. I’m happy to call Doylestown home, because I feel at home here.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/09/image6.jpg"
}