{
  "id": 16979,
  "title": "Local Spotlight with Danielle: ByeByeCry",
  "slug": "local-spotlight-with-danielle-byebyecry",
  "date": "2023-03-06T17:44:33",
  "author": "Staff",
  "category": [
    "Live",
    "Style"
  ],
  "tags": [
    "ByeByeCry",
    "Danielle Gannon",
    "doylestown cardinal",
    "Samantha Myers"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer Meet Samantha Myers. Mother to two beautiful little girls, wife to her handsome husband, and CEO of ByeByeCry.  ByeByeCry was born after Samantha survived mothering two babies with colic. Both babies were born 2.5 years apart. Like many other women, Samantha was blissfully pregnant, awaiting her turn [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Danielle Gannon • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">M</span><span class=\"s1\">eet Samantha Myers. Mother to two beautiful little girls, wife to her handsome husband, and CEO of ByeByeCry.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">ByeByeCry was born after Samantha survived mothering two babies with colic. Both babies were born 2.5 years apart. Like many other women, Samantha was blissfully pregnant, awaiting her turn at motherhood. When her first daughter was born, she found that mothering was not as easy as expected. She was up all day and all night, trying to soothe her child. She bounced and fed her, changed her, rocked her, and still cried. She was mentally and physically exhausted. In between her baby’s cries, she researched. She read about colic and gas and how to handle this new phase of life she found herself in.</span></p>\n<p class=\"p5\"><span class=\"s1\">Both babies had acid reflux and cried incessantly. With baby number two she started experimenting with unconventional sounds like Vacuum, Chainsaw, Hair Dryer, Lawn Mower, and Jackhammer. BINGO! They worked. This was a pivotal moment where Samantha knew she had to develop the product she and her husband so desperately needed. There were moments in the day she was finally able to enjoy motherhood and her baby was calm.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Samantha created a portable baby sound machine designed to soothe colicky babies. It housed many of the sounds she found to have a calming effect on her daughter. When she went back into the Pediatric hospital for her follow-up, she presented the device. The doctor was astounded! How have you had the time and energy to create this while taking care of newborns and only on a four-month maternity leave?! Against all odds, Samantha did just that. She started a product based on a need for something she could not find, and it was the only thing that worked for her!</span></p>\n<p class=\"p5\"><span class=\"s1\">Today Samantha has taken this product to the next level. She has created something exceptional and very tangible. The device is about the size of a hockey puck. It has a speaker in the middle, buttons on the sides with various sound choices, a nightlight, and a rubber strap that clips. When you see this device, you know it was created by a mom! The strap is designed so you can walk with the baby and soothe them with the sounds. It can clip onto your bra strap or stroller.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Check out her blog at byebyecry.com and keep an out for her app coming soon! Samantha’s mission is to help other moms and shine through the realness of motherhood. The not-so-easy nights and the struggles we women have as mothers when we are the only ones up all night long, haven’t showered in days, and are staring at this little love of ours wondering…, “How can we do this?”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">“Don’t compare yourself to others. Parenting is a marathon, not a sprint,” states Myers.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The most significant piece I gained in my time with Samantha is that she was inspired! Inspired to help others relieve the strain and pain she felt during these early months. She is a powerful force. She made it her mission to help other families going through the same struggle and was compelled to develop this much-needed product alongside following her heart.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Check out her website www.byebyecry.com and follow her on IG @byebyecryclub for daily reels on motherhood, connection with other parents, and product details.</span></p>\n<p class=\"p5\"><span class=\"s1\">Dr. Kathy Chen, a Pediatric Gastroenterologist in Philadelphia, states, “As a pediatric gastroenterologist with over 20 years of experience, the ByeByeCry Sound Machine is an exciting and innovative tool.” Dr. Kathy Chen submitted an application on her behalf into A Baby Shark Tank contest through a Pediatric Gastroenterology Organization known as NASPGHAN. They were selected as a Top 5 Finalist. Dr. Chen flew to Orlando and presented on Samantha’s behalf to some of the top G.I. docs across the country. Samantha flew out and got to sit in the audience with her mom.</span></p>\n<p class=\"p5\"><span class=\"s1\">“We are a relatable company that empowers moms. We are a real space for women to connect in their hardest yet most rewarding time in life,” states Myers.</span></p>\n<p class=\"p5\"><span class=\"s1\">Stay tuned for the release of the product for sale— SPRING 2023.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Meeting Samantha was a breath of fresh air! We had a wonderful time getting to know one another, and I felt an insane amount of inspiration just speaking with her. A mother’s intuition is a real thing. She is the real deal. She is doing this. She followed her heart, and because of that, I know that all good things will follow 🙂</span></p>\n<p class=\"p7\"><i>Danielle Gannon is a local Bucks County entrepreneur. Mom to three, she is co-owner of Organnons Natural Market and Founder &amp; Managing Director of Local Spotlight with Danielle. Her passion is connecting people and creating community. Residing in Ivyland, writing has always been a passion of hers. Find her on IG @localspotlightwithdanielle</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/03/byebyecryfamily.jpg"
}