{
  "id": 12446,
  "title": "Local Spotlight with Danielle: Health • Dr. Keith Sadel",
  "slug": "local-spotlight-with-danielle-health-%e2%80%a2-dr-keith-sadel",
  "date": "2022-03-01T23:15:24",
  "author": "Staff",
  "category": [
    "Fit"
  ],
  "tags": [
    "Danielle Gannon",
    "doylestown cardinal",
    "Dr. Keith Sadel"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer If you’ve needed a doctor or medical practitioner over the last decade or so, you may have found yourself in an office, waiting 30-60 minutes to be seen for your appointment. Then when brought in for the doctor’s appointment, you may have found yourself rushed and unheard.  [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Danielle Gannon • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">I</span><span class=\"s3\">f you’ve needed a doctor or medical practitioner over the last decade or so, you may have found yourself in an office, waiting 30-60 minutes to be seen for your appointment. Then when brought in for the doctor’s appointment, you may have found yourself rushed and unheard.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">This scenario appears to be a growing crisis in medicine. Doctors are overworked, overbooked, and struggling to get reimbursed from insurance companies. This puts the doctor and patient in a tough spot.</span></p>\n<p class=\"p5\"><span class=\"s3\">In the late ‘90s, a new concept came into the medical community – Concierge Medicine, aka Membership Medicine. According to Web MD, One of the most popular reasons to consider a concierge doctor is quicker access to your physician. Same-day appointments and direct email and phone contact with your concierge doctor mean speedier access to care.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Dr. Keith Sadel, a practicing internist in Southampton, Pa., saw the lack of time and quality he could give his patients. A true believer in medicine and relationships., Dr. Sadel looked into the Concierge Medicine model and began to adapt this in his Bucks County practice.</span></p>\n<p class=\"p5\"><span class=\"s3\">“I see only positives with this model. I was seeing 25-30 patients a day with the traditional insurance model. I was running behind for all of them, barely able to grasp what the client needed, to now being proactive and truly knowing my clients. They come in 3-4 times a year for wellness visits. This time allows me to learn their emotional/physical needs and tendencies, collect all the preventative measures and keep them well,” says Sadel.</span></p>\n<p class=\"p5\"><span class=\"s3\">Dr. Keith has been practicing for approximately 22 years. He and his wife Vivi, have been married for 28 years. They have two sons, Ben &amp; Sid and a dog named Howard. They reside in Holland, PA. and they adore Bucks County. They have such a beautiful connection with their staff and patients. The difference between them is TIME and ACCESS.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\"><strong>Here’s how it works:</strong> You pay a yearly amount per person or a family rate. This ensures you are part of the program. You then receive all the benefits. See www.preservationhealth.com for details. “The problem today is we are reactive in medicine; the goal is to be proactive (preventative). This can be achieved through nutrition, daily stress relief practices, alternative treatments, and exercise,” stresses Dr. Sadel.</span></p>\n<p class=\"p5\"><span class=\"s3\">His office is located at 715 Cherry Lane, 2nd Floor, in Southampton, PA. You can follow his IG page @drkeithsadelpreservationhealth for updates, facts, and videos explaining more on his practice. He offers primary internal care, concierge medicine, and medical marijuana.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The Sadel’s also own a Float Spa, called LMA (Leave Me Alone), on the first floor in the same building). This adds to the holistic approach offered at Preservation Health, with their sister studio below offering float therapy and sauna treatments. They are a one-stop-shop for preventative medication and remedies—IG page @lmamineralfloat for photos and details.</span></p>\n<p class=\"p5\"><span class=\"s3\">When you meet Keith &amp; Vivi, you can not help but feel the good energy between the two of them, and it permeates. Medical care and doctor’s visits do not need to be so sterile and stressful. Let’s bring it back to basics, and it all starts with relationships.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Give them a call at 215-357-1495 and schedule your complimentary analysis. As we have all seen these last two years . . our health is of the utmost importance . . . if we don’t have that, we don’t have much else.</span></p>\n<p class=\"p6\"><i>Danielle Gannon is a local Bucks County entrepreneur. Mom to three, she is an English teacher at RedBarn Homeschool (a local co-op she co-founded), co-owner of Organnons Natural Market and Founder &amp; Managing Director of Local Spotlight with Danielle. Her passion is connecting people and creating community. She graduated with a degree in Journalism from Penn State University, went into real estate and sales, then business ownership. Residing in Ivyland, writing has always been a passion of hers, and this opportunity with The Cardinal has allowed her life to truly come full circle. Find her on IG @localspotlightwithdanielle</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/03/Dr-Keith-Sadel.jpg"
}