{
  "id": 14392,
  "title": "Local Spotlight with Danielle: Healing Wounds with Leyla &#038; Meghan at Garden Alley Therapeutics",
  "slug": "local-spotlight-with-danielle-healing-wounds-with-leyla-meghan-at-garden-alley-therapeutics",
  "date": "2022-08-23T14:40:32",
  "author": "Staff",
  "category": [
    "Fit"
  ],
  "tags": [
    "Danielle Gannon",
    "doylestown cardinal",
    "Leyla Safavi",
    "Meghan Delaney"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer This spotlight is all about the women! Meet Doylestown residents Leyla Safavi and Meghan Delaney. Together, they are Garden Alley Therapeutics. They are both licensed with their master’s from Drexel University. Leyla focuses on couples and Meghan on family, trauma, grief, children 7+, teens, and divorce. Their main [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Danielle Gannon • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">T</span><span class=\"s3\">his spotlight is all about the women! Meet Doylestown residents Leyla Safavi and Meghan Delaney. Together, they are Garden Alley Therapeutics. They are both licensed with their master’s from Drexel University. Leyla focuses on couples and Meghan on family, trauma, grief, children 7+, teens, and divorce.</span></p>\n<p class=\"p5\"><span class=\"s3\">Their main concern is on the “system” within a family and relationships. We all play roles in the lives we live and the dynamic of how those roles play out has everything to do with why we keep encountering the same roadblocks.</span></p>\n<p class=\"p5\"><span class=\"s3\">It’s all about identifying behaviors. You can’t bring someone here and say, “fix this person.” One’s issues likely have to do with the attachment they have to those around them. That attachment dictates how the relationship plays out.</span></p>\n<p class=\"p5\"><span class=\"s3\">“Small changes / small shifts are a lot of times all it is,” states Leyla. “We try to simplify it; you need to show up in a different way.”</span></p>\n<p class=\"p5\"><span class=\"s3\">As soon as I walked into Delaney and Safavi’s office, I felt at peace. It’s dressed in lots of different shades of white and green. The color, decor and space were chosen specifically to create a calming atmosphere. They are big on the understanding of energy and environment.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Delaney and Safavi believe that from the moment you walk in, therapy begins. </span></p>\n<p class=\"p5\"><span class=\"s3\">Meghan has her undergraduate degree in business/marketing. She went to school in West Virginia and worked for a newspaper right out of college. However, she felt her true calling wasn’t being expressed, as she wanted to help people. Not long after, she enrolled in Drexel and graduated with her master’s degree in Family Therapy.</span></p>\n<p class=\"p5\"><span class=\"s3\">Leyla went to RIT for studio arts. She taught photography for a year out of college and felt a calling to go back to school to help people. She originally went for medical school and had some experience as an EMT. Eventually that evolved into her caring for people on a deeper level, leading to her enrollment into Drexel for Family Therapy.</span></p>\n<p class=\"p5\"><span class=\"s3\">Leyla &amp; Meghan met in school and quickly became friends. They both graduated and independently put in their 3,000+ hours of work time to become officially ready to take on clients. </span></p>\n<p class=\"p5\"><span class=\"s3\">They both started their own LLC and had different offices for taking clients. Eventually, they would weekly cross over in Long Beach Island, NJ, and share space.</span></p>\n<p class=\"p5\"><span class=\"s3\">Healing wounds is the approach here at Garden Alley Therapeutics. “We really care about and will take care of our clients,” says Safavi. “We want to heal relationships. If I change one family, I heal generations after me.”</span></p>\n<p class=\"p5\"><span class=\"s3\">They offer intensive sessions over a 2–3-day span that are 8-12 hours for families and couples. These can be done over a weekend, or another 2–3-day span during the week. This allows the client and therapist to go deep and get to the core of issues much quicker than spanning it over 8-12 typical 1-hour appointments.</span></p>\n<p class=\"p5\"><span class=\"s3\">Another alternative practice they are introducing is working with Ketamine. It is a legal substance that works on depression and trauma and allows the person to heal. This, as they stated, helps to get the person out of their own way. Then true progress can occur.</span></p>\n<p class=\"p5\"><span class=\"s3\">In addition, Safavi and Delaney are creating a new course. Collaborating with a holistic minded doctor, they drafted a program called Food Mood. It is an in-person intro course on how what we eat affects us. </span></p>\n<p class=\"p5\"><span class=\"s3\">I will post the details and dates for this on social media when it’s ready!</span></p>\n<p class=\"p5\"><span class=\"s3\">“My hope is that we can help people connect the mind, body and soul,” states Delaney. “It has to be a collaboration with our clients. Us and them. At that point, we can all gain a different perspective.”</span></p>\n<p class=\"p5\"><span class=\"s3\">These two ladies blew me away with their peaceful nature, their want to do things alternatively and the depth to which they will go to meet the needs of their clients and the community.</span></p>\n<p class=\"p5\"><span class=\"s3\">If you are looking for an alternative measure to heal yourself and/or your family, schedule an appointment with these ladies. I have met and been to various therapists over the years and I felt a true shift based on their approach. I believe this is a new, improved, and much needed practice in Bucks County. I trust they will help many people in need of the deep healing that can only occur when you are working with the right person, committed to working with you as an individual. </span></p>\n<p class=\"p5\"><span class=\"s3\">Thank you for sharing your space with me, Meghan &amp; Leyla. I see your desire to heal others and it is incredibly admirable. </span></p>\n<p class=\"p5\"><span class=\"s3\">Garden Alley Therapeutics is located at 30 Garden Alley, Doylestown, Pa, in the heart of the Borough. IG @gardenalleytherapeutics</span></p>\n<p class=\"p5\"><span class=\"s3\">Leyla can be reached at 267-595-1113 or Meghan at 267-214-1940. </span></p>\n<p class=\"p6\"><i>Danielle Gannon is a local Bucks County entrepreneur. Mom to three, she is an English teacher at RedBarn Homeschool (a local co-op she co-founded), co-owner of Organnons Natural Market and Founder &amp; Managing Director of Local Spotlight with Danielle. Her passion is connecting people and creating community. Residing in Ivyland, writing has always been a passion of hers. Find her on IG @localspotlightwithdanielle</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/08/Garden-Alley.jpg"
}