{
  "id": 20016,
  "title": "Local Artist Nancy Taylor Shares Healing Powers of Art",
  "slug": "local-artist-nancy-taylor-shares-healing-powers-of-art",
  "date": "2024-07-09T15:24:41",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [],
  "excerpt": "<p>By Natalya Bucuy &#8211; Cardinal Managing Editor  12 pieces of Taylor’s FreeHand PaperCuts are on display and available for sale at Native Cafe through July (12 S. Main Street) A few months ago a tragedy of minor significance occurred in my kitchen. My favorite coffee mug &#8211; a gift from a dear friend, which reminded [&hellip;]</p>\n",
  "content": "<p><b>By Natalya Bucuy &#8211; Cardinal Managing Editor </b></p>\n<p><i><span style=\"font-weight: 400;\">12 pieces of Taylor’s FreeHand PaperCuts are on display and available for sale at Native Cafe through July (12 S. Main Street)</span></i></p>\n<p><span style=\"font-weight: 400;\">A few months ago a tragedy of minor significance occurred in my kitchen. My favorite coffee mug &#8211; a gift from a dear friend, which reminded me each morning, “Do Not Quit Your Day Dream” &#8211; sadly fell victim to a multi-dish pile-up in my sink and shattered. Trying to glue it back together resulted in a frustrating evening and a sticky mess. Unable to send my beloved to the trash yet, I saved my broken treasure with hopes for some kind of miracle cure.  </span></p>\n<p><span style=\"font-weight: 400;\">And it came through the skills of Nancy Wexler Taylor, an artist of unexpected media. At Kin Wellness Center, where Nancy volunteers regularly, I took her Broken Dish Jewelry class and learned how to transform parts of broken dishes into wearable art. Coming with a side effect of an obsessive collection of broken dishes, the skill gave me a way to make something new from something old. It did not require an arsenal of fancy tools. In the process of this artistic repurpose, I experienced an energy of renewal and a sense of deeper connection, not only to my fellow crafters but to myself &#8211; art has that therapeutic effect. And it allowed me to keep the upcycled memory of my favorite mug. </span></p>\n<p><span style=\"font-weight: 400;\">Doylestown artist, Nancy Taylor is a true art detective. She explores various art mediums and develops an understanding of the materials. This allows her freedom in her work. Her latest endeavor is FreeHand PaperCuts, and she taught this art form in a workshop at Kin, too. Without using any templates or tracing, with a truly freehand approach, the technique creates still floral forms out of simple strips of paper. </span></p>\n<p><span style=\"font-weight: 400;\">Nancy is passionate about teaching. Her technique is a step-by-step approach that helps support confidence in the student. In addition to Kin, she has taught for the Doylestown Art League, Greater Norristown Art League, Makers off Main, Allora in Doylestown, and her private studio. Her workshops cover a variety of craft skills including collages, pressed flowers, and black-out poetry. </span></p>\n<p><span style=\"font-weight: 400;\">“I see art as a powerful tool that helps us slow down, work through our struggles, and reconnect with the creative flow we enjoyed as children,” Nancy says. She believes that “art saves lives.” I agree. It also saved my favorite reminder to not quit my day dream.</span></p>\n<figure id=\"attachment_20017\" aria-describedby=\"caption-attachment-20017\" style=\"width: 1009px\" class=\"wp-caption alignnone\"><a href=\"/data/media/Screenshot-2024-07-09-at-3.22.21-PM.png\"><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-20017\" src=\"/data/media/Screenshot-2024-07-09-at-3.22.21-PM-1009x1024.png\" alt=\"Nancy Taylor\" width=\"1009\" height=\"1024\" srcset=\"/data/media/Screenshot-2024-07-09-at-3.22.21-PM-1009x1024.png 1009w, /data/media/Screenshot-2024-07-09-at-3.22.21-PM-296x300.png 296w, /data/media/Screenshot-2024-07-09-at-3.22.21-PM-768x779.png 768w, /data/media/Screenshot-2024-07-09-at-3.22.21-PM-65x65.png 65w, /data/media/Screenshot-2024-07-09-at-3.22.21-PM-990x1005.png 990w, /data/media/Screenshot-2024-07-09-at-3.22.21-PM-1320x1340.png 1320w, /data/media/Screenshot-2024-07-09-at-3.22.21-PM.png 1350w\" sizes=\"auto, (max-width: 1009px) 100vw, 1009px\" /></a><figcaption id=\"caption-attachment-20017\" class=\"wp-caption-text\">Nancy Taylor&#8217;s Papercuts</figcaption></figure>\n<p><span style=\"font-weight: 400;\">Check out Nancy’s art while sipping a cup of your favorite beverage and find her on Instagram @nancywexlertaylorarts or email her at nancywtaylor@gmail.com. </span></p>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/07/NancyTaylor.png"
}