{
  "id": 16290,
  "title": "Local Baker Follows Her Dream: Mom’s Cookie Bar",
  "slug": "local-baker-follows-her-dream-moms-cookie-bar",
  "date": "2023-01-10T00:09:54",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Lindsay Baker"
  ],
  "excerpt": "<p>By Jules from @FortheLoveofDoylestown • The Cardinal Contributing Writer True to her name, Lindsay Baker has been baking since she was a little girl. The youngest of four girls, she always helped her mom and grandmother bake Christmas cookies. And to keep the popular Pittsburgh family tradition alive &#8211; her grandmother lived there &#8211;  she [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Jules from @FortheLoveofDoylestown</strong> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">T</span><span class=\"s3\">rue to her name, Lindsay Baker has been baking since she was a little girl. The youngest of four girls, she always helped her mom and grandmother bake Christmas cookies. And to keep the popular Pittsburgh family tradition alive &#8211; her grandmother lived there &#8211;<span class=\"Apple-converted-space\">  </span>she helped prepare treats for cookie tables at weddings.<span class=\"Apple-converted-space\">   </span></span></p>\n<p class=\"p5\"><span class=\"s3\">As an adult, Baker would host Christmas Cookie Happy Hours, where her friends would pack their own boxes of cookies.<span class=\"Apple-converted-space\">  </span>The cookie bars, which she would make in pans, became quite popular.<span class=\"Apple-converted-space\">  </span>“You should sell these,” was a phrase she would often hear. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">A sales and marketing executive in the oil industry, Baker had to travel a lot and disliked having to leave her kids. After some life changes, Lindsay decided to follow her passion and opened up Moms Cookie Bar in July of this year at 21 N. Main Street. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The space has an adorable upstairs, which is available for both kid and adult parties. Baker collaborates with a whole network of businesses, so children can have a princess or character party with hot food from a local restaurant while creating and decorating their own cookies.<span class=\"Apple-converted-space\">  </span>Adults can have a BYOB cookie night as well.<span class=\"Apple-converted-space\">  </span>An outdoor patio provides space where customers can enjoy their milkshakes and desserts. <span class=\"Apple-converted-space\"> </span></span></p>\n<p><a href=\"/data/media/image3.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-16292\" src=\"/data/media/image3.jpeg\" alt=\"\" width=\"1470\" height=\"1103\" srcset=\"/data/media/image3.jpeg 1470w, /data/media/image3-300x225.jpeg 300w, /data/media/image3-768x576.jpeg 768w, /data/media/image3-1024x768.jpeg 1024w, /data/media/image3-74x55.jpeg 74w, /data/media/image3-111x83.jpeg 111w, /data/media/image3-215x161.jpeg 215w, /data/media/image3-990x743.jpeg 990w, /data/media/image3-1320x990.jpeg 1320w\" sizes=\"auto, (max-width: 1470px) 100vw, 1470px\" /></a></p>\n<p class=\"p5\"><span class=\"s3\">Mom’s Cookie Bar offers treats such as cookie bars, cookies, cookie cakes, iced coffee, hot cocoa, milkshakes, and ice cream. Baker’s cookie bars are, of course, the shining stars of the menu. The most popular bars include peanut butter and Twix and Nutella stuffed goodies.<span class=\"Apple-converted-space\">  </span>Other popular items include the salted caramel Backyard Beans, nitro cold brew milkshakes, and natural sodas from Appalachian Brewing Company.<span class=\"Apple-converted-space\">   </span></span></p>\n<p class=\"p5\"><span class=\"s3\">As a Doylestown native, Lindsay loves the town. “Everyone is so friendly and welcoming,” she says. “The area is so kid friendly.<span class=\"Apple-converted-space\">  </span>It’s a great place to raise a family.”<span class=\"Apple-converted-space\">  </span>As a mother of three kids, with the oldest now thirteen, she loves that her daughter can walk into the store and have some milkshakes and cookies with her friends. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Baker’s long-term goals include large events, wedding and party favors, and possibly a milk and cookie truck. Visit in person or at <a href=\"http://momscookiebar.com\" target=\"_blank\" rel=\"noopener noreferrer\">momscookiebar.com</a> to place your pick-up, delivery, or shipping order.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><i>Cardinal contributor Jules lives in Doylestown with her husband, son and two rescue dogs.<span class=\"Apple-converted-space\">  </span>In her spare time, she enjoys performing with her improv troupe The Department of Lost Socks, singing for the Bucks County Choral Society and acting in local shows.<span class=\"Apple-converted-space\"> </span></i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/01/image1.jpeg"
}