{
  "id": 17042,
  "title": "Love is In The Air At Le Macaron",
  "slug": "love-is-in-the-air-at-le-macaron",
  "date": "2023-03-06T18:33:24",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "jamie stem",
    "le macaron",
    "Louise Lee",
    "Steve Lee"
  ],
  "excerpt": "<p>By Jamie Stem  • The Cardinal Contributing Writer In the heart of Doylestown, just off Main Street sits one of the true gems of our small town &#8211; an authentic patisserie. Specializing in French treats, Le Macaron provides Doylestown with some of the most decadent and mouthwatering varieties of desserts a palate can handle.  My [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Jamie Stem<span class=\"Apple-converted-space\">  • </span></strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">I</span><span class=\"s1\">n the heart of Doylestown, just off Main Street sits one of the true gems of our small town &#8211; an authentic patisserie. Specializing in French treats, Le Macaron provides Doylestown with some of the most decadent and mouthwatering varieties of desserts a palate can handle.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">My son and I visit the store at 4 West Oakland Avenue regularly for our fix of sweets. Our favorites include the chocolate cigars, the beignets, and the pineapple fruit cubes. Of course, we always like to share the experience, so we get a six-pack of macarons for mom-mom and pop-pop. They love the red velvet ones the most. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Le Macaron treats visitors to an authentic French cafe experience in pristine elegance, complete with a smile from Steve or Louise Lee, the owners and long-time Doylestown residents. They are the heart and soul of this business, always present and committed to their dream. I’m thankful to have gotten to know them since the Cafe first opened in November 2020.</span></p>\n<p class=\"p5\"><span class=\"s3\">Initially, Steve and Louise wanted a change of pace for their family. They had a passion for food, in particular desserts. As parents to four boys, they also wanted to encourage their kids to chase their dreams and they combined that with a desire to get back into the food service industry that they had enjoyed so much in their youth.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">And so, they discovered the Le Macaron French Pastries franchise. Louise, being French Canadian herself, fondly recalled the French pastries of her childhood. She found the idea of bringing and sharing the culture of her childhood with her town quite exciting. Doylestown’s diversified health-conscious customers provided a perfect match.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The macaron, the cafe’s signature menu item, is preservative and gluten-free. It combines flavor, texture, presentation, and quality into a wholesome treat. Beyond the signature macaron lies an extensive menu consisting of gourmet chocolates, French gelato, daily baked croissants, and European-style beverages. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">As a French patisserie, Le Macaron cannot let Valentine’s Day pass by this month without a big splash. The patisserie carries all sorts of decadent gifts and treats from which to choose for that special someone in your life. What better way to say I love you than with something French and irresistibly tasty?</span></p>\n<p class=\"p5\"><span class=\"s1\">While the Lees’ primary focus is their business, they also have connections within the local community and charities. As an active member of Doylestown’s fire department and the county’s dive-and-rescue team, Steve particularly values local community involvement. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The Lees found numerous ways to further serve their community through their new venture. Hosting weekly fundraisers between May 2021 and September 2022, Le Macaron raised and donated a total of $3096.50 to NAMI Bucks County. That organization has been a beacon of help and hope to all people affected by mental health conditions.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Along the way, the Lees have made varying contributions to Between Friends Outreach, Kin, and Pine2Pink via the Thompson Shine and Sign event, Central Bucks High School West football club, Harlequin club, teachers of America club, Solebury school, Mercer Museum,<span class=\"Apple-converted-space\">  </span>Fonthill Castle, and Doylestown Parks and Recreations.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Steve and Louise share duties managing the store and meeting the needs of the Doylestown community. They enjoy meeting and connecting with people and are enthused to show how their unique product can add a taste of joy to weddings, bar mitzvahs, and baby and wedding showers. Stop by this week and visit one of my favorite places in Doylestown.<span class=\"Apple-converted-space\"> </span></span></p>\n<p>For more information visit <a href=\"https://lemacarondoylestown.com\" target=\"_blank\" rel=\"noopener noreferrer\">https://lemacarondoylestown.com</a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/03/Le-Macaron.jpg"
}