{
  "id": 12308,
  "title": "Love and  Business",
  "slug": "love-and-business",
  "date": "2022-02-08T13:21:29",
  "author": "Staff",
  "category": [
    "Fit",
    "Style",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "evolution candy",
    "jessica ramoy",
    "kin wellness and support",
    "Monkeys Uncle"
  ],
  "excerpt": "<p>By Jess Ramoy • The Cardinal Contributing Writer Happy Valentines Day! In honor of this romantic month, the Cardinal interviewed some local couples who are partners in life and in business. Check out their stories and some tips on how to succeed with your significant other! Evolution Candy • James and Tracy Lamb How and [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Jess Ramoy • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><i>H</i><i>appy Valentines Day! In honor of this romantic month, the Cardinal interviewed some local couples who are partners in life and in business. Check out their stories and some tips on how to succeed with your significant other!</i></p>\n<p class=\"p6\"><span style=\"color: #993366;\"><strong><span class=\"s1\">Evolution Candy</span> • James and Tracy Lamb</strong></span></p>\n<p class=\"p1\"><b>How and when did you meet? Did you always want to go into business together?</b></p>\n<p class=\"p7\"><b>James:</b> That’s funny because we actually met at our previous job, so we’ve been working together for quite some time. Going into business together was part of the conversation very early on.</p>\n<p class=\"p7\"><b>Tracy:</b> We work well together in addition to having fun together!!</p>\n<p class=\"p1\"><span class=\"s2\"><b>Tell us about the business and how it came about? What is an average day like at “the office”?</b></span></p>\n<p class=\"p7\"><b>Tracy:</b> Evolution Candy started when we bought the “Nuts Plus” business in 2018. Nuts Plus was started in 1981 and was located where Payton Jewelry is now. We discussed it when we found out that the business was for sale, and it was a mutual decision to make this lifestyle change. Primarily, James is in charge of ice cream and marketing; I’m in charge of candy and day-to-day operations. We flip and flop as the seasons and needs change. An average day will find one, the other, or both of us at the store.</p>\n<p class=\"p7\"><b>James:</b> Our biggest difference is that Tracy’s more of a morning person, and I am “famously” NOT! <span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>Is the business discussed at the dinner table? Are there any rules or boundaries in place to keep your personal life separate from the business?</b></p>\n<p class=\"p7\"><span class=\"s3\"><b>Tracy:</b> Absolutely. The store is a big part of our life, and it doesn’t go away when we go home. If we are not here together, we’ll catch each other up on what the other missed later in the day. We plan the day at the breakfast table and catch up again over the dinner table.</span></p>\n<p class=\"p7\"><b>James:</b> Basically, every day starts with the question, “What are we doing today or what is going to happen today?” We either have a game plan for the day, or the people who walk in dictate the day.</p>\n<p class=\"p1\"><b>Do you have any advice for couples starting on a business venture together?<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p7\"><b>Tracy:</b> Owning your own business is not just a job or a hobby. It is a lifestyle. We are open 7-days-a-week, and as a result, we have a great deal of logistics to manage &#8211; not only at the store but at home. The best part is supporting each other with our complementing strengths and strategies.</p>\n<p class=\"p7\"><b>James:</b> The division of responsibilities honestly works best for us at the store and in our relationship. We’re both either not good at or have no interest in doing some of the things the other does. Every major decision, though, is totally a team effort.</p>\n<p class=\"p1\"><b>Are you doing anything special for Valentine’s Day at the store?</b></p>\n<p class=\"p7\"><b>Tracy:</b> From our delicious assorted chocolate boxes, conversation hearts, and a super-secret Love Potion, we definitely invite everyone to stop by and check us out!</p>\n<p class=\"p7\"><b>Visit: <a href=\"https://evolutioncandy.com\" target=\"_blank\" rel=\"noopener noreferrer\">https://evolutioncandy.com</a></b></p>\n<figure id=\"attachment_12310\" aria-describedby=\"caption-attachment-12310\" style=\"width: 1460px\" class=\"wp-caption alignnone\"><a href=\"/data/media/Kin.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-12310\" src=\"/data/media/Kin.jpg\" alt=\"\" width=\"1460\" height=\"1872\" srcset=\"/data/media/Kin.jpg 1460w, /data/media/Kin-234x300.jpg 234w, /data/media/Kin-768x985.jpg 768w, /data/media/Kin-799x1024.jpg 799w, /data/media/Kin-990x1269.jpg 990w, /data/media/Kin-1320x1692.jpg 1320w\" sizes=\"auto, (max-width: 1460px) 100vw, 1460px\" /></a><figcaption id=\"caption-attachment-12310\" class=\"wp-caption-text\">Keith and Kristina Fenimore of Kin Wellness and Support &#8211; photo by Kase Fenimore</figcaption></figure>\n<p class=\"p6\"><span style=\"color: #993366;\"><strong><span class=\"s1\">Kin Wellness and Support • </span>Keith and Kristina Fenimore</strong></span></p>\n<p class=\"p1\"><b>How and when did you two meet? Did you always want to go into business together?</b></p>\n<p class=\"p7\"><span class=\"s3\"><b>Kristina:</b><span class=\"Apple-converted-space\">  </span>Keith and I met 16 years ago while living and working in Los Angeles. I was dropping off tapes to the office where he worked, and it was love at first sight &#8211; I fell in love with his two dogs he brought to the office. We started talking, and by the time I got back to my office, he had already left a voicemail asking me out on a date. I said yes, and we’ve been inseparable since. I never thought we’d be in business together, mostly because I never dreamed I’d be helping run a Cancer Wellness &amp; Support Center. It’s a blessing and an honor to be a part of Kin, and to be able to do it with my best friend is icing on the cake.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>Tell us about the business and how it came about? What is an average day like at “the office”?</b></p>\n<p class=\"p7\"><b>Keith:</b> Corinne Sikora came up with the idea for an all-inclusive free cancer center in Bucks County and she sort of appointed us to run with it. While she was battling brain cancer before she passed in November of 2020, she suggested the “Pine2Pink people” try to make her vision a reality. So our fate was determined by this extraordinary lady we actually never met.</p>\n<p class=\"p7\">There are so many variables that every day is unique. Now, our focus is three-fold – on-board cancer patients in Bucks County – find practitioners and instructors to donate their services, provide great care to our guests, and raise money, as we are 100% donation-based.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p7\"><span class=\"s2\"><b>Kristina:</b> My role as Director is to manage the operation and programmatic slate for all our services and be a point person for all our guests. I will tell you the best part of the job is meeting the special people in our community. The outpouring of kindness has been an overwhelming experience for both of us, and I think it’s brought us closer together. Seeing how much love there is in this world fills your heart and makes you want to give back to those around you. Kin was built by the community, its people helping people, simple but the most powerful tool we have.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>Is the business discussed at the dinner table? Are there any rules or boundaries in place to keep your personal life separate from the business?</b></p>\n<p class=\"p7\"><b>Kristina:</b> Keith and I have different viewpoints on this topic, but we’re able to manage our expectations of each other respectfully. I believe we need to turn off the “work” switch when we can. We have young children; it’s important that we have quality time with them. While we don’t have any rules or boundaries, I think we know each other so well; Keith recognizes when I’m giving him the stink eye, which means it’s time to shut down.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p7\"><span class=\"s3\"><b>Keith:</b> Kristina and I are pretty good about interweaving life and work, so it’s not overbearing. I will bring up Kin topics or take my kids to certain events or meetings, but that is purposeful. I want to teach them through doing, so having them in the know and participating is a nice extension of our family dynamic. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>How do you balance the business, family, and your personal relationship? </b></p>\n<p class=\"p7\"><b>Kristina:</b> I don’t know if “balance” is attainable. There are so many variables in life. What I’m trying to achieve is recognizing and celebrating the little things in life. This is another lesson I’ve learned from our business venture from the people fighting for their lives. Life is about celebrating the good days, being ok with the bad days, and finding joy in the little things.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p7\"><span class=\"s3\"><b>Keith:</b> In the non-profit space, we could work 24/7 and not get everything done. That said, we make a concerted effort to keep the Kin chat light on nights and weekends. I’ll leave my phone home on the weekends to disconnect. It takes effort to unplug, but it’s necessary for mental health and being present! <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>Do you have any advice for couples starting on a business venture together? Any advice for new couples in general?</b></p>\n<p class=\"p7\"><b>Kristina:</b> My only advice is to be sure you and your partner know how to communicate with each other in a healthy way. Listen and support each other. Hear what your partner is saying. Be respectful to each other’s thoughts, ideas, and opinions. Find out what each other’s strengths are and help nurture them. Remember that your partner is not perfect, and neither are you, so focus on the good parts of them. Finally, don’t take anything too seriously. If you’re dealing with something serious, help your partner find their pathway to the light.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p7\"><b>Keith:</b> This could easily be a long essay, but when I strip it down, I can say the foundation of our relationship is passion and communication. All we’ve done is carry those characteristics into our work, and it has served us well. Our end goal also aligns. We do what we do because we want to help people. The work we do through Kin and Pine2Pink has purpose and benefits people in profound ways. We are so lucky to be able to share this as a couple.</p>\n<p class=\"p7\"><b>Visit: <a href=\"https://www.welcometokin.org\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.welcometokin.org</a></b></p>\n<figure id=\"attachment_12311\" aria-describedby=\"caption-attachment-12311\" style=\"width: 1800px\" class=\"wp-caption alignnone\"><a href=\"/data/media/Monkeys-Uncle.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-12311\" src=\"/data/media/Monkeys-Uncle.jpg\" alt=\"\" width=\"1800\" height=\"1200\" srcset=\"/data/media/Monkeys-Uncle.jpg 1800w, /data/media/Monkeys-Uncle-300x200.jpg 300w, /data/media/Monkeys-Uncle-768x512.jpg 768w, /data/media/Monkeys-Uncle-1024x683.jpg 1024w, /data/media/Monkeys-Uncle-414x276.jpg 414w, /data/media/Monkeys-Uncle-470x313.jpg 470w, /data/media/Monkeys-Uncle-640x426.jpg 640w, /data/media/Monkeys-Uncle-130x86.jpg 130w, /data/media/Monkeys-Uncle-187x124.jpg 187w, /data/media/Monkeys-Uncle-990x660.jpg 990w, /data/media/Monkeys-Uncle-1320x880.jpg 1320w\" sizes=\"auto, (max-width: 1800px) 100vw, 1800px\" /></a><figcaption id=\"caption-attachment-12311\" class=\"wp-caption-text\">Derrick and Jeanell Morgan of Monkey&#8217;s Uncle</figcaption></figure>\n<p class=\"p9\"><span style=\"color: #993366;\"><strong>Monkey’s Uncle • Derrick and Jeanell Morgan</strong></span></p>\n<p class=\"p1\"><b>How and when did you two meet? Did you always want to go into business together?</b></p>\n<p class=\"p7\">We actually met while working for a large sporting goods company. We worked together and were friends for a few years before we began dating, but the idea of going into business for ourselves didn’t come about until after our son was born.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><span class=\"s3\"><b>Tell us about the business and how it came about? What is an average day like at “the office”?<span class=\"Apple-converted-space\"> </span></b></span></p>\n<p class=\"p7\">Opening The Monkey’s Uncle was definitely motivated by our son Brayden, who was diagnosed with Autism at age<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p7\">We knew we would need the flexibility for doctor visits and therapy appointments that a typical position wouldn’t allow, so we combined our love of sports and all things throwback to launch our small business dream. Derrick has always been a Philly sports fanatic, and Jeanell has always had a passion for fashion, so we decided that we could blend these worlds to create something unique from the bland, generic options that were available.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p7\">While Monkey’s Uncle has become a go-to shopping destination for Philly sports fans, our core mission is to provide mentorship and job skills to special needs students of all abilities by partnering with local school districts and support programs.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p7\"><span class=\"s3\">Our “Monkey on a Mission” impacts many students each week, giving them valuable skills, experience, and a sense of purpose in knowing that we are all equally awesome. While selling super cool tee shirts pays the bills, we are here to give real-world job opportunities and experiences to these students.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><span class=\"s3\"><b>Is the business discussed at the dinner table? Are there any rules or boundaries in place to keep your personal life separate from the business?</b></span></p>\n<p class=\"p7\"><span class=\"s3\">Because the two of us are rarely at the shop together, business is discussed at the dinner table, in car rides, over morning coffee, and even over text messages when we’re not together! This is like our second child, and our actual child is growing up in this business, so the reality is that we live and breathe Monkeys Uncle 24/7. Rarely, we can ever turn things off, but we make a point to try scheduling an actual date night once a month where we turn off business so we can just be Jeanell and Derrick. </span></p>\n<p class=\"p1\"><b>How do you balance the business, family, and your personal relationship? </b></p>\n<p class=\"p7\"><span class=\"s2\">We were fortunate to have worked together before becoming business partners, so we already knew that we would balance each other out well. It’s important to carve out time so you can actually “clock out” and not feel tethered to the business. Seeing both of us at the shop together is almost like seeing Superman and Clark Kent in the same room, but there are certain times of the year when we actually get to work together at the shop that we consider as our “date night”. </span></p>\n<p class=\"p1\"><b>Do you have any advice for couples starting on a business venture together? Any advice for new couples in general?</b></p>\n<p class=\"p7\"><span class=\"s2\">It’s vital that you define each other’s roles and stay within your respective lane. You are in business with your significant other as an equal partner, so you must remember you are a team no matter what. And the number one rule is to just be honest and open. There will be big wins that you celebrate together, but keep in mind that you need to support one another where there are downtimes or mistakes happen. That goes for your personal and business relationships.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><span class=\"s2\"><b>Visit: <a href=\"https://www.themonkeysuncle.net\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.themonkeysuncle.net</a></b></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/02/Evolution-Candy-0018.jpg"
}