{
  "id": 18839,
  "title": "Mercer Museum Research Library Becomes FamilySearch Affiliate Library",
  "slug": "mercer-museum-research-library-becomes-familysearch-affiliate-library",
  "date": "2024-01-29T13:32:27",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "Bucks County Historical Society",
    "familysearch affiliate library",
    "The Mercer Museum Research Library"
  ],
  "excerpt": "<p>If you want to be part of the popular ancestry search trend, you may not need to look any further than the local library. The Mercer Museum Research Library, operated by the Bucks County Historical Society (BCHS), is now a FamilySearch Affiliate Library, which means it has access to more genealogy resources to help you [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">I</span><span class=\"s2\">f you want to be part of the popular ancestry search trend, you may not need to look any further than the local library. The Mercer Museum Research Library, operated by the Bucks County Historical Society (BCHS), is now a FamilySearch Affiliate Library, which means it has access to more genealogy resources to help you make more family discoveries. FamilySearch is a world leader in family history.</span></p>\n<p class=\"p3\"><span class=\"s3\">There are only a few hundred affiliate libraries in the country. The designation means local library patrons will now have greater and more convenient access to the wealth of genealogical resources available through FamilySearch. The popular web service has over 6 billion searchable names and 2 billion images of historical genealogical records—and you get the helpful assistance of library staff.</span></p>\n<p class=\"p3\"><span class=\"s3\">FamilySearch adds over 300 million free genealogical records and images online yearly from all over the world and manages the famous FamilySearch Library in Salt Lake City. It has amassed billions of birth, marriage, death, census, land and court records from more than 130 countries to help you discover and make family connections.</span></p>\n<p class=\"p3\"><span class=\"s3\">“Becoming a FamilySearch Affiliate Library is one more way the Mercer Museum Research Library strives to serve its researchers,” says Annie Halliday, BCHS Director of Library and Archives. “We are excited to offer onsite researchers another resource in discovering more about their own history.”</span></p>\n<p class=\"p3\"><span class=\"s3\">“Interest in our ancestral roots continues to grow with the popularity of DNA tests, reality tv shows like Long Lost Family or Who Do You Think You Are?, and the growing access to online genealogy records. Adding the Mercer Museum Research Library as our newest FamilySearch Affiliate Library will enable patrons to make many fun, personal discoveries and family connections,” adds Paul Nauta, FamilySearch Public Relations Manager.</span></p>\n<p class=\"p4\"><strong>About FamilySearch</strong></p>\n<p class=\"p3\"><span class=\"s4\">FamilySearch is the largest genealogy organization in the world. FamilySearch is a nonprofit, volunteer-driven organization sponsored by The Church of Jesus Christ of Latter-day Saints. Millions of people use FamilySearch records, resources, and services to learn more about their family history.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s3\">To help in this great pursuit, FamilySearch and its predecessors have been actively gathering, preserving, and sharing genealogical records worldwide for over 100 years. Patrons may access FamilySearch services and resources for free at <a href=\"http://FamilySearch.org\" target=\"_blank\" rel=\"noopener noreferrer\">FamilySearch.org</a> or through more than 5,000 FamilySearch centers in 129 countries, including the main FamilySearch Library in Salt Lake City, Utah.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/01/2.-Mercer-Museum-Research-Library.jpg"
}