{
  "id": 19606,
  "title": "Help! Where’s My Village? A Holistic Community for Modern Moms",
  "slug": "modern-moms-village",
  "date": "2024-05-13T10:58:35",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "Bucks County Moms",
    "moms"
  ],
  "excerpt": "<p>By Amanda Vilar • Special for the Cardinal Over the past few years, many individuals, especially moms, the gatekeepers of our homes, have experienced a sense of isolation. While we have gained independence and strength as individuals, we are missing the sense of community that our traditional support systems provided.   To address this need for [&hellip;]</p>\n",
  "content": "<p><b><em>By Amanda Vilar </em><em>• </em></b>Special for the Cardinal</p>\n<p><span style=\"font-weight: 400;\">Over the past few years, many individuals, especially moms, the gatekeepers of our homes, have experienced a sense of isolation. While we have gained independence and strength as individuals, we are missing the sense of community that our traditional support systems provided.  </span></p>\n<p><span style=\"font-weight: 400;\">To address this need for support, I have made it my mission to bring local moms support and nurture as they raise their families.  </span></p>\n<p><span style=\"font-weight: 400;\">The Modern Moms Village is a virtual community that also hosts in-person events. It connects holistic, heart-centered providers with <a href=\"https://doylestowncardinal.com/live/life-lessons-from-local-moms/\">local families</a> who are seeking support. We have created a provider directory and a private community where our providers can connect, teach, and support local families without the interference of social media algorithms and bots. This community allows providers to share information on all aspects of wellness, including mental, emotional, physical, spiritual, and energetic support.</span></p>\n<p><span style=\"font-weight: 400;\">One of the Modern Moms providers is Samantha Barrett of Saroba Wellness.</span></p>\n<p><span style=\"font-weight: 400;\">With over 1000+ combined hours of training in Integrative Wellness Practices, Samantha&#8217;s education in Trauma-Informed Hatha, Advanced Vinyasa, Yin Yogas, Somatic Meditation, Herbalism, and Ayurveda Samantha takes a holistic approach to support families and practitioners. She believes in addressing the needs of the whole body to promote overall well-being.  Navigating how to show up fully for our families can sometimes create anxiety, especially in today&#8217;s world with the constant flow of ever-changing advice. Below, she offers five tips to ease this anxiety.  </span></p>\n<h2><b>5 Ways to Ease Mom Anxiety with Somatic Practices</b></h2>\n<ol>\n<li><b> Squeeze.</b><span style=\"font-weight: 400;\"> Gently squeeze arms from shoulders down to wrists and back up to shoulders a few times. This is a sensory-focused way to calm the nervous system. It says to the brain, &#8220;Hey, feel your body.&#8221;</span></li>\n<li><b> Breathe. </b><span style=\"font-weight: 400;\">Instead of controlling your breath, witness it. Is it choppy or shallow? Does it slow down or expand once you become aware of it? Feel into your life force. Try this: inhale &#8211; pause for five &#8211; exhale &#8211; pause for five. Repeat a few minutes. Breathe in and out through the nose to activate the parasympathetic nervous system.</span></li>\n<li><b> Feel.</b><span style=\"font-weight: 400;\"> Permit yourself to feel the sensation of anxiety in your body. You will not wither away if you allow yourself to feel discomfort. There is power in holding space for the full spectrum of emotions without judgment. You could lie on the ground with your knees bent and your feet flat on the floor. Place one hand on your belly and one on your chest. Feel how your body moves when you inhale and exhale. Feel the parts of your body that connect to the earth. Welcome this grounding energy and soften it into the earth as you let it hold you for a while.</span></li>\n<li><b> Connect. </b><span style=\"font-weight: 400;\">Relax your tongue. Imagine the tongue as a door between the head and the rest of the body. When your tongue relaxes down toward the bottom palate, you open that door for the energy to flow more freely between your mind and body.</span></li>\n<li><b> Release. </b><span style=\"font-weight: 400;\">Let go of any story that arises. Imagine your brain as the sky. The thoughts come through as clouds—always moving. Let them pass. Release each one and come back to the feeling of expansion. </span></li>\n</ol>\n<p><span style=\"font-weight: 400;\">Learn more and stay connected with Samantha at @sarobawellness and The Modern Moms Village at @themodernmomsvillage. For more infomration, visit </span><a href=\"http://www.themodernmomsvillage.com\"><span style=\"font-weight: 400;\">www.themodernmomsvillage.com</span></a></p>\n<p><span style=\"font-weight: 400;\"> </span></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/05/Moms.jpg"
}