{
  "id": 12650,
  "title": "Monkey on a Mission Provides Special Needs Teens Real Opportunity",
  "slug": "monkey-on-a-mission-provides-special-needs-teens-real-opportunity",
  "date": "2022-04-07T12:49:07",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "doylestown",
    "doylestown cardinal",
    "Monkeys Uncle"
  ],
  "excerpt": "<p>By John Lund and Susan Smith • The Cardinal Contributing Writers Many of you may be familiar with Monkey’s Uncle, (www.themonkeysuncle.net) which sells cool, vintage Philly sports team wear and local, artist-inspired, Doylestown clothing. However, many of you may not be aware of the heartfelt program offered by Monkey’s Uncle called Monkey on a Mission. [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By John Lund and Susan Smith • </strong>The Cardinal Contributing Writers</p>\n<p class=\"p3\"><span class=\"s2\"><i>M</i></span><span class=\"s2\"><i>any of you may be familiar with Monkey’s Uncle, (<a href=\"https://www.themonkeysuncle.net/\" target=\"_blank\" rel=\"noopener noreferrer\">www.themonkeysuncle.net</a>) which sells cool, vintage Philly sports team wear and local, artist-inspired, Doylestown clothing. However, many of you may not be aware of the heartfelt program offered by Monkey’s Uncle called Monkey on a Mission. Jeanell and Derrick’s son Brayden Morgan, who was diagnosed with autism when he was two years old, inspired his parents to create the Monkey on a Mission program. April is Autism Awareness Month, and in this month’s issue, we celebrate Brayden, Jeanell, Derrick, and Monkey on a Mission for all their work to support teens with special needs.</i></span></p>\n<p class=\"p1\"><strong>What is Monkey on a Mission, and what was the need for such a program?</strong></p>\n<p class=\"p6\"><span class=\"s1\">Monkey on a Mission is a mentorship program that teaches special needs kids many different aspects of running a business within the high school years. Special needs kids stay within the high school programs until they are twenty-one. They still get speech, they still get support, and they get a work-based study program. However, the day they turn twenty-one, they ‘age out’, and all those support programs disappear.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">When the child ages out, it creates a systemic problem where the working parents sometimes must make significant decisions on how they will manage their work-life scenarios while taking over where the school programs left off.</span></p>\n<p class=\"p1\"><strong>What business activities do the kids perform in the Monkey on a Mission program?</strong></p>\n<p class=\"p6\"><span class=\"s1\">The kids learn the entire 360 process of the business from the back-end of making products like shirts, mugs, and bags to the front-end of folding merchandise, doing the </span><span class=\"s3\">ticketing, working the register, and how to interact with the customers. Some of the kids even develop new products by digitizing artwork and putting them on the tees, totes, or mugs, and then they interact with the customer to help sell the products they created. Every item they sell of their own work will get them a commission, and a portion of the proceeds will also go to the kid’s favorite charity.</span></p>\n<p class=\"p1\"><strong>What Makes Monkey on a Mission Different from other programs?</strong></p>\n<p class=\"p6\"><span class=\"s1\">Many other great businesses also provide work-based programs for kids with special needs, but in many cases, the jobs they perform don’t give the kids the opportunities they need. They may be given assignments to clean the bathrooms, wash the windows, or fold towels. These kids can do so much more than that, and you just have to provide them with the opportunity, have a little bit of patience, and give them some guidance. These kids can do so many amazing things that people don’t realize, and that’s what it’s about, giving the kids a chance. These kids are capable and talented, and they just need the opportunity.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s4\">The key is finding each kid’s passion and figuring out how to tap into that. Some kids are amazing artists, and some may be good with math and numbers; others are great at putting systems in place. Some kids work on our website and put all our SEO tags on or figure out which items have low inventory and may need to come down from the website. Find their strength. Find what they love and lean into that.</span></p>\n<p class=\"p1\"><strong>How has your new location helped the program grow?</strong></p>\n<p class=\"p6\"><span class=\"s4\">When we were in our old location on E. State St, we had one or two students that would come in and do a mentorship program with us. Since we moved to our current building on 123 S Main Street, which is three times as big, we can dedicate more space to the program. The building is also handicap-accessible, a huge hurdle to overcome. If we had a student with a walker or a wheelchair, they couldn’t get into our old location. We currently have ten kids working with us at various times during the week.</span></p>\n<p class=\"p1\"><strong>Monkey’s Uncle is also a member of the All-Abilities Network. Can you tell us more about this network?</strong></p>\n<p class=\"p6\"><span class=\"s4\">The All-Abilities Network is a collection of businesses in Bucks and Montgomery counties, started by parents with children with special needs, with the intended goal to give their kids a purpose once they age out of the system. There are currently about 20 businesses in the network, and they use the platform to share ideas and experiences.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">Each of the parents/owners of these businesses has unique experiences from their previous professional life, whether it be public relations and marketing to lobbying for support from Senators in Washington DC. They work together in a coordinated effort to help ‘all boats rise’ within their network of businesses.</span></p>\n<p class=\"p8\"><span class=\"s2\"><i>The overriding message from our conversation with Derrick was to provide a platform for opportunity. Derrick and Jeanell have created that platform for children to be successful and fulfilled in their work. As George Bernard Shaw said, “Don’t wait for opportunity: create it.” Derrick and Jeanell have done just that. Visit <a href=\"https://www.themonkeysuncle.net/\" target=\"_blank\" rel=\"noopener noreferrer\">Monkey’s Uncle</a> and learn more, and while you’re at it, buy some really cool stuff made by some really cool kids!<span class=\"Apple-converted-space\"> </span></i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/04/Brayden-laugh.jpg"
}