{
  "id": 11550,
  "title": "My Turn: A Fall Story in Doylestown",
  "slug": "my-turn-a-fall-story-in-doylestown",
  "date": "2021-10-13T21:09:40",
  "author": "Staff",
  "category": [
    "Live",
    "Stay",
    "Style",
    "Taste"
  ],
  "tags": [
    "david ramoy",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By David Ramoy • Special to The Cardinal My wife wanted to move home to Pennsylvania to be close to family, but my feet were firmly planted on the warm Florida sand, and I wasn’t budging. This all changed one year ago on a crisp fall day. We were in PA for a visit and [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By David Ramoy</strong> • <em>Special to The Cardinal</em></p>\n<p class=\"p2\"><span class=\"s3\">M</span><span class=\"s4\">y wife wanted to move home to Pennsylvania to be close to family, but my feet were firmly planted on the warm Florida sand, and I wasn’t budging. This all changed one year ago on a crisp fall day. We were in PA for a visit and somehow ended up in Doylestown. We had on our warm sweaters and delicious lattes from Native in hand as our two year-old son wanted to go into every store, especially Busy Bees!</span></p>\n<p class=\"p4\"><span class=\"s4\">I saw the leaves on the ground, the happy families at Burpee Park and delicious coffee shops as far as the eye can see. I called it the Hallmark town and was almost expecting folks to break out in song, it looked so sweet.</span></p>\n<p class=\"p4\"><span class=\"s4\">After a full day of walking around downtown, and admiring the many museums and the library, we headed over to Chambers 19 to grab a bite to eat. We got a table by the window to look at the leaves and elegance of the town. I ordered a pint of Guinness, and we had some french onion soup to warm ourselves up. Calling it delicious wouldn’t do it justice . . . I was in heaven.</span></p>\n<p class=\"p4\"><span class=\"s4\">Miraculously our son was in good spirts and not causing a ruckus.</span></p>\n<p class=\"p4\"><span class=\"s4\">This day changed everything. I can’t quite put my finger on it, but Doylestown has a certain “je ne sais quoi” that’s undeniable. It only took one fall day in Downtown Doylestown for my wife to convince me to leave our lives in Florida and move here. We sat at Chambers and chatted about the town and how different it would be from our Florida lifestyle. Yes, we were giving up palm trees and winter would be coming; we just didn’t care. Doylestown in fall had enticed us.</span></p>\n<p class=\"p4\"><span class=\"s4\">They say fall represents change, and it definitely did for us. Fast forward to today, we sold our house in Florida, and we are here living in this delightful hallmark of a town. We’re unpacking our fall sweaters and stocking up on pumpkin spiced coffee. We couldn’t be happier.</span></p>\n<p class=\"p4\"><span class=\"s4\">I suppose it’s a good thing our visit last year wasn’t in the winter 😉</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/10/Fall-in-Doylestown.jpg"
}