{
  "id": 17357,
  "title": "New Podcast Features Two Local Residents",
  "slug": "new-podcast-features-two-local-residents",
  "date": "2023-04-15T15:29:11",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live"
  ],
  "tags": [
    "dana roberts",
    "doylestown cardinal",
    "Nick Ventresca",
    "Steve Willis"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer If you’re a podcast listener, you know that it can sometimes be hard to choose one to listen to because there is just so much content out there. However, two local residents, Nick Ventresca and Steve Willis, just made the quest for a good listen a lot [&hellip;]</p>\n",
  "content": "<p class=\"p1\">By Dana Roberts • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s1\">I</span><span class=\"s2\">f you’re a podcast listener, you know that it can sometimes be hard to choose one to listen to because there is just so much content out there. However, two local residents, Nick Ventresca and Steve Willis, just made the quest for a good listen a lot easier with the creation of their new podcast, “It’s Not Black or White.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Each episode features a conversation between these two friends, who are individually eloquent, thoughtful, funny, and interesting humans. Their dialogue is quite meta since they talk about how to talk to another person when your backgrounds or viewpoints differ, especially when the topic at hand might be controversial. Nick and Steve, or “Willis”, as he is commonly referred to, are genuinely interested in modeling mature ways to have difficult conversations, and want to support others in doing so, too.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">The podcast is particularly relevant to tune into during April, the month in which we celebrate diversity. The title of their podcast, a clear reference to the idea that things aren’t always black or white, is also a note to one very obvious difference between them: Nick is White, and Willis is Black. Their differences extend beyond skin color; Nick is a pastor of a church in Doylestown, and Willis is an educator and is focused on equity and inclusionary works within school districts. Nick’s passion is to pastor and lead a community of people in a Protestant Church background. Willis is a self-described lifelong learner and is heavily involved in the world of DEI (diversity, equity, and inclusion).<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Together, they touch on the fact that the circles in which they orbit, the “church world” and the “DEI world,” can be conflicting. But while the men have “drastically different worldviews,” they have some things in common. They are both dads, and husbands, and united in their love and care for people and respect for each other.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">“Through our podcast, we want to demonstrate that while Nick and I have different backgrounds, we are able to come to a common ground—or not a common ground—on a conversation, but be able to have that dialogue,” Willis says. “What I find is that if we are grounded in some commonality, then other differences pull back that centerpiece. What things we truly care about as people tend to bubble up to the top, and that’s where we find our common ground. So that’s why we’re talking about normalizing challenging conversations.”</span></p>\n<p class=\"p5\"><span class=\"s2\">A “bonus” feature of their conversation is that they conduct it over a beer since both men are fans of craft beer. Cleverly, the beer they choose for each episode ties into the episode’s theme. For the intro episode, they sipped on Origin, by Anchorage Brewing Company. They describe it as “strong, hoppy, and a little too citrusy, but still a good beer.”</span></p>\n<p class=\"p5\"><span class=\"s2\">Future episodes in the series will cover a variety of topics, including what leadership looks like, hospitality, the duality of thought, personal and societal outlets, marriage, parenting, and human rights. The next episode that they’ll release will be “The Art of Dialoguing.” While the beer they’ll drink is undetermined at this point, the conversation is sure to be thought-provoking and interesting.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">To give the podcast a listen, search “It’s Not Black or White” on Spotify for Podcasters.</span></p>\n<p><a href=\"/data/media/Podcast-QR-Code.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-17358\" src=\"/data/media/Podcast-QR-Code.jpg\" alt=\"\" width=\"441\" height=\"472\" srcset=\"/data/media/Podcast-QR-Code.jpg 441w, /data/media/Podcast-QR-Code-280x300.jpg 280w\" sizes=\"auto, (max-width: 441px) 100vw, 441px\" /></a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/podcast-article-picture-smiling.jpg"
}