{
  "id": 18579,
  "title": "OPA Grille: New Family-Owned Greek Restaurant Opens In Doylestown",
  "slug": "opa-grille-new-family-owned-greek-restaurant-opens-in-doylestown",
  "date": "2023-12-14T17:42:01",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "dakoda carlson",
    "Demetria Damian",
    "doylestown cardinal",
    "OPA Grille"
  ],
  "excerpt": "<p>By Dakoda Carlson • The Cardinal Editorial Intern OPA Grille has been open for a little over a month and already has residents raving about the spot. OPA serves up authentic Greek food on its menu and brings up a wonderful family dynamic.  “It’s a family business,” says Demetria Damian, the manager of OPA. “The [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em>By Dakoda Carlson</em> • The Cardinal Editorial Intern</p>\n<p class=\"p3\"><span class=\"s2\">O</span><span class=\"s3\">PA Grille has been open for a little over a month and already has residents raving about the spot. OPA serves up authentic Greek food on its menu and brings up a wonderful family dynamic.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">“It’s a family business,” says Demetria Damian, the manager of OPA. “The kids are there and so is everyone. The whole family is just together making this work.”</span></p>\n<p class=\"p5\"><span class=\"s3\">The restaurant, located on South Main St, is owned and operated by brothers, Gus Mamounas and Jimmy Giannoumis. The brothers came from the Greek Island of Chios and have been working in the food industry ever since. During the late 80s/early 90s, Gus and Jimmy had worked together and ran their own restaurant, sharing their passion for the culinary arts.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Damian, Gus’s daughter, says her father and uncle “didn’t really want to be in the restaurant business any longer” and sold their business, but always said if the time was right, “we’ll open another restaurant as a last hurrah” says Demetria.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">After the restaurant closed, Gus went on to start his own business of food distribution within Doylestown, which he still continues to do today. Jimmy went on to work in other restaurants, including being the cook for “HotSpot” until they closed their doors.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">When Lee’s Hoagies closed down, the family saw it as an opportunity. Gus and Jimmy went back into the business and together opened up OPA Grille. “It was perfect timing,” explained Demetria. “It was the perfect spot. Everything fell into place. It was awesome.”</span></p>\n<p class=\"p5\"><span class=\"s3\">Make sure you swing by OPA Grille for a lovely, authentic Greek dining experience. Located at 266, S Main St, Doylestown.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/OPA-Gus-is-on-the-right-and-Jimmy-is-on-the-left.jpeg"
}