{
  "id": 19555,
  "title": "Picnics on Pine Create Accessible Events for All Audiences",
  "slug": "picnics-on-pine",
  "date": "2024-05-09T15:20:48",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Play"
  ],
  "tags": [
    "Doylestown Events",
    "Doylestown Music",
    "Music in Doylestown",
    "Open air concerts",
    "Stage United"
  ],
  "excerpt": "<p>By Natalya Bucuy • The Cardinal Managing Editor What makes a good picnic? Food. Friends. Music.  Picnics on Pine offers all three in a welcoming, spacious, and scenic setting. With a red barn on Pine Street as a backdrop, the event is designed with the entire family in mind &#8211; attendees of all ages and [&hellip;]</p>\n",
  "content": "<p><b><em>By Natalya Bucuy • </em></b>The Cardinal Managing Editor</p>\n<p><span style=\"font-weight: 400;\">What makes a good picnic? Food. Friends. Music. </span></p>\n<p><span style=\"font-weight: 400;\">Picnics on Pine offers all three in a welcoming, spacious, and scenic setting. With a red barn on Pine Street as a backdrop, the event is designed with the entire family in mind &#8211; attendees of all ages and even pets are welcome. </span></p>\n<p><span style=\"font-weight: 400;\">The first of this year’s picnic on May 11 brings sets by two rising area songwriters, CLOVER from Frenchtown, NJ, and Moustapha Noumbissi, a Philadelphia native. Simply Delicious By Tina of Jamison will offer a picnic-inspired menu, and a makers&#8217; market will bring local craft vendors to showcase their work. Attendees can bring blankets or chairs to enjoy the performances and delicious bites as the sun goes down on Pine Street and Oakland Avenue. </span></p>\n<p><span style=\"font-weight: 400;\">“The picnics foster unique energy, introduce people to new artists, and create a special atmosphere,” Picnics on Pine creator Joe Montone says. “It’s a great way to bring the community together.”</span></p>\n<figure id=\"attachment_19558\" aria-describedby=\"caption-attachment-19558\" style=\"width: 1024px\" class=\"wp-caption alignnone\"><a href=\"/data/media/Montone.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-19558 size-large\" src=\"/data/media/Montone-1024x683.jpg\" alt=\"Joe Montone, Picnics on Pine\" width=\"1024\" height=\"683\" srcset=\"/data/media/Montone-1024x683.jpg 1024w, /data/media/Montone-300x200.jpg 300w, /data/media/Montone-768x513.jpg 768w, /data/media/Montone-414x276.jpg 414w, /data/media/Montone-470x313.jpg 470w, /data/media/Montone-640x426.jpg 640w, /data/media/Montone-130x86.jpg 130w, /data/media/Montone-187x124.jpg 187w, /data/media/Montone-990x661.jpg 990w, /data/media/Montone-1320x881.jpg 1320w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" /></a><figcaption id=\"caption-attachment-19558\" class=\"wp-caption-text\">Joe Montone, Picnics on Pine</figcaption></figure>\n<p><span style=\"font-weight: 400;\">Montone, 34, started the venture at a time when the town most needed live music events &#8211; amid the pandemic, in July of 2020. As bars and restaurants in town dealt with restrictions, Montone saw the need for an event that would bring music to the community while keeping everyone safe. That’s when he improvised and started Distance Picnics, an experiment that worked. Held outside, with enough room to socially distance, the event fulfilled the one need people had &#8211; to be together in the hardest of times, united by music. </span></p>\n<p><span style=\"font-weight: 400;\">“The goal was to create a food court for local restaurants and to present socially distant concerts,” Montone says. “Being on the microphone, announcing the performing artist, I felt completely suspended in time and space. I could feel the crowd&#8217;s need for that moment, I could feel the importance of music in that moment. It was so moving and life-changing,” he recalls.</span></p>\n<p><span style=\"font-weight: 400;\">The lockdown created the platform, but as Picnics on Pine now enters its fifth season, it’s clear that the need for live music remains. Each year since then, live music events on Pine Street have brought together music lovers, performers, and vendors. </span></p>\n<p><span style=\"font-weight: 400;\">This year, Montone started Stage United, a non-profit that organizes music events in the area. “We partner with local venue owners, historic landmarks, and unconventional spaces to present live music and help those facilities market the events,” he explains. “It will be a way to produce spectaculars more consistently and more sustainably.”</span></p>\n<p><span style=\"font-weight: 400;\">Despite having a rich live music culture, there is no art infrastructure in Doylestown, Montone says. With Stage United, he and his team will focus on presenting music events at existing area venues, historic landmarks, or other out-of-the-ordinary spaces. Stage United will plan concerts with representatives from each location, source refreshing artists relevant to those spaces, provide marketing tools for the festivities, and help financially support costs </span><span style=\"font-weight: 400;\">associated with the production.</span></p>\n<p><span style=\"font-weight: 400;\">The second picnic of the year is set to take place on June 15 in collaboration with the Doylestown Pride Festival. “This is a new way of presenting music so it doesn&#8217;t just fall on the backs of a bar owner or facility operator,&#8221; he says, &#8220;it welcomes more collaboration as we’d be working with those venues to present live music to the community.”  </span></p>\n<p><span style=\"font-weight: 400;\">Montone, a musician himself, has worked in the area to put on live music events for the last 14 years. He has developed unique concert programming for venues such as Puck, the TileWorks of Bucks County, Abington Art Center, the Doylestown Pride Fest, and the James A. Michener Art Museum. He believes that creating more resources to expand is extremely important as is hosting events open to audiences of all ages, not only those who can patronize bars. “Live music is essential to the town’s ecosystem,” he says. “We crave this.  I think our community is stronger than ever, and so, the way we demand live music can be too.&#8221;</span></p>\n<p><span style=\"font-weight: 400;\">For tickets and more information, visit </span><a href=\"http://picnicsonpine.com/\"><span style=\"font-weight: 400;\">picnicsonpine.com</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"http://stageunited.org/\"><span style=\"font-weight: 400;\">stageunited.org</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><a href=\"/data/media/Picnics.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-large wp-image-19559\" src=\"/data/media/Picnics-1024x683.jpg\" alt=\"picnics on pine \" width=\"1024\" height=\"683\" srcset=\"/data/media/Picnics-1024x683.jpg 1024w, /data/media/Picnics-300x200.jpg 300w, /data/media/Picnics-768x513.jpg 768w, /data/media/Picnics-414x276.jpg 414w, /data/media/Picnics-470x313.jpg 470w, /data/media/Picnics-640x426.jpg 640w, /data/media/Picnics-130x86.jpg 130w, /data/media/Picnics-187x124.jpg 187w, /data/media/Picnics-990x661.jpg 990w, /data/media/Picnics-1320x881.jpg 1320w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" /></a></p>\n<p><em><span style=\"font-weight: 400;\"><strong>Natalya Bucuy</strong> is a journalist, fiction and non-fiction writer, and the managing editor of the Cardinal. You can often find her roaming the streets of her beloved Doylestown in search of writing material, adventure, or both. To view more of her work, visit her website, nowwehaveastory.com</span></em></p>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/05/PicnicsonPine.jpg"
}