{
  "id": 11592,
  "title": "Pine2pink Summoned To Newtown By Small Business Community",
  "slug": "pine2pink-summoned-to-newtown-by-small-business-community",
  "date": "2021-11-13T12:01:10",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "Corinne Sikora Center",
    "doylestown cardinal",
    "Newtown Borough retailers",
    "The Pine2Pink Foundation"
  ],
  "excerpt": "<p>Expanding to Its Sixth Location in Bucks County, the Non-Profit has helped over 1000 Local Breast Cancer Patients The Pine2Pink Foundation 501(c)(3), an experience-based, community-driven non-profit dedicated to local breast cancer patients is happy to announce its expansion to Newtown, PA. The expansion opportunity presented itself when local Newtown Borough retailers on Historic State Street [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong><i>Expanding to Its Sixth Location in Bucks County, the Non-Profit has helped over 1000 Local Breast Cancer Patients</i></strong></p>\n<p class=\"p3\"><span class=\"s2\">T</span><span class=\"s1\">he Pine2Pink Foundation 501(c)(3), an experience-based, community-driven non-profit dedicated to local breast cancer patients is happy to announce its expansion to Newtown, PA. The expansion opportunity presented itself when local Newtown Borough retailers on Historic State Street united to bring the non-profit to town for the month of October. The fundraising efforts culminates at the end of the month with an event on October 28 on State Street All efforts will help locals battling cancer through two local non-profits: Pine2Pink and the Corinne Sikora Wellness and Support Center.</span></p>\n<p class=\"p5\"><span class=\"s1\">Pine2Pink’s immersive fundraising experience is being created by shop owners along State Street changing their exterior lights pink, virtual pink ribbons hidden throughout town as part of the Pine2Pink scavenger hunt, multiple stores creating and selling special items offering a percentage of sales to the non-profit. On Thursday, October 28 the retailers have organized a block party called “Light The Night Pink”. The event will stretch the length of State Street in the Borough and include music, drinks, sip n’ shops, special deals, an art expo, raffles and more! The event will begin at 6:30 p.m. until 9:00 p.m.</span></p>\n<p class=\"p5\"><span class=\"s1\">Retailers who have led the charge to bring Pine2Pink to Newtown are Gina-Maria Santoro, Owner, Giovanni’s Fine Fashions, Kathleen McCafferty, Owner, The Pro Shop of Newtown and Stephanie Eubanks, owner of Sugarbomb Bakery. Brittany Brown AKA Britt-Around-Town, a local Social Influencer and Pine2Pink supporter running partnerships, created viral social posts featuring Pine2Pink that caught the attention of these local Newtown small business entrepreneurs.</span></p>\n<p class=\"p5\"><span class=\"s1\">“Since opening our doors seven years ago, Giovanni’s has developed strong relationships with our customers and our neighboring retailers. I wanted to harness the strength of our community and support a non-profit with a track record of keeping funds local and giving 100% of money raised to those in need. We have all been touched by cancer. I am honored to help get Newtown involved in raising funds for the men and women battling in our Community,” said Gina-Maria Santoro, Owner, Giovanni’s Fine Fashions.</span></p>\n<p class=\"p5\"><span class=\"s1\">Kathleen McCafferty, Owner, The Pro Shop of Newtown shares, “I was introduced to the Corinne Sikora Wellness and Support Center by a lifetime friend who’s a Founding member of the Center, Alyssa Walloff. I learned that all Bucks County residents battling cancer will be able to utilize the Center’s integrative, therapeutic and supportive services for free. Being that the center is 100% donation based, I wanted to do my part to bring awareness to the Center and raise money so the Center has the resources it needs to help cancer patients from our Community. Many of my customers are either battling or survivors, our efforts are for them.”</span></p>\n<p class=\"p5\"><span class=\"s1\">“The Pink lights in front of stores and on our street lamps during the month of October will serve as a symbol to acknowledge our local Community members who are going through breast cancer treatment and recovery. We will celebrate the people who won the fight, encourage those battling and remember those who are no longer with us. We are excited to welcome the Pine2Pink Foundation to the Newtown Borough to work with our businesses owners and community to raise funds for our local patients,“ states Nicole Rodowicz, Newtown Borough Council.</span></p>\n<p class=\"p5\"><span class=\"s1\">“Pine2Pink was designed to be a visceral, experience-based, community driven non-profit that keeps funds local. Watching the small business owners form Newtown embrace the program and rally their community around Pine2Pink and the Corinne Sikora Center has been awe inspiring. Because of Gina, Kathleen and Stephanie and the amazing Newtown business Community, our non-profit is able to thrive and help more Community members battling cancer and for this we are grateful,” states Keith Fenimore the Founder &amp; Executive Director of Pine2Pink and Executive Director and Founding Member of the Corinne Sikora Wellness and Support Center.</span></p>\n<p class=\"p5\"><span class=\"s3\">Visit their websites to donate or participate in community events (<a href=\"http://www.pine2pink.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.pine2pink.org</a>) (<a href=\"http://www.corinnesikoracenter.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.corinnesikoracenter.org</a>). Donations can also be made via check and sent to P.O. Box 307, Doylestown, PA 18901.</span></p>\n<p class=\"p5\"><span class=\"s1\">You can also visit Pine2Pink on Facebook and Instagram: @Pine2Pink and Corinne Sikora Center at @corinnesikoracenter</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/11/Pine2PinkNewtown.jpg"
}