{
  "id": 19130,
  "title": "“Rocking” Revival by Great Barn at Puck Live!",
  "slug": "rocking-revival-by-great-barn-at-puck-live",
  "date": "2024-03-11T17:18:02",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Style",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Great Barn at Puck Live"
  ],
  "excerpt": "<p>By Natalya Bucuy • The Cardinal Managing Editor “Rocking!” That is how Maryana Ferguson describes the new adventure she and husband Steve sail on this year. Owners of the Great Barn Brewery, the couple recently announced the business’ comeback to the music venue scene. Puck Live!, Doylestown’s old favorite venue returns under Great Barn’s management [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Natalya Bucuy</strong></em> • The Cardinal Managing Editor</p>\n<p class=\"p3\"><span class=\"s2\">“Rocking!”</span></p>\n<p class=\"p4\"><span class=\"s1\">That is how Maryana Ferguson describes the new adventure she and husband Steve sail on this year. Owners of the Great Barn Brewery, the couple recently announced the business’ comeback to the music venue scene. Puck Live!, Doylestown’s old favorite venue returns under Great Barn’s management with the soft opening set for March 1.</span></p>\n<p class=\"p4\"><span class=\"s1\">The news comes as music to the ears of the local talent and music fans, now presented with additional performance space. “The most excitement comes from realizing how many people missed the music culture that Puck has built over the years,” Maryana says. “To see so many supporters that love live music and share the same passion for it is very encouraging.” </span></p>\n<p class=\"p4\"><span class=\"s3\">The Fergusons plan the re-opening of Puck to unfold in three phases. The first phase welcomes visitors the first week of March with a line-up of bands and a complete basement bar serving Great Barn farm-grown brews and other Pennsylvania-made wines and spirits. Phase two will bring the restaurant aspect to the venue. “As we await indoor kitchen renovations, we prepare to launch our food menu sometime in April,” Maryana says.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">A popular live music venue and club between 2006 and 2019, Puck occupies the basement of a former bank built in 1929, mere weeks before the Great Depression. The spacious basement features a stage, a mixing booth, and a studio-quality sound system that await the opening night. Backstage, signatures of various musicians that played here dignify a simple wall, reminding of the venue’s rich cultural past. Impressive stonework of the bank’s interior upstairs creates a unique background for an intimate lounge.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">With Puck as a significant part of their careers in the past, local musicians share the Fergusons’ enthusiasm for the project. Big-name acts such as Richie Havens, Robert Hazard, Danielia Cotton, Bunny Sigler, and The Lumineers have performed at Puck. “I’m very excited at the pairing of Great Barn and Puck,” says David Nonini, who returns to Puck as an open mic host, a job he missed during the venue’s closure. “Maryana and Steve are great, very warm, and welcoming to all musicians. They hosted some great shows at their former location, and they’ll continue to do so.”</span></p>\n<p class=\"p4\"><span class=\"s1\">On the outdoor patio, a future setting of a summer kitchen and garden bar &#8211; phase three of the project, Maryana shows me how she plans to arrange the flowers and set the tables outside. She dreams of an innovative menu, fun drinks and mocktails, and a lively atmosphere full of music. The vision blooms in her eyes with passion, the most essential of ingredients for business success.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">The revival of Puck and another Great Barn venue comes as much of a surprise to the Fergusons themselves as to anyone. In November, after almost three years in business, the Great Barn Taphouse in Valley Square suddenly closed its doors due to increasing lease costs.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Long winter months of uncertainty discouraged the couple. They continued to run the brewery and the Taproom in New Hope, but they weren’t sure what to do next. But it’s when we least expect it fate brings us something life-changing. This time, it was a phone call from Lynn Goldman, the owner of the Puck building. She proposed the Great Barn take over. And so the Ferguson rolled up their sleeves once again and got back to work.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">Moving within the Doylestown borough brings certain advantages to the growing microbrewing business. “We believe that locals deserve to have the best representation of truly local products,” Maryana says. “All grains are grown on our farm in Kintnersville only 18 miles away from Doylestown. Our beer is locally malted and brewed on the farm using a spring-fed water source. These practices greatly reduce our footprint as a brewery and contribute to the sustainability of the business overall.”</span></p>\n<p class=\"p4\"><span class=\"s1\">As the Fergusons look forward to new beginnings, they take their past experiences and the lessons they brought with them. “I just tell myself, ‘Don’t screw it up!’” Maryana smiles. “That’s all I gotta do. We’re ready to rock!”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Puck Live! by Great Barn is located at 1 Printers Alley. Hours of operation: Wed. 6 p.m.-10 p.m., Thurs. 6 p.m.-11 p.m., open mic 7 pm-10 pm, Fri. 5 p.m.-12 a.m., Sat. 3 p.m.-12 a.m., Sun. 12 p.m.-9 p.m.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/03/Great-Barn.jpeg"
}