{
  "id": 14840,
  "title": "Scarecrows in the Village Kickoff Weekend",
  "slug": "scarecrows-in-the-village-kickoff-weekend",
  "date": "2022-09-12T23:24:37",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Play",
    "Taste"
  ],
  "tags": [
    "Christine Hensel Triantos",
    "doylestown cardinal",
    "peddlers village"
  ],
  "excerpt": "<p>Peddler’s Village will present its 43rd annual Scarecrows in the Village competition and display starting on September 5. Other events taking place in September include a kickoff weekend, scarecrow-making workshops, free outdoor movies, a comedy show, food truck event, and an Autumn Wedding Show.  Each year, Peddler’s Village invites Philadelphia-area residents and organizations to create [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">P</span><span class=\"s2\">eddler’s Village will present its 43rd annual Scarecrows in the Village competition and display starting on September 5. Other events taking place in September include a kickoff weekend, scarecrow-making workshops, free outdoor movies, a comedy show, food truck event, and an Autumn Wedding Show.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Each year, Peddler’s Village invites Philadelphia-area residents and organizations to create scarecrows for its annual Scarecrows in the Village competition and display. The colorful and inventive scarecrows complement autumn-tinted Village for two months; the Village-wide display begins on Monday, September 5 and continues through Monday, October 31. Registration for the competition, which awards cash prizes, is open through Thursday, September 1. Members of the public are encouraged to vote for their favorites via the Peddler’s Village mobile app or by picking up a paper ballot at the Visitor and Event Center. Voting ends October 10.</span></p>\n<p class=\"p3\"><span class=\"s2\">On Saturday, September 10 and Sunday, September 11, Peddler’s Village will be presenting a Kickoff to Scarecrows in the Village. The weekend, which will feature a full schedule of live entertainment and performances, will also include a free outdoor movie—The Wizard of Oz—with trivia hosted by Alysa Bainbridge, Miss Pennsylvania 2022, and square dancing with the Long Hill String Band. Other family activities include scarecrow-making workshops, a story time session, musical performances, and jugglers. The weekend schedule can be found on <a href=\"http://PeddlersVillage.com\" target=\"_blank\" rel=\"noopener noreferrer\">PeddlersVillage.com</a>.</span></p>\n<p class=\"p3\"><span class=\"s2\">The ever-popular scarecrow-making workshops will take place on select weekends in September (Saturdays September 10, 17, 24, and Sunday, September 11). Families and groups that register for the event will be guaranteed a designated circle, materials and step-by-step instructions to create a life-size scarecrow to take home. Advance registration is strongly encouraged; walk-ins are based on availability.</span></p>\n<p class=\"p3\"><span class=\"s2\">Other events this September include a Comedy in the Village show on Friday, September 23, free outdoor movie nights on Saturdays September 10 and 24, and a Food Truck Thursday event, the last of the season, on Thursday, September 29. Couples interested in learning more about weddings at Peddler’s Village can register for the free Autumn Wedding Show on Sunday, September 18 where they can enjoy complimentary hors d’oeuvres, beverages, and desserts and have the opportunity to meet the Peddler’s Village event planning team as well as local vendors who will help make their dream wedding a reality.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\"><span class=\"Apple-converted-space\"> </span>To inquire about autumn and winter events sponsorship, contact Christine Hensel Triantos at <a href=\"mailto:ctriantos@peddlersvillage.com\">ctriantos@peddlersvillage.com</a>.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/09/Scarecrows.jpg"
}