{
  "id": 19376,
  "title": "Shad Festival Set For April 20/21",
  "slug": "shad-festival-set-for-april-20-21",
  "date": "2024-04-15T23:32:55",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Play",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal newspaper",
    "lambertville",
    "new jersey",
    "Shad Festival"
  ],
  "excerpt": "<p>By Jay Garrison • The Cardinal Contributing Writer Mark your calendars for the highly anticipated Shad Festival, taking place on April 20 &amp; 21 in downtown Lambertville.  Started in 1981, this year’s festival promises a vibrant display of hand-crafted art, jewelry, home goods, and delectable food. Attendees can also enjoy live music and entertainment suitable [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Jay Garrison • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s1\">M</span><span class=\"s2\">ark your calendars for the highly anticipated Shad Festival, taking place on April 20 &amp; 21 in downtown Lambertville.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Started in 1981, this year’s festival promises a vibrant display of hand-crafted art, jewelry, home goods, and delectable food. Attendees can also enjoy live music and entertainment suitable for the entire family.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Each spring, the Delaware River in Lambertville becomes a gathering place for returning Shad, who make their way back from the Atlantic Ocean to spawn before returning to the ocean. Shad fishing with Steve Meserve will start at 1 pm both days on Lewis Island (Lambert Lane), weather permitting.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">The festival will feature local artists along Church Street, home and garden vendors in the N. Union parking lot, a beer garden in the Lambertville Station parking lot, a poster show and auction at the 1st Presbyterian Church Gym Space, and a food court in the Wells Fargo parking lot.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Sponsored by Union Chill, the festival recommends parking at Riverwalk at Mt. Hope and Wilson Street or Diamond Silver (Arnett Ave &amp; N. Main Sts).<span class=\"Apple-converted-space\">  </span>The festival takes place from 11am &#8211; 5pm both days.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">With something for everyone, the festival is a fun and family-friendly event.</span></p>\n<p class=\"p5\"><span class=\"s2\">For more information, visit the festival’s website <a href=\"http://www.LambertvilleChamber.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.LambertvilleChamber.com</a></span></p>\n<p class=\"p6\"><strong>Poster Auction at Shad Festival<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p5\"><span class=\"s2\">Each year, local artists unite to support the dreams of young artists through the Jim Hamilton Memorial Shad Festival Scholarship. The scholarship awards two $10,000 scholarships to local high school seniors pursuing a college degree in the fine, performing, or culinary arts.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Led by Amy Cross and a team of volunteers the auction provides a unique opportunity for art enthusiasts to purchase exceptional works while contributing to the education of talented young artists.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">“The arts are so important to us as humans. Arts are how we express our emotions and how we relate to each other. So to spearhead the scholarship for the arts means so much to me because the students get so excited that their community is behind them and the parents are relieved that a group of people come together to fund the arts.” said Amy Coss<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">The fundraising effort culminates in an art auction featuring original works by local artists. The posters will be on display on April 19th and 22nd, with a Silent Auction open during these times. A Live Auction will take place on Sunday, April 22nd at 3pm, led by renowned experts Suzanne Perrault and Mayor Larry Keller.<span class=\"Apple-converted-space\">  </span>The auction takes place inside the 1st Presbyterian Church Gym Space on North Union Street.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Since its inception in 1981, the scholarship has awarded over half a million dollars to deserving students. Eligible high school seniors from surrounding New Jersey and Pennsylvania communities are encouraged to apply.</span></p>\n<p class=\"p5\"><span class=\"s2\"><span class=\"Apple-converted-space\"> </span>For more information and to apply, visit <a href=\"http://www.LambertvilleChamber.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.LambertvilleChamber.com</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/04/B5DCB180-1B8B-41D8-9326-D2EAC49C8FBA2023-04-23_12-06-52_000_arw.jpg"
}