{
  "id": 11868,
  "title": "Shop It Like It’s Hot! The Guide to Shopping Local this Holiday Season for Everyone on Your List",
  "slug": "shop-it-like-its-hot-the-guide-to-shopping-local-this-holiday-season-for-everyone-on-your-list",
  "date": "2021-12-15T09:18:13",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Fit",
    "Style",
    "Taste"
  ],
  "tags": [
    "Allora Gifts &amp; Home Décor",
    "Busy Bee Toys",
    "Doylestown Bookshop",
    "doylestown cardinal",
    "makers off main",
    "Mercantile at Doylestown",
    "Monkeys Uncle",
    "Olive Oil Etcetera",
    "Raymer’s Homemade Candies",
    "Serendipity",
    "Sports Connection",
    "The Salt Cave",
    "Urbanlux",
    "Vintage Alley"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer The holiday season is upon us, and with it comes the panic of making sure you’ve checked the boxes for everyone on your shopping list. Not to fear, we’ve got a handy guide for the best places to shop locally for everyone in your life.  Whether you [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Dana Roberts • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s1\">T</span><span class=\"s1\">he holiday season is upon us, and with it comes the panic of making sure you’ve checked the boxes for everyone on your shopping list. Not to fear, we’ve got a handy guide for the best places to shop locally for everyone in your life.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\">Whether you like to get your shopping done ahead of time, or, like me, rush out on December 24th in a mad dash trying to find something that will pass as a gift, this guide is for you. Plus, the benefits of shopping right here in Doylestown abound- you can support all the amazing businesses in our community AND avoid the stress of shipping delays and the madness of big box stores. Read on for where to go to buy for everyone on your list!</p>\n<p class=\"p5\"><b>For the Little Ones…</b></p>\n<p class=\"p1\">Look no further than the adorable toy store Busy Bee Toys, right on State Street. This cheerful, bright store offers gifts for children of all ages, from infants to teens. Arts and crafts, building and construction toys, dolls, plush toys, figurines, books, games, electronic toys, instruments, outdoor and sports toys, pretend play, sensory toys, puzzles, and science activities are just a few of the many categories of items Busy Bee offers. In addition to unique brands and toys you’ve never seen, the store also has the kindest employees who are always willing to offer a spot-on recommendation for the child in your life. And free, lovely gift wrapping is available!<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>Busy Bee Toys, 58 E. State Street, Doylestown<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p1\"><b>215-345-6070, Online shopping also available at <a href=\"http://busybeetoys.net\" target=\"_blank\" rel=\"noopener noreferrer\">busybeetoys.net</a></b></p>\n<p class=\"p5\"><b>For the Bookworm in Your Life…</b></p>\n<p class=\"p1\">Head to the Doylestown Bookshop to satisfy the literary cravings of the readers you adore! The Doylestown Bookshop (and its sister shop, the Lahaska Bookshop, in Peddler’s Village) features well curated displays of books of every genre, and a wonderful Staff Picks section. The children’s section is a great place to pick up unique books, activities, games and toys for the little ones in your life.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\"><span class=\"s1\">A lovely bonus of the Bookshop? You can also find gifts for nonreaders here, including U.S.A made hats, mittens, kitchen goods, decorative items, candles, funny socks and trinkets. But the book selection is truly beyond comparison, and store owner Glenda Childs says that this holiday season, the new releases will not disappoint. She and her staff are so excited about the many new titles coming out.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>Doylestown Bookshop, 16 South Main Street, Doylestown, 215-230-7610, <a href=\"http://doylestownbookshop.com\" target=\"_blank\" rel=\"noopener noreferrer\">doylestownbookshop.com</a></b></p>\n<p class=\"p5\"><b>For Your Quirky Friend…</b></p>\n<p class=\"p1\">If you haven’t yet stumbled upon Allora, a treasure of a shop on State Street by Nat’s Pizza, it is imperative that you head in this season to find delightful merchandise for that wacky aunt, cheeky neighbor, or witty friend you adore. Owned by Donna Gouldey, a Doylestown native and C.B. East graduate, this store offers a fun mix of holiday décor, clever cards, stationary, puzzles, hand towels and kitchenware, candles, bath and body products, jewelry, eco-friendly products, Advent calendars, teas, jerky and hot sauces, plant hangers, and more. This is the only place in town you will find a Schitt’s Creek prayer candle or a Dolly Parton puzzle to make you chuckle. Donna can also help you create a lovely gift basket if desired.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><span class=\"s2\"><b>Allora Gifts &amp; Home Décor, 156 West State Street, Doylestown, 267-406-4171, <a href=\"http://thisisallora.com\" target=\"_blank\" rel=\"noopener noreferrer\">thisisallora.com</a>, email: <a href=\"mailto:thisisallora@gmail.com\" target=\"_blank\" rel=\"noopener noreferrer\">thisisallora@gmail.com</a></b></span></p>\n<p class=\"p5\"><span class=\"s3\"><b>For the Wine Lover…</b></span></p>\n<p class=\"p1\"><span class=\"s3\">An experience gift is always a delight, especially when it involves wine. For the oenophile in your life, make the great (and ahem, very easy) choice of getting a gift certificate or booking a tour through Tastings &amp; Tours. They offer local wine, beer, and spirits tastings for $150 per person at 3 selected local wineries, breweries, or distilleries, with lunch included in the package price.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">An added bonus of a driver for the tour will allow your loved one to truly sit back and enjoy the experience. Tours are offered primarily on Saturdays and Sundays, but can be arranged on weekdays by calling or emailing.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>Book a tour or get a gift certificate at <a href=\"http://Tastingsandtours.com\" target=\"_blank\" rel=\"noopener noreferrer\">Tastingsandtours.com</a>, call at 484-695-6465, or email at <a href=\"mailto:info@tastingsandtours.com\">info@tastingsandtours.com</a></b></p>\n<p class=\"p5\"><b>For the Home Goods Connoisseur…</b></p>\n<p class=\"p1\">Urbanlux is the place to shop for the loved one in your life who has a beautifully decorated home. This lovely, airy store, located in Main Street Marketplace, offers personalized cutting boards and charcuterie boards, vases, pillows, throws and candles.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\">Owners Marie and Henry Gonzalez, and their sons Jeremy and Chris, also make gorgeous custom furniture. If your loved one is patient and will happily accept a belated gift, they could have a handcrafted table, console, buffet, shelf unit, dresser, or nightstand (in 6-12 weeks from order date). Urbanluxe also offers paint workshops that are furniture or project based.</p>\n<p class=\"p1\"><b>Urbanlux, 22 South Main Street, Doylestown, 610-409-1999, <a href=\"http://www.urbanluxhome.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.urbanluxhome.com</a></b></p>\n<p class=\"p5\"><b>For the Sweet Tooth…</b></p>\n<p class=\"p1\">Raymer’s Homemade Candies is the place to go for delicious homemade chocolates and candies for the sweets lover on your list. Owners Sue and Mark Raymer have been in business for 20 years and offer a variety of delightful goodies, including chocolate covered wine bottles, chocolate Santas, assorted chocolate boxes, and pretzel trays.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\">The chocolate covered Oreos are a must try (and great stocking stuffer!). Raymer’s also can provide corporate gifts starting at $30 and party trays that will not disappoint. Gifts can also be shipped (call or email).<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>Raymer’s Homemade Candies, 21 East Oakland Avenue, Doylestown, 215-348-3788, <a href=\"http://raymerscandies.com\" target=\"_blank\" rel=\"noopener noreferrer\">raymerscandies.com</a>, email at <a href=\"mailto:caramels@raymerscandies.com\">caramels@raymerscandies.com</a></b></p>\n<p class=\"p5\"><span class=\"s3\"><b>For the Apparel Lover…</b></span></p>\n<p class=\"p1\"><span class=\"s3\">Monkey’s Uncle is the place to go to shop for babies, babes, dudes and dads who like their clothes witty, retro/vintaged-inspired, and stylin’. Offering team shirts, local shirts, hats and accessories, and the cutest clothes for babies and kids (who wouldn’t want to put their child in a shirt that said “Winning is for the Birds”?!), this boutique is a must to visit.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\">Plus, Monkey’s Uncle proudly mentors young adults of all abilities, teaching them how to embrace their individual superpowers while providing real world job skills. An excellent local business to support!</p>\n<p class=\"p1\"><b>Monkey’s Uncle, 123 S. Main Street, Doylestown, 267-247-5865, <a href=\"http://themonkeysuncle.net\" target=\"_blank\" rel=\"noopener noreferrer\">themonkeysuncle.net</a></b></p>\n<p class=\"p5\"><b>For the Person Who Needs to Unwind…</b></p>\n<p class=\"p1\">The Salt Cave is the place to go for your friend or relative who could use some TLC and relaxation. Undoubtedly the loveliest little store in Doylestown, the Salt Cave is tucked away on the tiny alley off State Street and offers a variety of delightful bath and body products, salt lamps, candles, a crystal bar, as well as sessions in their featured salt cave, facials, massage therapy, Reiki healing therapy, and reflexology.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\">The salt cave consists of nearly 5000 pounds of Pink Himalayan Salt. A salt therapy session involves relaxing and detoxing in a tranquil and beautiful environment, in a zero gravity recliner. Salt therapy is incredibly beneficial and can boost your immunity, relieve stress, provides relief and reduces symptoms of allergies, asthma, respiratory issues, and inflammatory skin conditions.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\">This holiday season the Salt Cave also offers a $25 “build a box” that can be filled with 5 products in a cute display.</p>\n<p class=\"p1\"><b>The Salt Cave, 46 E. State Street, Doylestown, 215-515-SALT, <a href=\"http://buckscountysaltcave.com\" target=\"_blank\" rel=\"noopener noreferrer\">buckscountysaltcave.com</a></b></p>\n<p class=\"p5\"><b>For the Chef…</b></p>\n<p class=\"p1\">The selection at Olive Oil Etcetera, located in Main Street Marketplace, will bring any home chef (whether advanced or novice in skill level) a tasty treat. Olive oil is a must to have on hand for any kitchen, and this shop will not disappoint in variety and taste.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\">Featuring domestic olive oils and imported balsamic vinegars, honey, spices and seasonings, specialty foods, beauty products, home goods and accessories, your mouth will water, and your senses will be delighted while walking through this shop. An added bonus is the taste testing available!<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>Olive Oil Etcetera, 22 South Main Street, Doylestown (inside Main Street Marketplace), 267-880-6258, <a href=\"http://oliveoiletc.com\" target=\"_blank\" rel=\"noopener noreferrer\">oliveoiletc.com</a></b></p>\n<p class=\"p5\"><b>For the Plant Lover…</b></p>\n<p class=\"p1\">The best gift to give when you are stumped is a plant, in my humble opinion. Houseplants bring greenery and oxygen into any space, brighten a home, and offer the owner something to take pride in. Vintage Alley not only has the best selection of houseplants, but the owner of this shop, the lovely (and fittingly-named) Alley is the friendliest, kindest woman and has great advice on plants and all of the products in her shop.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\">If you’re not sure if your loved one can manage a plant, not to fret- Vintage Alley also carries a great assortment of unique, vintage clothing, bath and body products, home goods, candles, and jewelry. The shop has the vibe of Northern California and is a treat to spend time browsing in.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>Vintage Alley, 7 Taylor Avenue, Doylestown (in the Taylor Alley Shopping Center), 267-406-9354, <a href=\"http://shopvintagealley.com\" target=\"_blank\" rel=\"noopener noreferrer\">shopvintagealley.com</a></b></p>\n<p class=\"p5\"><b>For the Tough to Shop for…</b></p>\n<p class=\"p1\">Stumped on what to buy for your father-in-law, neighbor, boss, teenager, or child’s teacher? Make the great choice of visiting either of Doylestown’s vendor-based stores, Serendipity (at the corner of Main Street and Oakland Avenue) and Mercantile (located in the former Bon-Ton location, in the Doylestown Shopping Center).<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\"><span class=\"s3\">Serendipity was started by a mother-daughter duo and is committed to serving the community and delivering products that come from the heart. It’s the “go-to place” for locals and travelers for clothing and gifts alike, and features specialty products, surf brands, sports apparel, fashion jewelry, handbags and accessories, and bath and body products.</span><span class=\"s1\"><span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\">Mercantile was started in 2020 and features over 130 local vendors and artists. The store offers products featured by a variety of makers, including candles, artwork, plants, clothing, home goods, jewelry, decorations, furniture, handbags, CBD products, pet products, and novelty foods. Mercantile also offers live events (yoga! Santa and Grinch visits!) and classes.</p>\n<p class=\"p1\"><b>Serendipity, 33 South Main Street, Doylestown, 267-406-4129, <a href=\"http://shopsofserendipity.com\" target=\"_blank\" rel=\"noopener noreferrer\">shopsofserendipity.com</a></b></p>\n<p class=\"p1\"><b>Mercantile at Doylestown, 444-446 North Main Street, Doylestown, 484-439-4588, <a href=\"http://mercantiledoylestown.com\" target=\"_blank\" rel=\"noopener noreferrer\">mercantiledoylestown.com</a></b></p>\n<p class=\"p5\"><b>For the Sports Lover…</b></p>\n<p class=\"p1\"><span class=\"s1\">Head straight to Doylestown Sports Connection, a well curated shop that offers sports cards, Mitchell &amp; Ness apparel, vintage and hard-to-find jerseys, and limited-edition sneakers. Sports Connection can also take special orders for sneakers, perfect for that tricky-to-buy for teenage boy or trendy, athletic dude in your life. Family owned by John and Jess Calvecchio, this store, at the corner of West Oakland and Hamilton streets, is centrally located and perfect to check out while doing all of your in-town holiday shopping.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>Sports Connection, 38 West Oakland Avenue, Doylestown, 215-693-2206, <a href=\"http://chalfontsc.com\" target=\"_blank\" rel=\"noopener noreferrer\">chalfontsc.com</a></b></p>\n<p class=\"p5\"><b>For the Crafter and Lover of Handmade Goods…</b></p>\n<p class=\"p1\">You’re sure to find a wonderful holiday gift at Makers Off Main, a cute store on Main Street that features products from 80+ artisans that live within an hour of Bucks County. Wendy and Caitlin, the sweet and entrepreneurial founders of Makers, started the shop in July of 2020 when they decided to create an artists collaborative to help local makers showcase their products.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\">Makers offers holiday decorations, jewelry, art, and fun gifts for children. Be sure to check their website for the variety of classes and crafting opportunities they offer too, as these would make a great gift as well!<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><span class=\"s4\"><b>Makers Off Main LLC, 38 East State Street, Doylestown, 215-399-0016, <a href=\"http://makersoffmain.com\" target=\"_blank\" rel=\"noopener noreferrer\">makersoffmain.com</a></b></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/12/Busy-Bee.jpg"
}