{
  "id": 19546,
  "title": "What the Locals Do: Spring Loose and Explore Some Hidden Food Finds",
  "slug": "spring-loose-and-explore-some-hidden-finds",
  "date": "2024-05-09T08:54:04",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Fit"
  ],
  "tags": [
    "Darby and Bradley Birenbaum",
    "Debra Sparks studio",
    "doylestown cardinal",
    "Georgia “Peach” Birenbaum",
    "Natalya Bucuy"
  ],
  "excerpt": "<p>By Kim Petrillo • Special to the Cardinal If you’re anything like me, by the time spring rolls around, you’re more than ready for longer days, brighter skies, and putting those dreary days of winter behind. This season also awakens the travel bug in me &#8211; it’s the month that I eagerly plan out our family [&hellip;]</p>\n",
  "content": "<p><em><b>By Kim Petrillo • </b></em>Special to the Cardinal</p>\n<p><span style=\"font-weight: 400;\">If you’re anything like me, by the time spring rolls around, you’re more than ready for longer days, brighter skies, and putting those dreary days of winter behind. This season also awakens the travel bug in me &#8211; it’s the month that I eagerly plan out our family trips, summer camps, and even winter plans for my family. </span></p>\n<p><span style=\"font-weight: 400;\">Why not capitalize on that renewed energy and explore some new destinations while enjoying the beauty of nature closer to home? After all, there’s no better place to experience this spring season of renewal than beautiful Bucks County, with its covered bridges, extensive walking trails, historic inns, and flowering gardens. These are some of my family’s favorite places to visit as we shake off the dust, get ourselves out of the house, and mix up our normal routines &#8211; all within a short drive of Doylestown.</span></p>\n<h2><b>History, Charm, and Whiskey</b></h2>\n<p><span style=\"font-weight: 400;\">Having lived in Bucks County for the past 15 years, it’s surprising that I have only visited Bristol,  for the first time last year—apparently, I have been missing out! I love this deeply historic town, with its impressive theater, eclectic restaurants, waterside pavilion, and distillery. Take in a show at the Bristol Riverside Theater where you’ll surely be impressed by an exceptional production. Laugh out loud at the Second City: Comedian Rhapsody show from May 11 through June 2. </span></p>\n<p><span style=\"font-weight: 400;\">After a walk through town, stop at Dad’s Hat PA Rye Whiskey where you can try the award-winning Pennsylvania Rye Whiskey featured in creative cocktails as well as craft beers, wine, cider, and spirits from producers throughout Pennsylvania. For the true whiskey enthusiast, tours of the distillery are also available by appointment on Saturday afternoons. For a non-alcoholic option, Calm Waters Coffee serves up the perfect cup of steaming espresso and ham and cheese croissants to accompany your exploration.</span></p>\n<p><i><span style=\"font-weight: 400;\">Bristol Riverside Theater<br />\n</span></i><i><span style=\"font-weight: 400;\">120 Radcliffe Street, Bristol PA<br />\n</span></i><i><span style=\"font-weight: 400;\">Visit <a href=\"https://brtstage.org/\">brtstage.org</a> for tickets<br />\n</span></i><i></i></p>\n<p><i><span style=\"font-weight: 400;\">Dad’s Hat Distillery and Tasting Room<br />\n</span></i><i>131 Mill Street, Bristol PA<br />\n</i><i><span style=\"font-weight: 400;\">Visit <a href=\"https://dadshatmillst.com\">https://dadshatmillst.com</a><br />\n</span></i><i></i></p>\n<p><i><span style=\"font-weight: 400;\">Calm Waters Coffee<br />\n</span></i><i><span style=\"font-weight: 400;\">242 Mill Street, Bristol PA<br />\n</span></i><i><span style=\"font-weight: 400;\">Visit </span></i><a href=\"https://calmwaterscoffee.com\"><i><span style=\"font-weight: 400;\">https://calmwaterscoffee.com</span></i></a></p>\n<h2><b>Something for Everyone</b></h2>\n<p><span style=\"font-weight: 400;\">As a family of five, we can rarely find a destination that appeals to the whole family. Many a family car trip has ended with unhappy and hungry participants. However, with fire-pits (reserve online in advance), outdoor deck space, a distillery, poke, and pizza, the bustling Trolley Barn Public Market in Quakertown is one destination that we can all agree on. Located in the heart of Quakertown, the food hall with its exposed brick and industrial feel conveys the historical spirit of this town. Strolling through the market, it’s hard to decide what food option to go with but everyone can find something. Regardless of where we start, we always end with a treat from Batch Micro Creamery where the small batch of ice cream and exceptional quality makes everyone happy.</span></p>\n<p><i><span style=\"font-weight: 400;\">Trolley Barn Public Market<br />\n</span></i><i><span style=\"font-weight: 400;\">108 PA-313, Quakertown, PA<br />\n</span></i><i><span style=\"font-weight: 400;\">Visit </span></i><a href=\"https://trolleybarnpublicmarket.com/\"><i><span style=\"font-weight: 400;\">https://trolleybarnpublicmarket.com/</span></i></a></p>\n<h2><b>Hitting a High Note at the Narrows</b></h2>\n<p><span style=\"font-weight: 400;\">It wouldn’t be a spring itinerary in Bucks County without a hike—and High Rocks in Ralph Stover State Park is one of the best in the area. The highlight of the park, situated along the banks of the Tohickon Creek, is the towering cliffs that rise precariously over the water. The cliffs stand at an impressive height of 200 feet and offer panoramic views of the surrounding landscape. And who isn’t hungry after a hike? We like to continue our exploration northward, landing at the Narrows Restaurant in Upper Black Eddy. Surrounded by quintessential Bucks County scenery including a view of the Delaware River, this restaurant, located in a historic inn dating back to 1812, is the epitome of charming. Even better, it serves up impressive fare. From the intricate cocktails to the creative brunch menu, to kid-friendly options, the Narrows is one of our favorite ways to close out a day after an afternoon in nature.</span></p>\n<p><i><span style=\"font-weight: 400;\">High Rocks Vista, Ralph Stover State Park<br />\n</span></i><i><span style=\"font-weight: 400;\">170 Tory Rd, Pipersville, PA<br />\n</span></i><i><span style=\"font-weight: 400;\">Visit <a href=\"https://www.dcnr.pa.gov\">https://www.dcnr.pa.gov</a></span></i></p>\n<p><i><span style=\"font-weight: 400;\">The Narrows Restaurant and Bar<br />\n</span></i><i><span style=\"font-weight: 400;\">2206 River Road, Upper Black Eddy, PA<br />\n</span></i><i><span style=\"font-weight: 400;\">Visit <a href=\"https://www.thenarrowsrestaurantandbar.com\">https://www.thenarrowsrestaurantandbar.com</a></span></i></p>\n<h2><b>Carving Out Time with Friends</b></h2>\n<p><span style=\"font-weight: 400;\">Carversville stands out as one of the most picturesque places in Bucks County. As you drive the winding roads, through rolling hills, passing farmhouses and barns, it’s hard not to roll down the windows to breathe in the spring air and let your mood lighten a bit. On one of those hills, sits a renovated barn that houses The Rooster and Carrot Cooking Studio. The space, part of a property built in 1854, was once a self-sustained farm. Chef Kelly Unger, also the Director of the Doylestown Farmers Market, offers exceptional cooking classes in this beautiful space that transports to a faraway countryside. This Spring she is featuring menus from Greece. Grab a few bottles of wine and your culinary friends and schedule some time with Chef Kelly—relaxing and learning how to prepare new and delicious foods in a beautiful space, is the perfect way to exercise your creativity and renew your spirit this spring.</span></p>\n<p><i><span style=\"font-weight: 400;\">The Rooster and Carrot Cooking Studio<br />\n</span></i><i><span style=\"font-weight: 400;\">4230 Wismer Road, Doylestown PA<br />\n</span></i><i><span style=\"font-weight: 400;\">Visit <a href=\"https://www.theroosterandthecarrot.com\">https://www.theroosterandthecarrot.com</a></span></i></p>\n<h2><b>The Perk of Finding Fine Dining in the Suburbs</b></h2>\n<p><span style=\"font-weight: 400;\">My husband and I have been visiting Maize Restaurant in Perkasie for date nights and celebrations for over 10 years. Located in a compact shopping district in downtown Perkasie, the restaurant is certainly a hidden food gem. Once inside, we love the exposed brick, the intimate atmosphere, and the opportunity to enjoy a leisurely meal while watching the busy restaurant kitchen staff at work in this unique space. In addition to a romantic ambiance, the multi-course seasonal tasting menu changes frequently and features locally sourced ingredients that come together to form a very special meal &#8211; the warm biscuits and butter are reason enough to put Maize on your list this spring. The restaurant is BYOB so don’t forget to bring </span><span style=\"font-weight: 400;\">your favorite beverage to accompany your meal.</span></p>\n<p><i><span style=\"font-weight: 400;\">Maize Restaurant<br />\n</span></i><i><span style=\"font-weight: 400;\">519 Walnut Street, Perkasie, PA<br />\n</span></i><i><span style=\"font-weight: 400;\">Visit <a href=\"https://www.maizeonwalnut.com/\">https://www.maizeonwalnut.com/</a></span></i></p>\n<p><i><span style=\"font-weight: 400;\"><strong>Kim Petrillo</strong> has been a resident of Doylestown for 15 years. Along with her husband and three children, she enjoys exploring Bucks County looking for new adventures and food finds with a particular emphasis on good coffee and ice cream.</span></i></p>\n<p class=\"p1\">\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/05/Kim-Petrillo-Narrows.jpeg"
}