{
  "id": 20991,
  "title": "Stage United Hosts A Night of Song at Tile Works",
  "slug": "stage-united-hosts-a-night-of-song-at-tile-works",
  "date": "2025-01-13T12:09:43",
  "author": "Staff",
  "category": [
    "Play"
  ],
  "tags": [],
  "excerpt": "<p>By Danielle Gannon  •  The Cardinal Contributing Writer Join in the history of the Tile Works in Doylestown for A Night of Song, a monthly songwriter showcase hosted by Joe Montone, a Bucks County music producer.  In the first performance of the year, on Jan. 24, two artists will perform in the Big Room. Dirty [&hellip;]</p>\n",
  "content": "<p><b>By Danielle Gannon  •  </b>The Cardinal Contributing Writer</p>\n<p><span style=\"font-weight: 400;\">Join in the history of the Tile Works in Doylestown for A Night of Song, a monthly songwriter showcase hosted by Joe Montone, a Bucks County music producer. </span></p>\n<p><span style=\"font-weight: 400;\">In the first performance of the year, on Jan. 24, two artists will perform in the Big Room. Dirty Dollhouse led by Newtown&#8217;s Chelsea Mitchell, merges folk, retro-pop, and country. Greg Sover comes to the event as a blues, roots, and rock musician. The artist&#8217;s work can be viewed on Instagram: @dirtydollhousemusic @greg_sover. Chef Dan Gallo of Thyme and Plate Catering will cater the event. Limited tickets are available for purchase online at </span><a href=\"http://thetileworks.org/events\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">thetileworks.org/events</span></a><span style=\"font-weight: 400;\">. Indigenous Ingenuities, the local garden design company sponsoring this event. </span></p>\n<p><span style=\"font-weight: 400;\">The intimate setting of the room makes it a cozy venue for the seated performance. Picture a space with dim lighting, music, and passion. “It’s cool to bring people into the artist’s world a little bit,” says Montone. </span></p>\n<p><span style=\"font-weight: 400;\">Each month, Montone introduces each artist and hosts a Q&amp;A, asking questions that spark energy and inspiration. The artists then perform for the crowd. Artists from near and far come to share their love for life, the trials and tribulations of it, and the beautiful music that is born from all of the experiences. The idea for the music series was born as a collaboration between Tile Works Executive Director Katia McGuirk and Montone, the mastermind behind Picnics on Pine. </span></p>\n<p><span style=\"font-weight: 400;\">The music and the artistic spirit of Tile Works come together during these music events. Tile Works, which dates back to 1911, when Henry Mercer built the foundation, still produces tiles the same way Mercer himself made them. Here, they say they “honor the past and craft the future” &#8211; much like music and those who write it. Music is a compilation of experiences, stories, and a vision for taking that and turning it into music and lyrics to touch the lives of others. Each person has a different lens through which to view the world, and each song carries a different tune and meaning through which the listener can adapt it to life. </span></p>\n<p><span style=\"font-weight: 400;\">At Tileworks, each tile is a simple object of beauty. The grout that holds them together is our kindness, equanimity, fairness, and creativity. The space is a part of the show. Katia came to Joe with the inspiration to activate the space in the Tile Works’ Big Room for the winter. “To create live music experiences that are intentionally focused on the feeling of the space,” is the plan Montone says. The artist&#8217;s songs will sing back to Henry Mercer’s legacy in this “cozy container” of a space.</span></p>\n<p><span style=\"font-weight: 400;\">What Joe loves most about the series is showcasing music, the process of music, and songwriting. Putting pen on paper, just like tile making and the result is different each time. “It’s a beautiful thing to be able to inspire others through the story of songwriters,” says Montone. This series is amongst many different series that Tile Works puts on in Doylestown, including the Summer Blue Grass Series.</span></p>\n<p><span style=\"font-weight: 400;\">The artists benefit from A Night of Song series, because it creates an intimate container for the artists in our area. The artists can feel the energy of the room and the people. This intimate concrete space is very unique to our area and it is a very intentional show. </span></p>\n<p><span style=\"font-weight: 400;\">Many of the locals may know Joe Montone as the producer of the Picnics on Pine, shows at Puck LIVE, and collaborations with local singer/songwriter Anthony Green. </span></p>\n<p><span style=\"font-weight: 400;\"><a href=\"https://doylestowncardinal.com/arts-music/picnics-on-pine/\" target=\"_blank\" rel=\"noopener noreferrer\">Monotone’s Stage United</a> is the organization behind this and many music offerings into our local community. </span></p>\n<p><span style=\"font-weight: 400;\">The mission of Stage United is to inspire communities by providing greater access to powerful live music programming. Stage United plans concerts with representatives of each location, sources artists relevant to those spaces, provides marketing tools for the festivities, and helps financially support costs associated with the production.</span></p>\n<p><span style=\"font-weight: 400;\">“My focus has always been to create platforms for communities to flourish,” says Montone.</span></p>\n<p><i>Danielle Gannon is a local Bucks County entrepreneur. Mom to three, she is the founder and managing director of Local Spotlight with Danielle. Her passion is connecting people and creating community. Residing in Ivyland, writing has always been a passion of hers. Find her on IG @localspotlightwithdanielle</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2025/01/Screenshot-2025-01-13-at-12.07.35-PM.png"
}