{
  "id": 12222,
  "title": "Stolen 18th Century Pistol Returned to the Mercer Museum After Nearly 50 Years",
  "slug": "stolen-18th-century-pistol-returned-to-the-mercer-museum-after-nearly-50-years",
  "date": "2022-02-07T14:05:03",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "mercer museum"
  ],
  "excerpt": "<p>The Mercer Museum, operated by the Bucks County Historical Society (BCHS), attended a repatriation ceremony for stolen artifacts at the Museum of the American Revolution in Philadelphia on Friday, December 17, 2021, alongside six museums from the region. Artifacts stolen nearly half a century ago and recovered as part of a 50-year-old cold case cracked [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">T</span><span class=\"s2\">he Mercer Museum, operated by the Bucks County Historical Society (BCHS), attended a repatriation ceremony for stolen artifacts at the Museum of the American Revolution in Philadelphia on Friday, December 17, 2021, alongside six museums from the region.</span></p>\n<p class=\"p3\"><span class=\"s3\">Artifacts stolen nearly half a century ago and recovered as part of a 50-year-old cold case cracked by the FBI in 2019 were returned to the Mercer Museum, American Swedish Historical Museum, Hershey Story Museum, Landis Valley Museum, Museum of the American Revolution, and York County History Center. The items being repatriated include historic firearms from the 18th and 19th centuries, including rifles and pistols, and a Native American silver concho belt.</span></p>\n<p class=\"p3\"><span class=\"s2\">The recovery of the artifacts was made possible through the efforts of the Federal Bureau of Investigation Art Crime Team &#8211; Philadelphia Division, the United States Attorney’s Office of the Eastern District of Pennsylvania, and the Upper Merion Township Police Department.</span></p>\n<p class=\"p3\"><span class=\"s2\">The Mercer Museum received a late-18th century English flintlock boarding pistol, stolen from their collection nearly 50 years ago. At the time of its disappearance, the pistol was on display in an exhibit case on the third floor of the Mercer Museum in downtown Doylestown. In the 1990s, when reviewing a comprehensive inventory of the Mercer Museum’s collection, the pistol could not be located and was officially recorded as “missing”.</span></p>\n<p class=\"p3\"><span class=\"s3\">Originally acquired by the Bucks County Historical Society in 1906, the pistol was among items donated to the museum as belonging to General Augustine Willet by his great-granddaughter, Mrs. Allburger. Willet served as a Captain of militia at the onset of the American Revolution, later being promoted to a Major and Lieutenant Colonel. In 1800, he was commissioned Brigadier General of the Bucks County militia.</span></p>\n<p class=\"p3\"><span class=\"s2\">The original items donated by Willet’s great-granddaughter to the museum in 1906 also included Willet’s regimental coat, a rare surviving artifact, likely dating back to the period after the American Revolution.</span></p>\n<p class=\"p3\"><span class=\"s3\">“In law enforcement, as in any profession, there are good days and bad days. Today, standing here along with our partners, is one of those good days,” said Jacqueline Maguire, Special Agent in Charge of the FBI’s Philadelphia Division. “The absence of the items from these museums represented not just a physical or financial loss, but a loss to every visitor, every student, and every researcher who didn’t get to see the items over the years and missed out on important pieces of our nation’s heritage. The absence of these items was, for so long, a loss to the historical record. The FBI is honored to have helped correct that loss and return these artifacts to the institutions from which they were stolen so long ago.”</span></p>\n<p class=\"p3\"><span class=\"s2\">Thomas Gavin, who was convicted of stealing the artifacts in the 1960s and 1970s, was recently sentenced to one day in prison and various fines. The judge took Gavin’s age and declining health into consideration during sentencing.</span></p>\n<p class=\"p3\"><span class=\"s2\">The Bucks County Historical Society’s Vice President of Collections and Interpretation Cory Amsler adds, “To recover an object stolen from a museum is a tremendous thing. But to recognize that the object, once returned, can also help to tell an important and compelling story about a dramatic time period in Bucks County history makes its recovery that much more valuable.”</span></p>\n<p class=\"p3\"><span class=\"s2\">The Mercer Museum wishes to thank the Upper Merion Township Police Department, the Federal Bureau of Investigation, and the United States District Attorney’s Office of the Eastern District of Pennsylvania, for their wide-ranging efforts to pursue justice and ensure the restoral of important historical artifacts to their rightful repositories.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/02/Mercer-museum-pistol.jpg"
}