{
  "id": 17964,
  "title": "Take a Walk, Pal!",
  "slug": "take-a-walk-pal",
  "date": "2023-08-06T22:54:42",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "Ariel Mann",
    "doylestown cardinal",
    "Neshaminy Greenway Trail",
    "Peace Valley Park"
  ],
  "excerpt": "<p>By Ariel Mann • The Cardinal Contributing Writer Walking is a great low-impact activity that we should all engage in daily. Not only can it help you lose weight, but it can also help improve mood, manage stress, and reduce the risk of chronic disease. The American Heart Association recommends 150 minutes of moderate-intensity aerobic [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong><span class=\"s1\">By Ariel Mann • </span></strong></em><span class=\"s1\">The Cardinal Contributing Writer</span></p>\n<p class=\"p3\"><span class=\"s3\">Walking is a great low-impact activity that we should all engage in daily. Not only can it help you lose weight, but it can also help improve mood, manage stress, and reduce the risk of chronic disease. The American Heart Association recommends 150 minutes of moderate-intensity aerobic activity every week.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">It’s always nice to have a change of scenery, even if you can walk around your neighborhood. Below are some of my top walking trails and loops near Doylestown.</span></p>\n<p class=\"p4\"><span class=\"s4\"><strong>Central Park</strong>.</span><span class=\"s3\"> Very well known to local parents for its expansive playground and Kids Castle, Central Park offers an easy loop trail around the other park amenities.</span></p>\n<p class=\"p4\"><span class=\"s4\"><strong>Peace Valley Park</strong>.</span><span class=\"s3\"> Peace Valley Park has 14 miles of trails located on Lake Galena with many options for short loop trails or a longer 6-mile loop around the lake. You might catch others out fishing, paddling, or even looking for birds.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\"><strong>War Memorial Park</strong>.</span><span class=\"s3\"> The Doylestown Hike and Bike Trail offer a scenic loop taking you from CB West High School through Delaware Valley University. If you have time you can veer off the trail and check out the new Terrain on Del Val’s campus.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\"><strong>Neshaminy Greenway Trail</strong>.</span><span class=\"s3\"> This trail is an out-and-back trail located along Neshaminy Creek in Chalfont.</span></p>\n<p class=\"p4\"><span class=\"s4\"><strong>Covered Bridge Park</strong>.</span><span class=\"s3\"> This park offers a beautifully paved out-and-back trail frequented by other walkers and some bikers and is equipped with a playground and a dam for some picturesque water views.</span></p>\n<p class=\"p5\">L<strong>ooking for a more adventurous route?</strong> Try heading up to <strong><span class=\"s4\">High Rocks</span></strong> or the trails around <span class=\"s4\"><strong>Ringing Rocks</strong>.</span> Don’t forget to pack a hammer and visit the boulder field while you’re there.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\"><span class=\"s3\"><strong>Not into walking in nature?</strong> Walking around the Doylestown Borough is the best of both worlds. You’re getting your steps in and have the perfect excuse to pop into all of the amazing stores and restaurants you pass along the way. Some of my go-to stop ins: <strong>Makers Off Main, Native Cafe, and the Doylestown Bookshop</strong>.</span></p>\n<p class=\"p7\"><span class=\"s1\"><i>Ariel Mann is a nurse turned health coach. Her goal is to help people take charge of their health with realistic changes and improve their physical, mental, and emotional well-being. Check <a href=\"http://healthbyariel.com\" target=\"_blank\" rel=\"noopener noreferrer\">healthbyariel.com</a> to learn more and to schedule a consultation.<span class=\"Apple-converted-space\"> </span></i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/08/walking-2.jpg"
}