{
  "id": 17755,
  "title": "The Endless Summer Vacation",
  "slug": "the-endless-summer-vacation",
  "date": "2023-06-16T16:55:46",
  "author": "Staff",
  "category": [
    "Fit",
    "Play",
    "Stay"
  ],
  "tags": [
    "brian pultro",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Brian Pultro • The Cardinal Contributing Writer By now you have probably turned on the air conditioner and fired up the grill. Perhaps you have enjoyed a water ice and a night on the porch listening to the crickets as the sun slowly fades away. Summer is back and along with it come our [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Brian Pultro • </strong></em>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">B</span><span class=\"s1\">y now you have probably turned on the air conditioner and fired up the grill. Perhaps you have enjoyed a water ice and a night on the porch listening to the crickets as the sun slowly fades away. Summer is back and along with it come our annual vacations to paradise.</span></p>\n<p class=\"p5\"><span class=\"s1\">We work hard all year to save for and plan these cherished summer journeys. Many folks set up ACH payments into a “vacation account” to automatically save towards their goals each year. Some folks use a bonus to lock down that shore house. However, what we do while experiencing our vacations can be more important than the journey of saving and planning.</span></p>\n<p class=\"p5\"><span class=\"s3\">In older generations, when faced with their mortality, they would almost uniformly say that their biggest regret was spending too much time at work and not enough time with family. Today’s younger generations have taken that to heart and demanded a better work/life balance. However, when todays younger generations are faced with their own mortality, it is sadly all too common to hear them say that they wish they had spent less time mindlessly scrolling through their phone.</span></p>\n<p class=\"p5\"><span class=\"s1\">All of my fondest memories of childhood summer vacations are void of technology. I remember seeing my first bear while camping with my Dad in Virginia. I’ll never forget catching my first trout with my sister. Attending Mid-Atlantic Air Museum’s World War Two Weekend was always a highlight. Cooperstown and the Baseball Hall of Fame moved me to my core. My point is, never once was there a screen involved.</span></p>\n<p class=\"p5\"><span class=\"s1\">Now, I know you are mumbling that these vacations took place in the 90’s and cell phones weren’t a thing then. You would be correct, but video games and movies were around. The opportunity to sit and play Mario Kart on the N64 still existed. However, I have zero memory of a life changing event that occurred while helping those embarrassing 90’s Eagles teams to a Super Bowl in Madden.</span></p>\n<p class=\"p5\"><span class=\"s1\">My point is this – to achieve the endless summer vacation, put down the screen. We can’t make memories with our devices, but we can certainly make them with those we love.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Last year I took my boys for a 4-day stay on a working farm in the middle of New York state. I will admit, I was a bit nervous. I specifically chose this place because it had no TV’s, no Wi-Fi, and barely any cell service. Our lodging consisted of a small, 2-room cottage that was built in 1942. We did not pack any screens except for my cell phone. It was a gamble that paid off. Four straight days without seeing a screen (yes, my screen too) and it was magical.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">We did chores on the farm with the owners working the land. We hiked, we fished, we breathed the fresh country air. We played board games, pointed out the shapes of the clouds in the sky, read books, caught fireflies, played with the animals, colored, and cooked s’mores by the campfire. The day we had to leave my kids were in tears. Jackpot.</span></p>\n<p class=\"p5\"><span class=\"s1\">They loved being out on that farm so much (without screens) that they begged to go back this year. While we aren’t doing exactly what they requested, we are continuing our purposeful selection of a summer vacation that ditches screens.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">To my boys, their four days on the farm in New York in 2022 is the endless summer vacation. Memories that will last a lifetime. Don’t regret that you scrolled aimlessly, cherish that you captured the magic of the vacation that you worked so tirelessly all year to save for and plan.</span></p>\n<p class=\"p6\"><i>Brian Pultro is a Doylestown native, Navy Veteran, and local Financial Advisor. His practice is built upon the foundations of “Behavioral Finance” and training individuals and families on how to take natural human emotions out of the investment process. <a href=\"mailto:brian.pultro@LPL.com\">brian.pultro@LPL.com</a></i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/06/Endless-Summer.jpg"
}