{
  "id": 18854,
  "title": "The Art of Wintering: Lessons from the Arctic",
  "slug": "the-art-of-wintering-lessons-from-the-arctic",
  "date": "2024-01-29T13:51:05",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "Natalya Bucuy",
    "winter"
  ],
  "excerpt": "<p>By Natalya Bucuy • The Cardinal Managing Editor The shivers start before I even climb from under the blanket. I remind myself that this is the worst part of the morning. Once I wrap myself in a robe and place my feet into the tall fleece sock-slippers, I won’t be so cold. Besides, I can hear [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Natalya Bucuy<span class=\"Apple-converted-space\"> • </span></b>The Cardinal Managing Editor</p>\n<p class=\"p3\"><span class=\"s1\">T</span><span class=\"s1\">he shivers start before I even climb from under the blanket. I remind myself that this is the worst part of the morning. Once I wrap myself in a robe and place my feet into the tall fleece sock-slippers, I won’t be so cold. Besides, I can hear the whistling of the blizzard outside through the glass of the window and the thick curtains that cover it. If it’s bad enough, school will be canceled. To find out, I make my way out of my bedroom and down the dark hallway to the telephone that hangs on the wall. I don’t turn the lights on. If the automated message declares the winds to be too harsh or the temperatures too low (below -35C/-31F is a sure bet), my elementary grades will be allowed to stay home from school. The conditions would have to be harsher for my older sisters, who are in high school, to get the same break. This is my daily morning ritual during the school year.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\">I spent the first ten years of my life in Norilsk, Russia’s northernmost city inside the Arctic Circle. For six weeks in the winter, we lived in the darkness of the polar night. During this time, the sun doesn’t rise above the horizon. Darkness and blizzards rule.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\">While most people in the world do not share such memories of “wintering,” many do experience the effects of winter months, both physically and emotionally. According to the American Psychiatric Association, five percent of Americans deal with Seasonal Affective Disorder (SAD), a mood disorder characterized by depression that occurs at the same time every year. Symptoms include fatigue, depression, hopelessness, and social withdrawal. Unsurprisingly, the number is higher &#8211; 10 percent &#8211; in Alaska, where polar nights last as long as 60 days at the northernmost point.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\">The idea of months of darkness might sound scary and depressing (and perhaps make us, Pennsylvanians, feel a little less sad about the 5 p.m. winter sunsets.) But it could serve as a reminder that Wintering is a necessary part of the natural seasonal cycle. After all, both Alaskans and residents of my Siberian Norilsk enjoy 24 hours of daylight in mid-summer. For every darkness there is light.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\">British author, Katherine May, explores the topics of darkness and light in her two bestsellers &#8211; “Wintering” and “Enchantment.” As depressing as it may feel, “wintering” comes as a necessity both physically and psychologically, she says. Hibernation in the natural world takes commonplace. Trees, for example, shift all their energy in the winter, sending their essential nutrients to the roots. Humans need this, too. We need that downtime in winter months to give us a chance to retreat indoors, lay low, and slow down.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\"><span class=\"s1\">In “Wintering,” May discovers that periods of sadness and calm bring satisfaction in a way that isn’t jolly or necessarily very presentable to the outside world. “The dark days of winter offer a place of stillness and a time to embrace solace, sadness, and our darker emotions,” she says. In “Enchanted,” May finds that the times of solitude and sadness reignite beauty and wonder.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\">In a world where hustle, speed, productivity, and efficiency dictate our daily actions, we often forget that rest is essential. “Plants and animals don’t fight the winter; they don’t pretend it’s not happening and attempt to carry on living the same lives that they lived in the summer. They prepare. They adapt. They perform extraordinary acts of metamorphosis to get them through,” May writes. “We have seasons when we flourish and seasons when the leaves fall from us, revealing our bare bones. Given time, they grow again.”</p>\n<p class=\"p4\">“What soothes us?” is the question May asks in her work. She urges us to find that, and then find the light that helps us get through the darkness. We must let our bodies adapt to the winter season and deliberately bring light into our lives.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\"><span class=\"s2\">For us, dwellers of the Arctic, that meant staying under the warm covers when the blizzard’s gusts proved to be too vicious. An old Scottish term, hurkle-durkling, describes just that &#8211; lying in bed, or lounging after it is time to get up or go to work. For me, that also meant indulging in reading. My bedroom doubled as the family library, with packed bookshelves stretching from the floor to the ceiling. Such an arrangement gave me a head start on my path to becoming a writer.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\">“Come, come, hurry,” my mother calls to me and my sisters one midafternoon sometime in January. We all rush to the window on the east side of our apartment. We jump up to the windowsill and feel the flat coldness of the glass against our foreheads, our eyes peeled at the horizon. “Here she comes.” We watch the first sunrise of the season light the sky dull yellow and orange. Here she comes, the sun, bringing us the light.<span class=\"Apple-converted-space\"> </span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/01/Wintering.jpg"
}