{
  "id": 13658,
  "title": "The Talking Teacup",
  "slug": "the-talking-teacup",
  "date": "2022-06-14T16:03:52",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "brittany brown",
    "doylestown cardinal",
    "kathy keck",
    "patti fitzpatrick",
    "THE TALKING TEACUP Mother’s Day Hot Spot"
  ],
  "excerpt": "<p>By Britt Around Town • Special to The Cardinal When Patti Fitzpatrick stepped into The Talking Teacup years ago, she never expected it would change her life. She found comfort within the walls of this Chalfont teahouse during a challenging time in her life and it quickly became her place for solitude. She befriended Kathy [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Britt Around Town</strong> • Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s1\">W</span><span class=\"s2\">hen Patti Fitzpatrick stepped into The Talking Teacup years ago, she never expected it would change her life. She found comfort within the walls of this Chalfont teahouse during a challenging time in her life and it quickly became her place for solitude. She befriended Kathy Heck &#8211; the original owner of The Talking Teacup and began helping out around the teahouse.</span></p>\n<p class=\"p5\"><span class=\"s2\">Kathy originally opened the doors of The Talking Teacup back in 2003. Her motto was “Come as a stranger, leave as a friend” and it soon became a special place for friends and families to gather and make memories together. Kathy had cherished memories of sharing tea with her grandmother, which served as her motivation for running the teahouse for over 16 years.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">In November of 2020, shortly before Kathy lost her 7 year battle with cancer, she sent Patti a letter encouraging her to not “let [her] life go by” and to follow her passions to open a B&amp;B or a teahouse. In her letter, she wrote “You’re a good chef, baker and marketing person and you would be great at it. GO FOR IT!” After her passing, Patti started seeing “angel numbers” and began having dreams that she was having tea with Kathy, which lead her to re-read the letter and she eventually reached out to Kathy’s husband on New Year’s day saying that she thought there may have been a special message within the letter. She then found out that Kathy had told him to work with her if Patti ever reached out&#8230; and the rest is history!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Patti took ownership of The Talking Teacup in Fall of 2021 with the support of the community who fled to the tearoom sharing their stories and experiences there. It had been a place of happiness for so many. All of the food at The Talking Teacup is made fresh daily with a menu that is constantly changing to give guests a unique experience with every visit.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Patti has plenty of exciting plans for the future of The Talking Teacup, which is currently open for seatings at 11am and 2pm for lunch Wednesdays through Saturdays and for a five-course brunch on Sundays &#8211; also at 11am and 2pm and special events can be found listed on their website.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">The Talking Teacup is a recommended outing for any occasion, and is the perfect location to celebrate Mom this Mother’s Day. Keep an eye out for summer hours to be posted soon. Visit them online at <a href=\"http://www.thetalkingteacup.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.thetalkingteacup.com</a> or call 215-997-8441 to make your reservation!</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/06/talking-teacup.jpg"
}