{
  "id": 11813,
  "title": "The Good Folk Project Comes to Doylestown",
  "slug": "the-good-folk-project-comes-to-doylestown",
  "date": "2021-12-11T14:35:43",
  "author": "Staff",
  "category": [
    "Fit",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Good Folk Project",
    "Lindsay Troyer"
  ],
  "excerpt": "<p>Last month, the Doylestown community came together to welcome a new, local nonprofit in the borough, whose mission is to engage the community in activities that support local agriculture and alleviate hunger. Founder Lindsay Troyer is a Doylestown resident with a Masters in Food and Agriculture Policy and has worked in food and/or agriculture for [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">Last month, the Doylestown community came together to welcome a new, local nonprofit in the borough, whose mission is to engage the community in activities that support local agriculture and alleviate hunger. Founder Lindsay Troyer is a Doylestown resident with a Masters in Food and Agriculture Policy and has worked in food and/or agriculture for almost two decades.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">This past year, she volunteered as a community-garden farmer in the area and the season’s overabundance led to building relationships with local community fridges and pantries. “The needs of our local hungry felt urgent… and the community response to ‘do something’ was mighty” she said. It was then that the Good Folk Project was officially born.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">The Good Folk Project is passionate about staying locally-focused, and for its inaugural fundraising event it organized a borough-wide food drive, partnering with local businesses to be donation drop-off sites the two weeks prior to Thanksgiving.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">Host businesses Koru Real Wellness, Opal Hair Studio, Native Cafe, Nomad Supply Co. and Evolution Candy provided a small space in their shops to hold the nonprofits’ apple crate donation bins and signs, and customers were encouraged to bring a non-perishable item with them when they came in to shop or receive a service.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">The organization plan’s to host another drive in December, along with some monetary fundraising to create the Good Folk Community Kitchen, a pop-up, family-friendly event where community members prep meals to be delivered to the community fridges before the December holidays.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">Lindsay says “so many folks want to volunteer during this time of year in charitable food kitchens, so I wanted to create that opportunity right here in the community”! These pop-ups will take place throughout the year but the holiday’s felt like the right time to start.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">For more information on the organization and upcoming opportunities to get involved, follow the Good Folk Project on facebook and instagram, or reach out to the <a href=\"mailto:goodfolkproject@gmail.com\">goodfolkproject@gmail.com</a>.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/12/Good-Folk-Project.jpg"
}