{
  "id": 12419,
  "title": "The Roaming Realtor • This Olde House",
  "slug": "the-roaming-realtor-%e2%80%a2-this-olde-house",
  "date": "2022-03-01T22:34:36",
  "author": "Staff",
  "category": [
    "Live",
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "jeff lavine",
    "Rev Silas Milton Andrews House",
    "the roaming realtor"
  ],
  "excerpt": "<p>Did you know that the first few blocks of East Court Street off Main were among the very first to be developed in Doylestown Borough?  The residence at 146 East Court, the Rev Silas Milton Andrews House, circa 1856, epitomizes the Federal style in architecture. Federal is the name for the classicizing architecture built in [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">D</span><span class=\"s1\">id you know that the first few blocks of East Court Street off Main were among the very first to be developed in Doylestown Borough?<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">The residence at 146 East Court, the Rev Silas Milton Andrews House, circa 1856, epitomizes the Federal style in architecture. Federal is the name for the classicizing architecture built in the newly founded United States between 1780 and 1830.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">In the early American republic, our founding generation consciously chose to associate the nation with the ancient democracy of Greece and the republican values of Rome. Using the Roman architectural vocabulary, the Federal style applied to the balanced and symmetrical version of Georgian architecture practiced in the American Colonies’ new motifs of neoclassical architecture. </span></p>\n<p class=\"p3\"><span class=\"s1\">When the U.S. declared independence from Britain, there was a desire to separate ourselves from anything British-related, including our homes. This meant the Colonial style was falling quickly out of favor. From 1783 to 1815, the Federal-style began to rise in popularity. That’s not to say the Colonial style was banished entirely. Instead, Federal-style architecture absorbed bits and pieces of colonial style and grew to symbolize the period.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">The Federal-style was so named because the Federalist Party was the dominant one in American politics at the time. The architectural style followed the politics of the day to become the more popular style.</span></p>\n<p class=\"p3\"><span class=\"s1\">The key feature of Federal homes is their symmetry. They have the same layout you find in a Colonial, but more ornate. They often incorporate brass hardware alongside wood, have decorative iron fences, display rounded or arched windows, and elaborate moldings. You’ll also find these homes tend to be taller and narrower than Colonial homes and may have oval or circular-shaped rooms.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\">Another discerning feature of Federals tends to be made of brick and not the clapboard, more common in Colonial-style homes. 146 East Court is reminiscent of a Charleston townhouse, with its stately solid brick facade, copper gutters, detailed entablature, and eleven-foot ceilings.</p>\n<p class=\"p3\"><span class=\"s1\">I am always curious as to the context in which properties are built. What was happening in our little town of Doylestown in the year that the Rev. Silas Milton Andrews House was built? I hope you find this of interest.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">A branch line of the North Pennsylvania Railroad was built in 1856 from Lansdale and terminating in Doylestown. This is our Doylestown train as we know it today, and it officially opened in October 1856. The train ran twice daily to Philadelphia, a morning and evening run. A platform and small wooden waiting room were the only protection for passengers. It was in 1876 that the present stone railroad station was built.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">Our first gas lights were introduced in 1854. Substantial industrial development never occurred because of the town’s relatively high elevation and a lack of strong water power. This is why Doylestown evolved to have the professional and residential character that it still maintains today. (Yes, there’s always a reason why things exist as they are.)<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">In 1869, Doylestown established a waterworks, and the first telephone line arrived in 1878, the same year that a new courthouse was erected. And lastly, 1897 saw the first of several trolley lines connecting Doylestown with Willow Grove, Newtown, and Easton.</span></p>\n<p class=\"p3\">The history of our homes is entrenched in and illustrates the very history of our town. Knowing our past helps us understand our present and prompts us to clearly understand a simple fact: Our actions today impact the future.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p3\"><span class=\"s2\">I hope you enjoyed this month’s column. Every building has a story to tell, and your Roaming Realtor loves to tell them!</span></p>\n<p class=\"p5\"><b><i>Jeff Lavine, a REALTOR with Keller Williams Real Estate, has been leading the industry since 1984. Jeff and his team can be reached at his office, 215-340-5700 x222, his cell. 215-280-2750 or website www. <a href=\"http://www.PropertyinBucksCounty.com\" target=\"_blank\" rel=\"noopener noreferrer\">PropertyinBucksCounty.com</a>. The Roaming Realtor appears weekly on Facebook.</i></b></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/03/Silas-Milton-andrews-House.jpg"
}