{
  "id": 12712,
  "title": "The Resurrection of Evolution Candy",
  "slug": "the-resurrection-of-evolution-candy",
  "date": "2022-04-12T14:21:01",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "evolution candy",
    "James &amp; Tracy Lamb"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer In late 2018, James &amp; Tracy Lamb of Evolution Candy officially purchased the candy shop exactly one day into their marriage! They looked at various businesses for sale and decided this was the one! It’s more than just a candy shop, though. “We support our local community. [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Danielle Gannon • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">I</span><span class=\"s3\">n late 2018, James &amp; Tracy Lamb of Evolution Candy officially purchased the candy shop exactly one day into their marriage! They looked at various businesses for sale and decided this was the one!</span></p>\n<p class=\"p5\"><span class=\"s3\">It’s more than just a candy shop, though. “We support our local community. We contribute and sponsor local ball teams and the arts community,” says James. “We appreciate the support we get, and we love to give it back. That’s what small town is all about,” Tracy said.</span></p>\n<p class=\"p5\"><span class=\"s3\">When the pandemic hit in Spring of 2020, they had only been in business for a little over a year. They were still figuring out the ins and outs of the business. Then it came… EASTER season! They started making baskets and posting pictures of them. They have their unique “ice cream window”, allowing walk-ups, ice cream, and candy sales. The baskets were displayed, and they started selling. The calls came in with requests for candy of all kinds!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">James &amp; Tracy got to work. They realized that they had something here that the community wanted. EASTER BASKETS! They worked tirelessly for weeks on end, putting together basket requests. James on the phone with a pen &amp; pad of paper taking notes from the parents on their children’s likes &amp; dislikes. Tracy building baskets around price points and candy selections. They could be picked up or delivered.</span></p>\n<p class=\"p5\"><span class=\"s3\">When asked how they felt they were able to survive the pandemic and the online businesses like Amazon, etc.., James answered, “People buy from people”. It is evident how much relationships and person-to-person meant to the couple.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Easter baskets start at $25 and are customized! Think chocolate eggs, peeps, airheads, licorice, smarties, big bunnies, gum, colorful wheel lollipops, jellybeans, cow tails, the options are endless! There’s Easter candy and regular candy. The nostalgia of it all is so exciting! Get your order in ASAP.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">“We are not Harry &amp; David’s, where we make a basket and decide what you get. You tell us exactly what you want, and we customize it. Each and every one”, states Tracy. You can follow them on IG @evolutioncandy or visit them online <a href=\"http://www.evolutioncandy.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.evolutioncandy.com</a></span></p>\n<p class=\"p5\"><span class=\"s3\">This is a sweet, little, nostalgic shop offering candy, chocolates, ice cream/milkshakes, gift baskets, cookies and cold drinks. Check them out! This local Mom and Pop is all about community. Who better to support?</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/04/EasterBasket1_2310.jpg"
}