{
  "id": 14119,
  "title": "This Olde House: Let’s Talk Tudors…",
  "slug": "this-olde-house-lets-talk-tudors",
  "date": "2022-07-13T16:57:49",
  "author": "Staff",
  "category": [
    "Stay",
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "jeff lavine",
    "tudor homes"
  ],
  "excerpt": "<p>By Jeff Lavine • The Cardinal Contributing Writer I’ve always found it interesting that there are just a handful in Doylestown Borough. By their very nature, they are expensive to build, but an extremely popular style in the Northeast nonetheless, and certainly in the Philadelphia suburbs; just think of all the Tudors on the Main [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><b>By Jeff Lavine • </b>The Cardinal Contributing Writer</span></p>\n<p class=\"p3\"><span class=\"s3\">I</span><span class=\"s3\">’ve always found it interesting that there are just a handful in Doylestown Borough. By their very nature, they are expensive to build, but an extremely popular style in the Northeast nonetheless, and certainly in the Philadelphia suburbs; just think of all the Tudors on the Main Line. Since they are so uncommon around here, it makes local Tudor houses all the more intriguing. On the corner of West Oakland Avenue and Lafayette Street sits 286 W. Oakland, with the stately grandeur of any good Tudor home.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">You don’t have to be an architectural scholar to spot a Tudor house. Their distinct appearance makes them easily recognizable among their more symmetrical, lighter Colonial and Victorian neighbors. Tudor homes come in all sizes, and while smaller versions might have a quaint storybook appearance to them, larger Tudors more often embody the romantic ideal of an English country manor.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Tudor homes have several distinguishing features. They have a steeply pitched roof, often with multiple overlapping, front-facing gables (the triangular portion of the roof) of varying heights. The majority of their exteriors are brick, but they’re accented, often in those triangular gables, with decorative half-timbering. This is essentially a mock frame of thin boards with stucco or stone filling in the spaces between the boards.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The windows used in Tudor houses are also a nod to medieval architecture. Windows are tall and narrow with multiple panes, sometimes rectangular and sometimes diamond shaped. Large groupings of windows are common, and occasionally there are picturesque floating bay windows, called oriel windows, on the first or second story.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Though often not in the center of the house, the front door is still a significant architectural feature on Tudor homes. They typically have a round arch at the top and tend to be bordered by a contrasting stone that stands out against the brick walls. Finally, Tudor chimneys are another notable element where the details stand out, often having decorative chimney pots, which is a stone or metal extension at the top of the brick chimney.</span></p>\n<p class=\"p5\"><span class=\"s3\">As an architectural trend, Tudor style homes originated in the United States in the mid-19th century. During<span class=\"Apple-converted-space\">  </span>the 1920s and 30s, the Tudor style became highly popular, second only to the Colonial Revival style. The Tudor style movement is technically a revival of English domestic architecture, specifically Medieval and post-Medieval styles from the 1500s-1700s.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">These homes mimic a style designed to weather colder climates with lots of rain and snow. They were best suited for and thus more popular in the northern half of the United States. The original Tudor style arose in England in the late 15th Century and lasted until the early 17th Century, coinciding with the reign of British monarchs, who hailed from the House of Tudor, including Henry VIII.</span></p>\n<p class=\"p5\"><span class=\"s3\">Doylestown had a growth spurt in the late 1800s and early 1900s, thus Victorian architecture dominated alongside the stone Colonials that had already defined us. Eventually, masonry veneer techniques were developed, and brick and stone homes became more affordable to build, and the intricacies of Tudors remained quite expensive for the average home builder. The Tudor style began to fizzle out after World War II as the country turned to focusing on new, affordable housing developments that could be built quickly for our returning soldiers.</span></p>\n<p class=\"p5\"><span class=\"s3\">So, this week, the Tudor at 286 W. Oakland Avenue was a jumping off point for me to share a little information about a style of architecture that’s not a dominant type of home in our area. I’ll wager that you may now notice a few other of the Tudors that surround us. If I can at all encourage you to look at the wonderful architecture around us, to appreciate the diversity of styles we have and learn a little about housing history and our history, then I have done my job. I love this tour that we are on together.</span></p>\n<p class=\"p7\"><b><i>Jeff Lavine, a REALTOR with Keller Williams Real Estate, has been leading the industry since 1984. Jeff and his team can be reached at his office, 215-340-5700 x222, his cell. 215-280-2750 or website www. <a href=\"http://PropertyinBucksCounty.com\" target=\"_blank\" rel=\"noopener noreferrer\">PropertyinBucksCounty.com</a>. The Roaming Realtor appears weekly on Facebook.</i></b></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/07/286-W-Oakland.jpg"
}