{
  "id": 17327,
  "title": "Trimester Fit Body: Strength and Confidence through Pregnancy and Beyond",
  "slug": "trimester-fit-body-strength-and-confidence-through-pregnancy-and-beyond",
  "date": "2023-04-12T14:35:58",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "Meghan Rosenfeld",
    "Trimester Fit Body"
  ],
  "excerpt": "<p>By Natalya Bucuy  • The Cardinal Managing Editor A few years ago, personal trainer, Meghan Rosenfeld, who lived in Los Angeles, saw a need that she knew she could fulfill. She noticed that many pregnant women and new mothers struggled to find a workout program that fit their changing and healing bodies. And so, Rosenfeld set [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Natalya Bucuy<span class=\"Apple-converted-space\">  • </span></b>The Cardinal Managing Editor</p>\n<p class=\"p3\"><span class=\"s2\">A</span><span class=\"s1\"><span class=\"Apple-converted-space\"> </span>few years ago, personal trainer, Meghan Rosenfeld, who lived in Los Angeles, saw a need that she knew she could fulfill. She noticed that many pregnant women and new mothers struggled to find a workout program that fit their changing and healing bodies. And so, Rosenfeld set out to help.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">She received a pre and postnatal corrective exercise specialist certification and began working with women in local LA parks. “I became someone women came to when they didn’t feel comfortable in a traditional gym setting,” she said. Then the pandemic happened. California’s strict lockdown policies prevented Rosenfeld from continuing her personal training sessions. And so, she and her family decided to move to Doylestown, her hometown. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Here, she wanted to continue her practice. After some searching for a perfect fit, she discovered a studio space on the first floor of the Lenape Hall. In October 2022, she opened Trimester Fit Body. Since then she’s been offering pregnancy and postpartum personal training sessions one-on-one and in small groups.<span class=\"Apple-converted-space\"> </span></span></p>\n<figure id=\"attachment_17329\" aria-describedby=\"caption-attachment-17329\" style=\"width: 1024px\" class=\"wp-caption alignnone\"><a href=\"/data/media/MR-147.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-17329\" src=\"/data/media/MR-147-1024x683.jpg\" alt=\"\" width=\"1024\" height=\"683\" srcset=\"/data/media/MR-147-1024x683.jpg 1024w, /data/media/MR-147-300x200.jpg 300w, /data/media/MR-147-768x512.jpg 768w, /data/media/MR-147-414x276.jpg 414w, /data/media/MR-147-470x313.jpg 470w, /data/media/MR-147-640x426.jpg 640w, /data/media/MR-147-130x86.jpg 130w, /data/media/MR-147-187x124.jpg 187w, /data/media/MR-147-990x660.jpg 990w, /data/media/MR-147-1320x880.jpg 1320w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" /></a><figcaption id=\"caption-attachment-17329\" class=\"wp-caption-text\">Meghan Rosenfeld</figcaption></figure>\n<p class=\"p5\"><span class=\"s1\">In her practice, Rosenfeld strives to support women during and after their pregnancies. She focuses on pelvic floor health, diaphragmatic breathing, and strength training. Her unique approach offers training that helps boost the physical and mental strength mothers and mothers-to-be need. It helps them reconnect with their bodies and find and maintain their confidence and self-esteem. Rosenfeld prides herself on being hands-on with each client. She wants each woman to walk away from the class with relevant and individualized tips.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">“I’m so excited to be able to bring my business back to my hometown,” Rosenfeld says. “It gives me a sense of giving back. It’s so fulfilling to share my knowledge to support women. I love seeing women get confidence and clarity, and feel good in their own skin. Seeing them grow is so rewarding.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">For more information, visit <a href=\"http://trimesterfitbody.com\" target=\"_blank\" rel=\"noopener noreferrer\">trimesterfitbody.com</a> and visit the beautiful Trimester Fit studio at 5 S. Main St, Suite 105.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/MR-99-e1681324466617.jpg"
}