{
  "id": 15405,
  "title": "UFO’s Over Doylestown?",
  "slug": "ufos-over-doylestown",
  "date": "2022-10-25T23:04:42",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "Eric Mintel",
    "ufo's"
  ],
  "excerpt": "<p>By Eric Mintel • Special to The Cardinal Over the years, Bucks County has received its fair share of historical hijinx with encounters of ghostly ghouls and spooky specters. Lately, those encounters took an otherworldly turn as folks are reporting strange lights in the night sky.  Satellites? No. Drones? No.  What people are seeing all [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Eric Mintel • </strong>Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">O</span><span class=\"s1\">ver the years, Bucks County has received its fair share of historical hijinx with encounters of ghostly ghouls and spooky specters. Lately, those encounters took an otherworldly turn as folks are reporting strange lights in the night sky. </span></p>\n<p class=\"p5\"><span class=\"s1\">Satellites? No. Drones? No. </span></p>\n<p class=\"p5\"><span class=\"s1\">What people are seeing all over Doylestown and vicinity is a very bright slow moving object with multiple lights around it. One thing that always accompanies such reports is the observation that the object in question does not make any sound. </span></p>\n<p class=\"p5\"><span class=\"s1\">As a paranormal investigator, I come across these reports often. Here are some recent ones that reached me. </span></p>\n<p class=\"p5\"><span class=\"s1\">In August, a woman from Doylestown was closing her guest room window and saw this brightly lit object. She was so moved by what she saw that she drew it and sent the drawing to me. In May, during her break, a nurse at Doylestown Hospital looked out the window and saw a set of triangular lights moving in the distance over Chalfont. She captured the anomaly on video. In April, another woman saw multiple sets of lights hovering over Lake Galena. The lights moved when she shined a laser pointer at them. She then also captured them on video.   </span></p>\n<p class=\"p5\"><span class=\"s1\">These sightings, and millions like them, have been reported, in one way or another, since the beginning of the UFO wave of the 40’s and 50’s.</span></p>\n<p class=\"p5\"><span class=\"s1\">In 1947, Kenneth Arnold, an American aviator, spotted nine disc-like objects skipping through the sky while he was flying his single engine plane over Mount Rainier in Washington state. He recalled that they looked like saucers, skipping on water. Hence, the term was coined  &#8211; flying saucer. </span></p>\n<p class=\"p5\"><span class=\"s1\">In May of 2022, Congress held its first hearing on UFOs in over 50 years. Under pressure from the government and the public, the Pentagon has established the Unidentified Aerial Phenomenon Task Force. The action makes it easier for the public to report UFOs, sightings of which run in the thousands every year. Whatever these entities are, they don’t seem to be a threat. Could they be from another world? The idea of extraterrestrials coming in for a visit and checking up on us is fascinating. But there is no way of knowing. And so for now, let’s look at the skies with an open mind and the distinct possibility that we are not alone.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/10/eric2.jpg"
}