{
  "id": 14045,
  "title": "Welcome To Seaside Heights, New Jersey",
  "slug": "welcome-to-seaside-heights-new-jersey",
  "date": "2022-07-13T14:51:51",
  "author": "Staff",
  "category": [
    "Live",
    "Play",
    "Stay",
    "Taste"
  ],
  "tags": [
    "Britt Around Town",
    "doylestown cardinal",
    "Heavy Reel Brewing Co",
    "Hemingway’s Cafe",
    "ice cream boss",
    "Island Beach State Park",
    "mermaid manor",
    "new jersey",
    "seasode heights",
    "Sunny Hunny by the Sea"
  ],
  "excerpt": "<p>By Britt Around Town • Special to The Cardinal This edition of Britt Around Town’s Let’s Stay Series takes us to Seaside Heights, NJ for a perfect weekend getaway at Coconut Cottages. For this stay, we stayed in the Mermaid Manor cottage…and the theme couldn’t have been more beautifully carried out throughout the house.  Mermaid [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Britt Around Town</strong> • Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">T</span><span class=\"s1\">his edition of Britt Around Town’s Let’s Stay Series takes us to Seaside Heights, NJ for a perfect weekend getaway at Coconut Cottages. For this stay, we stayed in the Mermaid Manor cottage…and the theme couldn’t have been more beautifully carried out throughout the house.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Mermaid Manor is one of two “iconic Jersey shore beach bungalows” with a “surfers paradise” theme that make up Coconut Cottages. You can rent one or both of the bungalows depending on the size of your party.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The other house on property is known as Pineapple Place. For fans of Lily Pulitzer, this house has a strong Lily Pulitzer South Florida meets California vibe!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Each of these cozy cottages have the following available:</span></p>\n<p class=\"p5\"><span class=\"s1\">2 bedrooms, 2 bathrooms, pull out sofa, private patio with a grill, outdoor shower, beach chairs, boogie boards and more!</span></p>\n<p class=\"p5\"><span class=\"s1\">Coconut Cottages is owned by a Bucks County local business owner and is a great way to continue to support our local community while on vacation.</span></p>\n<p class=\"p5\"><span class=\"s1\">For my friends in the Bucks County area: this rental property is an estimated 70 minute relaxed and easy drive from Newtown.</span></p>\n<p class=\"p5\"><span class=\"s1\">The shore has always been my mom’s happy place, so of course we brought my mother along for our Seaside adventure during Mother’s Day weekend. The entire time we were there, she kept pointing out things throughout the cottage and talked about how much she loved the decorations. In particular, the decor in the master bedroom with a nod to The Little Mermaid’s song “Part of Your World.” This fun decor has the lyrics “Look at this stuff, isn’t it neat” and serves as a display of items found during beach outings. Such a cute touch!</span></p>\n<p class=\"p6\"><strong>Exploring Seaside Heights</strong></p>\n<p class=\"p5\"><span class=\"s1\">It may have been empty and cold on this blustery day at the end of “off season”, but<span class=\"Apple-converted-space\">  </span>by the time you are reading this, the shore destination will be filled with travelers and beach goers of all ages! The Seaside Heights Boardwalk has plenty to offer for visitors of all ages.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Some key features of the Seaside Heights:</span></p>\n<p class=\"p5\"><span class=\"s1\">Breakwater Beach water park, Casino Pier amusement park, Coin Castle and Shake Shoppe arcades, Beach Family Golf and Smugglers Quay Adventure Golf, Various bars and restaurants, Scooter rentals, Shops, pizza places and more.</span></p>\n<p class=\"p6\"><strong>Dinner at Hemingway’s Cafe</strong></p>\n<p class=\"p5\"><span class=\"s1\">Hemingway’s Cafe is located on Boulevard and is a great place to grab a bite to eat away from the boardwalk scene. We enjoyed an order of clams, chicken parm, wings and a chicken quesadilla. The wings were cooked extra crispy, which is exactly how I love them! Hemingway’s is not only a restaurant, but also holds late night DJ hosted dancing, live music, special events and more.</span></p>\n<p class=\"p6\"><strong>Heavy Reel Brewing Co</strong></p>\n<p class=\"p5\"><span class=\"s1\">After dinner in Seaside, we headed down to Heavy Reel Brewing Co for a few beers.</span></p>\n<p class=\"p5\"><span class=\"s1\">I sampled two of their sours, tried a sip of my husbands IPA and ended up getting a full pour of their delicious imperial dessert stout:</span></p>\n<p class=\"p5\"><span class=\"s1\">I absolutely loved the stout and the longer I drank it, the more the individual flavors could be identified. Breweries are one of my favorite things to seek out when visiting new places, and I am so thankful we were able to experience this gem.</span></p>\n<p class=\"p6\"><strong>Ice Cream Boss</strong></p>\n<p class=\"p5\"><span class=\"s1\">Is it really a trip to the shore if you don’t get ice cream? We popped into Ice Cream Boss for some post dinner dessert before heading back to the house for the night. This ice cream store has over 30 flavors of ice cream to choose from as well as Italian ice, soft serve and dole whip! I’m “that person” who loves gummy bears on my ice cream, so I ordered a rocky road topped with hot fudge and gummies. Perfection!</span></p>\n<p class=\"p6\"><strong>Breakfast at Sunny Hunny by the Sea</strong></p>\n<p class=\"p5\"><span class=\"s1\">We made an excellent choice heading right down the road to Ortley Beach for Mother’s Day breakfast at Sunny Hunny by the Sea Family Pancake House and Restaurant. (I couldn’t resist the name)</span></p>\n<p class=\"p5\"><span class=\"s1\">Sunny Hunny originally opened in the 1960s and is a women lead business in New Jersey. The restaurant has been in the family of the owner for 35 years &#8211; and they have plenty of stories to share from over the years…one in particular being their story of enduring the effects from Hurricane Sandy. In the words of the family:</span></p>\n<p class=\"p5\"><span class=\"s1\">“This one story structure, located one block from the beach on 6th ave in Ortley (Right down the street from the former location of the surf club) was able to withstand the power of Sandy with only minimal water damage, in relation to the surrounding area. It was a miracle that my Wife’s family was able to continue operating and survived the years following, even with the hit that tourism took.”</span></p>\n<p class=\"p5\"><span class=\"s1\">Now, owners Donjae and Christopher and their family carry on the family legacy at Sunny Hunny and look forward to serving Ocean County for many decades to come.</span></p>\n<p class=\"p6\"><strong>Island Beach State Park</strong></p>\n<p class=\"p5\"><span class=\"s1\">Another place we would have loved to have the opportunity to explore more is Island Beach State Park at the southern point of Seaside. Island Beach State Park is a “preserved barrier island that protects a number of natural shoreline and nearshore habitats. The park contains close to ten miles of sandy beach, an extensive shoreline along Barnegat Bay, dense maritime forests, rolling sand dunes, and tidal marshes.” While it was too windy to enjoy the park, we did take a drive through to see some of the beauty that it has to offer.</span></p>\n<p class=\"p5\"><span class=\"s1\">We had such a wonderful stay at Coconut Cottages and would love to head down for another visit in the future! There was something so cozy and welcoming about our time at Mermaid Manor. They have truly put together a “surfers paradise” and is the perfect place to create many wonderful memories for years to come.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Coconut Cottages are available to rent on a referral basis, so if you are interested in inquiring, email <a href=\"mailto:coconutcottages@yahoo.com\">coconutcottages@yahoo.com</a> and tell them I sent you!<span class=\"Apple-converted-space\"> </span></span></p>\n<p><a href=\"/data/media/Seaside-heights.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-14047\" src=\"/data/media/Seaside-heights.jpg\" alt=\"\" width=\"1544\" height=\"803\" srcset=\"/data/media/Seaside-heights.jpg 1544w, /data/media/Seaside-heights-300x156.jpg 300w, /data/media/Seaside-heights-768x399.jpg 768w, /data/media/Seaside-heights-1024x533.jpg 1024w, /data/media/Seaside-heights-990x515.jpg 990w, /data/media/Seaside-heights-1320x687.jpg 1320w\" sizes=\"auto, (max-width: 1544px) 100vw, 1544px\" /></a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/07/Seaside-2.jpg"
}