{
  "id": 18632,
  "title": "What The Locals Do: Holiday Edition",
  "slug": "what-the-locals-do-holiday-edition",
  "date": "2023-12-14T20:13:48",
  "author": "Staff",
  "category": [
    "Style",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Shenoa Incorvati"
  ],
  "excerpt": "<p>By Shenoa Incorvati • Special to The Cardinal Bucks County is a magical place all year round, but it somehow has a little extra magic during the month of December. As the mom of two small children, there is nothing I love more than to see how excited they get when visiting Santa or seeing [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Shenoa Incorvati • </strong></em>Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">Bucks County is a magical place all year round, but it somehow has a little extra magic during the month of December. As the mom of two small children, there is nothing I love more than to see how excited they get when visiting Santa or seeing an amazing Christmas lights display. Luckily, I live in an area that has many opportunities to show my children, and us kids at heart, that magic.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">Lights, Camera, Instant Christmas Spirit!</span></strong></p>\n<p class=\"p5\"><span class=\"s2\">Shady Brook Farm’s drive-through holiday light show is impressive. You can throw on your favorite Christmas music and enjoy your toasty hot cocoa in the comfort of your own car. It usually takes about 30 minutes to drive through. The light show features three million lights and lots of familiar characters. I took more pictures of my kid’s reactions than I did of the actual lights. The Shady Brook light show is open Sun. through Thurs. from 5 to 10 pm and Friday and Sat. from 5 to 11 pm. Prices vary depending on the date. The farm<span class=\"Apple-converted-space\">  </span>also offers wagon rides if you want to brave the elements instead of staying in your car.</span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Shady Brook Farm</i></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>931 Stony Hill Road</i></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Yardley, PA 19067</i></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Visit <a href=\"http://shadybrookfarm.com\" target=\"_blank\" rel=\"noopener noreferrer\">shadybrookfarm.com</a> for available times and tickets<span class=\"Apple-converted-space\"> </span></i></span></p>\n<p class=\"p7\"><span class=\"s2\"><span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><strong><span class=\"s3\">Have A Holly Jolly Shopping Spree</span></strong></p>\n<p class=\"p5\"><span class=\"s2\">My favorite way to Christmas shop is by shopping small local businesses. Luckily for us, there are 33 shops in downtown Doylestown that will participate in the Holly Jolly Sip and Stroll event. I leave my husband and my kids at home and hit the town to get those one-of-a-kind unique gifts.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">The Holly Jolly Sip and Stroll is going to take place not just one but three Thursday evenings: Dec. 7, 14, and 21 from 5 p.m. to 7 p.m. The Paper Unicorn, C. Ferry Home, and Seedlings and Sprouts are some of my favorite shops participating. Be sure to check with your favorite shops’ Facebook or Instagram pages to find out if they are participating. Happy shopping!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Downtown Doylestown<span class=\"Apple-converted-space\"> </span></i></span></p>\n<p class=\"p7\"><span class=\"s2\"><span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><strong><span class=\"s3\">Santa Clause Is Coming To The Garden Center</span></strong></p>\n<p class=\"p5\"><span class=\"s2\">Gasper Home and Garden Center in Richboro has a spectacular Christmas shop. Whether you are looking to add a few additions to your Christmas decor, or you are just there to window shop, you will not be disappointed. Gaspers also has a wonderful Santa Claus available for pictures through Dec. 22. Bring your camera and take as many pictures as you would like. This is free, although Gaspers hopes you will consider making a donation to the Bucks County SPCA in lieu of a payment. Reservations are strongly encouraged. This year there is also a meet and greet with Olaf the snowman from Frozen on Dec.16 from 10 am to 12 pm.</span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Gasper Home &amp; Garden</i></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>316 Tanyard Road</i></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Richboro, PA 18954</i></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Call 215-364-2400 for reservations<span class=\"Apple-converted-space\"> </span></i></span></p>\n<p>&nbsp;</p>\n<p class=\"p4\"><strong><span class=\"s3\">Gingerbread Delight<span class=\"Apple-converted-space\"> </span></span></strong></p>\n<p class=\"p5\"><span class=\"s2\">Anyone who has been to Peddlers Village knows what a true gem it is. It is our very own Stars Hallow, minus the troubadour. During the month of December, the Village features not only an amazing light display, but they have an incredible gingerbread competition that runs through Jan. 13.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">This competition brings in more than one hundred entries. Parking can be tricky, especially for those popular evenings and weekends, so be sure to plan ahead. Peddlers Village also features some great restaurants, but be sure to make reservations. This is one of my favorite places to walk around during the holiday season—it truly feels like you are on the set of a Hallmark movie.</span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Peddler’s Village<span class=\"Apple-converted-space\"> </span></i></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Routes 202 &amp; 263</i></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Lahaska, PA 18931</i></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Visit <a href=\"http://Peddlersvillage.com\" target=\"_blank\" rel=\"noopener noreferrer\">Peddlersvillage.com</a> for information about all their holiday events</i></span></p>\n<p class=\"p7\"><span class=\"s2\"><span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><strong><span class=\"s3\">A Christmas Castle<span class=\"Apple-converted-space\"> </span></span></strong></p>\n<p class=\"p5\"><span class=\"s2\">Fonthill Castle is something everyone should see at least once. During the month of December beautifully decorated Christmas trees are placed throughout the castle. Last year I had the opportunity to take my mother and sister on a tour and it did not disappoint. We could not agree which Christmas tree we thought was the most beautiful—the rainbow tree was my favorite.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">The design and the construction are truly fascinating. The intricate tiles are prevalent throughout the castle and just add to the interesting history. I highly suggest taking a guided tour, they last about an hour, and the guides are incredibly knowledgeable. If tours are not your thing, they offer holiday meandering dates so you can go at your own pace. Head to mercermuseum.org to check for available dates.</span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Fonthill Castle<span class=\"Apple-converted-space\"> </span></i></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>East Court Street &amp;Route 313</i></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Doylestown, PA 18901</i></span></p>\n<p class=\"p6\"><span class=\"s3\"><i>Visit <a href=\"http://mercermuseum.org\" target=\"_blank\" rel=\"noopener noreferrer\">mercermuseum.org</a> to check for available dates and to purchase tickets</i></span></p>\n<p class=\"p7\"><span class=\"s2\"><span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Whatever it is you choose to do this December, I hope it is full of cheer and laughter and you’re surrounded by people you love.</span></p>\n<p class=\"p8\"><span class=\"s3\"><i>Shenoa Incorvati moved to Doylestown in October of 2019 and has been digging into all that Bucks County has to offer ever since. Keeping her two little kiddos entertained is a full-time job.</i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/FONTHILL2.jpg"
}