{
  "id": 20285,
  "title": "When Do You Give Your Kids A Smartphone?",
  "slug": "when-do-you-give-your-kids-a-smartphone",
  "date": "2024-09-15T19:52:20",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [],
  "excerpt": "<p>John Liberatore • Special for the Cardinal Local Parents Organize Awareness Campaign for “The Anxious Generation” and “Wait Until 8th” By now many parents have heard about the #1 best-seller, The Anxious Generation, by Jonathan Haidt. This book is primarily about the negative impacts of a childhood where much of our kids’ lives are centered [&hellip;]</p>\n",
  "content": "<p><b><em>John Liberatore </em><em>• </em></b>Special for the Cardinal</p>\n<p><b>Local Parents Organize Awareness Campaign for “The Anxious Generation” and “Wait Until 8th”</b></p>\n<p><span style=\"font-weight: 400;\">By now many parents have heard about the #1 best-seller, <a href=\"https://www.amazon.com/Anxious-Generation-Rewiring-Childhood-Epidemic/dp/0593655036/ref=asc_df_0593655036/?tag=hyprod-20&amp;linkCode=df0&amp;hvadid=692875362841&amp;hvpos=&amp;hvnetw=g&amp;hvrand=8047704563362064476&amp;hvpone=&amp;hvptwo=&amp;hvqmt=&amp;hvdev=c&amp;hvdvcmdl=&amp;hvlocint=&amp;hvlocphy=9007178&amp;hvtargid=pla-2281435180058&amp;psc=1&amp;mcid=cf7fc5a176c03e5eb1da66f12410e367&amp;hvocijid=8047704563362064476-0593655036-&amp;hvexpln=73\" target=\"_blank\" rel=\"noopener noreferrer\">The Anxious Generation</a>, by Jonathan Haidt. This book is primarily about the negative impacts of a childhood where much of our kids’ lives are centered around screens, rather than having a play-based childhood. He cites the dangers of technology, but more specifically how social media and devices are harming our young children socially, developmentally, and for some psychologically. </span></p>\n<p><span style=\"font-weight: 400;\">The book supports the idea that smartphones and social media should not be allowed until a developmentally appropriate age. Haidt suggests 14 years old (or the end of 8</span><span style=\"font-weight: 400;\">th</span><span style=\"font-weight: 400;\"> grade) as a reasonable age for allowing smartphones, and 16 as the recommended minimum age for opening a social media account. He also talks about the decline of outdoor play, and how this is a lost opportunity to learn important life skills like compromise, conflict resolution, and how to overcome adversity in the real world. The book is full of facts, figures, and studies, and is a great resource for anyone who wants to better understand these issues and make an informed decision about when to allow their child to have access to various technology. </span></p>\n<p><span style=\"font-weight: 400;\">Given the book’s reception, it seems that many parents agree that these are important and serious issues, but they may also feel as though there is nothing much that can be done. This is where “The Anxious Generation” truly sets itself apart. The work not only identifies problems, but provides solutions. Many solutions however involve other parents, the schools, and really the entire community. We can tell our kids phones are a big responsibility, and that they can be addictive and unhealthy, but eventually, we will have to answer to the argument, “But everyone else has a phone, so why can’t I?”. </span></p>\n<p><span style=\"font-weight: 400;\">The solutions are generally centered around two basic ideas &#8211; coordinating with other like-minded parents in your community to have more consistent restrictions for smartphone use, and encouraging our kids to play more or hang out together in person rather than on a device. Both solutions require a community effort. If there is no one else for your kid to play with outside, they are going to come back in to go on their devices like everyone else. </span></p>\n<p><span style=\"font-weight: 400;\">I recently attended my kids’ Home and School Association meeting and found that a conversation on this topic had already been started. Fellow parent, Jenn McFarlane, gave a presentation at the meeting on the Anxious Generation and related issues and initiatives. The <a href=\"https://www.waituntil8th.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Wait Until 8th initiative</a> is a rapidly growing countrywide initiative that is based on a very simple idea. You are asked to provide your school and your child’s grade level, and you make a pledge that you will not provide a smartphone for your child until after 8th grade. Watches and basic phones are not included in this pledge. </span></p>\n<p><a href=\"/data/media/Screenshot-2024-09-15-at-7.47.14-PM.png\"><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-20287\" src=\"/data/media/Screenshot-2024-09-15-at-7.47.14-PM-1024x745.png\" alt=\"Wait Until the 8th Initiative\" width=\"1024\" height=\"745\" srcset=\"/data/media/Screenshot-2024-09-15-at-7.47.14-PM-1024x745.png 1024w, /data/media/Screenshot-2024-09-15-at-7.47.14-PM-300x218.png 300w, /data/media/Screenshot-2024-09-15-at-7.47.14-PM-768x559.png 768w, /data/media/Screenshot-2024-09-15-at-7.47.14-PM-74x55.png 74w, /data/media/Screenshot-2024-09-15-at-7.47.14-PM-990x721.png 990w, /data/media/Screenshot-2024-09-15-at-7.47.14-PM-1320x961.png 1320w, /data/media/Screenshot-2024-09-15-at-7.47.14-PM.png 1632w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" /></a></p>\n<p><span style=\"font-weight: 400;\">The Wait Until 8th website will track the pledges, and once ten kids from your child’s school and grade level have made the pledge, your school and grade level become “active”. You will then be provided with the email contacts for the parents of the kids who have signed up as well. This is a simple way to coordinate smartphone use standards with other parents in your child’s grade level. I was pleasantly surprised to find that my son’s class was already active, due in large part to Jenn’s work in raising awareness for these ideas within her network of parents.</span></p>\n<p><span style=\"font-weight: 400;\">Jenn and other local parents including Kirstin McGowan and Megan Maynard are leading efforts within the local community to raise awareness of technology-related parenting issues, solutions, and initiatives that have been gaining attention nationwide. Thanks to their work you may soon hear more about these topics this fall through HSA presentations, newsletter articles at your school, and other local events. </span></p>\n<p><span style=\"font-weight: 400;\">Technology and social media are not inherently evil. These issues are new to parents and the findings on the effects are new to us too. Also, every kid is different, and there is probably no one-size-fits-all rule. However, the responsibility falls upon parents and the community to provide balance and protect our kids from a variety of dangers found on these devices until their brains have developed and they have acquired the life experiences to handle them. We don’t have to change the world to help our kids. We just have to change our local community a little bit. </span></p>\n<p><span style=\"font-weight: 400;\">If you would like to learn more, you can read the book “The Anxious Generation”, or follow Central Bucks Wait Until 8</span><span style=\"font-weight: 400;\">th</span><span style=\"font-weight: 400;\"> on Instagram (@waituntil8th_centralbucks). Also, be on the lookout for any presentations or information on this topic in your local schools, and consider making the Wait Until 8th pledge in your child’s grade level (www.waituntil8th.org).</span></p>\n<p><span style=\"font-weight: 400;\">Encourage your kids to get off their devices and go outside to play. They have their entire lives to explore the Internet and social media, and for all the other things that come along with being an adult sooner than we want to think about. But how many years do they have left where they can just be a kid and go outside and play with some friends?</span></p>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/09/Screenshot-2024-09-15-at-7.51.25-PM.png"
}