{
  "id": 18078,
  "title": "Woodworking and Air Drawing: Hoehne Clark",
  "slug": "woodworking-and-air-drawing-hoehne-clark",
  "date": "2023-08-12T15:27:06",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Style"
  ],
  "tags": [
    "doylestown cardianl",
    "Hoehne Clark Fine Furniture and Design",
    "Nate Schneller",
    "Woodworking and Air Drawing: Hoehne Clark"
  ],
  "excerpt": "<p>Meet a craftsman who can see through trees and a designer who draws in the air By Nate Schneller • The Cardinal Editorial Intern Stepping into the shop on E. State Street, I’m greeted by several unique pieces of furniture and jewelry. These wooden creations serve as the bread and butter of Hoehne Clark Fine [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b><i>Meet a craftsman who can see through trees and a designer who draws in the air</i></b></p>\n<p class=\"p1\"><em><strong>By Nate Schneller • </strong></em>The Cardinal Editorial Intern</p>\n<p class=\"p3\"><span class=\"s2\">S</span><span class=\"s1\">tepping into the shop on E. State Street, I’m greeted by several unique pieces of furniture and jewelry. These wooden creations serve as the bread and butter of Hoehne Clark Fine Furniture and Design. As I chat with the owners, Bill Hoehne and Susan Clark, I sit on a “mushroom stool” made of hickory wood.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">“We’re partners,” Bill says. “Susan does a lot of the design and we both work on the building. We collaborate on different projects, all the furniture and the jewelry.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Bill has worked with wood for most of his life. “Ever since I was in high school and took wood shop,” he says. He won a Golden Hammer award for a hutch cabinet he made while there. Since then, Bill worked for George Nakashima, a famous architect and furniture maker, whose work has been featured in the Michener Museum.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">It was Susan who suggested that Bill get back to creating his own furniture. Thus, their collaboration began, with Bill mostly handling construction and Susan helping with the design process. Their method of collaborating is fairly unique. “I can’t draw,” Susan says. “I’m not even good at sketching. So, if I have an idea, I do what I call ‘air drawing.’” She demonstrates for me, scribbling a rectangle in the air with her pointer fingers. From there, she says Bill has to “translate” the air drawings into a physical piece of furniture. It is not an easy process, but they make it work. “Having an idea is easy, but to make it come to life is time-consuming,” Susan says.</span></p>\n<figure id=\"attachment_18080\" aria-describedby=\"caption-attachment-18080\" style=\"width: 682px\" class=\"wp-caption alignnone\"><a href=\"/data/media/Eubie-Open.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-18080\" src=\"/data/media/Eubie-Open-682x1024.jpg\" alt=\"\" width=\"682\" height=\"1024\" srcset=\"/data/media/Eubie-Open-682x1024.jpg 682w, /data/media/Eubie-Open-200x300.jpg 200w, /data/media/Eubie-Open.jpg 705w\" sizes=\"auto, (max-width: 682px) 100vw, 682px\" /></a><figcaption id=\"caption-attachment-18080\" class=\"wp-caption-text\">Cabinet that goes by the name “Eubie,”due to its curved drawer at the bottom.</figcaption></figure>\n<p class=\"p5\"><span class=\"s3\">When designing furniture, Bill and Susan take inspiration from a multitude of different sources. Sometimes it’s nature. Susan recalls seeing a dead tree and thinking it looked like a dancer. She brought the idea to Bill, and eventually the concept evolved into a wooden figure with a spear, which Susan calls their “Warrior Princess.” Other times, inspiration strikes out of boredom. “When Bill is working on an idea, I might get bored,” Susan says. She then takes scraps of wood from the workshop and shapes them into designs. And that is how the pair began designing jewelry.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The process of recycling scraps has also helped with creating furniture. “One day, there were these pieces laying on the table, and I put them together and said ‘Oh, here’s a table,’ which is now this table,” Susan shows me the small model, then points to the finished table in the store. The transition from scraps to finished products is incredible.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">One of the most impressive works is a chess table. Commissioned by a client who had seen Susan and Bill’s work online, the piece is a result of a collaborative design process. Made of sycamore and wenge, an exotic wood from East Africa, the chessboard features a base shaped like a giant pawn. Speaking of pawns, the chess pieces, handmade and carved by a friend, showcase incredible detail. The knight pieces are especially imposing, with a detailed horse face and mane. A smaller, unfinished piece lives in the store, a smaller chess board as its home.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Visit the Hoehne Clark store at 52 B E. State St., or check out the website <a href=\"http://hoehneclark.com\" target=\"_blank\" rel=\"noopener noreferrer\">hoehneclark.com</a>.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/08/Chess-Table-1-1.jpg"
}