{
  "id": 11446,
  "title": "10 B&#038;B’s to View Fall Foliage in Bucks County",
  "slug": "10-bbs-to-view-fall-foliage-in-bucks-county",
  "date": "2021-10-08T21:58:33",
  "author": "Staff",
  "category": [
    "Live",
    "Stay",
    "Style"
  ],
  "tags": [
    "1740 house",
    "1780 Wedgewood Inn",
    "black Bass Hotel",
    "Bridgeton House on the Delaware",
    "doylestown cardinal",
    "frog hollow farm",
    "Galvanized America Inn",
    "Golden Pheasant Inn",
    "Riverstone 1730 on the Delaware",
    "The Inn at Barley Sheaf Farm",
    "The Inn at Bowman’s Hill",
    "Visit Bucks County"
  ],
  "excerpt": "<p>By Visit Bucks County • Special to The Cardinal  This fall, take a staycation! Breathe in the crisp autumnal air while enjoying the warm hospitality at one of the many B&amp;B’s in your own backyard. 1740 House Located in the quaint riverside village of Lumberville, the 1740 House is just 5 miles up the river [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><b>By Visit Bucks County • </b></span><span class=\"s1\">Special to The Cardinal</span></p>\n<p class=\"p2\"><span class=\"s1\"><span class=\"Apple-converted-space\"> </span></span><span class=\"s1\"><b><i>This fall, take a staycation! Breathe in the crisp autumnal air while enjoying the warm hospitality at one of the many B&amp;B’s in your own backyard.</i></b></span></p>\n<p class=\"p1\"><span class=\"s1\"><b>1740 House</b></span></p>\n<p class=\"p1\"><span class=\"s1\">Located in the quaint riverside village of Lumberville, the 1740 House is just 5 miles up the river from the New Hope. The Inn has 24 fully equipped rooms, all with river views – offering the perfect backdrop for a weekend getaway or a long-term stay. Guest rooms feature some of the finest views of the Delaware River in all of Bucks County – especially during autumn!</span></p>\n<p class=\"p1\"><span class=\"s1\"><b>1780 Wedgwood Inn of New Hope</b></span></p>\n<p class=\"p1\"><span class=\"s1\">This cozy B&amp;B is the perfect home away from home for those looking to explore the New Hope area. With many attractions within walking distance, fall foliage can be seen in the vast backyard, which is complete with a scaled down covered bridge structure. Feel right at home with their daily hot gourmet breakfast and plenty of things to do such as the Fall Foliage train ride out of the New Hope Railroad.</span></p>\n<p class=\"p2\"><span class=\"s1\"><span class=\"Apple-converted-space\"> </span></span><span class=\"s1\"><b>Black Bass Hotel</b></span></p>\n<p class=\"p1\"><span class=\"s2\">The famous Black Bass Hotel in Lumberville has preserved its Victorian era history beautifully and welcomes everyone &#8211; except George Washington, who was turned away. History buffs will enjoy the exciting lore of the Black Bass, which is also home to one of the largest collections of vintage British memorabilia in the country. Enjoy the brilliant hues of reds and orange on a private deck overlooking the Delaware River while relaxing in this cozy and luxurious B&amp;B. Stop across the street at the Lumberville General Store for some fresh sandwiches and hot beverages!</span></p>\n<p class=\"p1\"><span class=\"s1\"><b>Bridgeton House on the Delaware</b></span></p>\n<p class=\"p1\"><span class=\"s1\">This romantic spot in Upper Black Eddy is the perfect place to hang your hat for the weekend. The luxury bed and breakfast offers a riverfront view and plenty of nearby activities to enjoy the changing leaves. With cozy fireplaces, relaxing massages and beautiful sunset views over the water, Bridgeton House is one of the best places to get pampered and enjoy the finer things in life.</span></p>\n<p class=\"p1\"><span class=\"s1\"><b>Frog Hollow Farm B&amp;B</b></span></p>\n<p class=\"p1\"><span class=\"s1\">A stone farmhouse filled with history and originally built in the 1740’s, owners and innkeepers, the Adlers, call the B&amp;B their “ribbit of heaven.” Stay in one of their three cozy rooms and enjoy a hot breakfast with menu items like ginger pancakes and brioche French toast with caramelized pears and blueberries. On the grounds, enjoy common picnic tables where you can enjoy take-out or purchase a picnic basket, hammocks, chairs and a small dock to take in the changing leaf views.</span></p>\n<p class=\"p1\"><span class=\"s1\"><b>Galvanized America Inn</b></span></p>\n<p class=\"p1\"><span class=\"s1\">This beautiful, 4-bedroom inn is located in Pipersville in the sprawling Bucks County countryside among hundreds of red, orange and yellow leaves! Sit by the outdoor firepit with marshmallows and hot cider during your stay. Tour the wineries of Bucks County during your stay, and be sure to grab dinner at the Pineville Tavern, which was featured on Diners, Drive-Ins and Dives and just a short ride away. Have a large family or friend group? Rent out the whole inn at a special rate.</span></p>\n<p class=\"p2\"><span class=\"s1\"><b>Golden Pheasant Inn</b></span></p>\n<p class=\"p1\"><span class=\"s1\">Located between the Delaware River and Canal in Bucks County, the Golden Pheasant Inn offers fine dining and luxurious accommodations in a truly picturesque setting. Relax and take a moment to savor one-of-a-kind canal-side dining, warm hospitality, and French-inspired cuisine. Tons of foliage surrounds the inn. Right up the hill is the delectable and architectural masterpiece known as Sand Castle Winery. Try their Alpine Spice wine in fall!</span></p>\n<p class=\"p1\"><span class=\"s1\"><b>Riverstone 1730 on the Delaware</b></span></p>\n<p class=\"p1\"><span class=\"s1\">Riverstone 1730 is a classic nine room 18th century waterfront Guest House Bed &amp; Breakfast overlooking the Delaware River in Upper Black Eddy. Dating back to 1730, Riverstone has served as a frontier trading post, a Publik House (Colonial era tavern), and today, as Guest House Bed &amp; Breakfast. The wide plank flooring, four fireplaces, exposed beams and 18th century antiques take you back to the 1700’s the moment you walk through your private entrance. Surrounded by foliage, it’s the perfect place for a quaint and cozy getaway amidst the red, yellow, brown and orange trees of the season.</span></p>\n<p class=\"p1\"><span class=\"s1\"><b>The Inn at Barley Sheaf Farm</b></span></p>\n<p class=\"p1\"><span class=\"s1\">Catch a peek of the foliage during your stay at The Inn at Barley Sheaf. Located on acres of preserved farmlands and woods, this bed and breakfast provides all the amenities for a luxurious stay. Enjoy gourmet dining at their romantic restaurant. Or shop ‘til you drop at nearby Peddler’s Village and take in the area’s seasonal festivities, like Scarecrows in the Village (September 6 – October 30) and Apple Weekend (November 6 &amp; 7). Don’t forget to look up during your stay! The U.S. Hot Air Balloon Team, takes off from this location.</span></p>\n<p class=\"p1\"><span class=\"s1\"><b>The Inn at Bowman’s Hill</b></span></p>\n<p class=\"p1\"><span class=\"s1\">You’ll be in for a treat at this AAA Four Diamond bed and breakfast in Bucks County. As a certified wildlife habitat, The Inn at Bowman’s Hill in New Hope is a wonderful B&amp;B for animal and nature enthusiasts. Glimpse a sighting of white-tailed deer and foxes or take a stroll through the Bowman’s Hill Wildflower Preserve on the adjacent property. With acres of nature surrounding the property, you will be able to view some of the best fall foliage around.</span></p>\n<p class=\"p1\"><span class=\"s3\">For even more B&amp;B’s, and information on lodging packages and special offers, go to <a href=\"http://www.VisitBucksCounty.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.VisitBucksCounty.com</a>.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/10/BandB.jpg"
}