{
  "id": 11512,
  "title": "10 Fun Things To Do This Fall in Bucks County",
  "slug": "10-fun-things-to-do-this-fall-in-bucks-county",
  "date": "2021-10-13T04:18:49",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Play",
    "Stay",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "fall foliage"
  ],
  "excerpt": "<p>1. Doylestown Bike Path Doylestown Borough is a bike friendly community. Bike racks are provided through out town so riders can park their bike while they shop, visit and dine. The Doylestown Community Bike and Hike Network is a network of 25 miles of completed trails, shared roadways and side-paths for use by bicyclists and [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>1. Doylestown Bike Path</strong></p>\n<p class=\"p2\"><span class=\"s1\">Doylestown Borough is a bike friendly community. Bike racks are provided through out town so riders can park their bike while they shop, visit and dine. The Doylestown Community Bike and Hike Network is a network of 25 miles of completed trails, shared roadways and side-paths for use by bicyclists and pedestrians. Wondering what to do next weekend? How about a nice, long bike ride through the trails while admiring the fall foliage. Don’t forget to stop downtown for your pumpkin spiced latte from Nonno’s or Skyroast, pumpkin ice cream at Nina’s, or maybe even a fancy fall drink from The Hattery!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>2. Doylestown Escape Room<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s1\">What a great and, dare I say it, spooky way to spend an evening at Halloween time! An Escape Room is a live action-adventure game that is built around a certain theme or story.<span class=\"Apple-converted-space\">  </span>With 6 unique escape rooms to choose from, they have something that everyone in your group will love! Doylestown Escape Room has become the destination of choice for fun with friends &amp; family, birthday parties, company team building events, holiday celebrations, and just about any occasion. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>3. Froehlich’s Farm and Garden Fall Festival- Furlong, PA<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s1\">Fall is not complete without a festival to celebrate the changing of the leaves, the chill in the air, and, of course, Halloween! We are excited for the annual Froehlich’s Farm Fall Festival, and you should be too! The festival is held right on the farm, Saturdays and Sundays, throughout the month of October. Froehlich’s Farm offers the perfect fall adventure, with fun for all ages.<span class=\"Apple-converted-space\">  </span>Fall Fest includes Hayride on our 100 Acre Farm, Corn Maze *5 ACRES*, Pick-Your-Own Pumpkin Patch, Moon Bounce, Inflatable Obstacle Course, Pony Rides  *11:00-2:00 Every Day*, Petting Zoo  (only select dates), The Monster Slide, Mini Slide, The Cow Train, Build-Your-Own Scarecrow Station, Face Painting, Pumpkin Painting, Hay Maze, Toddler Hay Climb, Pumpkin Bowling, Shoot Out, Sling Shot, Cut Out Boards, Scarecrows, Live Music, Great Food, Local Breweries, Home Baked Goods and more. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>4. Peddlers Village- Scarecrows in the Village and The Murder Mystery Walking Tours and Scarecrows in the Village – New Hope</strong></p>\n<p class=\"p2\"><span class=\"s1\">Halloween season isn’t complete without a good ol’ fashioned murder mystery. Can you guess which stories are true and which are phantoms? Prizes will be awarded to those who know their Bucks County ghosts, but beware…They’re ready to deceive you!<span class=\"Apple-converted-space\">  </span>Check out the two great options below. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">• Golden Girls Murder Mystery: The Halloween Caper</span></p>\n<p class=\"p2\"><span class=\"s1\">• The GhostDusters Murder Mystery &#8211; They came, they died, they might be ghosts…or not.</span></p>\n<p class=\"p2\"><span class=\"s1\">While there, take a stroll through Scarecrows Village! Over 100 spectacular scarecrows line the autumn-tinted pathways of Peddler’s Village during the 42nd annual Scarecrows in the Village, on display from September 6 through October 30! View and vote for your favorite larger-than-life creations in this Bucks County tradition. Some scarecrows are inspired by famous characters, some are humorous, some are scary – but all of them are carefully handmade by Philly-area residents and organizations.</span></p>\n<p class=\"p1\"><strong>5. Hellericks Farm Fest – Doylestown<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s1\">Bring your family and friends to the rolling hills of Bucks County, PA amidst the beauty of fall’s finest colors to enjoy a great day of fun on the farm.  General Admission includes entry to the 18 acre Adventure Farm area which includes a Hayride, 2 Corn mazes, Farm animals, 3 slides, Tractor Tire playground and 40+ activities for children and adults of all ages. Don’t forget to ask about their Goat Yoga!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>6. Peace Valley Park Harvest Moonlight – New Britain<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s1\">Peace Valley Nature Center is a magical place in every season, but there’s something special about it in the fall.<span class=\"Apple-converted-space\">  </span>To make a serine, or maybe even spooky night of it, head over on the 20th to observe one of the most spectacular and brightest moons of the year on October 20! Meet at the Nature Center. Inclement weather cancels the walk. </span></p>\n<p class=\"p2\"><a href=\"https://www.peacevalleynaturecenter.org/events-calendar\" target=\"_blank\" rel=\"noopener noreferrer\"><span class=\"s1\">https://www.peacevalleynaturecenter.org/events-calendar</span></a></p>\n<p class=\"p1\"><strong>7. A Night Away at The Logan Inn- New Hope<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s1\">If you dare, get a babysitter for the kids and head on over to the spookiest inn in Buck County.<span class=\"Apple-converted-space\">  </span>This is Bucks County’s oldest continuously run Inn and is in the National Register of Historic Places. At the Logan Inn, there are reports of at least eight ghosts! One of the most active rooms in the Inn is room no. 6. Several women reported seeing a man behind them through the mirror in the bathroom, which disappears upon turning around. Can you make it all the way through the night in room no. 6?<span class=\"Apple-converted-space\">  </span>Many guests cannot!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>8. Movies at The Mercer Museum – The Addams Family- Doylestown</strong></p>\n<p class=\"p2\"><span class=\"s1\">Grab the popcorn and a snuggly blanket and head to the “Green” at the Mercer Museum for a family-friendly outdoor film screening. Thursday, October 21, 2021, Gates Open: 6:00 pm, and start time is dusk (around 7:00 pm) Join The Addams Family for their kookiest scarefest yet! What a great way to spend a fall evening!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>9. The Count’s Halloween Spooktacular at Sesame Place- Langhorne<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s1\">Come in costume and celebrate silly, not-too-spooky fun at The Count’s Halloween Spooktacular at Sesame Place! The park will be transformed into a family-friendly Halloween haven and guests will enjoy trick-or-treating around the park, Halloween-themed shows, participating in our interactive Scarecrow Scavenger Hunt,  swinging, flying, and cruising on Count von Count-themed mechanical rides, and unique photo opportunities with everyone’s favorite furry friends dressed up in costume on their Halloween-themed floats! </span></p>\n<p class=\"p1\"><strong>10. Shady Brook Farm Fall Fest- Yardley<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s1\">Fall is Shady Brook’s favorite time of year!<span class=\"Apple-converted-space\">  </span>Come celebrate the season with them at check out their Eerie Illuminations Wagon Ride and Light Show! This BRAND NEW Halloween experience featuring enchanting Halloween displays synchronized to music. Also, here at the farm, you can take your corn mazing to the next level by doing it in the dark! Bring-your-own flashlight to navigate your way through the 5-acre corn maze when the sun goes down. Other fall activities include a haunted barn, apple and pumpkin picking, bonfires and so much more!<span class=\"Apple-converted-space\">  </span>This is a must this season!<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/10/The_Count_s_Halloween_Spooktacular_at_Sesame_Place_46fd9900-4dec-4232-8554-0256cd42708e.jpg"
}