{
  "id": 18547,
  "title": "Stay Active this Winter with Pilates",
  "slug": "18547",
  "date": "2023-12-14T17:20:36",
  "author": "Staff",
  "category": [
    "Fit"
  ],
  "tags": [
    "doylestown cardinal",
    "polates",
    "Tricia Scheeler"
  ],
  "excerpt": "<p>By Tricia Scheeler • Special to The Cardinal When it comes to staying fit and healthy, finding an exercise routine that you enjoy is key. One popular workout method that has gained significant attention in recent years is Pilates. Part of the reason it is so popular is that it can be customized to fit [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Tricia Scheeler</strong></em> • Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">W</span><span class=\"s1\">hen it comes to staying fit and healthy, finding an exercise routine that you enjoy is key. One popular workout method that has gained significant attention in recent years is Pilates. Part of the reason it is so popular is that it can be customized to fit your goals regardless of fitness level.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Pilates is low-impact and focuses on strengthening the body’s core muscles, improving your posture and flexibility, and enhancing overall body awareness. Developed by Joseph Pilates in the 1920s, it is a system of exercises that relies on principles like muscular control, precision of movement, and breath. The exercises can be done on a mat or on various equipment such as a Reformer.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The first and perhaps the most popular way to engage in pilates is through attending studio group classes. Many fitness centers and pilates studios offer group classes with certified instructors who guide you through a series of exercises. Group classes not only provide you with the motivation to push yourself but also create a supportive community environment where you can connect with like-minded individuals.</span></p>\n<p class=\"p5\"><span class=\"s1\">Another way to stay motivated is through virtual classes. With the adaptations we made during the pandemic many fitness studios and trainers now offer virtual pilates classes on demand or live. These classes allow you to interact with the instructor and other participants from the comfort of your own home!</span></p>\n<p class=\"p5\"><span class=\"s1\">Participating in fun fitness events in your town is yet another way to stay active. Many cities organize fitness events such as workshops or pilates in the park, where you can join a group of individuals who share your passion for pilates. These events not only allow you to get in a good workout but also provide an opportunity to socialize and make new friends.</span></p>\n<p class=\"p5\"><span class=\"s3\">If you prefer a more personalized approach, private training sessions with a Pilates instructor may be the perfect choice for you. Private sessions offer one-on-one guidance and allow the instructor to tailor the exercises to your specific needs and fitness goals. If you are just starting your Pilates journey, this is the perfect place to start.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Tricia Scheeler is the owner and lead instructor of Flip Dog Pilates. She has been<span class=\"Apple-converted-space\">  </span>a fitness instructor for 30 years. She has a B.S. in Kinesiology for Penn State University. Check <a href=\"http://www.flipdogpilates.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.flipdogpilates.com</a> to learn more about classes and private sessions. Follow her on instagram @flip.dog.doylestown</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/Pilates.jpg"
}