{
  "id": 18775,
  "title": "",
  "slug": "18775",
  "date": "2024-01-19T17:06:46",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "Gratz Gallery"
  ],
  "excerpt": "<p>Gratz Gallery’s upcoming sale on Sunday, January 28, 2024 at 12 pm EST will highlight a large selection of traditional and modern, American paintings and frames at unbeatable prices.  Auction Information: The online auction will include close to 100 lots of paintings and frames by American artists, including paintings from the Pennsylvania Impressionists, students from [&hellip;]</p>\n",
  "content": "<p class=\"p1\">Gratz Gallery’s upcoming sale on Sunday, January 28, 2024 at 12 pm EST will highlight a large selection of traditional and modern, American paintings and frames at unbeatable prices.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p3\"><b>Auction Information:</b></p>\n<p class=\"p3\">The online auction will include close to 100 lots of paintings and frames by American artists, including paintings from the Pennsylvania Impressionists, students from the Pennsylvania Academy of the Fine Arts, Hudson River School, and a large selection of period and decorative frames. The genres stretch from impressionist to modern art, including traditional, abstract, folk and decorative art, as well as small, unknown treasures and gems. The online catalog will be available for viewing after January 1, 2024 through our website at gratzgallery.com, where you will also find the direct link to the live auction catalogue at <a href=\"http://Liveauctioneers.com\" target=\"_blank\" rel=\"noopener noreferrer\">Liveauctioneers.com</a>.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p3\">Included in this upcoming sale are American paintings from the 19th and 20th centuries, all the way to 20th and 21st centuries’ modern, abstract art. Some of the traditional highlights represented are works by Pennsylvania Impressionists Daniel Garber, Robert Spencer, S. George Phillips, and Walter Baum, Philadelphia Ten member Nancy Maybin Ferguson, a variety of 19th century landscapes, and a pair of stunning portraits by William Prior. The sale offers a varied selection of paintings, etchings, drawings, and frames at truly unbeatable prices.</p>\n<p class=\"p3\"><span class=\"s1\">This is an online exclusive auction, held in cooperation with the auction platform Liveauctioneers.com. Interested bidders must register and place bids with our online auction collaborators. Liveauctioneers.com allows for both absentee and real-time online bidding. For added convenience, download the Liveauctioneers app to your smart phone and bid from wherever you spend your January 28th. Gratz Gallery is able to extend a low buyer’s premium to our clients, offering very competitive estimates on an exciting inventory of Fine American and Modern Paintings, and frames.</span></p>\n<p class=\"p3\"><b>Preview Days: Friday and Saturday, January 26 &amp; 27, 2024, 11am – 4pm at Gratz Gallery location</b></p>\n<p class=\"p3\">You are invited to stop by the gallery for two special preview days on Friday and Saturday, January 26 &amp; 27, 2024, from 11 am – 4pm at Gratz Gallery and Conservation Studio, 5230 Silo Hill Road, Doylestown, PA 18902. During that time you have the opportunity to take a closer look at all the artwork, ask questions, and even leave your floor bids and register for telephone bidding. We apologize for any inconvenience, but the gallery will be closed to walk-in attendance on the day of the auction.</p>\n<p class=\"p3\"><b>About Gratz Gallery:</b></p>\n<p class=\"p3\">Gratz Gallery and Conservation Studio has been a leading authority on American Art, a trusted representative for collectors in the expansion and upgrade of their fine American art collections for over 40 years, and an important member of the Bucks County art community. Specializing in 19th and 20th century American paintings, with a focus on painters from the Pennsylvania Academy of the Fine Arts, Gratz Gallery offers a wide selection of Fine Art from Impressionism to Modern Art.</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/01/image2.jpeg"
}