{
  "id": 12693,
  "title": "5 Spring Wines Under $25",
  "slug": "5-spring-wines-under-25",
  "date": "2022-04-08T15:02:16",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "Charlotte Adams",
    "doylestown cardinal",
    "wine"
  ],
  "excerpt": "<p>By Charlotte Adams • Special to The Cardinal With every turn of the season towards lighter jackets and pollen-filled air, I find myself craving lighter wines. It’s an exuberant craving, one that can only be attributed to the kind of good mood that comes from longer days.  Warmer temperatures deem white wines and lighter reds [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Charlotte Adams • </strong>Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">With every turn of the season towards lighter jackets and pollen-filled air, I find myself craving lighter wines. It’s an exuberant craving, one that can only be attributed to the kind of good mood that comes from longer days.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\">Warmer temperatures deem white wines and lighter reds fitting again, and bubbly is welcomed more and more frequently without needing a reason. Here are five of my favorite springtime wines for under $25. Wines marked with an asterisk are available at the Doylestown Fine Wine &amp; Good Spirits store on Veterans Lane. Cheers!</span></p>\n<p class=\"p5\"><strong>1. Galen Glen Vinology Grüner Veltliner 2020 ($17.99)<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p4\"><span class=\"s4\">This local wine will always hold a place in my heart, as the vineyard block it comes from was the site of my master’s thesis research on vineyard management practices. The Troxell family makes exceptional dry, aromatic white wines (just ask wine critic James Suckling). If you like Sauvignon Blanc, be sure to give this one a try and pair it with pork or asparagus dishes. You can order at galenglen.com or by visiting the winery in Andreas.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong>2. Buckingham Valley Vineyards Vidal Blanc 2020 ($11.99)</strong></p>\n<p class=\"p4\"><span class=\"s3\">This lovely, family-owned winery is a Bucks County gem. Established in 1966, they are one of the oldest wineries in the state. Their Vidal Blanc, made from the eponymous hybrid grape, is crisp and zippy with a distinct lemon drop flavor. Pair it with lemon-garlic hummus and crackers. You can order at buckinghamwinery.com or by visiting the winery in Buckingham.</span><span class=\"s2\"><span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong>3. Vignobles Bulliat Crémant de Bourgogne Brut-Nature NV ($18.99)*</strong></p>\n<p class=\"p4\"><span class=\"s3\">This 100% Chardonnay sparkling wine from Burgundy, France, did not receive any sugary dosage before bottling, meaning it’s bone dry. It has very fine bubbles and flavors of citrus and biscuit. Try it with a soft, creamy cheese like Brillat-Savarin. At less than $20, this wine is a steal.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong>4. Dr. Konstantin Frank Dry Riesling 2020 ($15.99)*</strong></p>\n<p class=\"p4\"><span class=\"s2\">Dr. Frank is a Finger Lakes winery known for planting the first European vines on the East Coast back in 1957. Their dry Riesling is a benchmark and will delight with notes of lime, tangerine, and the varietally distinct scent of petroleum. It might sound off-putting to drink something with hints of crude oil, but I promise it’s exquisite. Pair with Asian cuisine.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong>5. Erbeldinger Spätburgunder Rheinhessen 2018 ($24.99)*</strong></p>\n<p class=\"p4\"><span class=\"s3\">Spätburgunder is the German word for Pinot Noir. This is a very light-bodied red, with dominant flavors of cranberry and strawberry. It has subtle tannins, like something you would find drinking black tea, and bright acidity. Pair it with pizza or a fruity cheese, such as Morbier.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><i>Charlotte Adams is a Bucks County resident who holds a master’s degree in Wine &amp; Vineyard Sciences from the University of Bordeaux in France. She works in wine marketing at Vine Street Imports and hosts private wine classes on the side. You can find her on Instagram @commonroadwine or at <a href=\"http://commonroadwine.com\" target=\"_blank\" rel=\"noopener noreferrer\">commonroadwine.com</a>.<span class=\"Apple-converted-space\"> </span></i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/04/Galen-Glen.jpg"
}