{
  "id": 11529,
  "title": "5 Tips to Safely Celebrate Halloween with Your Pets",
  "slug": "5-tips-to-safely-celebrate-halloween-with-your-pets",
  "date": "2021-10-13T20:51:26",
  "author": "Staff",
  "category": [
    "Live",
    "Play",
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "halloween pet safety"
  ],
  "excerpt": "<p>Whether heading to a party, celebrating on social media or greeting little ghouls and goblins at home, getting the entire family &#8211; including the four-legged family members &#8211; involved in the Halloween festivities can be the biggest treat of all. However, it’s important to take some precautions to avoid spooking your pets, particularly if you’ll [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">W</span><span class=\"s2\">hether heading to a party, celebrating on social media or greeting little ghouls and goblins at home, getting the entire family &#8211; including the four-legged family members &#8211; involved in the Halloween festivities can be the biggest treat of all. However, it’s important to take some precautions to avoid spooking your pets, particularly if you’ll be dressing them for the occasion.</span></p>\n<p class=\"p3\"><span class=\"s2\">In addition to keeping your pets out of the candy bowl and tempering their excitement during all the hustle and bustle, keep these tips from PetSmart’s resident veterinarian and pet care expert, Dr. Jennifer Freeman, DVM, in mind to ensure your pets are comfortable in their costumes so they’re able to celebrate stress-free.</span></p>\n<p class=\"p3\"><span class=\"s2\">Take baby steps. Start by trying a simple accessory, like a bandana, on your pets. See if they allow this and will walk around with it on for a few minutes. Not all pets like wearing clothes and some may become stressed or agitated while wearing a costume. However, many just need a little coaxing and positive reinforcement, such as praise and a treat.</span></p>\n<p class=\"p3\"><span class=\"s2\">Reward with something tasty. After you put the apparel or costume on your pets, reward them with their favorite treat to create a positive association between wearing the costume and getting a treat.</span></p>\n<p class=\"p3\"><span class=\"s2\">Ensure the costume is safe. Once you know your pets are comfortable in a costume, it’s important to ensure the outfit allows them to walk, bark, meow and see without difficulty. Additionally, if your pets can easily trip over their legs, try another type of clothing. Make sure there aren’t any accessories attached that may be easy for them to chew on or swallow.</span></p>\n<p class=\"p3\"><span class=\"s2\">Consider the weather. Pets can overheat easily, so ensure their clothing is not too bulky or heavy if it is warm on Halloween. Watch for elastic features around the paw area that may be restrictive and be certain there is enough room around the widest area of the chest to allow for proper air flow and ventilation.</span></p>\n<p class=\"p3\"><span class=\"s2\">Keep an eye on body language. Pets often communicate through body language and their behavior may let you know if they’re stressed or uncomfortable. Pay extra attention to your costumed pets’ body language while attending parties or events and watch for signs of discomfort such as pacing, hiding or refusing to move.</span></p>\n<p class=\"p3\"><span class=\"s2\">For more tips and tricks for keeping your pets safe this Halloween, as well as ideas for seasonal costumes, toys and treats, visit <a href=\"http://PetSmart.com\" target=\"_blank\" rel=\"noopener noreferrer\">PetSmart.com</a>. <span class=\"Apple-converted-space\">                </span>(<i>courtesy PetSmart)</i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/10/halloween-pet-safety.jpg"
}