{
  "id": 11358,
  "title": "55th Annual Polish American Family Festival &#038; Country Fair 2021",
  "slug": "55th-annual-polish-american-family-festival-country-fair-2021",
  "date": "2021-08-27T15:47:16",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live",
    "Play",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "National Shrine of Our Lady of Czestochowa",
    "The Polish-American Family Festival &amp; Country Fair"
  ],
  "excerpt": "<p>September 4, 5, 6, 11, 12 • 12:00 – 8:00 pm Daily The Polish-American Family Festival &amp; Country Fair is a five-day celebration of Polish culture, heritage and traditions. Starting with a small, informal event in 1966, the Festival has grown from humble beginnings into one of the oldest and most popular festivals of its [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><b><i>September 4, 5, 6, 11, 12 • 12:00 – 8:00 pm Daily</i></b></span></p>\n<p class=\"p1\"><span class=\"s1\">T</span><span class=\"s2\">he Polish-American Family Festival &amp; Country Fair is a five-day celebration of Polish culture, heritage and traditions.</span></p>\n<p class=\"p3\"><span class=\"s2\">Starting with a small, informal event in 1966, the Festival has grown from humble beginnings into one of the oldest and most popular festivals of its kind in the U.S. Each year the Festival attracts a diverse crowd of local, regional and international visitors, with over 25,000 festival attendees in 2019 alone.</span></p>\n<p class=\"p3\"><span class=\"s2\">At the festival, guests enjoy a variety of amusement rides, the exciting “Little Circus” show, and continuous live entertainment on two outdoor stages. The festival showcases award-winning polka and disco polo bands as well as Polish folk dance groups from across the United States and Canada. A much-anticipated part of the festival is the performance of the Polish American String Band in their Mummers costumes on the second Sunday of the festival.</span></p>\n<p class=\"p3\"><span class=\"s2\">Visitors to the festival witness demonstrations by historical re-enactors of the seventeenth century Polish-Lithuanian Commonwealth (known as the Banner of Jasna Gora) and the World War II Living History group, daily shows of Polish traditions, and a crafters’ village.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s3\">One of the most delicious ways to enjoy Polish culture is to sample the wide variety of Polish cuisine available for purchase. The festival menu includes smoked and grilled kielbasa, pierogi, potato pancakes, stuffed cabbage rolls, pastries, and Polish beer. Festival favorites such as funnel cake, hot dogs, chicken fingers, and water ice are also available. Since 2018, a new feature at the festival has been our Polish Vodka Tasting experience.</span></p>\n<p class=\"p4\"><strong>Take Part In The Festival Sweepstakes</strong></p>\n<p class=\"p3\"><span class=\"s3\">Win Cash Prizes! Grand Prize – $10,000. Purchase Festival Sweepstakes Tickets. The drawing will be held live in the Pavilion at 7:30pm on Sunday, September 12th.</span></p>\n<p class=\"p5\">The Festival takes place on the grounds of the <span class=\"s4\">National Shrine of Our Lady of Czestochowa,</span> located on 170 beautiful acres in Doylestown.</p>\n<p class=\"p3\"><span class=\"s2\">The event is non-profit and staffed solely by volunteers dedicated to making your visit a wonderful experience. All net proceeds go directly to defraying the costs of the festival and to maintaining the operation of the Shrine.</span></p>\n<p class=\"p3\"><span class=\"s2\">The Polish American Family Festival and Country Fair in Doylestown has been bringing people from the East Coast together to celebrate Polish heritage and culture for over fifty years! The festival provides an opportunity to celebrate Polish and Polish American pride while also helping to raise funds for the Shrine. Come join the fun! It’s a unique opportunity to have a great time at a great bargain while supporting a great cause.</span></p>\n<p class=\"p3\"><span class=\"s2\">Admission is $12 per person. For more information visit </span><a href=\"https://polishamericanfestival.org\" target=\"_blank\" rel=\"noopener noreferrer\"><span class=\"s4\">https://polishamericanfestival.org</span></a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/08/Polish-Girls-in-Dress.jpg"
}