{
  "id": 17446,
  "title": "A Chat With Matt  Fisher",
  "slug": "a-chat-with-matt-fisher",
  "date": "2023-04-16T14:25:28",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "matt fisher"
  ],
  "excerpt": "<p>What got you started in music? Listening to records with my Dad when I was little started my curiosity. Having access to his extensive vinyl collection and knowledge of all things rock n roll definitely helped to shape my young mind.  I started to get interested in playing music when I was 12. My friend [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong><span class=\"s1\">What got you started in music?</span></strong></p>\n<p class=\"p2\"><span class=\"s2\">Listening to records with my Dad when I was little started my curiosity. Having access to his extensive vinyl collection and knowledge of all things rock n roll definitely helped to shape my young mind.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s3\">I started to get interested in playing music when I was 12. My friend had teenage neighbors that were in<span class=\"Apple-converted-space\">  </span>bands<span class=\"Apple-converted-space\">  </span>and we would watch them practice. Sometimes they would let us try to play with them and show us how to play the instruments. I got to play the little snare break down from “Blister in the Sun” with them and that’s all it took to get me hooked. Not long after that I was putting together bands of my own with my friends and I’ve never stopped.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong><span class=\"s4\">What projects are you currently working on and where are you playing at?</span></strong></p>\n<p class=\"p2\"><span class=\"s5\">I’m currently working on recording an EP (Stands for extended play &#8211; longer than a single and shorter than an album)<span class=\"Apple-converted-space\">  </span>that will be out later this year under the stage name FishEar. Turns out there are a whole bunch of other musically inclined Matt Fishers out there so I feel a need to separate myself from the Matt Fisher pack so to speak.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s2\">If you want to hear my music on Spotify, Apple, etc. you have to type in “Matt Fisher Audio Decor” to find the right Matt Fisher. So coming soon to your preferred streaming platform… FishEar!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s2\">Currently I am also drumming with Trifecta which is a sort of improv jam band with some Hendrix, Dead, Marley, and originals mixed in. Our next gig is July 7th at John &amp; Peters. Other gigs may soon pop up as well.</span></p>\n<p class=\"p2\"><span class=\"s2\">Also I have recently been reconnecting with my old street punk band from my teenage years called Youth on the Warpath. Could be some future recordings or gigs in the making there. Another name rebranding may be necessary here as well. We are all much older now. “Old Farts on the Garden Trail” is in the running.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s2\">I like to frequent some of the open mics in the area too. Good chance any given Wednesday you may find me jamming at Villa Capri’s open mic. Always a good time!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>You’re from Doylestown, how long have you been playing music in the area?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s6\">Most of my bands were garage and basement worthy bands starting at around 12-years-old. I’ve played a good handful of local shows with some of those outfits but it has been hard to keep most bands together for very long. So to get the musical ideas out, that lead me down the path of cassette 4-track recording in high school. I put out a whole bunch of local releases. DIY style recordings, all hand made, full of whatever I was interested in at the time and lots of experimental music.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s5\">I continue to play in bands and play live when I can but home recording is where I can more freely explore and create. I like to play with all types of music styles and different types of instruments. I want to push boundaries. To create in as many different ways as possible and see what can come of it. Start with some sound or concept, apply a limitation, make a rule, change a pattern or just react in one take and keep it honest for better or worse. When recording I like to try to let the art emerge from itself in a way. It’s audible art or “Audio Decor” if you will. I want to create something new that even if it sounds unusual, will excite me and hopefully others as well.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s7\">Doylestown folk may know me most as the host of the “Open Jam.” I started it at Muggs for five years and migrated it to several other local bars until landing it at Stephanie’s (The Cellar on Main) for the last two years. It was a weekly free format jam session for any and all styles of musician. A collaborative musical experience. I met and played with so many great and talented musicians from the local community and surrounding areas over the years. It was a grand experiment and a most enjoyable time!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>You and your wife recently had a baby, exciting times, how are you adjusting to being a dad?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s5\">As I’m sure you know, it’s been a huge adjustment but of course it is super wonderful and worth all the energy. I’m very lucky that my wife is such a great mommy. She gives 1000% all the time… and I would like to think I’m doing pretty OK myself.<span class=\"Apple-converted-space\">  </span>My daughter is my world!<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/Matt-Fisher.jpg"
}