{
  "id": 18619,
  "title": "A New Sun Rises in Doylestown",
  "slug": "a-new-sun-rises-in-doylestown",
  "date": "2023-12-14T20:03:06",
  "author": "Staff",
  "category": [
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "UrbanSun"
  ],
  "excerpt": "<p>UrbanSun announced the grand opening of its vibrant new store, exclusively designed for teens and young adults in Doylestown Borough. From the team that brought the iconic Serendipity shop to town, UrbanSun will feature the latest trends in clothing, jewelry, accessories, and gifts for the young shoppers who flock to the Borough.   The grand opening [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">U</span><span class=\"s2\">rbanSun announced the grand opening of its vibrant new store, exclusively designed for teens and young adults in Doylestown Borough. From the team that brought the iconic Serendipity shop to town, UrbanSun will feature the latest trends in clothing, jewelry, accessories, and gifts for the young shoppers who flock to the Borough.  </span></p>\n<p class=\"p3\"><span class=\"s2\">The grand opening is set for the first weekend of December &#8211; Saturday, December 2nd and Sunday, December 3rd &#8211; and will include swag bags for the first 300 in-store customers and exclusive grand opening specials. This brand-new store is located at 21 East Oakland Avenue, in a fresh, completely redesigned space formerly occupied by Raymer’s Candy.  </span></p>\n<p class=\"p3\"><span class=\"s2\">“We are so excited to welcome the community in and are looking forward to growing together,” says Nicole Beltz, co-owner of Serendipity and UrbanSun. “The idea for UrbanSun was truly organic and grew from our experiences in Serendipity. Over the last few years, we’ve noticed more and more young people walking through town, shopping together, and really gravitating to our coastal-casual merchandise. So, we decided to build a store that was community-driven, locally inspired, and just for them.” </span></p>\n<p class=\"p3\"><span class=\"s2\">Keeping it casual and light, UrbanSun will carry some of the most popular items from the Serendipity shop, including clothes, backpacks, and breezy bracelets, rings, necklaces, and anklets.  But, UrbanSun is more than just a store, it’s a brand itself. </span></p>\n<p class=\"p3\"><span class=\"s2\">“UrbanSun is a vibe,” says Beltz. “Our sunrise logo truly represents us. We are bringing coastal style to a downtown environment. UrbanSun is young, modern, fun and radiates positivity. The store will carry a full stock of UrbanSun branded merchandise &#8212; with our vibrant logo on everything from water bottles and bags to t-shirts, hats, and slouchy sweatshirts in an array of popular colors for girls and guys. Our goal is to enable groups of young people to shop together and to offer a robust inventory of innovative, unique products that will speak to their interests.” </span></p>\n<p class=\"p3\"><span class=\"s2\">UrbanSun rises from the strong roots of Serendipity’s long running success. Opening its first brick and mortar location in Avalon, NJ in 2012, Serendipity has evolved into an e-commerce brand and multi-location operation in New Jersey and Pennsylvania. The Doylestown Serendipity shop will soon celebrate 10 years in business, anchoring a prominent corner in the Borough of Doylestown. </span></p>\n<p class=\"p3\"><span class=\"s2\">Expanding the Serendipity business with UrbanSun’s new concept and store was an easy decision for owner/operators Nicole Beltz and Ryan Miller, who have deep ties to the community, as current borough residents and graduates of Delaware Valley University. “We want to support the continued growth in our community and keep the downtown area a safe, thriving destination for many years to come,” Beltz says. “I can’t say enough about Doylestown. We are a community in the truest sense of the word, and we couldn’t be more excited about growing our business, encouraging people to shop local, and launching our new brand here.”  </span></p>\n<p class=\"p3\"><span class=\"s2\">As UrbanSun opens its doors in Doylestown this holiday season, it will become a hot destination for young shoppers, as well as their parents who are looking for that “just right” gift for their tween, teen, or young adult. UrbanSun will simultaneously launch their website, enabling online browsing and shopping at shopurbansun.com. </span></p>\n<p class=\"p3\"><span class=\"s2\">Instagram: <a href=\"https://www.instagram.com/urbansun_official/\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.instagram.com/urbansun_official/</a></span></p>\n<p class=\"p3\"><span class=\"s2\">Website: <a href=\"http://www.shopurbansun.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.shopurbansun.com</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/urbansunhat.jpg"
}