{
  "id": 11371,
  "title": "Announcing Children’s Village Rebuild",
  "slug": "announcing-childrens-village-rebuild",
  "date": "2021-09-10T14:58:34",
  "author": "Staff",
  "category": [
    "Fit"
  ],
  "tags": [
    "childrens village",
    "doylestown caedinal",
    "doylestown health"
  ],
  "excerpt": "<p>Doylestown Health is pleased to announce that Children’s Village will be rebuilt on the campus of Doylestown Hospital as a new priority of ONE VISION: The Campaign for Doylestown Health. To accelerate completion of this project, longstanding and visionary donors Jeanne and John Hubbard, PhD, have generously launched the $1.5 Million Children’s Village Challenge Match. All gifts to the [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">D</span><span class=\"s2\">oylestown Health is pleased to announce that Children’s Village will be rebuilt on the campus of Doylestown Hospital as a new priority of ONE VISION: The Campaign for Doylestown Health.</span></p>\n<p class=\"p3\"><span class=\"s2\">To accelerate completion of this project, longstanding and visionary donors Jeanne and John Hubbard, PhD, have generously launched the $1.5 Million Children’s Village Challenge Match. All gifts to the new Children’s Village will be matched up to $1.5 million!</span></p>\n<p class=\"p3\"><span class=\"s2\">On August 4, 2020, an EF2 tornado struck Doylestown, causing significant damage to the hospital campus and Children’s Village. Though the students and staff were evacuated safely and without serious injury, the building was damaged beyond further use. Thanks to an outpouring of donations from the community in the form of supplies, toys, crafts, and equipment, Children’s Village resumed operations a week later at a temporary site nearby on Ferry Road.</span></p>\n<p class=\"p3\"><span class=\"s2\">Though insurance covers part of the cost of rebuilding, with your support, we will bring the early childhood education center home to the Doylestown Hospital campus in a new facility commensurate with Doylestown Health’s standard of excellence.</span></p>\n<p class=\"p3\"><span class=\"s2\">Known for its strong curriculum incorporating play-based learning, Children’s Village has served the community for more than 35 years. Parents who were once students are now sending their own children through the infant, toddler, preschool, and kindergarten programs. Many employees of Doylestown Health also rely on Children’s Village for its convenient proximity to the hospital. The new building’s expanded footprint will include amenities designed to enhance learning and play opportunities, based on best practices in childhood education facilities.</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">Project highlights include:</span></strong></p>\n<p class=\"p3\"><span class=\"s2\">• Four infant rooms, four young toddler rooms, three older toddler rooms, four preschool rooms, and one kindergarten room</span></p>\n<p class=\"p3\"><span class=\"s2\">• A multipurpose area for gatherings, assemblies, and fitness</span></p>\n<p class=\"p3\"><span class=\"s2\">• Dedicated library space</span></p>\n<p class=\"p3\"><span class=\"s2\">• Interactive playground and outdoor learning space</span></p>\n<p class=\"p3\"><span class=\"s2\">• A tech-equipped “smart” kindergarten room</span></p>\n<p class=\"p3\"><span class=\"s2\">• A dedicated art room and teaching kitchen</span></p>\n<p class=\"p3\"><span class=\"s2\">• An administrative suite for teachers, staff, and care professionals</span></p>\n<p class=\"p3\"><span class=\"s2\">• Low-impact environmental building design with optimized natural light</span></p>\n<p class=\"p3\"><span class=\"s2\">• An integrative classroom environment and dedicated learning space for children with special needs</span></p>\n<p class=\"p3\"><span class=\"s2\">• Enhanced safety and security</span></p>\n<p class=\"p3\"><span class=\"s2\">We invite community support to help advance progress on this new campaign priority, and bring Children’s Village home. Learn more about the Children’s Village Challenge Match here</span></p>\n<p class=\"p4\"><strong><span class=\"s3\">About Doylestown Health Foundation</span></strong></p>\n<p class=\"p3\"><span class=\"s2\">As the philanthropic arm of Doylestown Health, Doylestown Health Foundation raises funds to safeguard the future of excellence in patient care and to improve the quality of life for all members of the community. Philanthropic support of an ambitious comprehensive campaign, ONE VISION: The Campaign for Doylestown Health, is transforming the delivery of superior healthcare in our community, both in new and expanded facilities, and through advancements in cutting-edge programs and state-of-the-art technologies. Contributions also support bold investments in innovative treatments, process improvements, and community resources to enhance the patient experience well into Doylestown Health’s second century of healthcare excellence.</span></p>\n<p class=\"p3\"><span class=\"s2\">Visit <a href=\"http://DoylestownHealthFoundation.org\" target=\"_blank\" rel=\"noopener noreferrer\">DoylestownHealthFoundation.org</a> or call 215.345.2009 for more information.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/09/ChildrensVillage.jpg"
}