{
  "id": 14403,
  "title": "Artist Spotlight: Tracy",
  "slug": "artist-spotlight-tracy",
  "date": "2022-08-23T16:13:26",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal"
  ],
  "excerpt": "<p>Hi, I’m Tracy with “Lettering By Tracy”. I am a local hand lettering artist. I specialize in hand lettered doormats, cards, prints, and more! I combine my love of typography and art to create one of a kind products. Tell us about yourself. When did your journey with art begin? My journey with art started [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><span class=\"s1\" style=\"color: #993300;\">Hi, I’m Tracy with “Lettering By Tracy”. I am a local hand lettering artist. I specialize in hand lettered doormats, cards, prints, and more! I combine my love of typography and art to create one of a kind products.</span></em></p>\n<p class=\"p3\"><b>Tell us about yourself. When did your journey with art begin?</b></p>\n<p class=\"p4\"><span class=\"s2\">My journey with art started as a child. I always loved pottery, drawing and painting. I continued drawing and painting into my adult years. Like many others during the pandemic, I began looking for new outlets to pass the time and started calligraphy. It wasn’t long after I started calligraphy that I began lettering on different mediums and “Lettering By Tracy” was born!</span></p>\n<p class=\"p3\"><b>Tell us about your art.<span class=\"Apple-converted-space\">  </span>What is your creative process like?</b></p>\n<p class=\"p4\"><span class=\"s4\">My art centers around my handwriting, which is really cool if you think about it. I elaborate and manipulate my handwriting<span class=\"Apple-converted-space\">  </span>to make new designs and fonts. In doing this, I add a fun unique spin to the products that I paint which truly makes them one of a kind. Custom doormats are my most popular item with calligraphy prints a close second. I also have a line of greeting cards with unique sayings for any occasion.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><b>Who or what is a big inspiration for you?</b></p>\n<p class=\"p4\"><span class=\"s4\">As a creative person, I’m always looking for inspiration in the world around us. There are many local (and non-local) artists that inspire me because of their ability to create something from nothing. In my business, I do exactly that. I have a blank slate on a wide variety of mediums such as wood, coir, acrylic, and cardstock. I think about the intention of the piece that I want to create and let my hands do the rest.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><b>How do you like being a local artist in Doylestown?</b></p>\n<p class=\"p4\"><span class=\"s2\">I love being a local artist in Doylestown. The network of small businesses and the community around Doylestown have been very welcoming and supportive. Many people reach out to me on social media to say hi or to inquire about my doormats.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><b>Where can we find your work?</b></p>\n<p class=\"p4\"><span class=\"s2\">• <a href=\"http://www.LetteringByTracy.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.LetteringByTracy.com</a></span></p>\n<p class=\"p4\"><span class=\"s2\">• Instagram: @LetteringByTracy</span></p>\n<p class=\"p4\"><span class=\"s2\">• In store at Makers Off Main<span class=\"Apple-converted-space\">    </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/08/Tracy.jpg"
}