{
  "id": 12153,
  "title": "Artist Spotlight: Jen and Alexis",
  "slug": "artist-spotlight-jen-and-alexis",
  "date": "2022-02-05T18:07:29",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "artist spotlight",
    "doylestown cardinal",
    "makers off main"
  ],
  "excerpt": "<p>Jen and Alexis are a two-woman team out of North Wales, PA, that are the owners and creators of the jewelry brand Champagne on a Wednesday. Each piece of handmade jewelry is designed alongside an artwork card that embodies the inspirational messaging of the collection through original artwork and story.  Tell us about yourself. When [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><i>Jen and Alexis are a two-woman team out of North Wales, PA, that are the owners and creators of the jewelry brand Champagne on a Wednesday. Each piece of handmade jewelry is designed alongside an artwork card that embodies the inspirational messaging of the collection through original artwork and story.<span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p1\"><strong>Tell us about yourself. When did your journey with art begin? </strong></p>\n<p class=\"p2\"><strong><span class=\"s1\">Jen</span></strong><span class=\"s2\"> &#8211; I would say in 4th grade. I won a drawing contest. Then it went dormant until I became a mom. I would love doing paint classes, jewelry making classes, crafting with my boys, etc. for fun.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><strong><span class=\"s1\">Alexis</span></strong><span class=\"s2\"> &#8211; I’ve always been a “creative” person, scratching my creative itch in many ways over the years, mostly with music and writing. But then, about ten years ago, I took a drawing class in Doylestown because I had always told myself I was terrible at drawing, and I wanted to learn something new. It reminded me that all the ways we express our creativity are actually learned skills, and the sky is the limit if you are open to experimenting.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s2\">We are both moms with kids the same age, so our journey together as artist partners began when our youngest kiddos entered first grade, and we finally had time and energy to devote to our creative passions.</span></p>\n<p class=\"p1\"><strong>Tell us about your art and creative process?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><strong><span class=\"s1\">Jen</span></strong><span class=\"s2\"> &#8211; Honestly, I am obsessed with shopping. So, the first step is usually sourcing unique gemstones. We typically have a good amount of unused gems on hand. We have 3-4 large collection launches a year. Each of our collections has a vibe/theme. Once we know the vibe, we will lay everything out and design. We work together, sharing ideas and giving a big thumbs up or down. We both know what we like and don’t, so it is rare for it to be maybe. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><strong><span class=\"s1\">Alexis</span></strong><span class=\"s2\"> &#8211; Our art is in two parts- the jewelry design and the artwork card and messaging that comes along with each piece. We work together to create a cohesive aesthetic across the jewelry and the cards.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s2\">I don’t work well under pressure, so my best ideas come when I have nothing to do with them. I’ll dig back through those old ideas when it’s crunch time, and I rely on Jen a lot to help bring them to life in the jewelry. I usually start making a ton of art for the artwork cards, and eventually, I find my way towards something that seems to connect with the story we are trying to tell.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Who or what inspires you?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><strong><span class=\"s1\">Jen</span></strong><span class=\"s2\"> &#8211; I love creating designs that can be dressed up or down. I am inspired by the thought of an outfit or event that someone may wear our pieces for. But my biggest inspiration comes from talking with people at markets and making connections. Knowing that people connect with our designs and stories is the greatest inspiration for making and growing.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><strong><span class=\"s1\">Alexis</span></strong><span class=\"s2\"> &#8211; I often find inspiration for the messaging component of our work in what I feel like I need at that moment. So even though we are creating for others, I’m often speaking directly to myself through the collections. Artistically, I am drawn to the relationship between light and dark, which you will see in so many of our jewelry designs and how I photograph them.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>How do you like being a local artist in Doylestown?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s2\">We feel so lucky to be a part of such a welcoming community. We feel like Doylestown is the heart of the local artisan, and we love being close enough to be a part of it. There are so many talented creative humans in this area, and Doylestown showcases them either in individual stores, in stores like Makers and the Doylestown ArtFest!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Where can we find your work?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s2\">We sell our entire catalog online at <a href=\"http://www.champagneonawednesday.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.champagneonawednesday.com</a> and a thoughtful selection of our work at local boutiques such as Makers off Main. We also participate in many local vendor markets seasonally throughout Bucks and Montgomery Counties and the surrounding areas. <span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/02/jen-and-alexis.jpg"
}