{
  "id": 19756,
  "title": "Artifact Brewing Opens in Doylestown Borough",
  "slug": "artifact-brewing-doylestown-borough",
  "date": "2024-06-04T12:30:35",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "Artifact brewing",
    "Bucks County brewing",
    "Doylestown breweries"
  ],
  "excerpt": "<p>By Dana Roberts • Cardinal Contributing Writer This summer, Doylestown borough residents and Bucks County’s beer aficionados have a new place to enjoy the season’s charms, as well as a delicious brew: Artifact Brewing.  The brewery’s second location, which opened earlier this spring at 19 West Court Street, halfway down the block from Lilly’s Gourmet [&hellip;]</p>\n",
  "content": "<p><b><em>By Dana Roberts </em><em>• </em></b>Cardinal Contributing Writer</p>\n<p><span style=\"font-weight: 400;\">This summer, Doylestown borough residents and Bucks County’s beer aficionados have a new place to enjoy the season’s charms, as well as a delicious brew: Artifact Brewing. </span></p>\n<p><span style=\"font-weight: 400;\">The brewery’s second location, which opened earlier this spring at 19 West Court Street, halfway down the block from Lilly’s Gourmet and Catering welcomes visitors Thursday through Sunday. Artifact’s initial location, on York Road in Hatboro, has become an established local hangout for Hatboro residents, serving up an always-rotating selection of drafts from their seven-barrel brewing system. </span></p>\n<p><span style=\"font-weight: 400;\">The sense of community that the Hatboro location has developed is something that Ryan McKinney, 47, Artifact’s head brewer and one of its three partners, is most proud of. “It’s a place where old folks, young folks, families, and even pets come to hang out,” says McKinney. </span></p>\n<p><span style=\"font-weight: 400;\">McKinney and his partners, Matt Brzowski and Dan Richards, hope that the Doylestown location has the same vibe. The brewery features a full-size garage door that opens whenever the weather permits, as well as a small patio out front, where patrons can people-watch while enjoying their drinks. </span></p>\n<p><span style=\"font-weight: 400;\">Artifact’s brewing model is that they never brew the same beer twice. However, customers can always expect the following: easy-to-drink blonde ales or summer ales, hazy IPAs, big stouts, barrel-aged sour beers, a cider on tap, and a non-alcoholic offering. The brewery has a limited classic cocktail menu and a small snack menu. Guests are always welcome to bring food and are encouraged to support local restaurants by bringing their takeout there. Pets are welcome to come and enjoy the fun as well. The brewery offers occasional live music.</span></p>\n<p><span style=\"font-weight: 400;\">McKinney, himself an “artifact” from CB West’s class of 1994 (pun intended—by no means is 47 old, but the name reference could not be denied), and his partners felt that Doylestown would be the perfect fit for the second brewery space they planned to open. “I grew up here, it’s a great town, and we felt the town and community would benefit from what Artifact has to offer,” McKinney said. </span></p>\n<figure id=\"attachment_19770\" aria-describedby=\"caption-attachment-19770\" style=\"width: 988px\" class=\"wp-caption alignnone\"><a href=\"https://doylestowncardinal.com/wp-content/uploads/2024/06/Artifact.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-19770\" src=\"https://doylestowncardinal.com/wp-content/uploads/2024/06/Artifact-988x1024.jpg\" alt=\"Artifact Brewing \" width=\"988\" height=\"1024\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2024/06/Artifact-988x1024.jpg 988w, https://doylestowncardinal.com/wp-content/uploads/2024/06/Artifact-289x300.jpg 289w, https://doylestowncardinal.com/wp-content/uploads/2024/06/Artifact-768x796.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2024/06/Artifact-990x1026.jpg 990w, https://doylestowncardinal.com/wp-content/uploads/2024/06/Artifact-1320x1368.jpg 1320w\" sizes=\"auto, (max-width: 988px) 100vw, 988px\" /></a><figcaption id=\"caption-attachment-19770\" class=\"wp-caption-text\">Artifact Brewing opens second location in Doylestown</figcaption></figure>\n<p><span style=\"font-weight: 400;\">A Horsham resident and father to a 20-, 17-, and 13-year-old, McKinney was an accomplished home brewer and a geologist by trade. He recently started brewing full-time at Artifact after a long stint of juggling his full-time job in environmental consulting with the demands of the Hatboro brewery. </span></p>\n<p><span style=\"font-weight: 400;\">Artifact Brewing originated when Brzowski came to McKinney with the suggestion to open a brewery. Brzowski and McKinney had become friends because their children played sports together. Brzowski had enjoyed McKinney’s home brews and encouraged him to push his accomplished home brewing skills to the next level. They opened the Hatboro location in fall of 2019, after about 18 months of planning and execution. </span></p>\n<p><span style=\"font-weight: 400;\">The fact that the brewery was able to survive the hit of Covid speaks to its appeal. McKinney said that they were forced to shut down in-person, but offered curbside pickup, growlers, and free delivery within 15 miles throughout the pandemic closures, which kept them busy, and more importantly, afloat. </span></p>\n<p><span style=\"font-weight: 400;\">By the fall of 2022, Artifact was thriving, and another friend, Dan Richards, whom McKinney knew through a beer exchange, approached him and Brzowski about becoming a partner and opening another location. McKinney had already been thinking about a second location, not only because of Artifact’s success but to help meet the demand. </span></p>\n<p><span style=\"font-weight: 400;\">While the name Artifact is simply one that McKinney and Brzowski liked, it’s fitting for Doylestown, a place steeped in history. Cheers to this new brewery becoming a long-lived part of the borough’s establishments. Learn more at <a href=\"http://artifactales.com\" target=\"_blank\" rel=\"noopener noreferrer\">artifactales.com</a>, and follow the brewery on Instagram @artifactbrewing.</span></p>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/06/artifactreduced.jpg"
}