{
  "id": 14793,
  "title": "Artist Spotlight: The Soap Otter",
  "slug": "artist-spotlight-the-soap-otter",
  "date": "2022-09-12T22:49:14",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "the soap otter"
  ],
  "excerpt": "<p>Meet Dana, the maker behind The Soap Otter. She lives in Buckingham with her husband, children, and animals. She creates traditional handmade soaps and personal care products and only uses natural ingredients like clays, herbs, and essential oils! Tell us about yourself. When did your journey with art begin? Oddly enough, I’ve never considered myself [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">Meet Dana, the maker behind The Soap Otter. She lives in Buckingham with her husband, children, and animals. She creates traditional handmade soaps and personal care products and only uses natural ingredients like clays, herbs, and essential oils!</span></p>\n<p class=\"p3\"><b>Tell us about yourself. When did your journey with art begin?</b></p>\n<p class=\"p4\"><span class=\"s2\">Oddly enough, I’ve never considered myself an artist. Growing up and even still, I am terrible at drawing, painting, and most artistic mediums. What I was good at was baking and this skill transcends to my soap making &#8211; measuring ingredients, envisioning the outcome and improvising when needed. All that happens in baking and when creating soaps.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><b>Tell us about your art. What is your creative process like?</b></p>\n<p class=\"p4\"><span class=\"s3\">I create soaps in the traditional cold process method. That means I mix oils and fats with a lye solution at room temperature. Then I pour the soap and keep the mixture at room temperature. There is no heating involved. Soap making requires a lot of patience. After I pour the soaps in the loaf, I cut them into bars two to three days later. Then I cure them on a shelf for 4-6 weeks. Curing is an important process of soap making because it allows the bar to get nice and hard. This also makes the soap last longer.</span></p>\n<p class=\"p3\"><b>Who or what is a big inspiration for you?</b></p>\n<p class=\"p4\"><span class=\"s2\">Nature has been the driving inspiration for all my soaps and products. Oil infusions and botanicals in and on top of my soaps are key components in my soap-making. I started making soap with the intention of providing people with the most natural skin care products.</span></p>\n<p class=\"p3\"><b>How do you like being a local artist in Doylestown?</b></p>\n<p class=\"p4\"><span class=\"s2\">There is a whole network of makers and artists within this community. It’s amazing to me how supportive everyone can be towards each other and really what a close network it is.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><b>Where can we find your work?</b></p>\n<p class=\"p4\"><span class=\"s3\">Locally, I sell my products at Makers off Main, McArdles Farm Store, and Inklings Gifts and Bookstore. Online you can find me at <a href=\"http://thesoapotter.com\" target=\"_blank\" rel=\"noopener noreferrer\">thesoapotter.com</a> and on Etsy, Instagram &amp; Facebook @thesoapotter. <span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/09/IMG_7813.jpeg"
}