{
  "id": 20020,
  "title": "Ask Birdie: July 2024",
  "slug": "ask-birdie-july-2024",
  "date": "2024-07-09T15:35:33",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [],
  "excerpt": "<p>Dear Birdie,  Since we live in a relatively small town, it’s pretty easy to bump into people you know when you’re out (the farmers market, the pool, restaurants, summer concerts). How can I keep my interactions short or inconspicuously avoid someone I spy without seeming rude? Also, any spots that I can fly under the [&hellip;]</p>\n",
  "content": "<p><i><span style=\"font-weight: 400;\">Dear Birdie, </span></i></p>\n<p><i><span style=\"font-weight: 400;\">Since we live in a relatively small town, it’s pretty easy to bump into people you know when you’re out (the farmers market, the pool, restaurants, summer concerts). How can I keep my interactions short or inconspicuously avoid someone I spy without seeming rude? Also, any spots that I can fly under the radar? </span></i></p>\n<p><i><span style=\"font-weight: 400;\">Sincerely, Looking-for-Camo-Carol </span></i></p>\n<p><span style=\"font-weight: 400;\">Dear Camo-Carol, </span></p>\n<p><span style=\"font-weight: 400;\">First, I urge you (and everyone, really) to camo at least once in your hometown. Wear a wig and fake eyelashes. Disguise yourself with a hat and sunglasses. Try a new accent at the farmer&#8217;s market. Have some fun with it! Besides fulfilling your introvert dreams of avoiding small talk, the curious little exercise will give you a glimpse at a different perspective.</span></p>\n<p><span style=\"font-weight: 400;\">Once you get the fill of the game (or run out of disguises to try), please do come back as yourself. We need you. We love you. Today, we have so many distractions in our lives &#8211; busy lives fueled by hassle culture, schedules, to-do lists, and social media feeds. What we need most, though, is that human connection. Small talk on a grocery run might make you want to run for hills sometimes, but if you think about it, that might be one of the very few real-life interactions we have outside our households. Embrace it. </span></p>\n<p><i><span style=\"font-weight: 400;\">Dear Birdie, </span></i></p>\n<p><i><span style=\"font-weight: 400;\">I’m fed up with people driving way too fast down my street. Some cars treat it like a speedway, and I worry about kids and pets. Any suggestions for my next steps? </span></i></p>\n<p><i><span style=\"font-weight: 400;\">Sincerely, Safe Susan</span></i></p>\n<p><span style=\"font-weight: 400;\">Dear Susan, </span></p>\n<p><span style=\"font-weight: 400;\">Thank you for being safety-conscious. Between fast drivers and modern cars not exactly fit for some of the narrower roads we have, the streets can be a scary place. We’re all in a rush to get somewhere &#8211; so much to do, so little time. </span></p>\n<p><span style=\"font-weight: 400;\">Of course, there are traditional ways to deal with drivers in a hurry &#8211; informing local authorities and installing speed-tracking devices. But often, these tactics only work temporarily, still leaving residents shaking their fists in the rear-view mirrors. </span></p>\n<p><span style=\"font-weight: 400;\">But perhaps a more creative solution can deliver better results. One fundamental principle of economic analysis states that people respond to incentives. I think that applies here, too. Give the drivers a reason to slow down &#8211; curiosity, entertainment, or joy. </span></p>\n<p><span style=\"font-weight: 400;\">Summer is an ideal time for a lemonade stand or a yard sale. When you’re too busy to hold one, install funny signs &#8211; a joke, a piece of wisdom, a wish to have a nice day. Get artsy and creative with it, involve the kids in the neighborhood. If all else fails, add an element of surprise &#8211; who put a giant dinosaur in the front yard?!</span></p>\n<p>&nbsp;</p>\n<p><i><span style=\"font-weight: 400;\">Have a question for Birdie? Submit to the managing editor at natalya@doylestowncardinal.com</span></i></p>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/06/Gray-Blue-Gold-Rustic-Flower-Watercolor-Minimalist-Wedding-Banner-72-x-15-in.png"
}