{
  "id": 18051,
  "title": "August at Phillips’ Mill Means Calls for Submissions and Summer Fete Fun",
  "slug": "august-at-phillips-mill-means-calls-for-submissions-and-summer-fete-fun",
  "date": "2023-08-12T15:13:56",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "Phillips’ Mill"
  ],
  "excerpt": "<p>The “Call for Art” has gone out for the 94th Juried Art Exhibition at Phillips’ Mill in September. The Art Committee welcomes submissions from all artists within a 25-mile radius of the Mill: from the highly established to the emerging beginner, from the widely shown to the underrepresented, and from all ethnicities, backgrounds, and beliefs. [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">T</span><span class=\"s2\">he “Call for Art” has gone out for the 94th Juried Art Exhibition at Phillips’ Mill in September. The Art Committee welcomes submissions from all artists within a 25-mile radius of the Mill: from the highly established to the emerging beginner, from the widely shown to the underrepresented, and from all ethnicities, backgrounds, and beliefs. Registration is open July 30 – August 27, and must be completed online via Smarter Entry before dropping work off at the Mill on Receiving Days, September 8 and September 9, for in-person jurying.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">A stellar lineup of jurors has been selected for this year’s show: Al Gury, artist, educator, writer, and professor of Painting and Drawing at the Pennsylvania Academy of the Fine Arts in Philadelphia; painter, printmaker, and retired professor of Printmaking and African American Art History at Lafayette College, Curlee Raven Holton; TK Smith, Assistant Curator: Art of the African Diaspora at the Barnes Foundation; sculptor Syd Carpenter of Philadelphia, whose work is in the permanent collections of many museums including the Metropolitan Museum of Art, Philadelphia Museum of Art, and The Renwick Gallery of the Smithsonian American Art Museum; and ceramic artist and educator, Lauren Sandler, Associate Professor and Program Head of Ceramics at Tyler School of Art and Architecture at Temple University. For the show prospectus, Smarter Entry registration link, and juror bios, visit <a href=\"http://www.phillipsmill.org/art/juried-art-show\" target=\"_blank\" rel=\"noopener noreferrer\">www.phillipsmill.org/art/juried-art-show</a>.</span></p>\n<p class=\"p3\"><span class=\"s2\">One of the most delightful events on the Phillips’ Mill calendar this summer is the return of the annual fundraiser for the preservation of the historic 18th-century Phillips’ Mill itself. The Summer Fete is being billed as “A Brilliantly British Evening Along the Primrose Creek” and will be held on Saturday, August 19 at 5:30 PM. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">A spectacular evening is planned, with specialty cocktails and assorted canapés, a superb sit-down dinner by Catering by Design, fine wines, and beer. The event will honor longtime supporters Kathy and Ted Fernberger and feature a Rubber Ducky Regatta and jolly singing by the Gilbert &amp; Sullivan Society of Bucks County. Tickets are available online at $160 per person. Additional “Patron” level donations go directly to the PMCA Preservation Fund. Visit <a href=\"http://www.phillipsmill.org/event/2023-summer-fete\" target=\"_blank\" rel=\"noopener noreferrer\">www.phillipsmill.org/event/2023-summer-fete</a>.</span></p>\n<p class=\"p3\"><span class=\"s2\">Submissions for Phillips’ Mill’s 6th Annual Emerging Playwright Competition runs through August 27. The juried one-act playwriting competition encourages writers from a 100-mile radius of Phillips’ Mill to put forward original scripts for a chance to see their work performed before a live audience.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">The first 50 scripts submitted will be considered for the competition and evaluated by a distinguished panel of judges.<span class=\"Apple-converted-space\">  </span>As many as six winners will be selected to have a staged reading of their work on the Mill’s time-honored stage on Saturday, November 19.<span class=\"Apple-converted-space\">  </span>Each play selected for staging will also receive a $100 cash prize. The competition encourages innovative, original work to be brought to the stage continuing a long Phillips’ Mill drama tradition. The prospectus and all entry details can be found online at <a href=\"https://www.phillipsmill.org/drama/emerging-playwright-competition-prospectus\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.phillipsmill.org/drama/emerging-playwright-competition-prospectus</a>. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Founded in 1929 by William Lathrop as a meeting place for artists, the Phillips’ Mill Community Association is located just north of New Hope at 2619 River Road in New Hope. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Its distinguished history as the birthplace of Pennsylvania Impressionism, and its mix of traditional as well as innovative programs, continue to enrich artists throughout the community. Discover all the exciting and enlightening PMCA programs at <a href=\"http://www.phillipsmill.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.phillipsmill.org</a>.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/08/The-Phillips-Mill-Party-Cat_Pam-Miller.jpeg"
}