{
  "id": 19415,
  "title": "Autism Acceptance Month: Rachel Fischer",
  "slug": "autism-acceptance-month-rachel-fischer",
  "date": "2024-04-22T05:15:49",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "Autism Acceptance Month",
    "doylestown cardinal",
    "Rachel Fischer"
  ],
  "excerpt": "<p>By Jessica Ramoy • The Cardinal Executive Editor For National Autism Acceptance Month, we had the pleasure of speaking with Rachel Fischer, educator, advocate, and autism momma. Drawing from her personal journey and her background in education, she has created a platform to offer tips and resources to the parents and caregivers of the neurodivergent [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Jessica Ramoy • </b>The Cardinal Executive Editor</p>\n<p class=\"p3\"><b><i>F</i></b><b><i>or National Autism Acceptance Month, we had the pleasure of speaking with Rachel Fischer, educator, advocate, and autism momma. Drawing from her personal journey and her background in education, she has created a platform to offer tips and resources to the parents and caregivers of the neurodivergent community. Let’s dive in!<span class=\"Apple-converted-space\"> </span></i></b></p>\n<p class=\"p6\"><b>Tell us about your personal experience obtaining the initial Autism diagnosis for your son and what therapies and services you have been using since?</b></p>\n<p class=\"p6\">My son was diagnosed with Autism at 3 and half years old. There were many factors that unfortunately worked against us during that time. The pediatrician we were seeing at the time had stated on multiple occasions that the concerns me and my husband had were not valid and it was most likely our parenting that was the cause of the behaviors we were noticing. We were also requesting the evaluation process during the pandemic, so lockdown was also an excuse thrown out for why behaviors were occurring in our son. Sadly, most parents hear this at one time or another during the evaluation process. We did not give up and were eventually able to speak with the Lenape Valley Foundation for early intervention, which changed our lives.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p6\">From there, we were able to get on a wait list with CHOP for an evaluation. After receiving an Autism diagnosis, our son received Occupational Therapy and ABA (Applied Behavior Analysis) Therapy, as well as services through the Bucks County IU throughout preschool. I feel beyond thankful for all of the therapists that have worked with my son and continue to work with him. They have not only taught our son strategies for success in our world, but taught skills to my entire family on how better to support him.</p>\n<p class=\"p6\"><b>What non-profits, services, and local businesses do you want parents and caregivers of the neurodivergent community to be aware of?</b></p>\n<p class=\"p6\">Our community is so rich in the opportunities and support in place for our neurodivergent community. It is a testament to all the families fighting for our children and creating safe spaces for them in our community, in hopes to educate and include. As a parent to younger children, one of our favorite places to enjoy as a family is <b>Helping Friendly Farm</b> in New Hope, PA. HFF is a sensory exploration farm with therapy animals, gardens, and an incredible sensory barn. The owner, Jessica Zander, has become a part of our family and truly values each person that comes to her farm. She has made sure that all abilities are welcome and feel valued, while having the opportunity to regulate in so many ways.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p6\">Some other local spots we love for their inclusion and message are <b>The Monkey’s Uncle</b> in Doylestown, <b>Bake Ability</b> in Buckingham, and <b>So Much to Give Inclusive Cafe</b> in Skippack, and <b>Wild Styles Hair Salon</b> in Warminster, and nonprofit The <b>Next Step Program (TNS)</b> in Doylestown. Different therapy locations that are neurodiversity affirming can be hard to find, and I encourage parents and caregivers to see what is a great fit for their loved one.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p6\">We are very thankful for the <b>Lenape Valley Foundation</b> in Doylestown, <b>Behavior Interventions, LLC</b> in Willow Grove and <b>Good Shepherd Penn Partners</b> in Chalfont. The individuals we have worked with through the years showed our son how valued he is and taught supports that encouraged him and did not try to “change” him.</p>\n<p class=\"p6\"><span class=\"s1\"><b>What do you wish all students and community members knew about autism?</b></span></p>\n<p class=\"p6\">I truly wish that the societal stigmas related to Autism could be removed. I know that is a very large hope, but Autism is not something to fear. Autism is not something to be cured. Autism touches so many of our lives, through our own diagnosis, or that of our children, cousins, friends,etc.. It is something to be educated on. The earlier we start explaining that Autism is a part of our community, and ways to understand it, the better off we will be as a community.</p>\n<p class=\"p6\"><b>What more can be done in our community? By local government, local businesses, and health practitioners? </b></p>\n<p class=\"p6\">I think it is important to note that making an environment inclusive does not have to be difficult. I encourage businesses and community leaders to reach out to those with Autism, or parents/caregivers, in their community to help them create more inclusive environments. It’s important that more voices from the Autism community are heard. For example, putting communication boards in our playgrounds would be a great way for non-speaking individuals to feel supported in communicating their needs with those around them, and facilitate new relationships. If the borough ever wants to chat, I’m always around!</p>\n<p class=\"p6\"><b>On your Instagram page, you say, “Neurodiversity is BEAUTFIUL! So let’s embrace it as we travel the world!” What advice would you give families who may feel overwhelmed by the thought of travel.</b></p>\n<p class=\"p6\">There’s a huge fear in traveling anywhere, but especially nerve wracking when you have a loved one with extra needs. There is a lot to consider, and each family has to do what they feel most comfortable with. We have been able to find a healthy medium of trying new places, with plenty of preparation, while also exploring local spots that are comfortable and safe.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p6\">Our son is also very vocal when he needs to stay home and when he is feeling more adventurous. We follow his lead! I encourage families to start small. Explore a new playground, park, or local business. Staying close to home allows you with the ability to get back to your loved one’s safe space quickly, but could also open doors to a new favorite spot! The traveling might be difficult, but the memories could make it all worthwhile!</p>\n<p class=\"p6\"><b>What are your ultimate goals and your vision for your son as he gets older?</b></p>\n<p class=\"p6\">The ultimate vision I have for my son is that when he is an adult, he has a community that supports who he is. My husband and I will not always be around, and community is what is going to help our children when they become adults. I want him to be surrounded by people who know his worth, encourage him in his interests, support him in his endeavors, value his perspective, and appreciate his pure heart. I truly can’t wait to see what he accomplishes because I know it’s going to be wonderful.</p>\n<p class=\"p6\"><b>Tell us more about your platform and support group.</b></p>\n<p class=\"p6\">I started a blog and Instagram called “The Most Au-Some Journey” to get the word out on local resources that are beneficial to neurodivergent families, as well as traveling tips I have learned along the way with my family. I felt like I was struggling in finding businesses that supported and employed those of all abilities, as well as locations and activities that would benefit my entire family. This was a way for me to educate others on these locations while also meeting incredible activists in my own community.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p6\">As an educator, I am always eager to learn about new things, and every person I have met in regard to the blog has taught me such invaluable viewpoints of inclusion in our community. The blog has also led to realizing the need for support groups in our community. I have also started a support group, along with a very dear friend and fellow autism mom, that is free for parents and caregivers of neurodivergent children in our community.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p6\">Our next meeting will be on Thursday, April 18th at Montgomery Square UMC in North Wales, PA from 6-8 PM. You can reach out to us at  buckscondfamilyconnections@gmail.com.<span class=\"Apple-converted-space\">  </span>Also, I am a certified Elementary K-6, Reading Specialist K-12, and Wilson Reading Instructor. I am available for tutoring in the area for any students needing assistance in these areas. I can be contacted at <a href=\"mailto:most.au.some.journey@gmail.com\">most.au.some.journey@gmail.com</a>.</p>\n<p class=\"p6\"><b>Are there any books you recommend?</b></p>\n<p class=\"p6\">Some of my favorites are: “A Day with No Words” by Tiffany Hammond, “Eddie the Elephant Has Something to Say” by Alison Johns, “He Meant You to be You” by J.J. LeVan, “My Brain is a Race Car” by Nell Harris, and “The Girl Who Thought in Pictures: The Story of Dr. Temple Grandin” by Julia Finley Mosca.</p>\n<p class=\"p7\"><b><i>Learn more and<span class=\"Apple-converted-space\">  </span></i></b><b><i>follow Rachel’s<span class=\"Apple-converted-space\">  </span></i></b><b><i>journey on her Instagram<span class=\"Apple-converted-space\">  </span></i></b><b><i>@most.au.some.journey</i></b></p>\n<p class=\"p7\"><a href=\"mailto:Most.au.some.journey@gmail.com\"><b><i>Most.au.some.journey@gmail.com</i></b></a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/04/PXL_20230415_184712586.PORTRAIT.jpeg"
}