{
  "id": 14846,
  "title": "Bagel Barrel Celebrates Its Favorite 94 Year Old!",
  "slug": "bagel-barrel-celebrates-its-favorite-94-year-old",
  "date": "2022-09-12T23:29:58",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "art lorentz",
    "bagel barrel",
    "doylestown cardinal. danielle gannon"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer The morning of Friday, August 12, I walked into The Bagel Barrel in the heart of Doylestown with one mission in mind &#8211; to meet Art Lorentz.  Art, joined by his wife Carol and some friends, was celebrating his 94th birthday that morning. At no surprise to [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Danielle Gannon • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">T</span><span class=\"s3\">he morning of Friday, August 12, I walked into The Bagel Barrel in the heart of Doylestown with one mission in mind &#8211; to meet Art Lorentz. </span></p>\n<p class=\"p5\"><span class=\"s3\">Art, joined by his wife Carol and some friends, was celebrating his 94th birthday that morning. At no surprise to anyone, he chose the Bagel Barrel to mark the occasion. After all, he’s come to the shop everyday for breakfast for the last 29 years. </span></p>\n<p class=\"p5\"><span class=\"s3\">When I got there that Friday morning, the place was packed. A line for freshly baked bagels serpentined out the door onto State Street. Customers line up here daily to get a taste of the authentic NY style bagels that only come from Patrick Murphy, the owner. Despite the crowds, a special table with a birthday cake and candles and balloons awaited in the corner. Shortly thereafter, Art walked in, with his cap and vest on. The entire establishment greeted the birthday man with delight.</span></p>\n<p class=\"p5\"><span class=\"s3\">While he sat down to eat his bacon, egg, and cheese on an everything bagel, I got to talk to Patrick. Curiosity spiked in me, as I could tell this was more than just a “bagel shop.” This was &#8211; as customers confirmed for me &#8211; the local “Cheers.”</span></p>\n<p class=\"p5\"><span class=\"s3\">I asked Patrick about his initial interest in opening a bagel shop. He told me about the time he walked into the Princeton Bagel shop for a bagel and before he knew it, he was the Assistant Manager, turning a real profit for the owners.</span></p>\n<figure id=\"attachment_14848\" aria-describedby=\"caption-attachment-14848\" style=\"width: 523px\" class=\"wp-caption alignleft\"><a href=\"https://doylestowncardinal.com/wp-content/uploads/2022/09/art.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\" wp-image-14848\" src=\"https://doylestowncardinal.com/wp-content/uploads/2022/09/art.jpg\" alt=\"\" width=\"523\" height=\"697\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2022/09/art.jpg 1536w, https://doylestowncardinal.com/wp-content/uploads/2022/09/art-225x300.jpg 225w, https://doylestowncardinal.com/wp-content/uploads/2022/09/art-768x1024.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2022/09/art-990x1320.jpg 990w, https://doylestowncardinal.com/wp-content/uploads/2022/09/art-1320x1760.jpg 1320w\" sizes=\"auto, (max-width: 523px) 100vw, 523px\" /></a><figcaption id=\"caption-attachment-14848\" class=\"wp-caption-text\">Art Lorentz</figcaption></figure>\n<p class=\"p5\"><span class=\"s3\">He was thrown into the bagel world, and learned the ropes quickly from a 6th generation bagel maker with family roots in NYC. Back in the 1930s and 1940s, there was a Bagel Union and during the Great Depression, this was one of the strongest businesses around. One can find some fascinating information online about the Mafia and the Bagel Union. I hadn’t realized there was such a strong hold on this dense bread roll with a hole in the middle. After a few years working here, Patrick decided to bring bagels to Doylestown. In 1993, he moved into the State Street location and the rest is history.</span></p>\n<p class=\"p5\"><span class=\"s4\">“Our bagels have a crust to them, yet are soft on the inside,” Murphy said. This doesn’t happen by chance as there is no reinventing the wheel when it comes to Murphy’s creations. “Our bagels are boiled and baked the old fashioned way,” he adds. The dough sits for 12 hours, then goes through a barrel mixer. The mixer works the dough slowly and steadily. It is an old recipe and a decades-old process. And it’s not one to mess with. Murphy attributes his success to the great crew he has working for him, some members of which have been with him for decades. </span></p>\n<p class=\"p5\"><span class=\"s3\">“I’ll do this for as long as I am able,” he said. “There is no other town like Doylestown. It’s a walking town and it has a true sense of community.”</span></p>\n<p class=\"p5\"><span class=\"s3\">When Art finished his breakfast and half of his cake, I joined him, his wife Carol, and his friends, Sandy, Joan, and Todd. Art moved to Doylestown in 1953 and had four children. A salesman for Furman Lumber, he met his wife Carol and they married in 1983. Throughout his life he has enjoyed golfing, volunteering at the Doylestown Hospital, and was a great bowler. His daily routine looks like this: wake up, head to Bagel Barrel with Carol and meet their crew for breakfast, do some walking afterwards, head home for a light nap and wake up for lunch &#8211; ham and cheese to be exact. Then it’s time for a light rest, a stretching exercise routine for 20 minutes, then shower. He follows dinner with his all time favorite show, MASH and off to bed for another sunrise.</span></p>\n<p class=\"p5\"><span class=\"s3\">“Keep laughing and moving,” Art said about his secret to longevity. “Otherwise, it’s the kiss of death.” Art attributed Carol, his wife of 39 years, to his health and well being. “The most important part is that we have each other,” he said. During the pandemic, the couple came to Bagel Barrel every single day, to make sure Patrick would be able to stay open. His little breakfast bunch said, “Patrick helped us get through the pandemic, and we helped him.” </span></p>\n<p class=\"p5\"><span class=\"s3\">As patrons walked through the shop doors to order bagels, they showed a sense of admiration for Art. Everyone here knows him, because, well, he’s a staple here. He is an optimistic people-person and that’s evident. </span></p>\n<p class=\"p5\"><span class=\"s3\">This day was a very special day. Not only did I get to see the life and longevity of a very happy and healthy 94 year old, but I saw another great example of the true community that exists in this beautiful borough of Doylestown.</span></p>\n<p class=\"p5\"><span class=\"s3\">Happy Birthday, Art. May you live another 29 years eating bacon, egg, and cheese bagels. And Best wishes to you Patrick, as you embark on your 30th year in business, here in our great community. You are both shining examples of what it means to be good people.</span></p>\n<p class=\"p5\"><span class=\"s3\">You can visit the Bagel Barrel at 60 W State Street, Doylestown M-F 6am-2pm and Sat-Sun 7am-1pm.</span></p>\n<p class=\"p6\"><i>Danielle Gannon is a local Bucks County entrepreneur. Mom to three, she is an English teacher at RedBarn Homeschool (a local co-op she co-founded), co-owner of Organnons Natural Market and Founder &amp; Managing Director of Local Spotlight with Danielle. Her passion is connecting people and creating community. Residing in Ivyland, writing has always been a passion of hers. Find her on IG @localspotlightwithdanielle</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/09/breakfastbunch-e1663039719805.jpg"
}