{
  "id": 19364,
  "title": "Bucks County Symphony Orchestra Announces Its Spring Concert",
  "slug": "bucks-county-symphony-orchestra-announces-its-spring-concert-2",
  "date": "2024-04-15T23:26:37",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "Elizabeth Pitcairn",
    "Maestro José Luis Domínguez",
    "The Bucks County Symphony Orchestra"
  ],
  "excerpt": "<p>The Bucks County Symphony Orchestra announces its Spring Concert on Saturday, April 27 at 8:00 p.m. at Central Bucks High School South in Warrington.  This special evening of great music celebrates the 70th anniversary of the BCSO’s inaugural concert in 1954. Maestro José Luis Domínguez and the BCSO welcome violin virtuoso Elizabeth Pitcairn, who joins [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">T</span><span class=\"s2\">he Bucks County Symphony Orchestra announces its Spring Concert on Saturday, April 27 at 8:00 p.m. at Central Bucks High School South in Warrington.<span class=\"Apple-converted-space\">  </span>This special evening of great music celebrates the 70th anniversary of the BCSO’s inaugural concert in 1954.</span></p>\n<p class=\"p3\"><span class=\"s3\">Maestro José Luis Domínguez and the BCSO welcome violin virtuoso Elizabeth Pitcairn, who joins the orchestra in a performance of Johannes Brahms’ justly famous Violin Concerto in D.<span class=\"Apple-converted-space\">  </span>A native of Bucks County, Ms. Pitcairn has earned a stunning reputation as one of America’s most beloved soloists. She has appeared with numerous prestigious orchestras at the Academy of Music and Kimmel Center in Philadelphia, and at Carnegie Hall, Walt Disney Concert Hall, and the Saratoga Performing Arts Center.<span class=\"Apple-converted-space\">  </span>She performs with one of the world’s most legendary instruments, the “Red Mendelssohn” Stradivarius of 1720, said to have inspired the Academy Award–winning film The Red Violin. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s3\">The BCSO completes the festive evening with Ludwig van Beethoven’s Fifth Symphony, arguably the most famous orchestral work in the classical repertoire.<span class=\"Apple-converted-space\">  </span>First performed in Vienna in 1808, the Fifth has become one of the cornerstones of symphonic music.<span class=\"Apple-converted-space\">  </span>Deriving its distinctive power from an intense and ever-present rhythmic drive, the symphony moves from a sense of tragedy to one of ultimate triumph, a worthy exemplar of the emerging Romantic Era.</span></p>\n<p class=\"p3\"><span class=\"s3\">Tickets are $25 for adults, $20 for seniors, and free for students.<span class=\"Apple-converted-space\">  </span>Reserve online at <a href=\"http://BucksCountySymphony.org\" target=\"_blank\" rel=\"noopener noreferrer\">BucksCountySymphony.org</a> to guarantee admission.<span class=\"Apple-converted-space\">  </span>Visit the website for more information.<span class=\"Apple-converted-space\">  </span>  </span></p>\n<p class=\"p4\"><strong><span class=\"s4\">About the Bucks County Symphony Orchestra <span class=\"Apple-converted-space\"> </span></span></strong></p>\n<p class=\"p3\"><span class=\"s3\">For 70 years, the Bucks County Symphony Orchestra has enriched the community with performances of classical music in local venues at affordable ticket prices. Its board members and the majority of its musicians are volunteers committed to enriching the musical arts in Bucks County and the surrounding communities. The Bucks County Symphony Orchestra continues to carry forth the mission of its founders: sharing the joy of symphonic music through live performance and educational outreach.</span></p>\n<p class=\"p3\"><span class=\"s3\">To learn more about Bucks County Symphony Orchestra visit <a href=\"http://BucksCountySymphony.org\" target=\"_blank\" rel=\"noopener noreferrer\">BucksCountySymphony.org</a>.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/04/Elizabeth-Pitcairn.jpeg"
}