{
  "id": 11239,
  "title": "‘Bucks County Classic’ 2021 Set for September 12",
  "slug": "bucks-county-classic-2021-set-for-september-12",
  "date": "2021-08-22T15:10:35",
  "author": "Staff",
  "category": [
    "Fit",
    "Play"
  ],
  "tags": [
    "Bucks County Classic 2021",
    "Doylestown Arts Festival",
    "doylestown cardinal"
  ],
  "excerpt": "<p>The Bucks County Classic, a 1.4-mile bicycle race course with 90-feet of climbing each lap, will again streak through downtown Doylestown. The September 12 live event is highly anticipated after the 2020 edition was held virtually.  The race is part of a weekend of activity in Doylestown. In their quest for victory, competitors cycle around [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">T</span><span class=\"s2\">he Bucks County Classic, a 1.4-mile bicycle race course with 90-feet of climbing each lap, will again streak through downtown Doylestown. The September 12 live event is highly anticipated after the 2020 edition was held virtually.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s3\">The race is part of a weekend of activity in Doylestown. In their quest for victory, competitors cycle around the footprint of the Doylestown Arts Festival. The festival — also returning for 2021 — traditionally features nearly 200 juried artists, family activities, demonstrations, music from multiple stages, and an abundance of refreshments.</span></p>\n<p class=\"p3\"><span class=\"s2\">Organizers still seek potential business sponsors. </span><span class=\"s3\">Returning and new area business donors have committed support to this year’s event, but funds are still needed to close the gap. Race organizers have set up a GoFundMe, and Fred Beans Automotive Group has pledged to match up to $10,000 in donations made.</span></p>\n<p class=\"p3\"><span class=\"s3\">“We have long relied on area businesses to make the Bucks County Classic a success, but we realize not every business is in the same position to donate coming out of the COVID-19 pandemic,” said Bucks County Classic Director Laura Reppert. “With Fred Beans stepping up to offer this $10,000 donation match, we feel we can reach our fundraising goal by encouraging both businesses and community members to give what they can on our GoFundMe page. We thank Fred Beans for generously helping us get to our own finish line in terms of fundraising, enabling us to put on another great event for the community.”</span></p>\n<p class=\"p3\"><span class=\"s3\">This year will mark the 17th Bucks County Classic, which has grown over the years to become the biggest weekend in Bucks County. As the premier cycling event in Southeastern Pennsylvania, both professional and amateur racers compete in their respective events, and a citizen’s ride and kids’ races help build a love of cycling. Making the event even more inclusive, the race course winds around the always popular Doylestown Arts Festival.</span></p>\n<p class=\"p3\"><span class=\"s3\">“The Bucks County Classic is a highly anticipated event each year that unites our community and highlights so many things that make Doylestown a special place, including its rich art scene and cycling friendly streets,” said Fred Beans Automotive Group Vice President Beth Beans Gilbert. “We are proud to operate much of our business here in Doylestown and have made it a priority at Fred Beans to give back in ways that help maintain the town’s strengths and vibrancy. We are happy to play a larger role this year to support the return of the Bucks County Classic after a brief hiatus due to the pandemic and welcome the support of other donors to make this the best year yet.”</span></p>\n<p class=\"p3\"><span class=\"s3\">Learn more about the upcoming cycling races and this free family event at <a href=\"http://www.buckscountyclassic.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.buckscountyclassic.com</a>. Also find the GoFundMe fundraising link on the @BucksCounty Classic Facebook page.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/08/Bucks-Classic-Boke-Race.jpg"
}