{
  "id": 17297,
  "title": "Bucks Beautiful Hosts 10th Spring Fling Gala April 21",
  "slug": "bucks-beautiful-hosts-10th-spring-fling-gala-april-21",
  "date": "2023-04-12T12:17:09",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Style",
    "Taste"
  ],
  "tags": [
    "Barley Sheaf Farm",
    "bucks beautiful",
    "doylestown cardinal"
  ],
  "excerpt": "<p>Bucks Beautiful is pleased to host the tenth annual Spring Fling Gala at the historic Inn at Barley Sheaf Farm on Friday April 21st, 2023 at 6:00 pm. Guests will enjoy dining in the country elegance of the 19th Century Stone Bank Barn, located at 5281 York Road in Holicong.   The enchanting evening will [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">B</span><span class=\"s1\">ucks Beautiful is pleased to host the tenth annual Spring Fling Gala at the historic Inn at Barley Sheaf Farm on Friday April 21st, 2023 at 6:00 pm. Guests will enjoy dining in the country elegance of the 19th Century Stone Bank Barn, located at 5281 York Road in Holicong. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">The enchanting evening will include a seated dinner, silent live auction, wine pull, raffle and live entertainment. Cocktail hour music will be performed by student musicians from the Central Bucks West High School Orchestra. The Master of Ceremonies and Disc Jockey will be Geoff Panettieri of Party Scene Events. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">In honor of our 10th anniversary celebration, we’re hosting a VIP pre-party at 5;00pm. This special early entry ticket features a welcome toast, distinctive hors d’oeuvres, cocktails plus a performance by local musician James Lauchmen on acoustic guitar.</span></p>\n<p class=\"p3\"><span class=\"s1\">Thanks to the generosity of Bucks County businesses, an impressive array of auction items offered this year include: paintings by famed local artists such as Dot Bunn and Sandy Askey-Adams; theater, symphony, museum and sports tickets; Dine Around Town packages; Spa and Skin Care baskets and several children’s admissions, just to name a few. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s1\">Please RSVP as soon as possible as seating is limited.<span class=\"Apple-converted-space\">  </span>Tickets can be purchased online at www.bucksbeautiful.org or by phone at 215-340-3639. To become an event sponsor or donate an auction item contact <a href=\"mailto:info@bucksbeautiful.org\">info@bucksbeautiful.org</a>.<span class=\"Apple-converted-space\">  </span>Thank you for helping us grow!</span></p>\n<p class=\"p3\"><span class=\"s2\">Bucks Beautiful is a 501(c)3 non-profit organization that beautifies Bucks County by coordinating gardening projects, reforestation efforts and educational programs in our community.<span class=\"Apple-converted-space\">  </span>We create partnerships with like-minded civic coalitions to develop attractive yet sustainable plantings to foster a healthier environment. Since 1991 we have worked to enhance the local landscape for residents and visitors alike by beautifying our towns, schools, parks, roadsides and pathways throughout Bucks County.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/Spring-Fling-Photo-1.jpg"
}