{
  "id": 19437,
  "title": "Bucks Culture Fest: Many Voices, One Community",
  "slug": "bucks-culture-fest-many-voices-one-community",
  "date": "2024-04-22T05:31:53",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Play",
    "Style",
    "Taste"
  ],
  "tags": [
    "Bucks County Community College",
    "Bucks Culture Fest",
    "doylestown cardinal",
    "Sheela Rai"
  ],
  "excerpt": "<p>By Sheela Rei • The Cardinal Contributing Writer On April 28, Bucks County will host its inaugural Bucks Culture Fest at the LInkz Pavillion outdoor quad of Bucks County Community College (BCCC). The free, family-friendly event will begin at 11 a.m., bringing to life the beautiful cultures found within our community.  Event organizer Angela Nutter [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Sheela Rei • </strong></em>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">O</span><span class=\"s1\">n April 28, Bucks County will host its inaugural Bucks Culture Fest at the LInkz Pavillion outdoor quad of Bucks County Community College (BCCC). The free, family-friendly event will begin at 11 a.m., bringing to life the beautiful cultures found within our community.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Event organizer Angela Nutter of Doylestown Juneteenth and the African Diaspora Collective in Bucks County has been working with Jean Dolan, Director of DEI and Community Engagement at BCCC, along with Desis of Doylestown to build this event from the ground up.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The theme: Many Voices, One Community. As Nutter explains, Bucks County is a large and diverse area. In her current position as a program coordinator for a local nonprofit, she has had face-to-face interactions with many different folks within our community. She conceptualized this event to highlight the range of diversity. In addition to the goal of ensuring all cultures get a sense of belonging, Nutter hopes to highlight the cultures of those folks who have been in this area for centuries, such as our native population. Nutter shared that the maternal side of her family has been part of this community from the start, as her family was deeded land from William Penn himself.</span></p>\n<p class=\"p5\"><span class=\"s1\">Nutter approached Dolan at the last Juneteenth celebration in Doylestown, asking to partner together for this event. Dolan shared that the event goes hand in hand with both the DEI (Diversity Equity Inclusion) mission and the mission of BCCC. Dolan was able to work with BCCC to provide the facilities, space, and staffing free of charge, making the event a possibility. Dolan shared that the BCCC Office of Admissions has been working alongside the BCCC DEI Programs department to bring this event to fruition.</span></p>\n<p class=\"p5\"><span class=\"s1\">Some event highlights include a short documentary from the Coalition of Natives and Allies, a free yoga session with a local non-profit, as well as an Indian dance group, the PKM Polish Folk Dance Ensemble, an Irish dance, and a Belly Dance performances. A performance by renowned Shalom Mukamuri, a Henna artist, several local food trucks, children’s entertainment, lawn games, and a marketplace hosting local vendors also shine as features. Helena Masiorski from Polish Living History Inc. will also have a display and some reenactments.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Additionally, a bluegrass group ShadowGrass has a ticketed concert that afternoon at 3 p.m. and is hosting a free bluegrass jam from 1-3 p.m. in the lobby. They invite folks to bring an instrument and jam with them. The performance center will feature a beer garden set up, providing additional refreshments for the event.</span></p>\n<p class=\"p5\"><span class=\"s1\">As Nutter and Dolan shared their planning of the event, as well as their vision for a community that embraces its many voices and cultures, I couldn’t help but feel proud to live in this beautiful community. The hard work members of this community put into events like these is what makes our community one of the best places to live. I hope to see many of our Cardinal readers and their families at this event.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/04/Bucks-Culture-Fest.jpg"
}