{
  "id": 12678,
  "title": "Caned Furniture Is Having a Moment! (Again)",
  "slug": "caned-furniture-is-having-a-moment-again",
  "date": "2022-04-08T12:01:29",
  "author": "Staff",
  "category": [
    "Style"
  ],
  "tags": [
    "caned furniture",
    "doylestown cardinal",
    "victoria guillot"
  ],
  "excerpt": "<p>By Victoria Guillot • The Cardinal Contributing Writer If you have looked at any furniture lately, chances are you’ve noticed that cane accents are suddenly everywhere. It’s one of the hottest trends of 2022. There are many good reasons to get on board with this trend. First, it has stood the test of time. I’m [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong><span class=\"s1\">By Victoria Guillot • </span></strong><span class=\"s1\">The Cardinal Contributing Writer</span></p>\n<p class=\"p3\"><span class=\"s3\">I</span><span class=\"s4\">f you have looked at any furniture lately, chances are you’ve noticed that cane accents are suddenly everywhere. It’s one of the hottest trends of 2022.</span></p>\n<p class=\"p5\"><span class=\"s4\">There are many good reasons to get on board with this trend. First, it has stood the test of time. I’m talking way back in time. Did you know that a cane bed was buried in Tutankhamun’s tomb in 1323 BC? It started appearing in England, France, and Holland in the late 1600s and became extremely popular in Victorian times. I read that Marie Antoinette did her daily hairstyling seated on a cane chair.</span></p>\n<p class=\"p5\"><span class=\"s2\">Second, cane is a sustainable resource. Cane comes from the bark of a vine in the palm family that grows very large. Harvesting the bark does not harm the trees.</span></p>\n<p class=\"p5\"><span class=\"s5\">Third, it’s practical. It became popular in hot, humid climates because the air can circulate through the caning, avoiding musty smells and keeping the occupant of a caned chair cooler. Caning also is easier to keep clean and free of moths and mites. It won’t warp or crack with heat and humidity. It’s lightweight too, so furniture is easy to move around.</span></p>\n<p class=\"p5\"><span class=\"s4\">I like caning because it gives such a visually light and airy effect to a space.</span></p>\n<p class=\"p6\"><strong>There are many fresh ways to use caned furniture in 2022  </strong></p>\n<p class=\"p5\"><span class=\"s4\">We are seeing expanded applications for caning. Where caning used to be seen on seating pieces, today we also see it on cabinets and bed frames. It looks great with the pale, natural wood that’s trending now. It also looks new and fresh with ebony-stained or gray wood. Seats often combine upholstery, caning, and wood for some beautiful contemporary silhouettes.</span></p>\n<p class=\"p6\"><strong>So how can you use caning to update your home?</strong></p>\n<p class=\"p5\"><span class=\"s2\">Add a caned accent chair in your living room to lighten the mood. Try a new cabinet or armoire with caned doors or drawers for a textural accent. Consider a caned headboard, especially if your bed needs to be in front of a window because the light will come through the caning. Try a cane-back desk chair. What about a caned decorator screen to fill an empty corner or conceal something unsightly. Have you checked out caned lampshades? Caning is fantastic on media cabinets to hide clutter. If you’re a DIY type, you can buy sheets of caning and apply them to doors or drawers to upcycle an old piece. You can even use framed cane panels as wall paneling.</span></p>\n<p class=\"p6\"><strong>You can shop the looks.</strong></p>\n<p class=\"p5\"><span class=\"s4\">This month I’ve curated a collection of the caned items shown plus lots more, granting you special designer trade access. Get best internet pricing by using the shopping links at <a href=\"https://stagecoachservices.com/home-shop\" target=\"_blank\" rel=\"noopener noreferrer\">https://stagecoachservices.com/home-shop</a>. (If you purchase through this link, I will receive a commission at no additional cost to you.)</span></p>\n<p class=\"p8\"><span class=\"s1\"><i>Victoria Guillot is a home stager/interior designer of 15 years based in Buckingham/Doylestown. A 6-time Best of Houzz winner, she has been featured on a 26-episode radio series and is the author of a book of tips on home staging. If you want more trade access or would enjoy her decorating or staging assistance, you can find her at <a href=\"http://stagecoachservices.com\" target=\"_blank\" rel=\"noopener noreferrer\">stagecoachservices.com</a>.</i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/04/caned-furniture.jpg"
}