{
  "id": 11967,
  "title": "CB CARES: Providing Resources for Parents, Educators, and Community Members",
  "slug": "cb-cares-providing-resources-for-parents-educators-and-community-members",
  "date": "2022-01-11T11:44:21",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "CB CARES",
    "doylestown cardinal",
    "Dr. N Robert Laws",
    "Jim Brexler",
    "Kimberly Cambra",
    "Richard Reif"
  ],
  "excerpt": "<p>By Dakota Latorre • The Cardinal Contributing Writer I have met several families that have moved here from different towns and even states specifically to send their kids to the renowned Central Bucks School District.  Every Zillow and Realtor listing in this region boasts its “Award Winning” school district. The fact that we have a [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Dakota Latorre • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">I </span><span class=\"s2\">have met several families that have moved here from different towns and even states specifically to send their kids to the renowned Central Bucks School District.<span class=\"Apple-converted-space\">  </span>Every Zillow and Realtor listing in this region boasts its “Award Winning” school district. The fact that we have a great public school system is no secret, but we have something else that makes this school district stand out from all the other highly rated school districts in this state.<span class=\"Apple-converted-space\">  </span>We have CB Cares!</span></p>\n<p class=\"p4\"><b>What is CB Cares?</b></p>\n<p class=\"p4\">CB Cares is a non-profit education foundation that is dedicated to supporting the social, emotional and mental development of students and their families. <span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\"><b><span class=\"Apple-converted-space\"> </span>How do they do this you might be asking…</b></p>\n<p class=\"p4\">• Recognizes ‘good students making great choices’ with its Boomerang Youth Recognition Award.</p>\n<p class=\"p4\">• Offers that sense of community many teens may feel is lacking in their lives through the Backpack Newsletter updating them on positive student news and upcoming events.</p>\n<p class=\"p4\"><span class=\"s4\">• Provides necessary financial support to teachers with great ideas with its Innovative learning Grants.  </span></p>\n<p class=\"p4\"><span class=\"s4\">• Offers volunteer opportunities for students through CB Cares Volunteer Teens to interact with community leaders and businesses.  </span></p>\n<p class=\"p4\"><span class=\"s4\">• Offers acknowledgement and encouragement to parents who are all doing their best, but need some guidance and expert advice sometimes with its Parent Positive Speaker Series</span></p>\n<p class=\"p4\"><span class=\"s4\">• Provides recognition to coach and teachers that put in the extra effort to transform their students’ lives through the Positive Coaching Award </span></p>\n<p class=\"p4\"><span class=\"s4\">• Hosts the longest running MLK Day of Service outside the Philadelphia region. January 17th will mark CB Cares’ 19th Annual MLK Day Opening Ceremony</span></p>\n<p class=\"p4\"><span class=\"s5\">• Provided a safe place to go after school by building a skate park at the local YMCA </span></p>\n<p class=\"p4\"><span class=\"s4\">• And much more!!! </span></p>\n<p class=\"p4\"><span class=\"s4\"><b>CB Cares History</b></span></p>\n<p class=\"p4\"><span class=\"s4\">CB Cares was started in the early 1990s by Richard Reif, the former CEO of Doylestown Hospital, and Dr. N Robert Laws, former Central Bucks School District Superintendent. They’re focus during that time was on teenagers, and they saw a need to promote overall health and to raise the quality of life in the community. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">Dr. N Roberts Laws, parent himself, knew that the community needed to support and engage the youth of the community in healthy ways to show our young people they were valued as community members. This concept has now expanded and aims to support all children in elementary to high school.<span class=\"Apple-converted-space\">  </span>It currently serves the whole Central Bucks School District, which includes 23 schools, almost 20,000 students, and 37,800 families.</span></p>\n<p class=\"p4\"><span class=\"s4\"><b>Framework</b></span></p>\n<p class=\"p4\"><span class=\"s4\">CB Cares first initiative was the 40 Assets which was created as a “how to” model to create responsible and resilient young. To achieve this goal, CB Cares Educational Foundation used the Search Institute’s Developmental Assets®. (Search Institute is an independent nonprofit organization whose mission is to provide leadership, knowledge, and resources to promote healthy children, youth, and communities). <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">These assets focus on solutions rather than problems and are powerful predictors of behavior and have built in resiliency factors that help youth to cope with and avoid difficult situations.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">They include external values such as support, empowerment, boundaries and expectations, and constructive use of time.<span class=\"Apple-converted-space\">  </span>They also focus on internal assets such as commitment to learning, positive values, social competencies and positive ideas.<span class=\"Apple-converted-space\">  </span>This is still the bedrock of all CB Cares initiatives 25 years later. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\"><b>Transitioning…</b></span></p>\n<p class=\"p4\"><span class=\"s4\">Although the framework and mission of CB Cares were solid and earned the support of the community, it truly transformed when Kimberly Cambra was hired at the executive director (selected from over 30 candidates!) in 2005. Kimberly, with a background in culinary arts, marketing and business, used her skillsets to create annual fundraiser events that could really make a difference in the students’ lives.<span class=\"Apple-converted-space\">  </span>Under her leadership, CB Cares has raised over $850,000 through special events and fundraising. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\"><b>Accomplishments</b></span></p>\n<p class=\"p4\">With the help of their partners, Doylestown Health and the Central Bucks School district, CB Cares has impacted thousands of students and awarded more than $75,000 in scholarships, received more than 10,000 Boomerang nominations, awarded more than $175,000 in Innovative Learning Grants and students have volunteered over 8,000 hours! CB Cares emphasizes working together with the community and always asks the questions “how can we make it better together”.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\"><span class=\"s4\">The organization is also supported with additional financial support through Educational Improvement Tax Credit (EITC) and those businesses include Fred Beans Family of Dealerships, Hatboro Federal, Univest Bank, People’s Security Bank &amp; Trust and Weist Market. Doylestown Health and the Village Improvement Association have been long standing supporters in many healthy ways. </span></p>\n<p class=\"p4\"><span class=\"s4\"><b>25th Anniversary Reflections and Future Goals</b></span></p>\n<p class=\"p4\"><span class=\"s4\">2022 is their 25th anniversary celebration. Currently, they reflect on all their past accomplishments and their ever-growing list of goals and vision for the future.<span class=\"Apple-converted-space\">  </span>Kimberly explains the vision and goals are to uphold and ensure the organization remains dedicated to enriching the experience and education of students through innovative learning grants and Developmental Assets-based programs that promote responsible and resilient youth.    </span></p>\n<p class=\"p4\"><span class=\"s4\"><b>Jim Brexler, Doylestown Health President and CEO </b></span></p>\n<p class=\"p4\">“Doylestown Health is a proud partner of the CB Cares Educational Foundation. We have been closely involved with CB Cares since its founding nearly 25 years ago. Doylestown Health stands with CB Cares on its many initiatives and programs to create resilient youth in our community.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p4\">As an independent, community-focused health system, Doylestown Health endorses the mission of CB Cares as it aligns with our own mission to continuously strive to improve the quality of life and proactively advocate for the health and well-being of all members of our community.”</p>\n<p class=\"p6\"><b>For more info visit </b><a href=\"https://cb-cares.org\"><b>https://cb-cares.org</b></a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/01/CB-Cares.jpg"
}