{
  "id": 11921,
  "title": "Don’t Begin the New Year with a Mountain of Debt",
  "slug": "dont-begin-the-new-year-with-a-mountain-of-debt",
  "date": "2021-12-01T13:47:33",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "brian pultro",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Brian Pultro, AIF, BFA, RFC® • The Cardinal Contributing Writer It’s that time of year again. Candy canes, holiday parties, ugly sweaters, and credit card debt. While overindulgence is a part of society around the holidays, overindulging in swiping that plastic can be surprisingly easy to avoid if you make a few tweaks to [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Brian Pultro, AIF, BFA, RFC® • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">I</span><span class=\"s3\">t’s that time of year again. Candy canes, holiday parties, ugly sweaters, and credit card debt. While overindulgence is a part of society around the holidays, overindulging in swiping that plastic can be surprisingly easy to avoid if you make a few tweaks to your Holiday shopping routine.</span></p>\n<p class=\"p5\"><span class=\"s3\">Here are a few pointers for you to de-stress, and give gifts that folks will cherish for years to come.</span></p>\n<p class=\"p5\"><strong><span class=\"s4\">1. Make a budget</span></strong><span class=\"s3\"> – Wow, could this be more cliché? Every year we are told to make a budget…soooo not original. But wait, have you actually sat down and calculated how much you plan to spend on each individual person this holiday season? Seriously? Doing so can be eye opening.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Once you factor in buying something for Aunt Mildred, bringing a bottle of wine to that Holiday party, getting that pencil sharpener for your kids 4th grade teacher, and all of the other purchases, the number can be shocking.</span></p>\n<p class=\"p5\"><strong><span class=\"s4\">2. Pretend like you are Tony Soprano </span></strong><span class=\"s3\">– What I mean by that is, put cash in envelopes. Seriously, once you make your budget, start writing out envelopes with the names of everyone you need to buy for. Then, put the exact amount of cash in there that you plan to spend on that person.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The physical act of handing someone cash represents a loss. Humans feel loss twice as much as they feel gain. When you swipe your credit card you don’t feel the same sense of separation with your hard-earned money as you do when handing someone cash.</span></p>\n<p class=\"p5\"><strong><span class=\"s4\">3. Channel your inner 5-year-old </span></strong><span class=\"s3\">– There is a scene at the end of the film “Inception” where a grown man opens his dying father’s vault expecting to reveal the thing his father cherishes the most in life…. business documents. Instead, he finds a pinwheel he made for his father when he was 5, along with a photo of them together in a pool.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">No one is going to remember that ($1,000) iPhone you bought for them twenty years from now. But, they will remember an extraordinarily thoughtful and sentimental gift you made for them. These gifts not only tug at our heartstrings for years, but they are low cost. I am willing to bet that the things you still pull out of dust covered boxes every now and then, aren’t made with microchips, but are made with love.</span></p>\n<p class=\"p5\"><strong><span class=\"s4\">4. Clean your ears </span></strong><span class=\"s3\">&#8211;<span class=\"Apple-converted-space\">  </span>Yes, you heard me! If we just take the time to listen and observe when our loved ones talk, we can glean a lot about what they might love instead of asking for an Amazon shopping list. Simple things like, “I have been meaning to get this picture framed for years” or “I really want to try this new restaurant” can be gold when figuring out what to get folks this holiday. Plus, the things folks mention off-hand typically cost a lot less than other items we might be thinking of.</span></p>\n<p class=\"p5\"><strong><span class=\"s5\">5. Finish strong</span></strong><span class=\"s6\"> – If you can make a budget, use cash, conjure up a gift with meaning, and listen carefully, you will be well on your way to winning this holiday season. Not only will your loved ones shed a tear at the thoughtfulness of your gift, but you can cry tears of joy into your champagne on New Year’s Eve knowing you are starting 2022 without a Mount Everest of credit card debt.</span></p>\n<p class=\"p7\"><span class=\"s7\"><i>Brian Pultro is a Doylestown native, Navy Veteran, and local Financial Advisor. His practice is built upon the foundations of “Behavioral Finance” and training individuals and families on how to take natural human emotions out of the investment process.</i></span></p>\n<p class=\"p8\"><b>Pultro Financial Management</b></p>\n<p class=\"p8\"><b>(215) 489-3876 • <a href=\"mailto:brian.pultro@LPL.com\">brian.pultro@LPL.com</a></b></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/12/Christmas-Money.jpg"
}