{
  "id": 11506,
  "title": "Doylestown Historical Society: Outdoor Tours- Walking &#8211; Driving – Biking Options!",
  "slug": "doylestown-historical-society-outdoor-tours-walking-driving-biking-options",
  "date": "2021-10-13T04:06:03",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Fit",
    "Play"
  ],
  "tags": [
    "doylestown cardinal",
    "Doylestown Historical Society",
    "The Francis B. Shaw Historic District"
  ],
  "excerpt": "<p>Haunted Doylestown Tour  Fall is the time to open your mind! Hear the stories of hauntings, communications from former souls of past times, and confused spirits. Unravel the legends and the true history of the town with this fun and interesting tour of Haunted Doylestown! This very popular tour requires reservations.   Call to reserve [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>Haunted Doylestown Tour<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s1\">Fall is the time to open your mind! Hear the stories of hauntings, communications from former souls of past times, and confused spirits. Unravel the legends and the true history of the town with this fun and interesting tour of Haunted Doylestown! This very popular tour requires reservations. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">Call to reserve your space.<span class=\"Apple-converted-space\">  </span>Tour walk-ins taken only if there are slots remaining.</span></p>\n<p class=\"p2\"><span class=\"s1\">6:30 P.M.<span class=\"Apple-converted-space\">  </span>October 1, 8, 22 &amp; 23</span></p>\n<p class=\"p1\"><strong>Old Courthouse Row Walking Tour</strong></p>\n<p class=\"p2\"><span class=\"s1\">This walking tour will trace the history of past Doylestown’s courthouses since the advent of Doylestown as the County Seat. Your tour guide will include an architectural interpretation of the distinctive styles of Lawyer’s Row, and insight into the rich history of Bucks County Government.</span></p>\n<p class=\"p2\"><span class=\"s1\">This tour will begin near the Civil War monument on Court Street. Call to arrange your tour time.</span></p>\n<p class=\"p1\"><strong>The Francis B. Shaw Historic District Walking Tour</strong></p>\n<p class=\"p2\"><span class=\"s1\">This new tour explores little known information on the emergence of the Doylestown Railroad Station that changed the history of the region, and a catastrophic fire that threatened to reverse the progress of a town. You will see examples of post-revolutionary expansion of commercial and residential buildings, and learn about the global impact of a nationally known agricultural manufacturing company and how it became the Doylestown Agricultural Works that we recognize today. Call to arrange your tour time.</span></p>\n<p class=\"p1\"><strong>Historic Doylestown Tour</strong></p>\n<p class=\"p2\"><span class=\"s1\">Join us for a walking tour through the streets of historic Doylestown tracing the history of many of downtown’s finest buildings – many of which have been cited as historic by the Borough’s Historic Board and the Historic Conservancy. Call to arrange your tour time.</span></p>\n<p class=\"p1\"><strong>Personages and Events of Historic Doylestown</strong></p>\n<p class=\"p2\"><span class=\"s1\">Join us for a walking tour highlighting unique people and history-changing information and events connected to Doylestown. Call to arrange your tour time.</span></p>\n<p class=\"p1\"><strong>An Architectural View of Doylestown</strong></p>\n<p class=\"p2\"><span class=\"s1\">Explore the elements of architecture in Doylestown as it connects to town commerce, history, and growth. View the town through the eyes of an architectural interpreter and learn how to understand what each town communicates to the viewer. Call to arrange a tour time.</span></p>\n<p class=\"p1\"><strong>The Impact and Importance of Agriculture in Bucks County</strong></p>\n<p class=\"p2\"><span class=\"s1\">Bucks County is one of the three original counties created by colonial proprietor William Penn in 1682. Penn named the county after the county in which he lived in England, Buckinghamshire. He built a country estate, Pennsbury Manor, in Falls Township, Bucks County, on the Delaware River.</span></p>\n<p class=\"p2\"><span class=\"s1\">Penn saw the rich land as beneficial on many levels, with ports in nearby cities, and bisecting rivers. Waterways were the major highways of travel and commerce for the first 200 years of Bucks County growth, until railways became a strong contributor for increasing commerce and travel.</span></p>\n<p class=\"p2\"><span class=\"s1\">Enjoy exploring these historical and current sites in our region that include regional mills, homesteads, mansions, river vistas, hiking trails, and universities!</span></p>\n<p class=\"p1\"><strong>General Information About The Tours</strong></p>\n<p class=\"p2\"><span class=\"s1\">Please meet in the Magill Schoolhouse, 56 S. Main Street Doylestown, PA 18901. The walking tours last about one hour. Enjoy permanent and rotating exhibits while at the Schoolhouse! Download your driving or biking tour from our website!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">There is $10 donation per person. Ticket options are part of your membership benefits! Consider becoming a member!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><i>Reservations are required for all tours. Please call 215.345.9430 to set up your private-party tour if dates and times are not offered in the description. </i><a href=\"http://www.doylestownhistorical.org\" target=\"_blank\" rel=\"noopener noreferrer\"><span class=\"s1\">www.doylestownhistorical.org</span></a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/10/Park-view.jpg"
}