{
  "id": 14073,
  "title": "Doylestown Car Show Lives on as a Legacy of its Founder, Bruce Rutherford",
  "slug": "doylestown-car-show-lives-on-as-a-legacy-of-its-founder-bruce-rutherford",
  "date": "2022-07-13T15:01:55",
  "author": "Staff",
  "category": [
    "Play",
    "Style"
  ],
  "tags": [
    "Bruce Rutherford",
    "Doylestown At Dusk Car Show",
    "doylestown cardinal",
    "Helen Amelsberg",
    "Natalya Bucuy",
    "Rick Millham Jr."
  ],
  "excerpt": "<p>By Natalya Bucuy • The Cardinal Contributing Writer To inspire others by deeds of kindness is an act of true real-life magic. And as many friends and community members will attest, Bruce Rutherford, led a life full of such magic.  On July 16, from 5 pm to 10 pm the Doylestown At Dusk Car Show [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Natalya Bucuy • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">To inspire others by deeds of kindness is an act of true real-life magic. And as many friends and community members will attest, Bruce Rutherford, led a life full of such magic. </span></p>\n<p class=\"p4\"><span class=\"s2\">On July 16, from 5 pm to 10 pm the Doylestown At Dusk Car Show will once again attract thousands of visitors to Rutherford’s beloved hometown. In December 2020 Rutherford, a Doylestown native and a co-owner of Rutherford Camera Shop, suddenly passed away. The car show he founded more than a decade before lives on as his continuous legacy. </span></p>\n<p class=\"p4\"><span class=\"s2\">The annual event started as the Heart of Bucks Auto Show held at CB West High School. In 2011, Rutherford worked with the town administration and local businesses to bring the show into the heart of town. Ever since, every July, cars of all years, makes, and models line up the State, Court, and Main Streets in Doylestown for the free to the public family-friendly event. Vendors and bands provide food and entertainment. Organizers estimate that over 15,000 people come to town for the car show every year to see the collection of over 500 automobiles.  </span></p>\n<p class=\"p4\"><span class=\"s2\">“It’s a real gem of the community,” says Helen Amelsberg, this year’s Car Show Chair. “It brings the people together. We’re making memories for all the people of Doylestown. We’re bringing families out and that benefits all the shops and local businesses. There are opportunities to sponsor the show. And all the proceeds from the show go back to the community.”</span></p>\n<p class=\"p4\"><span class=\"s2\">Rutherford had a passion for cars, but more than that, he had a passion for helping those in need and bringing people closer to one another. The Rotary Club of Doylestown, of which he was a long-time member, manages the event. Various organizations including Doylestown Health, Bucks County Opportunity Council, and National Giving Alliance, among others, work with the club to allocate funds from the show to local community needs through scholarships, grants, and donations. </span></p>\n<p class=\"p4\"><span class=\"s2\">“Every year the show gets bigger and better,” Amelsberg says. “Bruce is very much alive and he’s very much with us as we put the show together. Everyone on the team is a volunteer. The show was created by Bruce. We miss him. He was an awesome guy; everyone loved him. Bruce did a lot of the work and so it’s been hard to replace him. But he assembled a team of people, and he was good at creating roles. It’s a huge event, but it’s a very small group of people who put it together.”</span></p>\n<p class=\"p4\"><span class=\"s2\">The registration for the show is open to any car owner who wants to participate. Rick Millham Jr., the Car Show Vice Chair, says that the open-to-all registration allows for great variety and brings in people and cars with impactful stories to tell. </span></p>\n<p class=\"p4\"><span class=\"s2\">“People who bring their cars share them with the people who want to see them,” Millham says. “Last year we had a guy named Henry Ford bring his Model T to the show. That is just one example that almost every car has a story the owner wants to tell.” </span></p>\n<p class=\"p4\"><span class=\"s2\">The judging of the show is mostly informal. At the end of the day, the organizers pick 40 top cars and eight special awards. The awards include Ladies Choice, Mayor’s Cup and others. And, of course, one lucky winner takes home the Bruce Rutherford Best-of-Show award. </span></p>\n<p class=\"p4\"><span class=\"s2\">“Whether you get an award or not, if you’re at the show, you have won,” Millham says. “We continue to honor Bruce by keeping his legacy alive.”</span></p>\n<p class=\"p4\"><span class=\"s2\">And Rutherford’s legacy is that of continuous inspiration. Julie Druzak, Rutherford’s close friend and a local business owner, remembers him by the endless amounts of joy and support he gave to the world. </span></p>\n<p class=\"p4\"><span class=\"s2\">“He gave me and so many others the priceless gift of friendship,” she says. “If I die and I am remembered the way Bruce is remembered, I did something right.” </span></p>\n<p class=\"p4\"><span class=\"s2\">For registration, sponsorship opportunities, parking and more information visit <a href=\"http://Doylestowncarshow.com\" target=\"_blank\" rel=\"noopener noreferrer\">Doylestowncarshow.com</a>.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/07/Bruce-has-the-Mic.jpg"
}