{
  "id": 17404,
  "title": "EN GARDE! A Taste of Bucks County Academy of Fencing",
  "slug": "en-garde-a-taste-of-bucks-county-academy-of-fencing",
  "date": "2023-04-15T15:54:47",
  "author": "Staff",
  "category": [
    "Fit",
    "Play"
  ],
  "tags": [
    "Bucks County Academy of Fencing",
    "doylestown cardinal",
    "Mark Holbrow"
  ],
  "excerpt": "<p>We’ve all done it. We’ve watched a swashbuckler film, then struck a fencing pose in the mirror and whispered, “En garde.” The opportunity to actually learn to fence is right around the corner at the Bucks County Academy of Fencing. The BCAF has two locations; one in Lambertville, N.J. and the other in Hatfield, PA. [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">W</span><span class=\"s2\">e’ve all done it. We’ve watched a swashbuckler film, then struck a fencing pose in the mirror and whispered, “En garde.”</span></p>\n<p class=\"p3\"><span class=\"s2\">The opportunity to actually learn to fence is right around the corner at the Bucks County Academy of Fencing.</span></p>\n<p class=\"p3\"><span class=\"s2\">The BCAF has two locations; one in Lambertville, N.J. and the other in Hatfield, PA.</span></p>\n<p class=\"p3\"><span class=\"s2\">If you’d like to give fencing a try, the BCAF offers a ‘Taste of Fencing’ program which is a 60-minute lesson once a week for three weeks for $125. Equipment is provided and each student receives a fencing glove that is theirs to keep.</span></p>\n<p class=\"p3\"><span class=\"s2\">This program offers newcomers an overview of fencing, so they can decide if they’d like to continue with the sport before making a big commitment of time and money.</span></p>\n<p class=\"p3\"><span class=\"s2\">“There are so many benefits to fencing,” said Mark Holbrow, the head fencing master at BCAF. “It sharpens your agility, balance, reflexes and your mind, and it’s a really good form of exercise.</span></p>\n<p class=\"p3\"><span class=\"s2\">“Fencing is for everyone; no matter what your age or fitness level, there’s a place for you if you’re interested in learning an exciting, fun sport.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">As fencers improve, they will have the opportunity to compete. The BCAF has produced a number of national champions, some of whom teach in the program, and some younger BCAF students have gone on to fence in college.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Experienced fencers are also welcome, whether to brush up on their skills or get back into competition form.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Bucks County Academy of Fencing is celebrating over 42 years of training men and women in the classic art of fencing. Recreational and competition-grade classes taught by USAF certified coaches are open to anyone ages 8 and older. For information on BCAF visit <a href=\"http://www.bcaf.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.bcaf.com</a> or call 215-862-6112.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/2015-LV-Full-floor-pix1-e1681588481431.jpg"
}