{
  "id": 11494,
  "title": "Entertaining Outdoors When The Weather Cools Down",
  "slug": "entertaining-outdoors-when-the-weather-cools-down",
  "date": "2021-10-13T03:48:07",
  "author": "Staff",
  "category": [
    "Live",
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "victoria guillot"
  ],
  "excerpt": "<p>By Victoria Guillot  •  The Cardinal Contributing Writer Extend your Outdoor Entertaining with Style It’s that in-between time of year again. The air is cooler and the days are shorter. Somehow during a pandemic, this impacts our lives more than normal because to stay safe we’ve been doing a lot of entertaining outdoors. In summer [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Victoria Guillot  •  </b>The Cardinal Contributing Writer</p>\n<p class=\"p1\"><span class=\"s2\"><b>Extend your Outdoor Entertaining with Style</b></span></p>\n<p class=\"p3\"><span class=\"s3\">It’s that in-between time of year again. The air is cooler and the days are shorter. Somehow during a pandemic, this impacts our lives more than normal because to stay safe we’ve been doing a lot of entertaining outdoors. In summer weather that’s easy. Once the temperatures drop and the sun sets earlier, this becomes more of a challenge.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s3\">Under normal circumstances, we move the party indoors when the weather changes. However, many people are still reluctant to spend any more time than necessary indoors with others, vaccinated or not. So how do we keep our social lives humming in cooler weather? And how do we do it with style?</span></p>\n<p class=\"p1\"><strong><span class=\"s2\">Bring on the warmth!</span></strong></p>\n<p class=\"p3\"><span class=\"s3\">Take a cue from European outdoor cafes.<span class=\"Apple-converted-space\">  </span>Before your guests arrive, add throws and blankets to keep everyone warm as the temperatures drop. Fold and drape one over each chair so your guests can help themselves as soon as they start to feel chilly.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s3\">Depending on the weather, your options range from light pashminas to cashmere throws and wool blankets. (Some throws are so pretty I’ve been known to wear them as great shawls when I go out. Shh…. Don’t tell anyone.)</span></p>\n<p class=\"p3\"><span class=\"s3\">Everyone loves sitting around a fire pit. Not only will it keep you warmer, there’s something special about the ambience when you add the element of flickering light. Options exist for all types of décor ranging from rustic to exotic to sleek contemporary metal.</span></p>\n<p class=\"p1\"><strong><span class=\"s2\">Take it up a notch. For a truly memorable evening, try sprinkling candlelight around the area.<span class=\"Apple-converted-space\"> </span></span></strong></p>\n<p class=\"p3\"><span class=\"s3\">Besides now that it’s getting dark early, you’ll welcome the soft lighting. There are so many lovely lantern options, and the glass sides will keep your candles from being extinguished by any breezes or worse&#8211; toppling over and starting a fire. For extra safety you can use battery-operated Luminara flameless candles. The flame movement looks so real! The glass of the lanterns reflects the flame and seemingly multiplies it. Jumbo lanterns add drama and practicality. Because they sit on the floor you don’t need extra tables for the candles, so you can spread light in more places.</span></p>\n<p class=\"p1\"><strong><span class=\"s2\">Add the comforts of your living room to the outdoors.</span></strong></p>\n<p class=\"p3\"><span class=\"s3\">Don’t forget the floor. A nice rug somehow makes the space feel warmer than a bare floor does, and it really boosts the style.</span></p>\n<p class=\"p3\"><span class=\"s3\">Outdoor rugs have come a long way in the last couple of years. You can find rugs that look like you borrowed them from your living room to extend the same hospitality to the outdoors. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s3\">Here I’ve taken a seating set and accessorized it different ways to give you inspiration.</span></p>\n<p class=\"p3\"><span class=\"s3\">It’s up to you how you coax your guests to want to leave after an evening in such a cozy and charming setting.</span></p>\n<p class=\"p3\"><span class=\"s3\">This month I’ve curated a collection with special designer trade access to firepits, lanterns, throws, outdoor rugs and beverage tubs. Get access by using the links at https://stagecoachservices.com/home-shop.</span></p>\n<p class=\"p5\"><span class=\"s5\"><i>Victoria Guillot is a home stager/interior designer of 15 years based in Buckingham/Doylestown.<span class=\"Apple-converted-space\">  </span>A 6-time Best of Houzz winner, she has been featured on a 26-episode radio series and is author of a book of tips on home staging. If you would like more trade access or would enjoy her decorating assistance, you can find her at <a href=\"http://stagecoachservices.com\" target=\"_blank\" rel=\"noopener noreferrer\">stagecoachservices.com</a>.</i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/10/victoria-oct-2021.jpg"
}