{
  "id": 18516,
  "title": "Evolution Candy Celebrates 5 Years in Business",
  "slug": "evolution-candy-celebrates-5-years-in-business",
  "date": "2023-12-14T16:17:24",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "evolution candy"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer Have you been to the sweet candy shop nestled in the sweet house at 45 E. State Street in the heart of Doylestown borough? The space invites you in with the cute little porch, outdoor seating, and an ice cream window.  James and Tracy Lamb opened Evolution [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Danielle Gannon • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">H</span><span class=\"s1\">ave you been to the sweet candy shop nestled in the sweet house at 45 E. State Street in the heart of Doylestown borough? The space invites you in with the cute little porch, outdoor seating, and an ice cream window.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">James and Tracy Lamb opened Evolution Candy on Oct. 1, 2018. They were looking to open a small business in Doylestown and had their eye on a few places. They tossed around different ideas and decided to go with a candy shop. “We thought we bought a candy store, and what we came to realize, is that we bought a piece of the community,” Tracy says.</span></p>\n<p class=\"p5\"><span class=\"s1\">The couple went in with a good business sense and got to work ordering candy, ice cream, special drinks, and small novelties. James and Tracy began to form relationships with not only the small business neighbors but also the everyday customers both young and old. They found themselves getting to know everyone’s likes, dislikes, and stories. Kids come after school, with a few dollars in their pockets, and leave with a smile &#8211; they buy something with their own money and have so much fun doing it.</span></p>\n<p class=\"p5\"><span class=\"s1\">“My favorite part of the borough, is that I can leave our shop to walk down the street and have four conversations with different locals along the way,” says James. It is a true community.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The couple makes sure to stock with all the favorites, but the fun has come with keeping inventory fresh and changing. Every week, there is a new piece of candy or specialty in the shop, something new for the customers to taste and try.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">“When we purchased this business, we thought we were on an eight to 10-year plan here,” James says. “Now that we are on year five, we realize we are just getting started.”</span></p>\n<p class=\"p5\"><span class=\"s1\">In the summer the sales focus on the ice cream. It’s a very common occasion to walk past the window and see a line wrapped around the little house. People of all ages, with dogs and even cats, wait for a special treat, connecting, laughing, and hanging on the porch. Winter brings an uptick in corporate baskets, which businesses send to their clients.</span></p>\n<p class=\"p5\"><span class=\"s1\">What is evident, is that James and Tracy love their shop, they love the community and they love doing this together. “Thank goodness we are here every day doing what we love, dividing the work, together,” Tracy says.</span></p>\n<p class=\"p5\"><span class=\"s1\">When asked about their own favorites, James didn’t skip a beat and picked up a chocolate potato chip, while Tracy went with the old school Whatchamacallit and Reese’s Take 5&#8230; no pun intended as they take on their fifth year in business.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">“If we age out or ever feel like we aren’t connected to our customer anymore, that’s when we know our time is up,” says Tracy. But until then you know where to go for all the smiles, good feels, and sweet treats. This sweet shop is open for business seven days a week and is a true staple in the borough. Visit them on IG: @evolutioncandy and catch a daily glimpse of the fun behind the scenes.</span></p>\n<p class=\"p7\"><i>Danielle Gannon is a local Bucks County entrepreneur. Mom to three, she is co-owner of Organnons Natural Market and Founder &amp; Managing Director of Local Spotlight with Danielle. Her passion is connecting people and creating community. Residing in Ivyland, writing has always been a passion of hers. Find her on IG @localspotlightwithdanielle</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/Evolutioncandyinside.jpg"
}