{
  "id": 12141,
  "title": "Exciting Changes at Michener Art Museum for 2022",
  "slug": "exciting-changes-at-michener-art-museum-for-2022",
  "date": "2022-02-05T17:48:43",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "Michener Art Museum"
  ],
  "excerpt": "<p>The James A. Michener Art Museum announced growth-focused changes in leadership at a pivotal time for the Michener. New additions to the Museum management team and Board are in place and exciting exhibitions are lined up, all with the goal of strengthening the Michener’s commitment to inspire and nurture a lifelong connection to the arts. [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">T</span><span class=\"s2\">he James A. Michener Art Museum announced growth-focused changes in leadership at a pivotal time for the Michener. New additions to the Museum management team and Board are in place and exciting exhibitions are lined up, all with the goal of strengthening the Michener’s commitment to inspire and nurture a lifelong connection to the arts.</span></p>\n<p class=\"p3\"><span class=\"s2\">A newly formulated Board named a transition team of three experienced senior directors, led by CFO Gary Ellis, to replace former Executive Director Kate Quinn, who left the Museum at the end of 2021. Ellis is joined by Chief Curator Laura Turner Igoe, Ph.D., and Director of Operations Jason Kobilnyk to ensure the financial, curatorial, and operational areas of the Museum continue to serve the community.</span></p>\n<p class=\"p3\"><span class=\"s2\">The Michener has also hired several new members to the executive leadership team, bringing a breadth of world-renowned museum experience and depth of growth-focused leadership to the well-known Delaware Valley institution, including Diane Guvenis, Chief Development Officer; Joshua Lessard, Director of Exhibitions; Aisling Lavery, Director of Public Engagement; and Heike Rass, Director of Marketing and Communications.</span></p>\n<p class=\"p3\"><span class=\"s2\">In addition, the Michener’s Board Chair, Virginia W. Sigety, a Trustee since 2005, welcomed new Board members in 2021: Dr. Vail Garvin, President and CEO of the Central Bucks Chamber of Commerce; Patricia Gorsky, a former nurse/community leader and philanthropist; and book editor and former print news reporter, Rhoda McKinney-Jones, the youngest daughter of the late civil rights leader, Rev. Dr. Samuel B. McKinney of Seattle. This year the Board also welcomes its new Trustee Robert Byers, Jr., President of Byers’ Choice Ltd. and Director of Penn Community Bank.</span></p>\n<p class=\"p3\"><span class=\"s2\">In recognition of her contributions to the Museum, the Board of Trustees thanks Kate Quinn for her steady stewardship throughout the pandemic and reopening of the Museum and wishes her success in her other future projects and career endeavors.</span></p>\n<p class=\"p3\"><span class=\"s3\">2022 arrives with an air of anticipation at the Michener. As part of community-focused and mission-driven cultural offerings, the Museum will be presenting two exciting special exhibitions this year: Keith Haring: A Radiant Legacy, opening on March 12, and Walk This Way: Footwear from the Stuart Weitzman Collection of Historic Shoes in the fall.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/02/Michener-Museum.jpg"
}