{
  "id": 14891,
  "title": "Fairy Tale Weddings in Doylestown",
  "slug": "fairy-tale-weddings-in-doylestown",
  "date": "2022-09-13T17:30:31",
  "author": "Staff",
  "category": [
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "Fonthill Castle",
    "john lund",
    "mercer museum",
    "susan smith"
  ],
  "excerpt": "<p>By John Lund and Susan Smith • The Cardinal Contributing Writers Imagine it’s your wedding day. The day you’ve dreamed of since childhood- the dream of feeling like a princess (or prince) in an enchanted castle far, far away. If you’re all about feeling like royalty on your special day, a castle wedding venue is [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By John Lund and Susan Smith • </strong>The Cardinal Contributing Writers</p>\n<p class=\"p3\"><span class=\"s2\">I</span><span class=\"s1\">magine it’s your wedding day. The day you’ve dreamed of since childhood- the dream of feeling like a princess (or prince) in an enchanted castle far, far away. If you’re all about feeling like royalty on your special day, a castle wedding venue is a must. It turns out you don’t have to travel to Scotland or elsewhere in Europe to have this type of wedding. Henry Chapman Mercer created grand castles right here in Doylestown in the early 1900s, and they are the perfect venue for your special wedding day.</span></p>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2022/09/SJ-1-Kevin-Crawford-Imagery-e1663104513233.png\"><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-14892 alignleft\" src=\"https://doylestowncardinal.com/wp-content/uploads/2022/09/SJ-1-Kevin-Crawford-Imagery-e1663104513233.png\" alt=\"\" width=\"385\" height=\"833\" /></a></p>\n<p class=\"p5\"><strong>Fonthill Castle</strong></p>\n<p class=\"p6\"><span class=\"s1\">A wedding at Fonthill Castle is truly an architectural dream wedding. With seating for up to 250 guests, this castle/museum and outdoor garden oasis will surpass your royal dreams. Completed in 1912, Fonthill was the self-designed home of Henry Mercer. Mercer built Fonthill as his home and as a showplace for his collection of tiles and prints; it’s an eclectic mix of Medieval, Gothic, and Byzantine architectural styles and is an unmatched setting in all of Bucks County.</span></p>\n<p class=\"p6\"><span class=\"s1\">Your wedding ceremony at Fonthill Castle can be held in two lovely locations on the tree-lined property. The first is in the “Enchanted Woods”, situated on the back grounds of the castle. A stream-fed pond sits below the castle and provides a breathtaking backdrop of the castle for cherished photos. The second location is at the front of the castle, which provides an intimate setting at the foot of the castle’s concrete walls. The cocktail hour and wedding reception are held in a 6,400 square foot, clear-top tent situated behind the castle and is catered exclusively by Jeffery Miller Catering.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">During the cocktail hour, guests can enjoy a self-guided tour of the first floor—a perfect spot for guest pictures. Your bridal party can also enjoy their own special wedding lounge with an attached balcony overlooking the castle’s beautiful grounds. During the reception, guests can move outside, enjoy drinks around the manicured firepit, and smoke a favorite cigar at the “Cigar Circle”. Extend your evening with an after-party in the “Moonlight Lounge”.</span></p>\n<p class=\"p5\"><strong>Mercer Museum</strong></p>\n<p class=\"p6\"><span class=\"s1\">Mercer Museum is a six-story reinforced concrete castle designed by Henry Mercer in 1916. Today, it is one of Bucks County’s premier cultural attractions and a Smithsonian affiliate. The museum complex houses a collection of over 50,000 pre-Industrial tools that offer visitors a unique window into pre-Industrial America through sixty different crafts and trades.</span></p>\n<p class=\"p6\"><span class=\"s3\">Weddings at Mercer Museum are one of the best-kept secrets in Bucks County. Here, your ceremony can be hosted in multiple locations on the property. The “Garden Square” is an outdoor option in the courtyard flanked by a turn-of-the-century log cabin and the rustic stables. An indoor option is “Elkins Gallery, “ a classic fireplace-adorned hall. “Central Court”, in our opinion, is the most dramatic option for your ceremony. “Central Court” is the bottom level of the museum display floor. Couples can choose chairs on the ground floor or the option for your guests to view the ceremony elevated on the 2nd and 3rd levels of the six-story museum.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">After the ceremony, your party will move to a newly installed, state-of-the-art, transparent, air-conditioned “Garden Tent” at the foot of the castle. This is the perfect spot to host your cocktail hour and reception. You and your guests will revel in this magical space as dramatic lights are cast up the side of the castle for all to take in. Post-dinner dancing will ensue in the museum’s “Great Hall”.</span></p>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2022/09/SJ-2A-Kevin-Crawford-Imagery.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-14893 alignright\" src=\"https://doylestowncardinal.com/wp-content/uploads/2022/09/SJ-2A-Kevin-Crawford-Imagery.jpg\" alt=\"\" width=\"435\" height=\"653\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2022/09/SJ-2A-Kevin-Crawford-Imagery.jpg 1800w, https://doylestowncardinal.com/wp-content/uploads/2022/09/SJ-2A-Kevin-Crawford-Imagery-200x300.jpg 200w, https://doylestowncardinal.com/wp-content/uploads/2022/09/SJ-2A-Kevin-Crawford-Imagery-768x1152.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2022/09/SJ-2A-Kevin-Crawford-Imagery-683x1024.jpg 683w, https://doylestowncardinal.com/wp-content/uploads/2022/09/SJ-2A-Kevin-Crawford-Imagery-990x1485.jpg 990w, https://doylestowncardinal.com/wp-content/uploads/2022/09/SJ-2A-Kevin-Crawford-Imagery-1320x1980.jpg 1320w\" sizes=\"auto, (max-width: 435px) 100vw, 435px\" /></a></p>\n<p class=\"p5\"><strong>Jeffery Miller Catering</strong></p>\n<p class=\"p6\"><span class=\"s1\">Jeffery Miller Catering took over the wedding business at Fonthill Castle and Mercer Museum in 2019. Jeffrey A. Miller creates catered events that perfectly blend innovative cuisine and extraordinary hospitality in unforgettable settings. Jeffrey A. Miller Catering started in 1980 as a brunch-in-bed school project by founder Jeff Miller, then sophomore studying entrepreneurship at the Wharton School of the University of Pennsylvania. Having discovered a passion for great food, Jeff used his summers to stage in the best kitchens he could find, working in New York, London, and the south of France.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">The creativity in presentation, emphasis on freshness, and attention to detail that made these restaurants great inspired him to abandon outdated, cookie-cutter banquet food. He instead focused on vibrant culinary offerings rich in flavors from around the world, served with a spirit of warm hospitality that puts people first. This spirit helped Jeffrey A. Miller Catering grow into the thriving company it is today, with sixteen exclusive venues hosting catered events that perfectly blend innovative cuisine and extraordinary hospitality in unforgettable settings like Fonthill Castle and Mercer Museum.</span></p>\n<p class=\"p5\"><strong>Set Your Date!</strong></p>\n<p class=\"p6\"><span class=\"s1\">Full-scale wedding options at Fonthill and Mercer Museum are available between May and October. Smaller weddings are possible all year round at Mercer Museum. Contact Anthia Graham at anthiag@jamcater.com for more information or go to Jeffery Miller Catering at www.jamcater.com to view the calendar. Some dates may be available this year for September and October for those last-minute nuptials! Contact Anthia soon to save those dates and enjoy your dream castle wedding right here in Doylestown!</span></p>\n<p class=\"p8\"><em>Photos of bride Susan Smith and groom John Lund<span class=\"Apple-converted-space\"> </span></em><span class=\"s4\">at Fonthill Castle </span>by Kevin Crawford Imagery. •. <a href=\"http://www.kevincrawfordimagery.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.kevincrawfordimagery.com</a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/09/SJ-3-Kevin-Crawford-Imagery.jpg"
}