{
  "id": 12568,
  "title": "Finney’s Pub . . . The Local Cheers of Doylestown",
  "slug": "finneys-pub-the-local-cheers-of-doylestown",
  "date": "2022-03-10T18:15:06",
  "author": "Staff",
  "category": [
    "Live",
    "Play",
    "Taste"
  ],
  "tags": [
    "Danielle Gannon",
    "doylestown cardinal",
    "Finney’s Pub",
    "Rich Lunoe",
    "rich wylie"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer You walk in . . . and you’re greeted with nostalgia of the good ol’ days: a real beer, bourbon, and smokin’ kind of bar. Any day of the week, you’re met with the friendly face of Rich Wylie, who has tended the bar at Finney’s Pub [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Danielle Gannon</strong> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">Y</span><span class=\"s1\">ou walk in . . . and you’re greeted with nostalgia of the good ol’ days: a real beer, bourbon, and smokin’ kind of bar. Any day of the week, you’re met with the friendly face of Rich Wylie, who has tended the bar at Finney’s Pub since 1982. Rich is the staple at Finney’s, and the bar is full of regulars who come to shoot the breeze and get their daily beverage of choice.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Finney’s sits on Main Street with a big green awning, right next to The Gap. It’s the local watering hole whose roots stem back to 1837. It was always a restaurant/bar or local general store. It sits on top of old tunnels that were said to be part of the slave trade back in the 18th century. Its walls are stone, and its bar, a rustic cherry wood.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">It’s filled with the chatter of Bucks County’s restaurateur’s, owners, bartenders, and maids from all around. This is their stomping grounds . . . where they feel at home, and Rich is a big reason for it. He is known as Bucks County’s longest-standing tender of bar at the same location. That goes a long way and sure says a lot! I watched as various different people came through the door, got comfortable on their “stool,” and Rich poured them their “drink”, not a question asked. It’s a haven and a comfortable space for everyone to kick back and have camaraderie, laugh, and leave their worries at the door.</span></p>\n<p class=\"p5\"><span class=\"s1\">It was originally owned by the late Jim Finney and his wife, Bonnie. When Jim passed, Rich Lunoe purchased the bar and has owned it ever since. Now we have Big Rich (Rich Wylie) and Little Rich (Rich Lunoe) . . . the good cop and the bad cop. We won’t tell you who’s who.</span></p>\n<p class=\"p5\"><span class=\"s1\">Finney’s is known as a gastropub, serving the BEST wings in town. Forty flavors, to say the least. Crispy and delicious! Cheesesteaks, wings, and all-around good bar food. “We are a bar you want to go, to have fun and eat good bar food”, says Wylie, who takes great pride in his dedication to the establishment.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">“We are a family-run, local restaurant and bar who truly cares about their customers and this community. We respect our clients, make sure they’re safe and when they’re here . . . you are always under my supervision”, states Wylie.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">They have two levels. The downstairs is the space for regulars seven days a week. Upstairs, sometimes known as “Club Finney”, you will find Karaoke on Thursdays and a local DJ on Friday and Saturday nights. It’s also a private space available to parties of all sizes and price ranges. Call and they will work with you and your budget. There’s a pool table and pool league that also meets downstairs on various days.</span></p>\n<p class=\"p5\"><span class=\"s1\">Here you’ll find they don’t have to reinvent the wheel. They have a bartender that’s managed the space for 38+ years, a regular customer base, and some tasty bar food.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Saint Patty’s falls on a Thursday this year, and as in the typical Irish spirit, Finney’s is all set for the crowd! They will open around 11:00am and feature the traditional Corn Beef &amp; Cabbage, Shepherd’s Pie, and of course . . . Bangers and Mash. Drink, beer, and shot specials all day and the weekend following.</span></p>\n<p class=\"p5\"><span class=\"s1\">You can check out their FaceBook &amp; InstaGram pages for daily updates on what’s happening at the pub. They do a lot to support the local community with charities, and fundraisers. “We aren’t here to make a million dollars. We are here to provide a good space and local bar for our customers”, says Rich. There sure is a lot of bars and restaurants to choose from in Doylestown, but nothing captures the true essence of a Pub like Finney’s . . . where it’s clear, everyone knows your name!</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/03/Rich-Wylie.jpg"
}