{
  "id": 19036,
  "title": "For the Love of a Farm",
  "slug": "for-the-love-of-a-farm",
  "date": "2024-02-27T15:43:47",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "Hershberger Heritage Farm",
    "Natasha Lichty"
  ],
  "excerpt": "<p>By Natasha Lichty • Special to The Cardinal I see the sign for “Hershberger Heritage Farm” and turn down the long gravel driveway, admiring the large brick barn and red corncrib ahead – quintessential markers of an old, Bucks County farm. I park in front of the late 1800s house and head into the sunroom-turned-farm [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Natasha Lichty • </strong></em>Special to The Cardinal</p>\n<p class=\"p3\"><span class=\"s2\">I </span><span class=\"s1\">see the sign for “Hershberger Heritage Farm” and turn down the long gravel driveway, admiring the large brick barn and red corncrib ahead – quintessential markers of an old, Bucks County farm. I park in front of the late 1800s house and head into the sunroom-turned-farm store.  </span></p>\n<p class=\"p5\"><span class=\"s1\">Inside, Nate Layton is packing up dozens of what he calls “Berger Boxes” – boxes of various cuts of pasture-raised, organically fed meat that will be delivered to customers around Bucks County and beyond. The tall cardboard stacks are a promising sign for Nate who just a week before was gravely wondering how many more days his farm business could survive.</span></p>\n<p class=\"p5\"><span class=\"s1\">Like most small, local farms, Hershberger Heritage Farm relies heavily on sales generated at farmers markets, but five weeks of rain in a row in the late summer/early fall left Nate and his business partner, Pat Ebner, with 80% less in revenue than they normally would have made those weeks. They found themselves in a financial hole, and at the end of December, when they needed to start planning for more feed and supplies for the season. The two partners felt discouraged. </span></p>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2024/02/HHF7.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\" wp-image-19039 alignleft\" src=\"https://doylestowncardinal.com/wp-content/uploads/2024/02/HHF7.jpg\" alt=\"\" width=\"397\" height=\"529\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2024/02/HHF7.jpg 705w, https://doylestowncardinal.com/wp-content/uploads/2024/02/HHF7-225x300.jpg 225w\" sizes=\"auto, (max-width: 397px) 100vw, 397px\" /></a></p>\n<p class=\"p5\"><span class=\"s3\">Nate, unsure what to do next, turned to his Instagram followers with a video that highlighted his dilemma with a raw transparency that business owners often try to shield from customers. “I have some disappointing news to share with you,” he said while walking his dogs through the woods, recounting the situation and the uncertainty they were feeling.  “I’m not sure that we’re going to have the money to start up in 2024. I’m not trying to be down about it – I’m still trying to be optimistic, but at this point, it’s not looking really good,” he continued.</span></p>\n<p class=\"p5\"><span class=\"s1\">At the end, Nate asked his followers to share the video with friends and family to help get the word out and potentially sell more Berger Boxes. With this call to action, his followers delivered, and he woke up to fifty orders the next morning (they normally average two new orders a day). Nate then posted another video, thanking everyone who placed an order.  That video, having now been viewed almost 70k times, went a bit viral. “And that’s when the orders really started coming,” Nate tells me.  “And it kind of hit me that social media and our community can help save the farm.”</span></p>\n<p class=\"p5\"><span class=\"s1\">Since then, he’s been updating his Instagram audience daily, sharing how many new subscribers he’s at, and bringing them along on the journey to his 300-subscriptions goal – a number that would provide a sense of security and confidence heading into the season.  It’s fun to follow along and watch the videos he shares, his growing optimism palpable with each new order and day.</span></p>\n<p class=\"p5\"><span class=\"s1\">It’s clear that Nate loves the life he’s built. He runs his woodworking business (purpleheartfinefurniture.com) out of the barn, enjoys hikes in the woods with his dogs, and is proud to produce his own food.  He vows he would continue to live on these sprawling fifty acres in Sellersville regardless of the farming business, but he knows he’s providing Bucks County with an option we wouldn’t have without him. </span></p>\n<p class=\"p5\"><span class=\"s4\">Nate began raising chickens when he was looking for healthier, pasture-raised meat options. While he could find pasture-raised grass-fed beef locally, he failed to find chicken.  </span></p>\n<p class=\"p5\"><span class=\"s1\">An Air Force Veteran with a business degree, Nate realized there was a gap in the market and a lightbulb went off in his head.  If he couldn’t find what he needed, he was going to do it himself. Fast forward ten years and Hershberger Heritage Farm provides Bucks County with eggs, chicken, beef, pork, and lamb, all raised using regenerative farming practices and rotational grazing &#8211; attributes that would be almost impossible to find at grocery stores. </span></p>\n<figure id=\"attachment_19040\" aria-describedby=\"caption-attachment-19040\" style=\"width: 406px\" class=\"wp-caption alignright\"><a href=\"https://doylestowncardinal.com/wp-content/uploads/2024/02/Nate1.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\" wp-image-19040\" src=\"https://doylestowncardinal.com/wp-content/uploads/2024/02/Nate1-613x1024.jpg\" alt=\"\" width=\"406\" height=\"678\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2024/02/Nate1-613x1024.jpg 613w, https://doylestowncardinal.com/wp-content/uploads/2024/02/Nate1-179x300.jpg 179w, https://doylestowncardinal.com/wp-content/uploads/2024/02/Nate1-768x1284.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2024/02/Nate1-990x1655.jpg 990w, https://doylestowncardinal.com/wp-content/uploads/2024/02/Nate1.jpg 1124w\" sizes=\"auto, (max-width: 406px) 100vw, 406px\" /></a><figcaption id=\"caption-attachment-19040\" class=\"wp-caption-text\">Nate Layton</figcaption></figure>\n<p class=\"p5\"><span class=\"s1\">Before we know it, it will be April and Hamilton Street will be lined with our favorite vendors. On warm, sunny days we will all flock there, filling our tote bags with wonderful locally produced bounty, but let’s remember to show up on the days when the weather isn’t as ideal. </span></p>\n<p class=\"p5\"><span class=\"s1\">So, to adopt the “there’s no bad weather, only bad clothes” mantra, on rainy or cold Saturdays, try your best to bundle up, step into those rain boots, and grab your biggest umbrella. Let’s not be (literal) fair-weather supporters of our local farmers. Because as Nate said during my conversation with him, “A small farm like this needs the community.  Without that, it can’t exist.”</span></p>\n<p class=\"p5\"><span class=\"s1\">If you’d like to learn more about Hershberger Heritage Farm or place an order for a Berger Box, you can visit them at <a href=\"http://www.bergerbox.farm\" target=\"_blank\" rel=\"noopener noreferrer\">www.bergerbox.farm</a>. </span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/02/HHF2.jpg"
}