{
  "id": 18261,
  "title": "Free Spirit-ed Business Invites Non-Drinkers for a Drink Out",
  "slug": "free-spirit-ed-business-invites-non-drinkers-for-a-drink-out",
  "date": "2023-10-11T22:49:46",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "Christa Vigilante",
    "dakoda carlson",
    "doylestown cardinal",
    "Free Spirit"
  ],
  "excerpt": "<p>By Dakoda Carlson • The Cardinal Editorial Intern A bar for non-drinkers? A store? A local hangout? It’s all of the above! Free Spirit is a new Buckingham business specializing in non-alcoholic beverages, hemp goods, and natural alternatives. Owner Christa Vigilante, a Bucks County native, tends the bar, which has its regulars.   Half-bar, half-store, Free [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Dakoda Carlson • </strong></em>The Cardinal Editorial Intern</p>\n<p class=\"p3\"><span class=\"s2\">A</span><span class=\"s1\"><span class=\"Apple-converted-space\"> </span>bar for non-drinkers? A store? A local hangout? It’s all of the above!</span></p>\n<p class=\"p5\"><span class=\"s1\">Free Spirit is a new Buckingham business specializing in non-alcoholic beverages, hemp goods, and natural alternatives. Owner Christa Vigilante, a Bucks County native, tends the bar, which has its regulars. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Half-bar, half-store, Free Spirit offers alcohol-free spirits and adaptogen drinks. That’s drinks contain ingredients of beneficial adaptogens—functional herbs like ginseng, for example. Unlike alcohol, adaptogens aim to enhance and balance the body’s chemistry instead of suppressing it and help the mind and body adapt to stress. Christa offers mixed-to-order cocktails and non-alcoholic wines, beers, and spirits in bottles and cans for purchase. The store also offers hemp products that range from hats and bags to edibles.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The motive behind the business came when Christa herself went alcohol-free. Once she stopped drinking, she noticed the limited options for non-drinkers and decided she wanted to change that. “It became my mission to make a place for alcohol-free people to find community, beverage options, and social connections.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The location of Free Spirit in the Buckingham Green shopping plaza presented itself to Christa and her team. “We loved this spot because there is oodles of parking, a sidewalk, a grassy knoll out front for events, and it’s completely ADA accessible, which meant no one would be excluded from entry,” Christa says.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Besides the delicious drinks, Free Spirit offers educational opportunities to the community. This month Christa is offering “Cocktails for Beginners” and “Cannabinoids and You.” Free Spirit also brings live music for outdoor hang-outs at least once a month.</span></p>\n<p class=\"p5\"><span class=\"s1\">The overall goal for the business is to jumpstart the creation of Non-Alcoholic shops. “The idea that my shop is the only NA bar and bottle shop in Bucks County is wild to me,” Christa says. Free Spirit is a space designed for people to feel welcome. Christa says she wants folks to feel “connected, seen, and thought of” at her store.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">And Christa’s business free spirit flies high, as she has already begun laying the foundation to partner with local music venues and make NA beverages a more common option. She partnered with the R.R.A.T club in Point Pleasant and runs a table at the clubhouse shows.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Besides running the store, Christa cares for her three children, a dog, and 3 cats with her husband of 20 years. They currently reside in Solebury Township. “Finding balance is always the biggest challenge,” she says.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">Christa always had a passion for food. She attended college in Vermont to study the culinary arts. “I started working with the New England Culinary Institute and everything after really clicked,” Christa says. “I just knew that a career in hospitality was what made sense for me.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">Later, she was offered a position to oversee the Bouchon location in New York City, of Thomas Keller’s restaurant group. “It was a career dream come true and gave me the opportunity to work with the masters of their crafts,” said Christa. She spent 3.5 years with the company and was able to facilitate many experiences. She helped cater events during New York Fashion Week, Rockefeller Center Tree Lighting ceremonies, and The Macy’s Thanksgiving Day Parade.</span></p>\n<p class=\"p6\">Free Spirit is located at 4920 York Road, Store 13 in Buckingham, PA<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p6\">Website: f<a href=\"https://www.facebook.com/FreeSpiritPa/\" target=\"_blank\" rel=\"noopener noreferrer\">reespirithemp.com</a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/10/Free-Spirit.jpg"
}