{
  "id": 14033,
  "title": "Garden Bar at Puck Fills a Void",
  "slug": "garden-bar-at-puck-fills-a-void",
  "date": "2022-07-13T14:38:17",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "dpylestown cardinal",
    "Garden Bar",
    "john lund",
    "susan smith"
  ],
  "excerpt": "<p>By John Lund and Susan Smith • The Cardinal Contributing Writers Prior to the pandemic, one of our favorite Doylestown stops was Puck Live. Aside from a great indoor music venue, Puck Live was a great outdoor space to enjoy a beer and watch an Eagles or Phillies game projected onto the big screen on [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By John Lund and Susan Smith • </strong>The Cardinal Contributing Writers</p>\n<p class=\"p3\"><span class=\"s2\">Prior to the pandemic, one of our favorite Doylestown stops was Puck Live. Aside from a great indoor music venue, Puck Live was a great outdoor space to enjoy a beer and watch an Eagles or Phillies game projected onto the big screen on the side of the building. Puck’s closure may not have been the result of the pandemic, but the lasting image of the empty outdoor space on Printer’s Alley had been a constant reminder of the many voids we all have encountered over the past couple of years.</span></p>\n<p class=\"p4\"><span class=\"s2\">However, with each door that closes, a new one opens. The void on Printer’s Alley was filled in late May, with a new spot called The Garden Bar at Puck. The Garden Bar at Puck is a pop-up beer garden created by Doylestown locals Joe Montone and Sean McGuinness of Daisy Chain Events. They are being aided by Sacred Vice Brewing Company, an up-and-coming brewery in Philadelphia. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s3\">How it Started</span></strong></p>\n<p class=\"p4\"><span class=\"s2\">“I was looking for a familiar way to connect with new people,” says Sean, who just moved to the area from Philadelphia with his family during the lockdown in 2020. He thought perhaps sharing his dynamic experience in the service industry would lead him to a new community. That’s just around the time he met Joe Montone.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">For more than 12 years, Joe has created platforms for communities to flourish through live music and experiences in Doylestown. His outdoor concert series, Picnics on Pine, has brought acclaimed original artists to the area for an all-ages audience complete with local food and craft vendors. He is also the guest producer of Abington Art Center’s Summer Concert Series.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">“Sean and I met over at Siren Records where I was working at the time. We connected on our similar taste in music, and I was glad to make a new friend, which is sometimes difficult in this area,” says Montone. Over the past winter, Sean asked Joe if he would help him create an outdoor pop-up bar in Doylestown, which he referred to as a garden bar. “Sean’s enthusiasm is absolutely infectious, and I love taking on new projects even when I shouldn’t,” says Joe about the initial proposal, “so I of course said yes right away.”</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">Sacred Vice Brewing</span></strong></p>\n<p class=\"p4\"><span class=\"s2\">Sean then recruited his friends from Sacred Vice Brewing Company to help with the project.</span></p>\n<p class=\"p4\"><span class=\"s2\">Cousins Justin and Matt launched Sacred Vice Brewing in 2018. They were inspired by shared family memories and the dream to become part of Philadelphia’s long and epic brewing history. In 2021, Andrew “Ruby” Rubenstein joined them as partner and head brewer. Ruby has nearly two decades of award-winning brewing experience, most recently with 2SP Brewing in Delco and Iron Hill. Together, they plan on making even more beer they like to drink and share.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">The Finished Product</span></strong></p>\n<p class=\"p4\"><span class=\"s2\">The success of The Garden Bar at Puck reflects each person’s years investing and championing communal spaces. “Across the board, we all wanted something new in Doylestown. Each one of us cares deeply about this community, and it’s amazing that we’ve all provided our strengths to make this happen. This is a true collaboration, and it couldn’t be done without each other,” says Montone. “We feel blessed that our partners at Daisy Chain Events approached us with the opportunity,” says Matthew Brodsky of Sacred Vice Brewing Company. “Sean was a great friend when he was at Lunar Inn in Port Richmond, and we’ve been waiting for his next big thing.” Kate O’Hare of River Girl Gardens adds, “there couldn’t be a more desperate time for something like this to bloom. Communities everywhere need spaces like this. Sean and I agreed that it’s a place where we all get to do our favorite things. Cheers to that and for the love of gardens.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Each Wednesday through Saturday from 5pm to 11pm, The Garden Bar features a rotating menu of regionally acclaimed beers, natural wines, draft cocktails, and more. Joe and Sean encourage guests to bring their own takeout from local restaurants or from home. There are plans to feature guest chefs later in the season.</span></p>\n<p class=\"p4\"><span class=\"s2\">“It’s incredible to see what this space has become,” Montone concludes. “We planted the seeds here, but it’s amazing to see how people interact with the space and make it their own.”</span></p>\n<p class=\"p4\"><span class=\"s2\">The Garden Bar at Puck is located at 1 Printer’s Alley (the former Puck patio).</span></p>\n<p class=\"p6\"><strong>For more information visit </strong><a href=\"https://linktr.ee/gardenbardtown\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>https://linktr.ee/gardenbardtown</strong></a></p>\n<p class=\"p8\"><i>Susan and John live in Doylestown Boro and support local business and events in Doylestown (and Beyond) with their Instagram account @doylestownborobuzz.</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/07/Garden-Bar-at-Pucks.jpg"
}