{
  "id": 17009,
  "title": "Get to Know a Doylestownian: Cathy Quon &#8211; An Enchanted Florist",
  "slug": "get-to-know-a-doylestownian-cathy-quon-an-enchanted-florist",
  "date": "2023-03-06T18:09:31",
  "author": "Staff",
  "category": [
    "Style"
  ],
  "tags": [
    "Cathy Quon",
    "dana roberts",
    "doylestown cardinal",
    "enchanted florist"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer “Get to Know a Doylestownian” is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide; in any way they see fit. This month, we interviewed Cathy Quon, co-owner of An Enchanted Florist, [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Dana Roberts • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s1\"><i>“Get to Know a Doylestownian” </i>is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide; in any way they see fit. This month, we interviewed Cathy Quon, co-owner of An Enchanted Florist, along with her husband Bob, in the center of Doylestown borough. There are few people as busy as a florist on Valentine’s Day, so we thought we’d get the inside scoop on what the day of love looks like for Cathy, her experience owning a flower shop, and the best flowers to get for all occasions. An Enchanted Florist is located at 39 W. State Street (at the corner of State and Hamilton streets), and online at anenchantedflorist.com.</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>My husband and I bought An Enchanted Florist in</b>&#8230;2005.</span></p>\n<p class=\"p1\"><span class=\"s3\"><b>The name comes from</b>&#8230;we purchased an existing business with this Enchanting name.</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>We decided to buy our business in Doylestown because</b>&#8230;it is such a quaint town steeped in history, charm, and business potential.</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>I decided to become a florist because</b>&#8230;I love flowers and making people happy. I used to be a wedding planner at Aldie Mansion. So, with my wedding experience, love of flowers, artistic ability, and psychology degree, it all fit perfectly into place.</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>My favorite part of my job is</b>&#8230;making people happy every day with the beauty I get to create.</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>The hardest part of my job is</b>&#8230;funerals.</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>The most unusual reason a customer has sent a floral arrangement in the past was</b>&#8230;there is no unusual reason to send flowers because flowers are a part of every life event: good, bad, happy, or sad. I am amazed at how many people send flowers “just because.”</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>Our busiest days of the year are</b>&#8230;Mother’s Day, Valentine’s Day, Christmas, and Thanksgiving.</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>The most popular flower we sell is</b>&#8230;a Rose (not necessarily red).</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>The most fragile/difficult flower to work with is</b>&#8230;a Lily.</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>On Valentine’s Day and the week leading up to it we work.</b>..a lot of hours!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><span class=\"s2\"><b>We deliver flowers as far away as</b>&#8230;Ottsville, Warminster, Perkasie, New Hope, and everywhere in between.</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>If you’re looking for an arrangement to get someone, you can’t go wrong with</b>&#8230;our designer’s choice (English garden style).</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>My personal favorite flower is.</b>.. actually, more than one. I love peonies, roses, and ranunculus.</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>My favorite thing to see out the window of our shop is</b>&#8230;the town flourishing, people laughing with each other, all the borough has to offer, and the Witches Ride at Halloween.</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>The best thing about working in the middle of town is</b>&#8230;to be part of the vibrancy of the town, get to know people, and all of our awesome fellow retailers.</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>If I could go out to dinner anywhere in town for Valentine’s Day, I would go to</b>&#8230;tough choice! So many awesome restaurants: Bocelli’s, Penn Taproom, Paganini’s, Chambers 19&#8230;the list is too long.</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>My husband and I have been married for</b>&#8230;31 years.</span></p>\n<p class=\"p1\"><span class=\"s4\"><b>On Valentine’s Day, my husband and I</b>&#8230; work very hard to make lots of people happy. We then might order Chinese take-out from Kung Fu and take a deep breath.</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>If I could indulge in any treat on Valentine’s Day, I would pick</b>&#8230; anything chocolate from Raymer’s, and my husband would want ice cream from Evolution Candy.</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>My best advice to other couples on Valentine’s Day (or any day) is</b>&#8230;cherish each other, including during the long and short moments, appreciate one another, and always remember that love is patient and love is kind every day—not just on Valentine’s Day.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/03/Cathy-Quon.jpg"
}