{
  "id": 12201,
  "title": "Get Out of Debt in 2022",
  "slug": "get-out-of-debt-in-2022",
  "date": "2022-02-07T13:43:43",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "brian pultro",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Brian Pultro, AIF, BFA, RFC® • The Cardinal Contributing Writer Welcome to February! How are those New Year’s resolutions coming along? If one of those resolutions was to work your way out of debt in 2022, then you are in luck.  Figuring out a mound of debt can be frightening and leave you with [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Brian Pultro, AIF, BFA, RFC® • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">W</span><span class=\"s3\">elcome to February! How are those New Year’s resolutions coming along? If one of those resolutions was to work your way out of debt in 2022, then you are in luck. </span></p>\n<p class=\"p5\"><span class=\"s3\">Figuring out a mound of debt can be frightening and leave you with anxiety. Where do you start? How do you tackle it all? That is why I have two straightforward tips you can follow, to help accomplish that resolution of getting out of debt in 2022.</span></p>\n<p class=\"p5\"><span class=\"s3\">Since the two methods for working your way through debt are snow-themed, February is the perfect time to choose from the avalanche method or the snowball method. Depending on your circumstances, one will be a better fit for you. Let’s plow through both.</span></p>\n<p class=\"p5\"><span class=\"s3\">•<span class=\"Apple-converted-space\">  </span>Avalanche method – with this method, you would make a list of all of your debts and their interest rates. Once you compile the list, put them in order from the highest interest rate to the lowest. Then, you would pay the minimum amount on each of your debts except for the highest interest rate debt, which you would dedicate as much to as possible.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The theory here is that you reduce the debt that is racking up the most interest billed to you. Once you have paid off the highest interest rate debt, you move down the list to the next one.</span></p>\n<p class=\"p5\"><span class=\"s3\">• Snowball method – in this method, you list all of your debts from largest balance to smallest balance. Once you complete the list, you pay the minimum on all of your debts except the one with the smallest balance, which you would dedicate as much to as you possibly could.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">The theory here is that you pay off the smallest balance first, gaining momentum and an emotional win as you move towards paying off all your debt. Continue to move down the list from smallest to largest until all of the debts are paid off.</span></p>\n<p class=\"p5\"><span class=\"s3\">Being a Behavioral Financial Advisor (BFA), I love the snowball method. Providing yourself with an emotional win is crucial to keeping up the momentum of paying down debt. When we can harness our emotions and create positive change regarding money, the feeling is euphoric. However, even though I prefer one method, it does not mean it is the best fit for you. Figuring out what will work best for your situation is very important.</span></p>\n<p class=\"p5\"><span class=\"s4\">It’s winter! Get outside, enjoy the cold and the magic of the snow while also harnessing it to pay down some of your debt.</span></p>\n<p class=\"p6\"><span class=\"s5\"><i>Brian Pultro is a Doylestown native, Navy Veteran, and local Financial Advisor. His practice is built upon the foundations of “Behavioral Finance” and training individuals and families on how to take natural human emotions out of the investment process.</i></span></p>\n<p class=\"p8\"><span class=\"s6\">The opinions voiced in this material are for general information only and are not intended to provide specific advice or recommendations for any individual. Securities offered through LPL Financial, member FINRA/SIPC.</span></p>\n<p class=\"p9\">Pultro Financial Management</p>\n<p class=\"p9\">(215) 489-3876 • <a href=\"mailto:brian.pultro@LPL.com\">brian.pultro@LPL.com</a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/02/Get-Out-of-Debt.jpg"
}