{
  "id": 17373,
  "title": "Get to Know a Doylestownian: Bill Hooker",
  "slug": "get-to-know-a-doylestownian-bill-hooker",
  "date": "2023-04-15T15:36:06",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "Bill Hooker",
    "dana roberts",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer “Get to Know a Doylestownian” is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide; in any way they see fit. Since April is Celebrate Diversity Month, we wanted to highlight a [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Dana Roberts • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\"><i>“Get to Know a Doylestownian” </i>is a monthly feature in which a Doylestown resident or person of interest helps us get to know them better by finishing sentences we provide; in any way they see fit. Since April is </span><span class=\"s3\">Celebrate Diversity Month</span><span class=\"s2\">, we wanted to highlight a person in the community who strives to honor the differences between us. </span><span class=\"s3\">Bill Hooker</span><span class=\"s2\">, local resident, and leader in the Supplier Diversity field, embraces and champions the importance of diversity on both a personal and professional level. To learn more about what his company offers, visit his website at </span><span class=\"s3\">www.Bill-Hooker.com</span><span class=\"s2\">, and read on to find out his perspective on diversity in the workplace and in our community.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><span class=\"s5\"><b>I’ve been working in the supplier diversity field for</b>… over 20 years, as a private practice Supplier Diversity and Supplier Development consultant. My business, of which I am the President, is SourceOne Innovations. It was created to help create, enhance, train, and audit a supplier diversity program in a fraction of the time and expense of alternate approaches. While in “corporate America,” I created a supplier diversity program for a multi-national pharmaceutical company and have helped many other companies, large and small, to create fully functional supplier diversity programs to enable compliance with the customer diverse spend reporting requirements.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>Supplier diversity programs, in layman’s terms, is</b>… a proactive business strategy that encourages the use of minority-, women-, veteran/service-disabled-, LGBTQ-, and disability-owned businesses, as suppliers. Supplier diversity is not an entitlement program and only the best supplier, diverse or not, should be awarded business.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>I became interested in this because</b>… there is such an overwhelming and not addressed need to help underrepresented and underserved communities grow. Among those communities included are minority-women-LGBTQ-veteran-and disability-owned businesses, commonly referred to as “diverse suppliers”. With rapidly growing attention to assisting these diverse suppliers (and ultimately the communities in which they live) there is a growing list of companies now supporting the creation of supplier diversity programs that enable companies to create a program to bring business awards to qualified suppliers.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>My education background is</b>… BA/Biology-Chemistry, MBA/Finance. I am a certified LGBT and Disability Owned business enterprise, a lifetime Certified Purchasing Manager, and an ICF-certified executive coach.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>My work week/daily schedule is</b>… dependent on my customers’ needs.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>My favorite part of my job is</b>… helping underrepresented and underserved communities and companies join forces with companies to forge lasting business relationships.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>The most challenging part of my job is</b>… not having enough hours in the day.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>The most interesting part of my job is</b>… meeting prospective customers and designing a program to best fit their needs.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>Fields and industries we serve include</b>… health care, pharmaceutical, insurance, banking, utilities, manufacturing, property management, consumer products, food processing, et al.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>An industry/business that I’m fascinated by right now is</b>… every single interest that uses our products.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>The farthest and most interesting places my work has taken me to is</b>… the UK and working in the healthcare arena.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>Diversity for me, on a personal level, is</b>… the satisfaction of playing my part in helping achieve equality amongst all sectors.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>A book/television program/movie related to diversity that resonated with me was</b>… reading “Tuesdays with Morrie,” “White Fragility,” and “The Light We Carry.”</span></p>\n<p class=\"p1\"><span class=\"s2\"><b>I grew up in</b>… Erie, PA, and have lived in NY, FL, OH, and now live with my husband, Mark, in New Britain Township.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>My husband and I settled in Bucks County because</b>… we love the country-like setting.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>Something I love that Doylestown/Bucks County offers to highlight the importance of diversity is</b>… Doylestown’s support of LGBTQ activities.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>Where I feel our community could improve regarding diversity is</b>… to put politics aside when it comes to human needs.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>Right now, I’m reading</b>… Spare, by Prince Harry.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>My theme song would be</b>… “Special,” by Lizzo.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>At the end of the day, I unwind by</b>… meditating.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>If I could immerse myself in a different culture, I would choose</b>… indigenous culture.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>A place I would theoretically love to live is</b>… Paris/Siesta Key, FL.</span></p>\n<p class=\"p1\"><span class=\"s5\"><b>With regard to diversity, I hope our local community and global community</b>… genuinely supports difference.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/Bill-Hooker.jpg"
}