{
  "id": 18027,
  "title": "Harvest Month: Interview with Love Grows",
  "slug": "harvest-month-interview-with-love-grows",
  "date": "2023-08-12T15:04:43",
  "author": "Staff",
  "category": [
    "Fit",
    "Live",
    "Taste"
  ],
  "tags": [
    "Ailsa Coughlan",
    "brad berry",
    "doylestown cardinal",
    "harvest month",
    "lily appleby",
    "love grows"
  ],
  "excerpt": "<p>By Lily Appleby • The Cardinal Editorial Intern It’s August, which for many local farmers means harvest time. This Harvest Month, Ailsa Coughlan and Brad Berry from Love Grows share what it means to be a small-scale farm, why it’s worthwhile to buy local, and offer advice for up-and-coming growers. Q: Why buy produce local? [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong><span class=\"s1\">By Lily Appleby • </span></strong></em><span class=\"s1\">The Cardinal Editorial Intern</span></p>\n<p class=\"p3\"><em><span class=\"s3\">I</span><span class=\"s2\">t’s August, which for many local farmers means harvest time. This Harvest Month, Ailsa Coughlan and Brad Berry from Love Grows share what it means to be a small-scale farm, why it’s worthwhile to buy local, and offer advice for up-and-coming growers.</span></em></p>\n<p class=\"p5\"><strong>Q: Why buy produce local? Why buy organic? Is it worth the extra cost?</strong></p>\n<p class=\"p6\"><span class=\"s2\"><strong>A:</strong> I would first say it’s not necessarily an extra cost. Our prices tend to be comparable, and often better than grocery store organics &#8211; and sometimes even lower than conventional produce prices. The money exchanged isn’t the only cost to consider. There’s also the environmental cost, the local economy’s cost, the dietary cost, and the cost of your well-being. But all those things aside, I would say it’s worth it from a community perspective, and I would stress the local aspect of food choices versus the organic. Though we are not certified organic our practices go beyond the national organic program as the organic standards have diminished over the years. Essentially, investing in producers who you can see every week at the farmers market is a good investment. When you’re supporting locally, you’re ensuring that land is being used to grow food rather than having houses built on it, which is invaluable, especially here in Bucks County.</span></p>\n<p class=\"p5\"><strong>Q: What’s the dirt on soil? What’s going on with our topsoil and what are your practices at Love Grows?</strong></p>\n<p class=\"p6\"><span class=\"s2\"><strong>A:</strong> So, we are a low-till operation. As far as creating and getting nutrients into the foods that we grow, we use composting, cover cropping, and though we don’t currently have any, we typically have pastured animals rotated into the fields as well. Those three things help build the nutrient density of the soil, and in turn the food that we grow, so they are very important aspects of growing vegetables. Composting and cover cropping are especially critical to growing good food.</span></p>\n<p class=\"p6\"><span class=\"s2\">Applying the golden rule and not taxing the land year after year with the same crops is one way to grow top soil.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong>Q: What other awesome things is Love Grows doing that separates you from other more conventional farms?</strong></p>\n<p class=\"p6\"><span class=\"s2\"><strong>A:</strong> The first thing that separates us from conventional farms is that we are very small scale. It’s myself and my partner Ailsa who are the primary growers. We have folks volunteer in the summer on a more regular basis, but generally speaking, it’s the two of us in the field. So, as far as scale goes, it’s dramatically different compared to mechanized production you find in states like California.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\">In life in general, but especially in farming, there’s a quality and quantity balance. Because we are on a smaller scale, our quality goes up because our quantity isn’t so great. There’s just attention to detail that gets lost when you’re growing on thousands of acres, compared to our three.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\">The way we lay out compost and rotate vegetables so that the land has time to rest in between means the nutrient density of our food rises compared to bigger growers, which gives us a superior flavor. We hear every weekend from customers that, for example, our cabbage is the sweetest cabbage that you can find or that our carrots are phenomenal. I think it’s the characteristic of the growing technique of the grower that you’re shopping with. Bigger growers can’t replicate that on a large scale, because it’s so individualistic.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong>Q: What are some of the things you’ve learned over the years that have surprised you about farming…?</strong></p>\n<p class=\"p6\"><span class=\"s2\"><strong>A:</strong> This is my 20th year of growing, and Ailsa’s 10th year. There’s been a lot of different things along the way. Every year is just a miracle really, to see that from a seed you can grow so many different things.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\">I don’t know if it’s surprising as much as it’s exciting, but the response of plants to the moon cycle really guides how we grow. Seasonality is important, but the moon cycle brings up the water table, and affects plants dramatically with the extra light reflected from the sun when it’s a full moon as opposed to a new moon.</span></p>\n<p class=\"p5\"><strong>Q: Was there anything that surprised you early on in your career?</strong></p>\n<p class=\"p6\"><span class=\"s2\"><strong>A:</strong> Just how much food goes uneaten. We donate food every week to a local organization called Rolling Harvest, so we really don’t let too much food go to waste – we always try to get it to somebody’s kitchen table in the area. That’s another thing that’s good about supporting the local community; we’re also feeding the folks who are in need in the area.</span></p>\n<p class=\"p6\"><span class=\"s2\">When I first got into it, I was just thinking about really wanting to change the world and make it a better place by growing food. It’s amazing how if the outlets aren’t there, and the labor isn’t there, food can go unused, and that’s a shame. That’s not necessarily an uplifting surprise, but you know what, here’s a positive: just how much one person or a small group of people can grow, without even using machines. We do use tractors, but a lot of our work is just done by hand. It’s surprising but exciting, just how much food you can grow with your hands.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong>Q: It’s August. Paint us a picture of a day in the life at Love Grows.</strong></p>\n<p class=\"p6\"><span class=\"s2\"><strong>A:</strong> So, we are starting early. As far as farmers go, we aren’t natural early risers, but in the summer months when it’s super hot out, we are waking up early, getting as much work as we can outside before noon, and then taking a siesta later in the day – say 3:00pm or 4:00pm – just to miss that intense heat. We are actually tending to all the things that we will be harvesting through the fall. In the August heat, we are putting out little seedlings like broccoli, cauliflower, cabbage, carrots, and beets which we won’t harvest until October or November. It’s an interesting juxtaposition, they’re planted during sweltering days but can be harvested when the nights are near freezing. August is all about making it through the heat, trying to keep our bodies cool, spirits up, and working between big rain events and with the weather.</span></p>\n<p class=\"p5\"><strong>Q: Any advice for new farmers and gardeners?</strong></p>\n<p class=\"p6\"><span class=\"s2\"><strong>A:</strong> Anyone who’s serious about farming needs to spend an entire growing season on an established farm. If you’re just curious about farming or gardening, dig in however you can. Every season there are successes and there are failures, but you get a new chance every year, especially if you’re growing annuals. Give it a shot and see what comes out. As far as a fun thing in PA, I’d say try growing peanuts. There are varieties that you can grow, and it’s an unusual thing to try, especially if you’ve been gardening for years. There’s always something new to grow. You can even grow artichokes around here with success. Find something different to give yourself a challenge and see if you can make it happen.</span></p>\n<p class=\"p5\"><strong>Q: Where can we buy your produce and find out what’s going on with you and the farm?</strong></p>\n<p class=\"p6\"><span class=\"s2\"><strong>A:</strong> The best place to find us is at the farmer’s markets. I am at the Doylestown market with my brother on Saturdays (April &#8211; Thanksgiving) from 8:00 am &#8211; 1:00 pm. The last two years we’ve had an indoor venue, so we are looking to do it most of the year. Ailsa’s always in Yardley (April &#8211; Thanksgiving) from 9:00 am – Noon on Saturdays. There’s a great market in Wrightstown, that we attend in the winter time. For us specifically, there’s our farm stand, which is open 10:00am – 1:00pm on Sundays.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\">Make sure to stop by Love Grows stand at Playwicki farm, or visit Brad and Ailsa at one of the local farmers markets. <span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/08/LoveGrows-Fall2020-75.jpg"
}