{
  "id": 19453,
  "title": "Have You Ever Wanted to be Part of a Guinness World Record? Well, Here is Your Chance!",
  "slug": "have-you-ever-wanted-to-be-part-of-a-guinness-world-record-well-here-is-your-chance",
  "date": "2024-04-22T05:43:41",
  "author": "Staff",
  "category": [
    "Play"
  ],
  "tags": [
    "doylestown cardinal",
    "Tague Lumber of Doylestown"
  ],
  "excerpt": "<p>At 5:00pm on April 25, 2024 Tague Lumber of Doylestown (6100 Easton Rd., Plumsteadville) will attempt to break the Guinness World Records for “the most people knocking on wood” simultaneously. The current record stands at 295 people and is held by an Insurance Company in Bolivia. We are hoping to smash that record and make our friends [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">A</span><span class=\"s2\">t 5:00pm on April 25, 2024 Tague Lumber of Doylestown (6100 Easton Rd., Plumsteadville) will attempt to break the Guinness World Records for “the most people knocking on wood” simultaneously. The current record stands at 295 people and is held by an Insurance Company in Bolivia. We are hoping to smash that record and make our friends and neighbors in Doylestown proud!</span></p>\n<p class=\"p3\"><span class=\"s2\">As a lumber company we thought an event where people “knock on wood” would be an amusing way to gain some good luck while also bringing the local community together for lots of fun. Everyone is welcome to help us break the record. There is no age limit to participate, basically if you can hold a block of wood in your hand and knock on it, then you have what it takes.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">In addition to the Guinness World Records attempt, we will have the following goodies on hand as well:<span class=\"Apple-converted-space\">  </span>Free food, lots of door prizes, a commemorative “selfie” photo station, live music from the cover band “The Electric Mayhem,” an exciting performance by the Central Bucks East High School Marching, and a Product &amp; Vendor Expo with demonstrations.</span></p>\n<p class=\"p4\">Join us as we Knock on Wood and attempt to break a Guinness World Record! <span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p3\"><span class=\"s2\">Want to do more? We do need a few extra volunteers to act as Guinness World Record “Stewards.”<span class=\"Apple-converted-space\">  </span>GWR Stewards have an important and official role at the event; they act as an extension of the official Guinness Records judge and adjudicator. Each Steward verifies the participants in their assigned section really DID “Knock on Wood.” If you are interested in being an official GWR Steward, send an email to: <span class=\"Apple-converted-space\">  </span>Katie Connor at <a href=\"mailto:kconnor@taguelumber.com\">kconnor@taguelumber.com</a></span></p>\n<p class=\"p3\"><span class=\"s2\">Registration is required to participate in this historic event. You can find our listing on Eventbrite or on our website at<span class=\"Apple-converted-space\">  </span><a href=\"http://TagueLumber.com/event\" target=\"_blank\" rel=\"noopener noreferrer\">TagueLumber.com/event</a>, or just find for our ad in this publication and scan the QR code. But HURRY!<span class=\"Apple-converted-space\">  </span>This event is filling up quickly!</span></p>\n<p class=\"p3\"><span class=\"s2\">Come make history with us!<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/04/Lynne-Rhodes.jpeg"
}