{
  "id": 17721,
  "title": "Hot Music with Big Chill",
  "slug": "hot-music-with-big-chill",
  "date": "2023-06-16T16:43:45",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "big chill",
    "doylestown cardinal",
    "Gracie Lane",
    "jamie stem",
    "Keith Egyud",
    "Michael Mancuso",
    "Ryan Enstrom",
    "Tim Varvel",
    "tom ott"
  ],
  "excerpt": "<p>By Jamie Stem • The Cardinal Contributing Writer Hi Tom, you are a member of the Big Chill, tell me a little about what you do in the band?  Big Chill came to be after I ran into an old friend and musician, Bob “Oscar” Meyer, at Fischer’s Hardware store in Plumsteadville. Neither of us [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Jamie Stem • </strong></em>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><strong>Hi Tom, you are a member of the Big Chill, tell me a little about what you do in the band?<span class=\"s1\"><span class=\"Apple-converted-space\"> </span></span></strong></p>\n<p class=\"p4\"><span class=\"s1\">Big Chill came to be after I ran into an old friend and musician, Bob “Oscar” Meyer, at Fischer’s Hardware store in Plumsteadville. Neither of us had played for quite a few years and thought it might be fun to get some of our old bandmates together and play some music. Not long after finalizing our lineup, we found ourselves playing our first gig at the Cactus Grill in Pipersville in 2009.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">We’ve been playing at least once a month for over 15 years. I play drums, sing, do the bookings, drive the band trailer, and set up for gigs. I truly enjoy all of it. The best part is that I have the pleasure of playing and having fun with Big Chill and the enjoying the friendships that stood the test of time. Some folks have golf or fishing – I have Big Chill.</span></p>\n<p class=\"p3\"><strong>I have seen your band up on marquees in the area for years now and I always wondered if you played any of the music from the movie The Big Chill? It happens to be one of my favorite soundtracks.</strong></p>\n<p class=\"p4\"><span class=\"s1\">Yes we do. Gracie, our Singer, came up with the Big Chill slogan “Forget Who You Are, Remember Who You Were”. When people ask what songs do we play I tell them “Classic and Soon to Be Classic Rock with a Touch of Motown”<span class=\"Apple-converted-space\">  </span>We play a wide range of songs from Aretha to Adele, Beatles to Bowie and Steely Dan to Springsteen. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><strong>Tell me a little bit about the players in your band.</strong></p>\n<p class=\"p4\"><span class=\"s1\">Keith Egyud fronts on Bass and Lead vocals. Keith is our musical director and arranger. He’s had a long career of performance over the years with The Rivals, Construction and most notably, Strange as Angels, who was a very successful band.</span></p>\n<p class=\"p4\"><span class=\"s1\">Michael Mancuso is our amazing lead guitar “magician” (and his fingers never leave his hands!). He’s the quiet one in the band who speaks loudest with his mad guitar skills. If a song has a guitar in it, Michael can play it proficiently, no matter what style or genre.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Gracie Lane is on lead vocals, acoustic guitar and percussion. While living in NYC, she started singing at open mics and eventually performed with a Rhythm &amp; Blues band, Country Rock trio and spent many years working in the piano bar circuit with her long time accompanist in the Tristate area. In 2008, she auditioned for the newly formed Big Chill and has been our female lead vocalist since then.</span></p>\n<p class=\"p4\"><span class=\"s1\">Tim Varvel is our Sax Man. Tim started to sit in with us when we played at the Cactus Grill. He sat in quite a bit and eventually started playing at our gigs. He was such a great fit that it just seemed it was meant to be. Lucky for Big Chill, Tim became a permanent fixture in the band and also contributes some bass and rhythm guitar.</span></p>\n<p class=\"p4\"><span class=\"s1\">Ryan Enstrom is our Keyboard maestro but also helps out with some Guitar on occasion. Before moving to PA, Ryan lived and played on the West Coast while also writing and recording his own tunes. The legendary Jeff Beck played and collaborated on Ryan’s compositions.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Tom Ott (also known as The Big Toe) is the heartbeat of Big Chill and plays the Drums and adds vocals. Originally from Trenton, Tom and Michael started playing together back in High School. He’s worked with The Fabulous Grease Band along with other band work in the Trenton area before becoming a permanent Pipersville resident.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Our website is <a href=\"http://www.bigchillband.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.bigchillband.com</a></span></p>\n<p class=\"p1\"><strong>Upcoming Schedule</strong></p>\n<p class=\"p5\">June 2nd • 7:00 – 11:00 • Cactus Grill</p>\n<p class=\"p5\">June 3rd • 2:00 – 5:00 • Peddlers Village</p>\n<p class=\"p5\">June 29th • 7:00 – 9:00 • Northampton Municipal Park</p>\n<p class=\"p5\">July 21st • 7:00 – 11:00 • Cactus Grill</p>\n<p class=\"p5\"><span class=\"s3\">July 22nd • 8:00 – 11:00 • Great Barn Brewery</span></p>\n<p class=\"p5\">July 24th • 7:00 – 9:00 • Hatfield Park Concert</p>\n<p class=\"p5\">August 10th • 7:00 – 9:00 • Buckingham Hansel Park Concert</p>\n<p class=\"p5\">August 25th • 7:00 – 11:00 • Cactus Grill</p>\n<p class=\"p5\">August 27th • 12:00 – 5:00<span class=\"Apple-converted-space\"> • </span>Kick Cancer Car Show • Cactus Grill</p>\n<p class=\"p5\">August 30th • 7:00 – 9:00 • Doylestown Park (Kids Castle)</p>\n<p class=\"p5\">Sept. 16th • TBD • Peddlers Village</p>\n<p class=\"p5\">Sept. 29th • 7:00 – 11:00 • Cactus Grill</p>\n<p class=\"p5\">October 7th • 11:00 – 3:00 • Hatfield Park Rocktober</p>\n<p class=\"p5\">October 27th • 7:00 – 11:00<span class=\"Apple-converted-space\"> • </span>Halloween Party • Cactus Grill</p>\n<p class=\"p5\">November 4th • TBD • Peddlers Village</p>\n<p class=\"p5\">November 17th • 7:00 – 11:00 • Cactus Grill</p>\n<p class=\"p5\">December 15th • 7:00 – 11:00 • Cactus Grill</p>\n<p class=\"p1\"><em>Jamie Stem highlights local musicians and the restaurants that host their live music. For more information reach out to Jamie at <a href=\"mailto:Jamie.stem@gmail.com\">Jamie.stem@gmail.com</a></em></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/06/Big-Chill.jpg"
}