{
  "id": 20502,
  "title": "How to Love Your People This Election Season and Beyond",
  "slug": "how-to-love-your-people-this-election-and-beyond",
  "date": "2024-11-04T08:07:10",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [],
  "excerpt": "<p>By Natalya Bucuy, Cardinal Managing Editor High Conflict: Exit Strategy  “You don’t know what you’re talking about!” my friend, seated to my right screams. “Oh, and you do? What you’re saying is just crazy!” my other friend barks back from the left. “I can’t believe you’d even consider voting like that! What are you thinking?” [&hellip;]</p>\n",
  "content": "<p><b>By Natalya Bucuy, Cardinal Managing Editor</b></p>\n<p><i><span style=\"font-weight: 400;\">High Conflict: Exit Strategy</span></i></p>\n<p><span style=\"font-weight: 400;\"> “You don’t know what you’re talking about!” my friend, seated to my right screams. “Oh, and you do? What you’re saying is just crazy!” my other friend barks back from the left. “I can’t believe you’d even consider voting like that! What are you thinking?” My eyes dart from one side to the other and I bite my nails as the dispute continues with insulting nicknames for presidential candidates and the laundry list of typical arguments, long beaten to death. My dinnermates, whom I love dearly, have been friends for years. But right now, they are caught in a volatile debate and I do not recognize them. It’s election year in America. Nothing is real and everything is on fire. Or, at least, it feels that way. I contemplate the most gracious way to move myself and my dinner plate to an empty seat across the table, next to my other friends whose faces are not red with disgust, where it’s safe.  </span></p>\n<p><span style=\"font-weight: 400;\">Sadly, this scene is not unique. Not unique to my friends, this election, or even to politics. It is high conflict, a phenomenon investigative journalist Amanda Ripley examines at length in her book of the same name. In her work, she interviews a multitude of people caught in high conflict &#8211; politicians, divorce mediators, gang members, and even a former Columbian gorilla fighter. She learns the nature and the purpose of conflict. And she finds a way to take us to a safer place across the table. </span></p>\n<p><b>High Conflict vs. Healthy Conflict </b></p>\n<p><span style=\"font-weight: 400;\">Ripley defines high conflict as “a conflict that becomes self-perpetuating and all-consuming, in which almost everyone ends up worse off.” It’s a conflict for the sake of conflict. Insert politics, wars, divorces, family feuds, workplace disputes, and even road rage as examples. High conflict occurs when two sides of a disagreement form into “us” and “them.”  </span></p>\n<p><span style=\"font-weight: 400;\">Not all conflict is high conflict and not all conflict is bad. Good conflict, Ripley explains, is necessary for growth. The search for truth lies in controversy, not agreement. Characteristics of good conflict include sadness, frustration, and even anger, but also flashes of curiosity, surprise, and movement. It’s a “you and me against the problem” attitude, not “me against you.” </span></p>\n<p><span style=\"font-weight: 400;\">High conflict, on the other hand, distorts our perception. We feel morally superior to others but also threatened. So threatened, we place signs with nasty insults on our lawns. So fearful, we scream obscenities at the person who clearly belongs off all public roads with those driving skills. In this state, we lose our peripheral vision, we make mistakes, and we miss opportunities to learn more about others. </span></p>\n<p><span style=\"font-weight: 400;\">How do people end up in such a vile place? Despite how it feels, it is not due to ignorance, lack of intelligence, or the rotten nature of the participants’ characters. It’s due to the nature of high conflict itself, which harbors contempt, disgust, predictability, a sense of righteousness, and the feeling of being stuck. Ripley analogizes it to a tar pit in which prehistoric animals got caught and died slowly &#8211; sticky and movement-constricting. It’s a black hole of doom that consumes anyone who enters, yet attracts more participants to drown in its bottomless depths. High conflict is not productive or beneficial to anyone, it masks underlying stories we all carry, and it blocks connection between humans. </span></p>\n<p><b>A Way Out</b></p>\n<p><span style=\"font-weight: 400;\">Thankfully, there is a way out of toxic conflict. And it’s not by avoiding conflict altogether. “Living without conflict is like living without love &#8211; cold and eventually unbearable,” Ripley writes. The goal is to shift from high conflict to healthy conflict. Not to give up our ideas, values, and beliefs, not to agree or to find a compromise, but to gain understanding. Understanding of the other person, ourselves, or the problem at hand. Once achieved, it paves the way out of high conflict and into healthy collaboration.  </span></p>\n<p><b>Breathe, then Listen. </b>Making time and space serves as a first step out of high conflict. Taking our minds off the conflict allows us to step out of the tornado and refocus on the present. Most of the high conflict energy is generated in our own brains because we forget to breathe, forget to stop, forget to pause. Ripley names the “never go to bed angry” advice as the worst. Take the night, she says. Things will look different in the morning.</p>\n<p><span style=\"font-weight: 400;\">Once we’ve taken a break &#8211; even if it’s a 30-minute walk to cool off during a heated argument &#8211; it’s time to get curious. The technique of looping can aid deeper understanding and more active listening, Ripley says.</span></p>\n<p><span style=\"font-weight: 400;\">Looping benefits both people, as we hear what we need to understand and the other person gets heard. It also keeps us humble and keeps us present. “I think I hear you say x,y, and z,” we say to our partner. “Is that right?” Even if we got it wrong, our partners relax a bit, letting some wind out of the sail of high conflict. Someone is listening. </span></p>\n<p><b>Avoid Firestarters. </b>Every high conflict comes with a set of firestarters, of which there are four: humiliation, conflict entrepreneurs, false binaries, and corruption.</p>\n<p><span style=\"font-weight: 400;\">Nelson Mandela famously said, “There is nobody more dangerous than one who has been humiliated, even when you humiliate him rightly.” Examples of humiliated politicians causing chaos run plenty and possibly everyone can remember the hot burn of shame we’ve all experienced at some point in our lives. It’s not pleasant and it causes resentment and retaliation. </span></p>\n<p><span style=\"font-weight: 400;\">Conflict entrepreneurs are people who add fire to high conflict, subconsciously or purposefully for their own benefit.  It’s the online trolls and keyboard warriors, whose sole purpose is to feed conflict, whether it’s for power or monetary gains.  </span></p>\n<p><span style=\"font-weight: 400;\">False binaries divide and simplify &#8211; “us” and “them.” This dehumanizes people, reducing the complexity of their experiences to black-and-white simplicity. Seeing people as multifaceted individuals they are changes the binary perspective.   </span></p>\n<p><span style=\"font-weight: 400;\">Corruption, another firestarter, creates a favorable environment for high conflict. If people do not trust institutions &#8211; government or media- they seek something or someone they can trust. This creates a danger of conflict entrepreneurs sweeping in. According to a recent survey, 69% percent of Americans do not trust the media, compared to 30% in the 1970s. In this climate, people turn to alternate sources for information, which often are not accurate. Misinformation fuels high conflict.   </span></p>\n<p><b>Understand the Understory. </b>What lies beneath the conflict? Seeking the understory &#8211; the why behind our seemingly silly opponent’s actions &#8211; along with looping, brings understanding. By complicating the narrative and bringing more information and emotion into the picture, we start to dig deeper. There are usually only four general understories that back instances of high conflict, Ripley says: respect and recognition, power and control, care and concern, and stress and overwhelm.</p>\n<p><span style=\"font-weight: 400;\">Fights are never about what they seem to be about. We feel stressed and overwhelmed, so we fight with our spouses over dishes. We feel lost and powerless in grief, so we fight with our siblings over our parents’ estate. We feel disrespected, so we invade a country. Seeking the understories, as well as sharing our own is an important, although difficult step. It requires vulnerability and curiosity. </span></p>\n<p><b>Put the intergroup contact theory into practice. </b>In 2023 Oscar-nominated short documentary, “Stranger at the Gate,” a former marine plans an attack on a local mosque. In a turn of events (spoiler alert), he spends time with people who he set out to hate. He learns more about them, their culture, and their beliefs. He ends up joining the faith and becoming a family with the congregation. This is an example of the intergroup contact theory at work. And to date, Ripley says, that’s the only known practice proven to reduce prejudice. In other words, to accept people, we must get to know them. Spend time with them, ask questions, and learn more about their differing point of view.</p>\n<p><span style=\"font-weight: 400;\">Intergroup contact illuminates humanity and eliminates that false binary of “us” and “them.” It reveals people as the complex humans they are, not just simple caricatures we fight against in high conflict. And it gives power to the human capacity for collaboration. </span></p>\n<p><span style=\"font-weight: 400;\">Though the election season is wrapping up, we still must deal with the aftermath. We still have extended family Thanksgiving dinners and holiday outings with friends ahead of us. My two friends at the dinner table eventually gave up on their fruitless mission of proving each other wrong. As Ripley notes, “As much as humans want to fight, they just as badly want peace.”</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/11/Peace.jpg"
}