{
  "id": 12410,
  "title": "Irish Traditions Live On With Mike Brill",
  "slug": "irish-traditions-live-on-with-mike-brill",
  "date": "2022-03-01T22:26:10",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "matt mannini",
    "mike brill"
  ],
  "excerpt": "<p>By Matt Mannino &#8211; The Cardinal Contributing Writer Tell us about yourself and your music. When and how did you get started? ​In 1990, while in college, I picked up a friend’s guitar and started playing a song for my friends. They all stopped and looked at me, astonished, and said: “We didn’t know you [&hellip;]</p>\n",
  "content": "<p><strong>By Matt Mannino</strong> &#8211; The Cardinal Contributing Writer</p>\n<p class=\"p1\"><strong>Tell us about yourself and your music. When and how did you get started?</strong></p>\n<p class=\"p2\"><span class=\"s1\">​In 1990, while in college, I picked up a friend’s guitar and started playing a song for my friends. They all stopped and looked at me, astonished, and said: “We didn’t know you played guitar?” I returned with: “I didn’t know either”. I took lessons ten years prior for only one year and quit.<span class=\"Apple-converted-space\">  </span>That year’s Christmas, I asked for a guitar and have been teaching myself and playing professionally for the past 30 years.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s2\">My most outstanding musical achievement occurred last year when I performed my 1,000th show, clean and sober. On July 1, 2003, I stepped into a Drug and Alcohol Rehabilitation Treatment center for 31 days, and since I have not picked up or needed a drink or a drug.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">This achievement and clarity have provided me the opportunity to become a Licensed Professional Counselor (LPC) and have worked in the field for the past nine years. I have published my memoir “Hello My Name is Santa&#8230;an alcoholic’s journey from Homelessness to Santa Claus.” I am also an Adjunct Professor at Gwynedd Mercy University.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">These achievements and many roles have created a living mantra and view of my performances. I have been provided and gift that I have harnessed and nurtured for many years; however, at every musical gig, it is not about me. It’s about a connection of energy that I create with the people that are present, enjoying time out and new realities post-Covid. It’s the high I’ve searched for my entire life.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Who/what is your inspiration?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s1\">Not sure I can pick one genre, person, or instrument that I call my inspiration. As a Deadhead, I would say Jerry Garcia. As a singer-songwriter, Billy Strings, James Taylor, Bob Dylan, Neil Young, the list is endless in this category. As a solo musician, I have had the opportunity to learn a multitude of artists, which gives me a fresh approach and prepares me for a variety of requests.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">In the Irish traditional and rebel shows, I have had the good fortune to literally keep the spirit of my parents alive. They loved being Irish and were good at it in the traditional sense. Every time I sing an Irish song, it’s in the memory of my Mom and Dad, and it soothes the pain of losing them both 25 years ago to cancer within eight months of each other.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Describe your favorite and least favorite part about being a musician.<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s1\">My favorite part of being a musician is the infinite opportunities to marry this beautiful art over and over again. I should never get bored being a musician because I can sit down and learn new music songs, styles/genres, and even instruments. I have learned how to play harmonica while strumming a guitar on the mandolin, and during Covid, I stayed sane by teaching<span class=\"Apple-converted-space\">  </span>myself piano.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">The challenge of being a musician occurs when you see music or the Arts, in general, being taken away in schools. I have not met someone who disliked music or the Arts, so it is baffling to hear organizations and people voting to eliminate them, especially our children. This challenge is also an urgency in the form of a necessity to keep playing, sharing, and inspiring others through my performances. Music is contagious and inspiring.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>Tell us about your favorite performance of your career.<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p2\"><span class=\"s1\">I have one favorite performance in 2005 in Orange County, California. I was visiting a friend, two years sober, and he had set up a great itinerary of music gigs as he was a solidified musician out there for some years. During an entire out jam session, raising funds for the survivors of Hurricane Katrina.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">There were 20 musicians on stage jamming to In-A-Gadda-Da-Vida by Iron Butterfly. Mid jam, my friend made his way over to me and whispered in my ear to look back. There behind me was Lee Doorman, bassist and one of the writers of the song itself. That performance stands out, but I have shared the stage with dozens of amazing musicians that I get to call friends.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">One such project allowed me to share the stage with my three older brothers: Tim, Joe, and Bob as “The Sons of Dot.” In early sobriety, that power of music and family mutually added to my strong foundation and purposeful meaning in life and sobriety.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><strong>How do you like being a musician in Doylestown? Where can we find you on St. Patty’s Day?</strong></p>\n<p class=\"p2\"><span class=\"s1\">​I may be dating myself, but my favorite gigs in Doylestown were the First Fridays. Those were prime opportunities for business and the arts to flourish while citizens roamed the streets. On the whole, Doylestown produces an authentic appreciation for music, and it’s always an honor to have performed at Villa Capri, Farmhouse Tavern, The Water Wheel, and Chambers 19. Since Covid, I believe music and businesses embrace new realities, and I’m so glad that music has become a vital ingredient to so many people’s and businesses’ healing and new realities. I hope to have many more gigs in Doylestown.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><strong>Mike Brill St. Patrick’s Tour 2022</strong></p>\n<p class=\"p5\">March 4 @ Tony’s Place in Ivyland<span class=\"Apple-converted-space\">  </span>•<span class=\"Apple-converted-space\">  </span>9pm &#8211; 11pm</p>\n<p class=\"p5\">March 5th @ Capri Pizza in Plumsteadville<span class=\"Apple-converted-space\">  </span>•<span class=\"Apple-converted-space\">  </span>630pm &#8211; 930pm<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\">March 11th @ 5 West Pub in Palmyra NJ<span class=\"Apple-converted-space\">  </span>•<span class=\"Apple-converted-space\">  </span>7pm &#8211; 10pm</p>\n<p class=\"p5\"><span class=\"s4\">March 12th @ Celtic Rose Irish Shop Peddlers Village • 11am &#8211; 2pm</span></p>\n<p class=\"p5\">March 12th @ Green Parrot Irish Festival<span class=\"Apple-converted-space\">  </span>•<span class=\"Apple-converted-space\">  </span>4pm &#8211; 7pm</p>\n<p class=\"p5\"><span class=\"s4\">March 13th Philadelphia St Patrick’s Day Parade w/North Catholic<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\">March 13th After Parade Party Tradition<span class=\"Apple-converted-space\"> </span>@ O’Mares Irish Pub in Philadelphia • 3:30pm &#8211; 7pm</p>\n<p class=\"p5\"><span class=\"s5\">March 17th @ O’Mares Irish Pub in Philadelphia •<span class=\"Apple-converted-space\">  </span>2pm &#8211; 5pm<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\">March 17th Night Gig O’Fowleys in Croyden &#8211; 630pm &#8211; 930pm</p>\n<p class=\"p5\"><span class=\"s4\">March 18th @ Green Parrot Newtown Irish Festival • 6pm &#8211; 9pm<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">March 19th @ Green Parrot Newtown Irish Festival • 2pm &#8211; 5pm</span></p>\n<p class=\"p5\"><span class=\"s5\">March 19th @ Curran’s Tacony MOSS AA Reunion • 7pm &#8211; 10pm</span></p>\n<p class=\"p5\">March 20th Peddlers Village Irish Day • 12pm &#8211; 2pm</p>\n<p class=\"p5\">March 25 @ Abington Club 1910 Bar and Grill • 7pm &#8211; 10pm</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/03/Irish-Musician.jpg"
}