{
  "id": 17694,
  "title": "Jamie Stem Brings Fun, Games, and Music to Local Audiences",
  "slug": "jamie-stem-brings-fun-games-and-music-to-local-audiences",
  "date": "2023-06-14T17:32:28",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "jamie stem"
  ],
  "excerpt": "<p>How did you first get into music? I originally was a huge fan of comedians George Carlin and Bill Hicks, and writers like Kurt Vonnegut and Henry David Thoreau. I really got a kick out of the written and spoken word.   At the time def poetry jams and open mics were happening but nobody [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>How did you first get into music?</b></p>\n<p class=\"p2\"><span class=\"s1\">I originally was a huge fan of comedians George Carlin and Bill Hicks, and writers like Kurt Vonnegut and Henry David Thoreau. I really got a kick out of the written and spoken word. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s2\">At the time def poetry jams and open mics were happening but nobody was going to that stuff as much as people were checking out hardcore bands in the area. <span class=\"Apple-converted-space\">  </span>So I took my songs to a local band called By All Means, the first song they had me sing was Alive by Pearl Jam which is funny because now I’m the lead singer of a Pearl Jam tribute band called The Ledbetters.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">I recall dreaming of being a singer of a band since I was little, doing rock shows with my stuffed animals. It truly was not long after watching Oliver Stone‘s The Doors, that I started singing in bands and I haven’t stopped since.</span></p>\n<p class=\"p1\"><b>Tell us more about the Ledbetters.</b></p>\n<p class=\"p2\"><span class=\"s1\">We started playing out back in 2019 and things have really been going well with that project. We’ve gotten a chance to travel all over and bring the Pearl Jam catalog to theaters and larger venues.<span class=\"Apple-converted-space\">  </span>It’s been so cool to see the revival of Grunge music. It’s amazing to see 40-something-year-olds coming out and bringing their kids to the shows to share in the music we grew up loving.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>Do you do anything else in music besides The Ledbetters band?</b></p>\n<p class=\"p2\"><span class=\"s1\">Yes, yes, and yes again. I have been playing solo acoustically locally for close to 25 years now. I run karaoke, host trivia, and open mics. I also own and operate Belly Busters poker league and Jamie Stem Entertainment, which sounds like a lot but it’s mostly just fun and games. I host different events all over the Bucks County area and have performed at hundreds of weddings. I love the art of performing and entertaining, it’s all I’ve ever done. To me the most wonderful gift life has given me is music. Its dark, but I’m most likely going to die a musician and I think I like that.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>Do you have any shows or performances coming up this month we can catch you at?</b></p>\n<p class=\"p2\"><span class=\"s1\">Yes, The Ledbetters’ only performance in May is Saturday, May 13 at Mickey’s Black Box in Lititz, PA You can get tickets here:<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><a href=\"https://www.ticketmaster.com/event/02005E4DCBA6245E\" target=\"_blank\" rel=\"noopener noreferrer\"><span class=\"s1\">https://www.ticketmaster.com/event/02005E4DCBA6245E</span></a></p>\n<p class=\"p2\"><span class=\"s1\">I host karaoke Sundays at 7:30 pm at Villa Capri in Doylestown,<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">I host trivia Mondays at 8 pm at Penn Tap Room in Doylestown<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><span class=\"s1\">I host trivia Thursdays at 7 pm at Plumsteadville Pub</span></p>\n<p class=\"p2\"><span class=\"s1\">And I perform locally at several different venues including Bishop Estate Winery, The Horse Tavern, Plumsteadville Inn, The Ram, Penn Tap Room, and Chambers 19.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/06/Jamie-Stem-2.jpg"
}