{
  "id": 17419,
  "title": "Kids Cast Their Spells at Mercer Wizarding Academy",
  "slug": "kids-cast-their-spells-at-mercer-wizarding-academy",
  "date": "2023-04-16T13:55:23",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Play"
  ],
  "tags": [
    "doylestown cardinal",
    "Mercer Wizarding Academy"
  ],
  "excerpt": "<p>Located in Doylestown, PA, the Mercer Museum &amp; Fonthill Castle, operated by the Bucks County Historical Society, are historic castles celebrating the legacy of Henry Chapman Mercer (1856-1930), American archaeologist, anthropologist, ceramicist and scholar.   This summer, young witches and wizards ages 7-12 return to the Mercer Museum to cast a spell at another exciting [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">L</span><span class=\"s2\">ocated in Doylestown, PA, the Mercer Museum &amp; Fonthill Castle, operated by the Bucks County Historical Society, are historic castles celebrating the legacy of Henry Chapman Mercer (1856-1930), American archaeologist, anthropologist, ceramicist and scholar. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">This summer, young witches and wizards ages 7-12 return to the Mercer Museum to cast a spell at another exciting year of the Mercer Wizarding Academy. This longstanding Mercer Museum educational program offers multiple week-long, half-day summer camp sessions filled with magic and excitement for young campers.</span></p>\n<p class=\"p3\"><span class=\"s2\">Wizard dress is highly encouraged, and campers are divided into separate “houses” by the magical Sorting Hat. Throughout the week, campers find their perfect wands and practice their spells, enjoy fantasy classes in Potions, Defense Against the Dark Arts, Care of Magical Creatures, Herbology, and more. In addition, campers receive Owl Post, participate in a series of Quidditch challenges, as well as a special dueling championship. All witches and wizards have many opportunities throughout the week to earn House Points and try to win the coveted House Cup, celebrated in a team Award Ceremony at the conclusion of each week.</span></p>\n<p class=\"p3\"><span class=\"s2\">This indoor/outdoor summer camp experience connects fantasy, history, science, literature and team-building in a one-of-a-kind setting at the Mercer Museum, and is a must for fans of the Harry Potter series.</span></p>\n<p class=\"p3\"><span class=\"s2\">The Mercer Museum, one of Bucks County’s premier cultural attractions and a Smithsonian affiliate, features both local and national seasonal exhibits as well as a core museum collection of over 50,000 pre-Industrial tools. The permanent collection offers visitors a unique window into pre-Industrial America through sixty different crafts and trades and is one of the world’s most comprehensive portraits of American material culture.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/04/2022-Wizarding-Camp-Awards-27-1.jpg"
}