{
  "id": 11690,
  "title": "Kindness Korner: Franco Federico",
  "slug": "kindness-korner-franco-federico",
  "date": "2021-11-23T12:50:36",
  "author": "Staff",
  "category": [
    "Live",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Franco Federico",
    "jessica ramoy",
    "La Dolce Vita Da Franco"
  ],
  "excerpt": "<p>Welcome to Kindness Korner, a new section that is dedicated to, well, kindness! In a period during which news around the world is especially wrought with negativity, we’ve decided to add some heartwarming stories that will hopefully make you smile.  These stories will be submitted by YOU, the reader. We want to hear about of [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><i>W</i><i>elcome to Kindness Korner, a new section that is dedicated to, well, kindness! In a period during which news around the world is especially wrought with negativity, we’ve decided to add some heartwarming stories that will hopefully make you smile.<span class=\"Apple-converted-space\">  </span>These stories will be submitted by YOU, the reader. We want to hear about of random acts of kindness you’ve experienced recently. This can be acts from a stranger, a business owner or employee, a teacher, a child… anyone. Send your story to <a href=\"mailto:jess@doylestowncardinal.com\">jess@doylestowncardinal.com</a>. Please include a picture of the kind person if possible (with their permission).<span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p1\"><b>By Jessica Ramoy • </b>The Cardinal Managing Editor</p>\n<p class=\"p3\"><span class=\"s2\">For this first edition, I’ll share a quick story that happened while delivering The Doylestown Cardinal of all things.</span></p>\n<p class=\"p4\"><span class=\"s2\">I entered into La Dolce Vita Da Franco with my two-year-old son. I was immediately greeted with a warm smile and a big Italian welcome by the owner, Franco Federico.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">He was kind from the start. He made room for our paper right at the front counter where all the customers would see. If you’ve been here before, you know there’s a huge display fridge with endless deserts right near this counter. My son noticed too, of course, and was immediately requesting cheesecake.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">The good mom in me was leaning towards no, thinking of how unhealthy it is, and that we didn’t even eat lunch yet. The bad mom in me thought that this would keep him busy for the next 20 minutes, while I could peacefully continue delivering. Bad mom won this round and I reluctantly agreed to the cheesecake. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">I reach into my purse, and discovered I left my money at home! Before I could even explain this to my eager son, Franco says, “It’s on the house! I insist”. I offered to come back later to pay, and he said “nonsense! This is a gift from me”.</span></p>\n<p class=\"p4\"><span class=\"s2\">This little act of kindness made my day and made my son’s next 20 minutes! Thank you, Franco. We appreciate you and your delicious cheesecake.</span></p>\n<p class=\"p4\"><span class=\"s2\">For more on La Dolce Vita Da Franco visit <a href=\"http://www.ladolcevitadafranco.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.ladolcevitadafranco.com</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/11/Franco-Federico.jpg"
}