{
  "id": 16268,
  "title": "Kindness Korner: Adrienne King of The PairUp Society Celebrates Community Diversity",
  "slug": "kindness-korner-adrienne-king-of-the-pairup-society-celebrates-community-diversity",
  "date": "2023-01-09T23:58:55",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live"
  ],
  "tags": [
    "Adrienne King",
    "doylestown cardinal",
    "Edie Weinstein",
    "The PairUP Society"
  ],
  "excerpt": "<p>By Edie Weinstein • Special to The Cardinal When I initially met Adrienne King, I was blown away by her steadfast commitment to social justice, diversity, and unity. Adrienne is a life-changing force for good in the world. Edie Weinstein: You are someone I think of as a wonder woman who wears so many hats- [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Edie Weinstein</strong> • Special to The Cardinal</p>\n<p class=\"p3\"><i>W</i><i>hen I initially met Adrienne King, I was blown away by her steadfast commitment to social justice, diversity, and unity. Adrienne is a life-changing force for good in the world.</i></p>\n<p class=\"p6\"><strong><span class=\"s2\">Edie Weinstein:</span></strong><span class=\"s1\"> You are someone I think of as a wonder woman who wears so many hats- business owner, wife, mother, social justice activist. How do you balance it all?</span></p>\n<p class=\"p6\"><strong><span class=\"s2\">Adrienne King:</span></strong><span class=\"s1\"> First, I’d say there isn’t such a thing as balance. It’s more like flexing; I flex in and out of the hats as they need me, always keeping in mind my core values and purpose.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">And yes, I do wear a lot of hats. I have a career at Merck as a Director of External Manufacturing Operations. I am the founder, executive director, and board president of the PairUP Society Inc., And I’m the co-owner, recipe curator, assistant juicer, and social media marketer for our family business, So Fresh So Green Juice Co. All that in addition to being a woman, wife, mother, and social justice and community activist.<span class=\"Apple-converted-space\"> </span></span></p>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2023/01/2197.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-16270\" src=\"https://doylestowncardinal.com/wp-content/uploads/2023/01/2197.jpg\" alt=\"\" width=\"1470\" height=\"2205\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2023/01/2197.jpg 1470w, https://doylestowncardinal.com/wp-content/uploads/2023/01/2197-200x300.jpg 200w, https://doylestowncardinal.com/wp-content/uploads/2023/01/2197-768x1152.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2023/01/2197-683x1024.jpg 683w, https://doylestowncardinal.com/wp-content/uploads/2023/01/2197-990x1485.jpg 990w, https://doylestowncardinal.com/wp-content/uploads/2023/01/2197-1320x1980.jpg 1320w\" sizes=\"auto, (max-width: 1470px) 100vw, 1470px\" /></a></p>\n<p class=\"p6\"><strong><span class=\"s2\">EW:</span></strong><span class=\"s1\"> Please talk about the PairUp Society and your vision for it.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong><span class=\"s2\">AK:</span></strong><span class=\"s1\"> The PairUP Society was born out of issues my family faced as well as the voices of others in the community. I grew up in Bucks County since the first grade and never felt like I belonged or like I was represented. My culture wasn’t celebrated and I think it was time to change that for future generations.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">The PairUP Society’s vision is for well-informed communities and schools where everyone has a safe environment and can show up authentically as him or herself. Every person has the support and resources to live and perform to full potential. We accept and acknowledge all members of the community. Differences are leveraged to strengthen the community overall. Part of our vision is to have a bold, courageous, and safe space for marginalized students, specifically black and brown students, to build relationships and find support from one another.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong><span class=\"s2\">EW:</span></strong><span class=\"s1\"> How can the communities in which we live uplift children?</span></p>\n<p class=\"p6\"><strong><span class=\"s2\">AK:</span></strong><span class=\"s1\"> Our communities can uplift children by listening to them. All children. We have to stop just thinking from our own street corners and lived experiences and realize that not everyone’s is the same. There is work that we need to do, starting with our children.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong><span class=\"s2\">EW:</span></strong><span class=\"s1\"> What are some of the events the organization have sponsored?<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong><span class=\"s2\">AK:</span></strong><span class=\"s1\"> The PairUP Society has sponsored a Unity Walk, Juneteenth at The Mercer, Back to School Drives, Day of Service events, Black History Month Events, and Kwanzaa Celebrations. We are working on planning a Historically Black College and University Workshop in the spring and fall of 2023. PairUP also consults with families and students one on one to provide a safe space and help them build a plan of action when they are experiencing issues that aren’t being addressed.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s2\"><strong>EW</strong>:</span><span class=\"s1\"> How do you and your family personify kindness?</span></p>\n<p class=\"p6\"><strong><span class=\"s2\">AK: </span></strong><span class=\"s1\">My family and I believe in being part of our community and giving back. We’ve instilled this in our girls from birth. The act of our family giving back is where many of the events that the PairUP society originate. For example, every year, my girls would host an Easter Egg Hunt on Good Friday and invite their friends and classmates.<span class=\"Apple-converted-space\">  </span>We asked each family to bring travel-size toiletries that we’d donate to soup kitchens and homeless shelters.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">To learn more and find out how you can help, visit: <a href=\"http://thepairupsociety.org\" target=\"_blank\" rel=\"noopener noreferrer\">thepairupsociety.org</a></span></p>\n<p class=\"p7\"><i>Edie Weinstein, MSW, LSW is a licensed social worker, psychotherapist, interfaith minister, journalist, speaker, PR and marketing professional and the grandmother of two wonderful children, who we are teaching to be kind.</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/01/IMG_4237.jpeg"
}