{
  "id": 12395,
  "title": "Let’s Stay Series: Wedgwood Inn • New Hope, Pennsylvania",
  "slug": "lets-stay-series-wedgwood-inn-%e2%80%a2-new-hope-pennsylvania",
  "date": "2022-03-01T22:16:37",
  "author": "Staff",
  "category": [
    "Stay",
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "New Hope",
    "ritt Around Town",
    "wedgwood inn"
  ],
  "excerpt": "<p>By Britt Around Town • Special to The Cardinal Last month I had the opportunity to spend the night at the Wedgwood Inn in New Hope, PA. This lovely 1870 Victorian Inn offers 18 elegant rooms featuring amenities such as whirlpool tubs, fireplaces, a relaxing garden and so much more. Wedgwood Inn is full of [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><strong>By Britt Around Town</strong> • Special to The Cardinal</span></p>\n<p class=\"p3\"><span class=\"s3\">L</span><span class=\"s2\">ast month I had the opportunity to spend the night at the Wedgwood Inn in New Hope, PA. This lovely 1870 Victorian Inn offers 18 elegant rooms featuring amenities such as whirlpool tubs, fireplaces, a relaxing garden and so much more. Wedgwood Inn is full of history and was even a stop on the Underground Railroad.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">For lovers of Haunted History &#8211; it is said that the you may encounter the ghost of a 12-year-old ex-slave named Sara as she can still be seen searching for her parents and if you are lucky she may even tell you her story of her escape from slavery.</span></p>\n<p class=\"p5\"><span class=\"s2\">Wedgwood Inn has 10 rooms in the main house as well as a Carriage House suite.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Our room for the night was the Lavender Room on the 2nd floor which included a luxurious queen size bed, a gas fireplace and a bathroom with a shower. The room was so bright, cheerful and cozy I couldn’t wait to come back and relax by the fire after a day of exploring New Hope and the surrounding area.</span></p>\n<p class=\"p5\"><span class=\"s2\">Before heading into town, we paid a visit to the backyard of Wedgwood Inn to see their covered bridge “gazebo” &#8211; one of my favorite features on their property. Carl &#8211; one of the innkeepers &#8211; built the gazebo to commemorate Bucks County’s iconic and historic covered bridges. Inside of the bridge, fencing was added where visitors can leave lovelocks to commemorate their stay. The tradition of leaving love locks on bridges, fences and other structures dates back to World War 1 and is meant to symbolize love’s “indestructible bond” between two partners.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span style=\"color: #993300;\"><strong><span class=\"s4\">MUST VISIT ATTRACTIONS DURING A STAY AT WEDGWOOD INN</span></strong></span></p>\n<p class=\"p5\"><span class=\"s2\">The weekend of our stay at Wedgwood Inn, I paid a visit to two of Bucks County’s must visit attractions located just north of New Hope.</span></p>\n<p class=\"p7\"><span class=\"s1\">Washington Crossing State Park and Visitor Center</span></p>\n<p class=\"p5\"><span class=\"s2\">“Near this spot, Washington crossed the Delaware on Christmas night 1776. The eve of the Battle of Trenton.”</span></p>\n<p class=\"p5\"><span class=\"s2\">Washington Crossing State Park is one filled with quite the history. Retrace George Washingon’s footsteps, stop into the visitor center for information on the area, or even stop by on Christmas Day to watch the reenactment of the historical crossing of the Delaware River.</span></p>\n<p class=\"p5\"><span class=\"s2\">The Washington Crossing State Park also includes the Thompson-Neeley Farmstead, Thompson-Neeley Mill, Bowman’s Hill Tower, soldier’s graves, Durham Boat Barn, historic houses and more!</span></p>\n<p class=\"p7\"><span class=\"s1\">Bowman’s Hill Tower (part of Washington Crossing State Park)</span></p>\n<p class=\"p5\"><span class=\"s2\">There’s no greater time to experience Bowman’s Tower in Washington Crossing than when Mother Nature throws a little bit of color into her Fall foliage views! Over in Washington Crossing State Park stands the 125 foot tall Bowmans Tower. Despite rumors that the tower served as a lookout during George Washington’s time in Bucks County, it was actually constructed in the 1930s as a memorial of where the troops MAY have been stationed to scope out enemies along the Delaware during the Revolution. Tours can be booked online that will allow you to climb the spiral staircase up to the observation deck that provides breathtaking views of Bucks County, Mercer County and the Delaware River!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong><span class=\"s4\" style=\"color: #993300;\">A NIGHT ON THE TOWN</span></strong></p>\n<p class=\"p5\"><span class=\"s2\">Before heading back to our room at Wedgwood Inn, we decided to spend the evening visiting some of the local businesses in town.</span></p>\n<p class=\"p5\"><span class=\"s2\">Our first stop was to 4 The Love of Things &#8211; to myself to some retail therapy.</span></p>\n<p class=\"p5\"><span class=\"s2\">I love this trendy fashion boutique and they always have clothes that fit my taste perfectly. This visit, I left with a camo dress and a Buffalo Plaid Ruana and some delicious crispie treats that they sell from The Crispery! That ruana is seriously so comfy and is like wrapping myself up in a blanket! I could browse this store for hours!</span></p>\n<p class=\"p5\"><span class=\"s2\">Then we headed across the street to visit UpMade Market, which is a lovely gift store that has carefully put together a collection of gifts and items handmade in the United States. In fact, that’s the spirit that the MADE in the name captures:</span></p>\n<p class=\"p8\"><span class=\"s1\">~ </span><span class=\"s5\">M</span><span class=\"s1\">akers<span class=\"Apple-converted-space\">  </span>~ </span><span class=\"s5\">A</span><span class=\"s1\">dventurers<span class=\"Apple-converted-space\">  </span>~ </span><span class=\"s5\">D</span><span class=\"s1\">reamers<span class=\"Apple-converted-space\">  </span>~ </span><span class=\"s5\">E</span><span class=\"s1\">xplorers</span></p>\n<p class=\"p5\"><span class=\"s2\">You never know what will catch your eye during a visit to UpMade. They have everything from candles and jewelry, to decor, knickknacks items from New Hope’s own Local and Lovely. Don’t forget to take your photo with the Pine2Pink wings located on their window while you are there!</span></p>\n<p class=\"p5\"><span class=\"s2\">A must visit during our stay was to Magikava (Pennsylvania’s first kava bar) to unwind with a bowl of kava. Kava is an herb that brings about a feeling of relaxation, pain relief, joy and happiness. It’s a healthier and safer alternative to alcohol and provides the same benefits without resulting in cognitive impairment. Owner, Erik, had once explained to me that during time he spent in Hawaii, locals would frequent Kava bars instead of consuming alcohol during social events. In addition to their kava, owners Erik and Caitlin have put together a collection of a variety of the finest quality of teas, spices, herbs and kava from all over the world. They have spent an extensive amount of time, love and dedication towards creating the perfect blend of teas and elixirs to sell at their bar.</span></p>\n<p class=\"p5\"><span class=\"s2\">Dinnertime lead us over to Nektar over on Mechanic Street. One of the beauties of Nektar is that it’s a “small plate restaurant” which is great for getting to try and share different items on the menu.</span></p>\n<p class=\"p5\"><span class=\"s2\">My husband and I shared the following:</span></p>\n<p class=\"p5\"><span class=\"s2\">~ A charcuterie board with smoked duck, wagyu beef and aged goat Gouda</span></p>\n<p class=\"p5\"><span class=\"s2\">~ Ahi tuna poke bowl <span class=\"Apple-converted-space\">  </span>~ Beef Wellington <span class=\"Apple-converted-space\">  </span>~ Goat cheese and smoked salmon<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">The service was fast and they brought out the plates as they were ready to allow us to pace out each dish. Everything was rich with flavor and it’s so hard to pick which dish was our favorite. Quick and excellent service, cozy atmosphere and an all around amazing time.</span></p>\n<p class=\"p5\"><span class=\"s2\">We ended our night on the town with some Sunday sips at the Great Barn Brewery Taproom and ordered a flight of beer. I of course picked a dunkel and a stout and Pete picked a juniper sahti ale and a NEIPA. I fell in love with the dunkel and had to get a 4 pack to take home and enjoy later.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Great Barn Brewery grows all their own grain on their farm and brewery in Kintnersville. Other ingredients are locally sourced from other nearby farmers. Their beer also uses fresh water from their private well.</span></p>\n<p class=\"p5\"><span class=\"s2\">After a fun time in the heart of New Hope, we enjoyed coming back to the inn to shower and relax for a bit and enjoy the fire before heading to bed.</span></p>\n<p class=\"p6\"><strong><span class=\"s4\" style=\"color: #993300;\">THE NEXT MORNING</span></strong></p>\n<p class=\"p5\"><span class=\"s2\">Monday mornings at Wedgwood Bed &amp; Breakfast Inn just hit a little different. Woke up early to enjoy a nice warm cup of tea on the back porch and enjoy the sound of the birds chirping and the rays of the beautiful sun shining through the trees.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Following my morning tea time, we were treated to breakfast at the inn. The meal had numerous courses and was the perfect fuel to start the day. I had to leave before breakfast was finished in order to get to work, but I was thrilled to be able to enjoy the first two rounds.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">To start we had strawberry yogurt by Chobani topped with an assortment of fruit and their homemade granola, followed shortly by broccoli quiche and a basket of bread.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s6\">I’d love to give a big THANK YOU to Carl and Dinie from Wedgwood Inn for being such welcoming hosts! The room was cozy, breakfast was delicious and we had an all around amazing stay. Congratulations to them on the 40th Anniversary of their offering Wedgewood perfection!</span></p>\n<p class=\"p9\"><span class=\"s1\">Wedgwood Inn • 111 W Bridge St, New Hope, PA 18938</span></p>\n<p class=\"p9\"><span class=\"s1\">(215) 862-2570 • <a href=\"http://www.wedgwoodinn.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.wedgwoodinn.com</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/03/Wedgewood-Inn.jpg"
}