{
  "id": 19577,
  "title": "Life Lessons from Local Moms at All Stages",
  "slug": "life-lessons-from-local-moms",
  "date": "2024-05-10T15:10:05",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "holidays",
    "mons of Bucks County",
    "mother's day"
  ],
  "excerpt": "<p>By Dana Roberts • Cardinal Contributing Writer For the third year in a row, we chatted with different local moms on all things motherhood. We are so grateful for their willingness to share their perspectives and the lessons each of their journeys as moms have taught them. Happy Mother’s Day to all! Aesha Tahir Wellness Consultant [&hellip;]</p>\n",
  "content": "<p><strong><em>By Dana Roberts <b>• </b></em></strong>Cardinal Contributing Writer</p>\n<p class=\"p1\">For the third year in a row, we chatted with different local moms on all things motherhood. We are so grateful for their willingness to share their perspectives and the lessons each of their journeys as moms have taught them. Happy Mother’s Day to all!</p>\n<h2 class=\"p1\"><b>Aesha Tahir<br />\n</b></h2>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2024/05/Aesha-Tahir-2024.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-19584\" src=\"https://doylestowncardinal.com/wp-content/uploads/2024/05/Aesha-Tahir-2024-1024x1024.jpg\" alt=\"Aesha Tahir\" width=\"1024\" height=\"1024\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2024/05/Aesha-Tahir-2024-1024x1024.jpg 1024w, https://doylestowncardinal.com/wp-content/uploads/2024/05/Aesha-Tahir-2024-150x150.jpg 150w, https://doylestowncardinal.com/wp-content/uploads/2024/05/Aesha-Tahir-2024-300x300.jpg 300w, https://doylestowncardinal.com/wp-content/uploads/2024/05/Aesha-Tahir-2024-768x768.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2024/05/Aesha-Tahir-2024-65x65.jpg 65w, https://doylestowncardinal.com/wp-content/uploads/2024/05/Aesha-Tahir-2024-990x990.jpg 990w, https://doylestowncardinal.com/wp-content/uploads/2024/05/Aesha-Tahir-2024.jpg 1080w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" /></a></p>\n<p class=\"p1\"><b>Wellness Consultant and Coach <a href=\"https://www.aeshatahir.com/\" target=\"_blank\" rel=\"noopener noreferrer\">www.aeshatahir.com</a></b></p>\n<p class=\"p1\"><b>Mom to:</b> Rayan, 18, Aydin, 13, and Nyle, 12</p>\n<p><b>Age when you became a mom:</b> I started my family very young. Are you ready for the answer? I had my oldest when I was 22.</p>\n<p class=\"p1\"><b>Expectation of motherhood versus reality:</b> <b> </b>Expectation: I’ll be enjoying EVERY moment and I’d go on daily jogs with my baby in the stroller. Reality: Trying to get out the door with a crying baby and the stroller getting stuck in the doorways, elevators, and subways. We lived in New York City at the time. And that wasn’t all. We were up at 2 a.m. again&#8212; this time both of us crying. I laugh at those memories now.</p>\n<p><b>Most challenging aspect of this stage:</b> Driving them around to all their sports practices, sometimes at the same time. I think I need to clone myself.</p>\n<p><b>Most joyous aspect of this stage:</b> I love watching them turn into wonderful grown adults. I enjoy our talks, jokes and sharing music playlists together.</p>\n<p><b>Favorite thing to do with your kids:</b> Go on a day trip to New York City and try out TikTok-worthy places.</p>\n<p class=\"p1\"><b>Best mom hack: </b>Delegate and ask for help. You can create a village with your partner, friends, and neighbors to make parenting a breeze.</p>\n<p class=\"p1\"><b>Best advice about motherhood you’ve received: </b>“It’s okay to be a good enough mother.” As a recovering perfectionist, I strive for perfection and there used to be no room for mistakes. Like one year I was late signing up my kids up for their favorite summer camp and I was hard on myself. It ended up being the best summer I had with my kids at home.</p>\n<p class=\"p1\"><b>Thoughts on the term “hot mess mom”:</b> The ups and downs of motherhood can be challenging. I’d say focus on doing the best you can and give yourself grace if things don’t go according to the plan.</p>\n<p class=\"p1\"><b>How your balance of motherhood and working feels right now:</b> It&#8217;s going well. I like to call it work-life integration because it brings both aspects together, merging work and family life. I often work on the sidelines and take client calls while driving, so I can handle both simultaneously throughout the day. This sets a good example for kids, showing them how we can make room for both in our lives. However, when my kids need me, I’m able to shut off and be there for them as well.</p>\n<p class=\"p1\"><b>Favorite quick self-care activity: </b>I’m a yoga instructor too and my personal yoga practice always centers me and brings everything into focus.</p>\n<p><b>What you’d like to do on Mother’s Day:</b> Go on a run with my kids. I’m a runner and all my kids are track athletes. It’s an activity we all enjoy together.</p>\n<h2 class=\"p1\"><b>Amanda and Jackie Drobot</b></h2>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2024/05/Amanda-and-Jackie-Drobot-children.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-19585\" src=\"https://doylestowncardinal.com/wp-content/uploads/2024/05/Amanda-and-Jackie-Drobot-children.jpg\" alt=\"Amanda and Jackie\" width=\"909\" height=\"909\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2024/05/Amanda-and-Jackie-Drobot-children.jpg 909w, https://doylestowncardinal.com/wp-content/uploads/2024/05/Amanda-and-Jackie-Drobot-children-150x150.jpg 150w, https://doylestowncardinal.com/wp-content/uploads/2024/05/Amanda-and-Jackie-Drobot-children-300x300.jpg 300w, https://doylestowncardinal.com/wp-content/uploads/2024/05/Amanda-and-Jackie-Drobot-children-768x768.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2024/05/Amanda-and-Jackie-Drobot-children-65x65.jpg 65w\" sizes=\"auto, (max-width: 909px) 100vw, 909px\" /></a></p>\n<p class=\"p1\"><b>Moms to:</b> Andie, 5.5 months and Makari, 11 months</p>\n<p><b>Our journey to motherhood:</b> We began trying for a baby in June 2022. We did a few rounds of IUI with no success, and then switched to IVF. We were lucky enough to get pregnant on the first try and found out we were pregnant in February 2023! We had also started the process to become licensed foster parents in July 2022 and we were finally licensed in June 2023. In August 2023, when Jackie was 6 months pregnant with Andie, we received a call to provide emergency placement for a 10-week-old boy, and the rest is history! Andie was born in November and Makari became a big brother at 5.5 months old!</p>\n<p><b>What it’s like to parent two infants of different ages:</b> Such a unique and wild experience! Our favorite thing is to watch their relationship develop. They are fascinated by one another. Andie loves to watch Makari crawl around and play. Mak loves to make Andie laugh, give her kisses and share his food with her! It can be challenging at times because Makari doesn’t yet understand why Andie can’t crawl around and play with him, and don’t get us started on the ever-changing sleep regressions and patterns for the two of them!</p>\n<p><b>Our expectation of motherhood versus the reality:</b> (Amanda) I work with kids all day every day as a pediatric occupational therapist, and I think I expected to be able to just be an OT 24/7 to manage some of the more challenging aspects of parenting. But at some point, my OT brain turns off and I’m just like any other mom trying to navigate the difficulties and ever-changing nature of parenthood.</p>\n<p class=\"p1\"><b>Hardest aspect of this stage:</b> Definitely the lack of consistent sleep. Most days we feel like walking zombies.</p>\n<p class=\"p1\"><b>Most joyous aspect of this stage:</b> Watching their relationship develop. That unconditional love for one another is worth every sleepless night.</p>\n<p><b>Best mom hack:</b> Mini fridge in your room for those newborn and nighttime feeds! No one wants to be walking up and down the stairs in the dark!</p>\n<p><b>Baby item we couldn’t live without:</b> Fisher Price baby play mat- if you know, you know. “Maybe you could be a purple monkey in a bubblegum tree.”</p>\n<p><b>Thoughts about fostering:</b> Fostering is hard, we will start with that. Visits from case workers, regulations, visitations, coordination of schedule, and everything in between. But man, is it worth it. The community we have developed alone is something we love, and of course we absolutely love being able to help the kiddos and families that need us.</p>\n<p><b>Best advice about motherhood we’ve received:</b> It’s true when they tell you that these hard newborn and infant times go by quickly and that they don’t last forever. We blinked and Mak is almost one and Andie has two teeth! Also, double diapering boys at night… life saver!</p>\n<p><b>Ways we are taking care of ourselves right now:</b> We’ll let you know in a few years! Just kidding, we make sure we aren’t neglecting doing the things we love even though we have tiny humans. We still make time for our friends and family, going on walks, hanging out with our neighbors, and checking out breweries. We just do it as a family of 4 now instead of a family of 2. We know some people enjoy time away from their kids but honestly the best way to care for ourselves is spending every moment we can soaking in these days. We frequently talk about how we’re not sure how we could ever love anything more than our two kids right now and that’s all we need in this moment!</p>\n<h2 class=\"p1\"><b>Kristen Erpel</b></h2>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2024/05/Kristen-Erpel-2024.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-19586\" src=\"https://doylestowncardinal.com/wp-content/uploads/2024/05/Kristen-Erpel-2024.jpeg\" alt=\"Kristen Erpel\" width=\"856\" height=\"982\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2024/05/Kristen-Erpel-2024.jpeg 856w, https://doylestowncardinal.com/wp-content/uploads/2024/05/Kristen-Erpel-2024-262x300.jpeg 262w, https://doylestowncardinal.com/wp-content/uploads/2024/05/Kristen-Erpel-2024-768x881.jpeg 768w\" sizes=\"auto, (max-width: 856px) 100vw, 856px\" /></a></p>\n<p class=\"p1\"><b>Owner of Maple and Maple Flower Company<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p1\"><b>Mom to:</b> Claire, 9, Henry, 7, and Annie, 4</p>\n<p class=\"p1\"><b>Birth Memories:</b> All three of my births were non-medicated, out-of-hospital births, each with an incredible team of Midwives. They were INTENSE, magical, and hands-down the most empowering things I’ve ever done. Claire was born at 7:16pm at a birth center in FL. She came into the world fist first, held high above her head, ready to tackle the world and she’s stayed true to her fierce and playful personality even since. Fun fact: She always found a way to wiggle that same arm out of her swaddle, to sleep the same way.  Henry was born at home, at 3:18pm. He entered this world en caul, (still in his amniotic sac) which is considered by many cultures to be a sign of good luck and greatness. Henry wakes up each day excited to see what lucky adventures he stumbles across and is ALWAYS the first of the kids to stumble across a penny heads up, have a ladybug land on him, or find a four-leaf clover.  Annie was born at home, at 3:47. Her birth was our most “exciting” as she showed up both 11 days late (past her due date), and also 20 minutes early (before my midwives arrived). She is our wildcard! She keeps us on our toes and challenges us to keep up with her never-ending energy. She is the life of the party and the finishing touch to our family.</p>\n<p class=\"p1\"><b>Best piece of advice for the postpartum period: </b>Make sure your husband/partner knows when and how to tell people “No.” No, we don&#8217;t want visitors right now. No, you can’t hold baby just yet. No, we won’t be coming to that event. The postpartum period is a minefield of emotions, compiled with physical and mental exhaustion. You won’t have the energy to fight all the battles that you want to, so make sure that you and your partner are on the same page about what the expectations are, so that THEY can speak for you, when you are too tired to stand up for yourself.</p>\n<p class=\"p1\"><b>Most challenging aspect of this stage of motherhood:</b> Balancing three very different kids, with very different needs, while juggling all their activities.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\"><b>Most joyous aspect of this stage: </b></p>\n<p class=\"p1\">Seeing the big kids discover who they are and begin to grow into fully functioning humans. They&#8217;re finding their passions, learning how to be independent. We have begun to introduce them to the books, movies and TV shows of OUR childhood and have been loving having more in-depth conversations.</p>\n<p class=\"p1\"><b>Favorite thing to do with your kids right now: </b>Family game night!</p>\n<p class=\"p1\"><b>Best mom hack: </b>Always. Pack. Snacks.</p>\n<p class=\"p1\"><b>Best advice about motherhood you’ve received: </b>“It doesn’t get easier, it just gets different.” I know that sounds harsh and kind of depressing, but it was the most honest and oddly refreshing advice ever given to me. It kept me from holding on to unrealistic goals of motherhood eventually being “easy” and allowed me to sit in the struggles that I was having and find hope in knowing that they would soon pass. There is always another “battle”, another nursing strike, another sleep regression, another tooth breaking though, and then they become toddler tyrants with tantrums and picking eating… Each age/phase has its own set of struggles. None of them are easy, but they are all different and you WILL survive them all…. Even if it doesn’t always feel like it.</p>\n<p class=\"p1\"><b>Thoughts on the term “hot mess mom”: </b>I think it’s an authentic representation of what all Moms feel (and look) like at some point in their journey. Do we want to have it all together, manage our schedules, look like we care about ourselves and have a perfectly curated house with well-behaved children? Of course! But society’s expectations are beyond reach for most of us, so if coining the phrase “hot mess mom” allows us to relax and recognize that we are all just doing our best, and that our best is good enough, then I’m all for it.</p>\n<p class=\"p1\"><b>How your balance of motherhood and working feels right now: </b>Impossible. I began Maple and Maple Flower Company, a retail florist and small-scale flower farm, 4 years ago. Farming is very cyclical. There are weeks/months where things are manageable, and then there are weeks/months, like now, that feel all-consuming. In the end though, it&#8217;s worth it. My kids are watching me follow my passion and seeing what hard work can accomplish, and that it’s okay to not &#8220;do it all” every day. Sometimes the house gets cleaned and the garden gets ignored, while other days the house seems to fall apart while the flowers get planted/harvested. We are all learning that both are okay.</p>\n<p class=\"p1\"><b>Favorite quick self-care activity right now: </b>At home manicures, audio books and chips and salsa.</p>\n<p class=\"p1\"><b>What you’d like to do on Mother’s Day:</b> Yardwork! The garden is my happy place, so I want to spend the day outside with the family, getting as many garden tasks crossed off as possible, before enjoying dinner and beating the kids at a game of Mario Party.</p>\n<h2 class=\"p1\"><b>Nerice Kendter</b></h2>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2024/05/Nerice-Kendter-2024.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-large wp-image-19587\" src=\"https://doylestowncardinal.com/wp-content/uploads/2024/05/Nerice-Kendter-2024-768x1024.jpg\" alt=\"Nerice Kendter\" width=\"768\" height=\"1024\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2024/05/Nerice-Kendter-2024-768x1024.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2024/05/Nerice-Kendter-2024-225x300.jpg 225w, https://doylestowncardinal.com/wp-content/uploads/2024/05/Nerice-Kendter-2024-990x1320.jpg 990w, https://doylestowncardinal.com/wp-content/uploads/2024/05/Nerice-Kendter-2024.jpg 1200w\" sizes=\"auto, (max-width: 768px) 100vw, 768px\" /></a></p>\n<p class=\"p1\"><b>Owner of Busy Bee Toys</b></p>\n<p class=\"p1\"><b>Mom to: </b>Julian, 22</p>\n<p><b>Hardest stage of motherhood:</b>  I&#8217;d say the trickiest time is what I call the &#8220;lippy&#8221; time.  That tween/early teen period when kids&#8217; mouths open before they take a moment to think.  It&#8217;s an important life lesson for us all that you can think whatever you want with no ramifications but as soon as it comes out of our mouths&#8230;&#8230;  Motherhood (as with life in general) is full of peaks and valleys, and I have gotten through them all with the love and support of my dearest friends, my wonderful husband and my incredible mom.</p>\n<p><b>Most joyous aspect of this stage:</b> I am really enjoying this time with my young adult son where we can have conversations and just enjoy spending together with me being less of a parent and instead (hopefully) a good example of adulthood while also being a sounding board, a guide and a support.  And hey, a big plus is that I don&#8217;t have to change diapers or do his laundry anymore!</p>\n<p><b>What it’s like to text with your grown child:</b>  I absolutely love getting texts and phone calls from my son!  He&#8217;s working full time and when he takes a moment out of his day to reach out to me, it makes me so happy.  My childhood and early adulthood was during the time before cell phones and when you wanted to talk to someone, you had to be at home or go to a pay phone!  So, I did not have this close of contact with my parents and I feel lucky that he chooses to connect with me so often.</p>\n<p class=\"p1\"><b>Something you recently learned from your child:</b> Julian is now a mechanic and I am learning more than I ever thought I would about engines!</p>\n<p><b>Where you were in your motherhood journey when you opened Busy Bee Toys:</b>  I was a mom of a 5-year-old and my dad had recently died when I opened my business.  Julian was only in half-day kindergarten and my husband worked out of the area, so I quickly learned about the massive amount of juggling that all working mamas do.  I was so lucky to have my mom close by so that she could help me with picking him up from school and so many other things! Having Busy Bee Toys as well as a young child gave both my mom and I something to focus on as we grieved. Growing the business meant that I sadly had to miss some important things like one of Julian&#8217;s birthday parties.  Having to sometimes place business needs ahead of my family was really difficult.  I remain so grateful for the way that family and friends helped me so that I could build my business while parenting my young child.  Never doubt the power of having people standing behind and next to you!</p>\n<p class=\"p1\"><b>Something you love to witness at Busy Bee:</b> I absolutely love seeing so many sweet families coming into my store.  From new mamas and papas with weeks old babies to excited toddlers being told that they can choose a special gift to proud uncles, aunts and grandparents showing us pictures of the littles in their worlds.  Helping families laugh and play with one another means so much to me!  I have had the pleasure of watching babies grow up to be young adults and love when they come back to visit.  Knowing that my business gave them joy as they grew up makes me so happy!</p>\n<p><b>Best advice you could offer to a mom who’s struggling right now:  </b>Breathe. Now is just one moment in time.  Everything changes and you are not alone.  Be soft and gentle with yourself.  Parenting is not always easy or pretty.  Reach out to friends, family or whoever you trust to be non-judgmental and supportive.   My staff and I are here to cheer on all of the mamas who are struggling because we&#8217;ve all been there!</p>\n<p><b>Thoughts on the term “hot mess mom”:</b> I don&#8217;t really love the term, but I agree with mamas feeling that they can be real.  Life and Motherhood is not a glossy magazine or Instagram post and never was.  There is no perfect life or perfect family. We are real people with good days, bad days and everything in between.  I believe in the power of us showing our humanity including our struggles and for us supporting one another.  My wish is that every mom has at least one person that she can vent to and cry with while knowing that she will always be loved.</p>\n<p><b>A Mother’s Day you’ll always remember:</b>  Over the last several years, I have begun to host Mother&#8217;s Day brunches for my mom (Shout out to Lily who just turned 90!), mother-in-law and some friends and it has been such a joyful way to celebrate the special women in my life!  I know that I will always remember these shared moments!</p>\n<h2 class=\"p1\"><b>Sarah Shoffler</b></h2>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2024/05/Sarah-Shoffler-2024.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-19588\" src=\"https://doylestowncardinal.com/wp-content/uploads/2024/05/Sarah-Shoffler-2024.jpg\" alt=\"Sarah Shoffler\" width=\"606\" height=\"716\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2024/05/Sarah-Shoffler-2024.jpg 606w, https://doylestowncardinal.com/wp-content/uploads/2024/05/Sarah-Shoffler-2024-254x300.jpg 254w\" sizes=\"auto, (max-width: 606px) 100vw, 606px\" /></a></p>\n<p class=\"p1\"><b>Mom to: </b>John 31, and Annie 27</p>\n<p><b>Age when you became a mom: </b>I was 37 when I had Johnny.  I had been waiting for almost 10 years to become a mother.</p>\n<p class=\"p1\"><b>Hardest stage of motherhood, and how you got through it:  </b>Those first couple of weeks after each of my children was born, while not feeling great myself, and trying to figure things out (especially with my first child). But my mom was always there to support and encourage me and help me learn.  Suddenly I was smart enough to listen to my own mother!</p>\n<p class=\"p1\"><b>Being a mom to a child who has Down Syndrome has been…</b> Extremely rewarding.  Motherhood stretches us in every way, and this experience has stretched me even more.</p>\n<p class=\"p1\"><b>Best advice you could offer to parents who are raising a child with different needs or abilities:</b> First, love your child because he or she is your child.  Next, never stop advocating for the best life, education, social life, and more for them. Listen to your child so you understand and support what is important to him or her, just like you do with your other children.</p>\n<p class=\"p1\"><b>A moment you felt particularly proud of each of your kids: </b>Christmas morning when 4-year-old Johnny saw all the gifts and said, “Mom, I want you to open my gift first!”<span class=\"Apple-converted-space\">  </span>And the day 5-year-old Annie and I were at ACME and Annie looked up at the sign and said, “Mommy, look! ‘A’ for Annie and ‘M’ for Mommy!&#8217; And too many more moments to count.</p>\n<p class=\"p1\"><b>Most joyous aspect of this stage of motherhood: </b>The memories of each of those years still bring tears to my eyes, but now, as my children have become adults, I treasure my relationships with them and love getting to know who they are becoming as they choose careers and people to share their lives with.  That is truly amazing to experience.</p>\n<p class=\"p1\"><b>Something you love to witness your kids do together:  </b>Tease each other at the supper table.  Go out together to do something fun.  Clean up the kitchen together!</p>\n<p class=\"p1\"><b>Favorite things you’ve loved to do in Doylestown with your kids through the years:</b>  Annie&#8217;s Water Ice! We still love to go (especially Annie and I).</p>\n<p class=\"p1\"><b>A Mother’s Day you’ll always remember:  </b>My first Mother’s Day.  Going to church and holding my sweet baby boy and feeling SO THANKFUL.</p>\n<p class=\"p1\"><b>What you hope to do this Mother’s Day: </b>Spend time with my children at home, visit in the backyard and cookout.  Just share some good family time.</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/05/MothersDay.jpg"
}