{
  "id": 17946,
  "title": "Local Non-Profit ANA to Hold Fundraising Party August 19th",
  "slug": "local-non-profit-ana-to-hold-fundraising-party-august-19th",
  "date": "2023-08-06T22:46:13",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Style",
    "Taste"
  ],
  "tags": [
    "ana",
    "doylestown cardinal",
    "laurie heine"
  ],
  "excerpt": "<p>By Lauren Heine • The Cardinal Contributing Writer To walk in beauty is a Navajo philosophy that Doylestown residents Connie and Bill Eastburn put into practice. After witnessing the poor quality of life of Native American tribes in the Southwest they were compelled to help. The tribes, in desperate need of goods, required ser¯vices to [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Lauren Heine</strong></em> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">T</span><span class=\"s1\">o walk in beauty is a Navajo philosophy that Doylestown residents Connie and Bill Eastburn put into practice. After witnessing the poor quality of life of Native American tribes in the Southwest they were compelled to help. The tribes, in desperate need of goods, required ser¯vices to foster self-reliance.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">In response, the Eastburns started a local non-profit Americans for Native Americans (ANA) 32 years ago. Today, ANA is dedicated to improving the quality of life for Native Americans of the Hopi, Navajo, and Zuni Nations in the Southwest. Through donations, ANA provides food, health care, nursing scholarships, and veterinary clinics.</span></p>\n<p class=\"p5\"><span class=\"s1\">Thanks to the donations, the children of the tribes receive much-needed clothes, coats, hats, and school supplies. They receive basic health screenings such as hearing and vision, as well as eyeglasses. The children board at school and return home on the weekends with a backpack full of food so they don’t go hungry.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">To foster self-reliance, ANA set up Nursing Scholarships at the University of New Mexico-Gallup to help with tuition and testing fees. The University’s veterinarian program provides free care for pets and livestock by volunteer veterinarians and technicians. In addition, a newly built self-sustaining veterinarian clinic recently opened on a Zuni reservation.</span></p>\n<p class=\"p5\"><span class=\"s1\">This year ANA was the winner of the “2023 Everything Bucks: Business or Chamber Event” for its Annual Garden Party. The event takes place on Saturday, Aug. 19 at the bucolic Happiness Farm.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Musicians Eric Mintel and Jack Darnell will entertain while party guests enjoy delicious appetizers from THE Catering Company, a signature cocktail from HopsScotch, and craft beer provided by Geronimo Brewing. There will be both silent and live auctions and Native American jewelry for sale. Many different local community organizations, schools, and churches have supported ANA in different ways. 97 percent of donations go directly to ANA programs.</span></p>\n<p class=\"p5\"><span class=\"s1\">If you’re interested in making a difference please visit <a href=\"http://americansfornativeamericans.org\" target=\"_blank\" rel=\"noopener noreferrer\">americansfornativeamericans.org</a>. For an invitation to the Party or to sponsor the event, please email a<a href=\"mailto:mericansfornativeamericans@gmail.com\">mericansfornativeamericans@gmail.com</a>.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/08/ANAtohaali-garden-8_orig.jpg"
}