{
  "id": 19482,
  "title": "Local Couple Cultivate Community",
  "slug": "local-couple-cultivate-community",
  "date": "2024-04-24T22:16:40",
  "author": "Staff",
  "category": [
    "Fit",
    "Style"
  ],
  "tags": [
    "Chris and Donna Blackway",
    "doylestown cardinal",
    "lauren heine"
  ],
  "excerpt": "<p>By Lauren Heine • The Cardinal Contributing Writer Chris and Donna Blackway have called Doylestown home for two decades. They love the blend of small-town charm and city culture in addition to proximity to Philly, NYC, and the Jersey Shore. As an entrepreneurial power couple, they own Nomad Supply Company and Opal Hair Studio located [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Lauren Heine • </strong></em>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">C</span><span class=\"s3\">hris and Donna Blackway have called Doylestown home for two decades. They love the blend of small-town charm and city culture in addition to proximity to Philly, NYC, and the Jersey Shore. As an entrepreneurial power couple, they own Nomad Supply Company and Opal Hair Studio located just a stone’s throw away from each other in historic downtown Doylestown. Living the dream, Chris and Donna reflect on their story and how the community shaped their success.</span></p>\n<p class=\"p5\"><strong>Early Work</strong></p>\n<p class=\"p6\"><span class=\"s1\">Chris Blackway grew up in Warminster and attended Bucks County Community College studying Fine Art Photography and Small Business Management. He always knew he wanted to open his own store that would unite his love of surfing, skateboarding, travel, and music. His passion took him solo van camping, surfing, and exploring the Pacific and Atlantic coasts.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s4\">Donna attended Plumstead Christian School and also pursued an art major for a year in college, but couldn’t find an area that felt right. Coincidentally, co-eds sought out her talent to style their hair, turning dorm rooms and bathrooms into improvised salons. Though she never seriously considered styling as a career, she found herself creating her own art in the medium of hair. “I could be successful and love what I did every day,” Donna realized. “I could create beautiful hair and connect with people”</span></p>\n<p class=\"p6\"><span class=\"s1\">The couple met in 1998 in Pacific Sunwear at the Willow Grove Mall as Chris worked up the courage to talk to Donna. Marriage, a home, three daughters, and two small businesses later, it seems serendipitous their story began in a surf and skateboarding retail store.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong>Dreamwork</strong></p>\n<p class=\"p6\"><span class=\"s4\">In 2019, Chris found himself out of work. He took it as an opportunity to pursue his business dream. He wanted to bring surfing culture to the community that spends their summers at the Jersey Shore. It was hard work but he stuck to his vision and found some backing to open Nomad Supply Co in November 2019, five months before the pandemic and lockdowns. The store survived o</span><span class=\"s1\">n curbside pick-ups and online business.</span></p>\n<p class=\"p6\"><span class=\"s1\">Nomad’s logo is a Swallow, a meaningful choice by Chris after Donna suggested Nomad’s name.<span class=\"Apple-converted-space\">  </span>Nomads and swallows are transient and migratory birds – just as those in surf and skate communities travel the world in search of new spots. And in a full circle, Chris sports three swallow tattoos to represent his daughters.</span></p>\n<p class=\"p6\"><span class=\"s4\">Chris aims to provide a place where the younger demographic can feel welcome and find products that fit their lifestyle. He selects merchandise and brands that are hard to find and stand out. “There is something for everyone and you don’t have to classify yourself as a skater or surfer,” Chris explains. “It’s quality products all the time.”</span></p>\n<p class=\"p6\"><span class=\"s1\">Nomad also serves as a music venue, giving a stage to growing local artists and bringing in customers from all over the tri-state area. Music is an integral part of surf and skate culture providing a soundtrack to events and road trips.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s5\">Unlike Chris, Donna never had intentions of owning her own business until the salon she worked at for 16 years was gifted to her and three of her coworkers (Liz and Steph Tatarsky and Jaime Ruffino) in 2021. Opal, formally EB Salon, is employee-owned and operated and has been incredibly rewarding and fun for Donna. She is very proud of her team at Opal for being nominated for Best of Bucks, winning Salon Top 200, and sponsoring local charitable organizations.</span></p>\n<p class=\"p5\"><strong>Teamwork</strong></p>\n<p class=\"p6\"><span class=\"s1\">Running two successful small businesses makes it challenging to find time for family. It does help that living in a small community, the kids can pop in their shops to check in. “Donna is a voice of reason when I feel like I’m in over my head,” says Chris.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s4\">Opal is the ideal spot to refresh your look this Spring. Drop into Nomad Supply Company even if you’re a grom, shubie, or pro for new gear or a Spring wardrobe – Chris would be stoked to see you. Shaka, dudes.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">For more info, visit <a href=\"http://shopnomadsupply.com\" target=\"_blank\" rel=\"noopener noreferrer\">shopnomadsupply.com</a> and <a href=\"http://opalbyeb.com\" target=\"_blank\" rel=\"noopener noreferrer\">opalbyeb.com</a>.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/04/ChrisDonnaBlackway.jpg"
}