{
  "id": 19054,
  "title": "Local Spotlight with Danielle: Paracon: Buck’s First Annual Paranormal Conference",
  "slug": "local-spotlight-with-danielle-paracon-bucks-first-annual-paranormal-conference",
  "date": "2024-02-27T15:53:46",
  "author": "Staff",
  "category": [
    "Live",
    "Style"
  ],
  "tags": [
    "Danielle Gannon",
    "doylestown cardinal",
    "Eric Mintel"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer Remember my good friend Eric Mintel of Eric Mintel Investigates? He has a treat for us all! In a world where the mysterious and unexplained continue to captivate our imagination, Mintel pairs with the Bucks County Community College to host a paranormal convention like no other. Ghosts, [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Danielle Gannon • </strong></em>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">R</span><span class=\"s1\">emember my good friend Eric Mintel of Eric Mintel Investigates? He has a treat for us all! In a world where the mysterious and unexplained continue to captivate our imagination, Mintel pairs with the Bucks County Community College to host a paranormal convention like no other. Ghosts, Bigfoot, UFOs, and a lineup of esteemed speakers, including special guest Nick Pope of the History Channel’s Ancient Aliens, will converge for Paracon, a one-day event that promises to unravel the secrets of the supernatural. “This paranormal convention has been a dream of mine for a very long time and now it’s becoming a reality!” Mintel says.</span></p>\n<p class=\"p5\"><span class=\"s1\">Scheduled from 12 pm to 7 pm on March 9, this spectral gathering will be spearheaded by Mintel and team member spirit medium Dominic Sattele. The venue, Zlock Performing Arts Center, provides the perfect eerie backdrop for attendees to delve into the enigmatic realms of the paranormal. The adjoining theater lobby area will be abuzz with vendors, offering a diverse array of mystical artifacts, books, and paraphernalia.</span></p>\n<p class=\"p5\"><span class=\"s1\">One of the highlights of this extraordinary event is the presence of Nick Pope, renowned as the Host of History Channel’s Ancient Aliens. With his deep insights into extraterrestrial phenomena, Pope is poised to share his perspectives on the mysteries that have puzzled mankind for centuries. His captivating narratives and wealth of knowledge promise to be a highlight of the convention, providing attendees with a unique opportunity to engage with one of the foremost experts in the field.</span></p>\n<p class=\"p5\"><span class=\"s1\">The roster of speakers is equally impressive, featuring a lineup of seasoned paranormal investigators and researchers. Bill Birnes, Tom Carey, Eric Spinner, and Jim Krug will take the stage, each bringing their own expertise and experiences to the fore.</span></p>\n<p class=\"p5\"><span class=\"s1\">Throughout the day, attendees can immerse themselves in riveting presentations, exploring topics ranging from ghostly encounters to sightings of elusive creatures like Bigfoot and the inexplicable allure of UFOs. With each speaker offering a unique perspective, the convention aims to foster a deeper understanding of the unexplained and spark thought-provoking discussions among participants.</span></p>\n<p class=\"p5\"><span class=\"s1\">As we embark on this paranormal odyssey, let us suspend our disbelief and open our minds to the possibility that there are forces beyond our comprehension. So, whether you are a skeptic or a true believer, join us for a day filled with intrigue, wonder, and the uncharted territories of the supernatural. To purchase a ticket please visit: <a href=\"https://ci.ovationtix.com/36202/production/1185765?performanceId=11394230\" target=\"_blank\" rel=\"noopener noreferrer\">https://ci.ovationtix.com/36202/production/1185765?performanceId=11394230</a></span></p>\n<p class=\"p5\"><span class=\"s3\">If interested in vending please contact:<span class=\"Apple-converted-space\">  </span><a href=\"mailto:Peter.chiovarou@bucks.edu\">Peter.chiovarou@bucks.edu</a><span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><i>Danielle Gannon is a local Bucks County entrepreneur. Mom to three, she is co-owner of Organnons Natural Market and Founder &amp; Managing Director of Local Spotlight with Danielle. Her passion is connecting people and creating community. Residing in Ivyland, writing has always been a passion of hers. Find her on IG @localspotlightwithdanielle</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/02/eric1.jpg"
}