{
  "id": 14131,
  "title": "Local Spotlight with Danielle: Tornado Chasing Photographer Brandon",
  "slug": "local-spotlight-with-danielle-tornado-chasing-photographer-brandon",
  "date": "2022-07-13T17:11:06",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "Alexandru Valeri-Bruschini",
    "Danielle Gannon",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Danielle Gannon • The Cardinal Contributing Writer Meet Alexandru Valeri-Bruschini {aka Brandon!} Brandon and I met over the pandemic when I was seeking a videographer to help document my local spotlight series. Brandon lives in Yardley and has a fascinating background. He was born in Bucharest, Romania, and adopted in the United States when [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Danielle Gannon</strong> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">M</span><span class=\"s3\">eet Alexandru Valeri-Bruschini {aka Brandon!} Brandon and I met over the pandemic when I was seeking a videographer to help document my local spotlight series.</span></p>\n<p class=\"p5\"><span class=\"s3\">Brandon lives in Yardley and has a fascinating background. He was born in Bucharest, Romania, and adopted in the United States when he was 16 months old. He was raised by a single widowed mother and his grandparents. He grew up going through the Pennsbury school district and onto Pennsylvania State University.</span></p>\n<p class=\"p5\"><span class=\"s3\">Brandon has always enjoyed photography, was fascinated by the weather patterns, and admired the freedom pilots had in traveling the world at their leisure.</span></p>\n<p class=\"p5\"><span class=\"s3\">When he was 17 years old, he trained for his pilot’s license and received it.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">After graduating from PSU, he took a position with the government, working as a Supervisor of Meteorological Natural Disaster aka “Tornado Chaser”. This allowed him to mix all three of his passions in one fell swoop! He travels the country, tracking weather and natural disaster patterns through photography &amp; video. He sees this as an opportunity to explore the world and see all the places people would never usually choose to travel.</span></p>\n<p class=\"p5\"><span class=\"s3\">In doing this, his skills behind the camera got increasingly better. He started sharing them on social media and with friends and family. This natural progression led many to request his talent for their weddings, anniversaries, and special family events. So, he created his media company, TS Media, and began working nights and weekends to scratch his itch.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Now Brandon sees himself as a Globe Trotter. His mark has been made worldwide, with the most recent stop being in Africa in June 2022. He loves that his profession has given him a leg up in the world, to meet people of different cultures and backgrounds.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Through many business adventures and collaborations over the last few years, Brandon has become a good friend of mine. He is a genuine person with an open heart, always seeking connection and camaraderie. You will see him posting pictures of Philly one day and Florida the next. He flies a small plane, often out of New Jersey occasionally, and enjoys keeping that hobby alive. He wears all the hats, and he wears them well! It’s a rare occasion when asking him to assist on a project that he declines. He is always up for the challenge!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">He would love to meet his birth parents one day, and that’s on his bucket list. In the meantime, he is grateful for the family he has and all the success he has been afforded.</span></p>\n<p class=\"p5\"><span class=\"s3\">Look no further if you are searching for a local photographer/videographer for your event. Brandon is the man for the job! You can contact him at <a href=\"mailto:airlitestudios@gmail.com\">airlitestudios@gmail.com</a> • 215-495-9488 • IG: @ts_media_ • IG: the_weatha_man</span></p>\n<p class=\"p5\"><span class=\"s3\">“I see myself continuing with the love for my career, helping people all around the world, one day at a time”, states Bruschini.</span></p>\n<p class=\"p6\"><i>Danielle Gannon is a local Bucks County entrepreneur. Mom to three, she is an English teacher at RedBarn Homeschool (a local co-op she co-founded), co-owner of Organnons Natural Market and Founder &amp; Managing Director of Local Spotlight with Danielle. Her passion is connecting people and creating community. Residing in Ivyland, writing has always been a passion of hers. Find her on IG @localspotlightwithdanielle</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/07/brandonpilot.jpg"
}