{
  "id": 17934,
  "title": "Local Organizations Show Kindness To Animals",
  "slug": "local-organizations-show-kindness-to-animals",
  "date": "2023-08-06T22:37:30",
  "author": "Staff",
  "category": [
    "Fit",
    "Live"
  ],
  "tags": [
    "doylestown cardinal",
    "Edie Weinstein",
    "Grey Muzzle Manor"
  ],
  "excerpt": "<p>By Edie Weinstein • The Cardinal Contributing Writer Kindness isn’t limited to two-legged beings. Our four-legged friends deserve our attention, energy, and care. In our region, there are several animal rescue programs that shine a light on the importance of looking after those with whom we share the planet. One is Grey Muzzle Manor, located [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Edie Weinstein • </strong></em>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">K</span><span class=\"s1\">indness isn’t limited to two-legged beings. Our four-legged friends deserve our attention, energy, and care. In our region, there are several animal rescue programs that shine a light on the importance of looking after those with whom we share the planet.</span></p>\n<p class=\"p5\"><span class=\"s3\">One is </span><span class=\"s4\"><strong>Grey Muzzle Manor</strong>,</span><span class=\"s3\"> located in Mohrsville, PA. What makes this sanctuary unique is that it tends to elder and infirm horses and provides hospice care as the horses approach their final finish line. The Manor also offers Animal Assisted Equine Therapy in which the horses serve as co-counselors in support of the client’s emotional needs. Grey Muzzle hosts yoga on the farm so participants can enjoy a one-hour class in the presence of the horses. The program also offers Support for Animals Enabling Recovery (SAFER), which provides foster care for those leaving domestic violence situations or entering into treatment for addiction or mental health concerns. The organization’s goal is to provide loving care and reunification of family members in crisis.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><a href=\"https://greymuzzlemanor.org\" target=\"_blank\" rel=\"noopener noreferrer\"><span class=\"s5\">https://greymuzzlemanor.org</span></a></p>\n<p class=\"p5\"><span class=\"s6\">Logan’s Heroes</span><span class=\"s1\"> is an East Greenville haven for rescued or abused animals. The agency’s mission is to give the animals a loving home with people who care about their well-being. Its namesake was a German Shepherd puppy named Logan who came to the caretakers in desperate medical need. Although he didn’t survive, the last days of his life were filled with love. The animals who have passed through the care of Logan’s Heros include dogs, horses, pigs, and goats.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><a href=\"https://www.lharinc.org\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.lharinc.org</a></p>\n<p class=\"p5\"><strong><span class=\"s7\">Stray Cat Blues</span></strong><span class=\"s8\"> based in Colmar sets its mission, ”to rescue stray and abandoned cats and kittens located in areas of Montgomery, Bucks, and other suburban Philadelphia counties and find them safe and appropriate homes.” This organization encourages people to adopt barn cats accustomed to living outdoors and would be more at ease living in a barn than in someone’s home. The Whiskers Way Program helps to socialize cats and prepare them for living in homes and with other felines.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><a href=\"https://www.straycatblues.org\" target=\"_blank\" rel=\"noopener noreferrer\"><span class=\"s9\">https://www.straycatblues.org</span></a></p>\n<p class=\"p5\"><strong><span class=\"s6\">Safe Haven Thoroughbred Rescue</span></strong><span class=\"s1\"> located in Bedminster Township and its owner Kate Goldenberg are dedicated to being a rescue, rehabilitation, adoption center, and sanctuary for horses. “Horses that come through our facility are protected for life,” Goldenberg says. “Through daily operations, we promote the healing benefits of interactions between horses and the community.” Goldenberg also serves as a horse midwife and has assisted in bringing numerous foals into the world. I met her and began volunteering at Safe Haven in 2014 offering Reiki (an energy healing modality) for a few of the horses who were living there at the time. One had an injured leg; another was in the midst of an asthma attack, and yet another was a week-old colt who was about to have surgery on his eyes.</span></p>\n<p class=\"p5\"><span class=\"s1\">Each of these programs welcomes donations and volunteers.</span></p>\n<p class=\"p6\"><a href=\"https://www.safehaventhoroughbredrescue.org\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.safehaventhoroughbredrescue.org</a></p>\n<p class=\"p7\"><i>Edie Weinstein, MSW, LSW is a licensed social worker, psychotherapist, interfaith minister, journalist, speaker, PR, and marketing professional. She is also the grandmother of two wonderful children, whom she is teaching to be kind.</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/08/Grey-Muzzle.jpg"
}