{
  "id": 19136,
  "title": "“Mean Girls” Comes to CB West March 14-17",
  "slug": "mean-girls-comes-to-cb-west-march-14-17",
  "date": "2024-03-11T18:06:34",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "CB West",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer “On Wednesdays, we wear pink.”  Fans of Tina Fey’s 2004 bitingly funny look at the social politics of girls in high school will be excited to don their pink the third weekend in March to see Mean Girls come to life at CB West High School.  The [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><em><strong>By Dana Roberts</strong></em> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><strong>“On Wednesdays, we wear pink.”<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p5\"><span class=\"s1\">Fans of Tina Fey’s 2004 bitingly funny look at the social politics of girls in high school will be excited to don their pink the third weekend in March to see Mean Girls come to life at CB West High School.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">The show follows the experience of Cady Heron (played by senior Ellie Quinlisk), a former homeschool kid and the newest student at North Shore High School, as she gets caught up with social outcasts Janis (junior Alyssa Cooke) and Damian (sophomore Aiden Adams), who use Cady to take down the school’s most popular girl clique, “The Plastics,” Regina George, Karen Smith and Gretchen Weiner (played by senior Ella Petras, junior Carey Brigley, and senior Annika Grasso).<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">West’s Harlequin Club Director Claudine Piechotta, began her role in October. Ironically, she spent her childhood in Africa, like the main character Cady in the show. The mind-blown and applause emojis best capture my reflections after leaving the auditorium after watching the rehearsal, both because of the evident talent and the character of these teens in the club.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">Incredibly gifted, witty, thoughtful, and engaging humans, any of them could end up on the big screen or Broadway in the future. Their analysis of the importance of Mean Girls, and its deeper messages about acceptance and breaking harmful behavior patterns during adolescence, was spot-on.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">“A lot of social media is shown in Mean Girls, and especially in this day and age, social media is kind of all that teenagers know. I do think that the themes reflect modern-day bullying,” said Ella Petras, aka Regina George, the “queen of the Plastics.” Alyssa Cooke, the junior who plays Janis, the nemesis of Regina George, reflected: “I think Mean Girls also shows that bullying is less strangers talking to each other in the hallway, but, especially with girls, it’s [more] your friends and people who you’re close with… who know the things about you that can hurt you. Mean Girls shows when friends turn against each other.”</span></p>\n<p class=\"p6\"><span class=\"s1\">Annika Grasso, who plays Gretchen Weiner, says, “It’s really familiar to a lot of people. It’s iconic. It’s a movie from 2004 that almost everyone has seen.” Meanwhile, Alyssa Cooke touched on the fact that the licensing rights for the high school version of the play just came out, so it’s a “newer” show to delight audiences. She also expanded on the opportunities the play presents, role-wise, for the female student actors. “This is where drama comes in with theater for girls. There’s such heavy competition for roles because there’s shows with so many guys and there’s one female part, and ten girls who would be amazing at it.” Ellie Quinlisk, aka Cady Heron, added, “Especially since we have understudies, there’s a lot of opportunity in this show. It’s cool to see how many people can have a bigger role.”</span></p>\n<p class=\"p6\"><span class=\"s2\">The gentlemen in the cast bring a lot to the table, too. Audiences might recognize “Kevin G.” the hilarious student rapper, played by junior Brian File. They’ll also be stunned to learn that the sarcastic wit and incredible presence of “Damian” comes from a sophomore, Aiden Adams. And the dancing and acting talent of Jordan Blaszcyzyk, who plays Aaron, the love interest of Cady (and Regina’s former boyfriend) will also wow. Blaszcyzyk commented on why the play deserves attendance because of its “realness,” which incorporates some dialogue that could be considered crass. “High school’s not PG,” said Blaszcyzyk. “You’ll be walking around the hallways, and there are vulgar things that are said and that are done. If you’re gonna make a high school show not PG-13 or not how this show is, then that’s not actually a real representation of high school.”</span></p>\n<p class=\"p6\"><span class=\"s3\">Director Claudine Piechotta noted the logistical feat of pulling off this play with challenges in scene transitions. This show demanded all her skills, and the skills of vocal director Abby Marchione, choreographer Kate Work, and pit director Kat Morehouse. The challenge of producing a play one month sooner than the other high schools’ productions means longer evening and weekend rehearsals for this group. The production also faces the challenge of being fully self-funded by the Harlequin Club, which relies on fundraising and parent support for licensing rights and production costs.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">Head to <a href=\"http://cbsd.org/HarlequinClub\" target=\"_blank\" rel=\"noopener noreferrer\">cbsd.org/HarlequinClub</a> to get your tickets for any of the four shows: Thurs., March 14 at 7 pm, Friday, March 15 at 7 pm, Sat. March 16 at 7 pm, or Sun. March 17 at 2 pm. Tickets are $10 for students/staff/children and $15 for adults.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/03/Mean-Girls-full-cast-picture-e1710194758149.png"
}