{
  "id": 12443,
  "title": "Mercer Museum Revealed",
  "slug": "mercer-museum-revealed",
  "date": "2022-03-01T22:55:39",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "john lund",
    "mercer museum",
    "susan smith"
  ],
  "excerpt": "<p>By John Lund and Susan Smith • The Cardinal Contributing Writers Even if you are a native of Bucks County, you may not be aware of the unique history of castles that sit right in our backyard. As noted by “Visit Bucks County”, there are four castles in Bucks County, and three of those castles [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By John Lund and Susan Smith • </b>The Cardinal Contributing Writers</p>\n<p class=\"p3\"><span class=\"s2\">Even if you are a native of Bucks County, you may not be aware of the unique history of castles that sit right in our backyard. As noted by “Visit Bucks County”, there are four castles in Bucks County, and three of those castles happen to be in the Borough of Doylestown. The Mercer Museum, Fonthill Castle, and The Tile Works all offer things to do, for the whole family, during the remaining cold days of winter.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Throughout 2022, we plan to cover these three castles that offer unique tours to learn the history, the collections, and the architecture of these jewels within our town. This month we are featuring the iconic Mercer Museum.</span></p>\n<p class=\"p4\"><span class=\"s2\">Henry Chapman Mercer, born in 1856, was only a child when the Industrial Revolution was changing the way the world produced goods. The Industrial Revolution introduced modern technological advances, like steam and iron ore, to make goods faster, cheaper, and higher quality. The Industrial Revolution also made many of the tools previously used obsolete.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">When Henry Mercer, the adult anthropologist, was fifty-seven years old, he orchestrated the construction of a six-story, poured-in-place, concrete museum to the house. He displayed many of these obsolete tools used during the pre-industrial revolution. The entire building, including the roof, was constructed with concrete.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">The completed building was 115 feet tall and had nearly 300 windows. The museum layout featured a winding ramp that proceeded along the inner perimeter of the building’s natural atrium, feeding observers to over 50 rooms of displays and exhibits. Today, the museum complex features local and national traveling exhibits and a core museum collection of over 50,000 pre-Industrial tools.</span></p>\n<p class=\"p4\"><span class=\"s2\">As we toured the museum, we were impressed with the simple yet complex architecture of the building. The atrium was expansive as we looked up to soak in all the items, large and small, on display. Many of the larger items are left suspended within the core of the atrium across all six levels. We were told that Henry Mercer chose to suspend the items to provide the observer with a unique perspective of the pre-industrial tools.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">There were so many exhibits to see across a broad spectrum of trades that it took us nearly two hours to complete our self-guided tour. We loved all of the exhibits, but our personal favorite was the entire fourth floor. The fourth level exhibits consisted of Shingle Making, Spinning &amp; Weaving, Surveying &amp; Navigation, and Gunsmithing &amp; Weapons exhibits. It was amazing to see the ingenuity and creativity of our forefathers to make those tools that were so essential during their lifetime.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">On level three, we found the Research Library, which, according to the museum literature, “holds over 20,000 books, periodicals, and pamphlets. In addition, it contains 2,500 feet of county government archives, over 800 manuscript collections, more than 12,000 images, maps, and other records that document not only local history but the life and work of Henry Chapman Mercer and early American technology, culture, and folk art.”</span></p>\n<p class=\"p4\"><span class=\"s2\">In 1916, the Mercer Museum opened to the public and today is on the list US National Register of Historic Places and US National Historic Landmark District Contributing Property. The museum is also a Smithsonian Affiliate Museum.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Mercer Museum is operated by the Bucks County Historical Society. According to Kyle McKoy, President/Executive Director, Mercer Museum and Fonthill Castle at Bucks County Historical Society, “It is (our) mission to educate and engage our many audiences in appreciating the past, and to help people find stories and meanings relevant to their lives—both today and in the future. By stewarding Henry Mercer’s legendary castles, and the collections within, we hope to create meaningful experiences for guests of all ages.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Multiple membership levels are available for as little as $35 for Full-Time Students and Individual seniors for unlimited access to the museum. Other membership plans can be found on the website <a href=\"http://www.mercermuseum.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.mercermuseum.org</a>.</span></p>\n<p class=\"p4\"><span class=\"s2\">The Mercer Museum is open from 10 a.m. to 5 p.m. Tuesday through Saturday.</span></p>\n<p class=\"p7\"><strong>Timed-entry slots for Mercer Museum:</strong></p>\n<p class=\"p8\"><span class=\"s2\">10:00 a.m. – 11:00 a.m.</span></p>\n<p class=\"p8\"><span class=\"s2\">Exclusive hour for Seniors 65+<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p8\"><span class=\"s2\">and Immunocompromised Guests</span></p>\n<p class=\"p8\"><span class=\"s2\">11:00 a.m. – 1:00 p.m.</span></p>\n<p class=\"p8\"><span class=\"s2\">General Admission</span></p>\n<p class=\"p8\"><span class=\"s2\">1:00 p.m. – 3:00 p.m.</span></p>\n<p class=\"p8\"><span class=\"s2\">General Admission</span></p>\n<p class=\"p8\"><span class=\"s2\">3:00 p.m. – 5:00 p.m.</span></p>\n<p class=\"p8\"><span class=\"s2\">General Admission</span></p>\n<p class=\"p7\"><strong>Admission:</strong></p>\n<p class=\"p8\"><span class=\"s2\">Members Free • Adult $15</span></p>\n<p class=\"p8\"><span class=\"s2\">Senior (65 and up) $13 • Student $10</span></p>\n<p class=\"p8\"><span class=\"s2\">Youth (6-17) $8 • 5 and under FREE</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/03/mercer-museum.jpg"
}