{
  "id": 18505,
  "title": "New Cafe and Jewelry Store Open in Doylestown",
  "slug": "new-cafe-and-jewelry-store-open-in-doylestown",
  "date": "2023-12-14T16:14:11",
  "author": "Staff",
  "category": [
    "Style",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "sarah cornwell jewelry",
    "Wheat and Vine"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer Local Businesswomen Join a New Venture October is National Women’s Small Business Month, a time to celebrate the benefits women bring to communities when they own small businesses. A new joint venture adds to the must-frequent list in Doylestown: Sarah Cornwell Jewelry and Wheat and Vine, a [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Dana Roberts • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\">Local Businesswomen Join a New Venture</p>\n<p class=\"p4\"><span class=\"s1\">October is National Women’s Small Business Month, a time to celebrate the benefits women bring to communities when they own small businesses. A new joint venture adds to the must-frequent list in Doylestown: Sarah Cornwell Jewelry and Wheat and Vine, a café and gourmet and specialty food store, which opened at 266 South Main St. on September 30.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">The stores bring welcome zest to a formerly quiet block of the borough, which is also inhabited by OPA Grille, Heather Bleu Home, and Las Fridas Mexican Kitchen. The spaces, which are connected via a shared interior door, provide patrons with a unique, multisensory experience. They offer the perfect venue to meet a friend for a cup of coffee and a delicious treat, pick up a gift, or spend time browsing carefully selected items and beautiful jewelry in a cozy, welcoming environment.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">The new brick-and-mortar location, which is the first retail space for Sarah Cornwell Jewelry and the second for Wheat and Vine’s owner Jessica Jackson, signifies a milestone for both women: the expansion of their brands individually, and also an exciting new collaborative experience. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong>Familiar Local Faces</strong></p>\n<p class=\"p4\"><span class=\"s1\">The names of both women are likely familiar ones. Sarah Cornwell, 47, is a long-time Doylestown resident and a CB West graduate, class of ’94. (Fun fact: she is the original “water girl” of the hanging baskets in the borough, which was her first job.) Her three children attend school in Central Bucks, and her husband is a local commercial realtor.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Cornwell’s lovely, delicate jewelry is what she has become well-known for. Jewelry-making has been a part of her life for over 20 years, but only in the last five years has her brand really exploded. Cornwell has had a home studio above her garage in Doylestown for some time, and her team of makers and support staff has grown to include 13 women. Her booth at Doylestown Arts Fest has been a staple for the last 10 years, and her jewelry has also been available at Makers: Vintage + Handmade at The Square in Dublin, and at The Craftery markets since 2018.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Makers: Vintage + Handmade (affectionately dubbed “Makers”), Wheat and Vine, and The Craftery are the delightful brainchildren of Jessica Jackson, 41, and each offers a unique and creative consumer experience. Both Makers and the initial Wheat and Vine Location are located at 123 N. Main Street in Dublin, in The Square. Makers is a market showcasing the handmade wares of talented artisans, and Wheat and Vine’s first location offers artisanal and gourmet food items curated by Jackson herself. Her husband, Kevin is the co-owner of the businesses. The Craftery is Jackson’s other well-known endeavor and encompasses individual craft markets showcasing various vendors, held at unique locations throughout the year. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Jackson, who is also a mom of three and a Bucks County local, has taken a dynamic path to get to her current professional enterprise. Crafting and interior design have always been her passions. She started a blog and was a part of the original “Real Housewives of Bucks County” (their name eventually changed to East Coast Creative), a group of female crafters, including entrepreneur Monica Mangin.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">After years of blogging, Jackson and Mangin were eventually contacted to do a segment on high-end DIY on the Nate Berkus show. The segment did well, and from there, their own show, Knock It Off, was born. The show aired in 2013 and had a successful season, but the demands of TV were difficult to sustain. Jackson found an inventive solution to meet her family’s needs and her own creative desires: she started The Craftery in 2014. The Craftery began with markets of 15 different vendors, plus evening and weekend workshops. In her first year, Jackson was recognized by Philadelphia Magazine in its coveted “Best of” List for the success of the markets. The Craftery now holds six to eight markets a year in locations all over Bucks County. Sarah Cornwell joined The Craftery as a vendor in 2018, thus establishing her relationship with Jackson.<span class=\"Apple-converted-space\"> </span></span></p>\n<p><a href=\"https://doylestowncardinal.com/wp-content/uploads/2023/12/KTP_0066.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-large wp-image-18507\" src=\"https://doylestowncardinal.com/wp-content/uploads/2023/12/KTP_0066-1024x683.jpg\" alt=\"\" width=\"1024\" height=\"683\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2023/12/KTP_0066-1024x683.jpg 1024w, https://doylestowncardinal.com/wp-content/uploads/2023/12/KTP_0066-300x200.jpg 300w, https://doylestowncardinal.com/wp-content/uploads/2023/12/KTP_0066-768x513.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2023/12/KTP_0066-414x276.jpg 414w, https://doylestowncardinal.com/wp-content/uploads/2023/12/KTP_0066-470x313.jpg 470w, https://doylestowncardinal.com/wp-content/uploads/2023/12/KTP_0066-640x426.jpg 640w, https://doylestowncardinal.com/wp-content/uploads/2023/12/KTP_0066-130x86.jpg 130w, https://doylestowncardinal.com/wp-content/uploads/2023/12/KTP_0066-187x124.jpg 187w, https://doylestowncardinal.com/wp-content/uploads/2023/12/KTP_0066-990x661.jpg 990w, https://doylestowncardinal.com/wp-content/uploads/2023/12/KTP_0066-1320x881.jpg 1320w, https://doylestowncardinal.com/wp-content/uploads/2023/12/KTP_0066.jpg 1470w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" /></a></p>\n<p class=\"p5\"><strong>New Adventure</strong></p>\n<p class=\"p4\"><span class=\"s1\">The impetus for the new joint space was sparked by Cornwell, whose expanding product line and growing team proved to need a bigger space than her home studio could offer. She began to look at only single-space retail locations in Doylestown but had harbored the thought of a possible collaboration with Jackson. “I always said that the only person I would ever go into business with is Jessica Jackson,” said Cornwell. “Everything she touches turns to gold.” Eventually, that dream became reality: in mid-October 2022, Cornwell saw the location and then showed it to Jackson. By March 2023, the women had signed a lease for the spaces, which are a combined 3,000 square feet.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">The place they have created reflects the communal feel that is important to them both. It showcases their unique personalities and offerings.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong>Wheat and Vine</strong></p>\n<p class=\"p4\"><span class=\"s1\">Jackson hopes that Wheat and Vine will make patrons feel like they are walking into her family kitchen, filled with delicious smells of coffee (provided by Rival Brothers Coffee) and amazing baked goods (by Pie Bird Farm, an Ottsville-based farm known for delicious hand pies and treats). Wheat and Vine is a deep, warm, cozy space, designed by Jackson herself and furnished with pieces by Hartland Salvage, Life’s Patina Farm, and Finished Spaces (owned by Cornwell’s brother, Jake Borden).<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Besides goods from the café and specialty products (including seasonings, snacks, chips and dip, local chocolates, drink mixers, jerky, and charcuterie), Wheat and Vine will also offer unique events, including cheese tastings and a grilled cheese happy hour on Fridays, starting in January 2024. Wheat and Vine also takes online orders and does gift boxes and corporate gift orders. In-store patrons can look forward to outdoor seating as well, likely in spring 2024.<span class=\"Apple-converted-space\"> </span></span></p>\n<figure id=\"attachment_18508\" aria-describedby=\"caption-attachment-18508\" style=\"width: 1024px\" class=\"wp-caption alignnone\"><a href=\"https://doylestowncardinal.com/wp-content/uploads/2023/12/a9c9e67b-d32a-404c-9a4a-3392ca5df8bf.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-18508\" src=\"https://doylestowncardinal.com/wp-content/uploads/2023/12/a9c9e67b-d32a-404c-9a4a-3392ca5df8bf-1024x682.jpg\" alt=\"\" width=\"1024\" height=\"682\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2023/12/a9c9e67b-d32a-404c-9a4a-3392ca5df8bf.jpg 1024w, https://doylestowncardinal.com/wp-content/uploads/2023/12/a9c9e67b-d32a-404c-9a4a-3392ca5df8bf-300x200.jpg 300w, https://doylestowncardinal.com/wp-content/uploads/2023/12/a9c9e67b-d32a-404c-9a4a-3392ca5df8bf-768x512.jpg 768w, https://doylestowncardinal.com/wp-content/uploads/2023/12/a9c9e67b-d32a-404c-9a4a-3392ca5df8bf-414x276.jpg 414w, https://doylestowncardinal.com/wp-content/uploads/2023/12/a9c9e67b-d32a-404c-9a4a-3392ca5df8bf-470x313.jpg 470w, https://doylestowncardinal.com/wp-content/uploads/2023/12/a9c9e67b-d32a-404c-9a4a-3392ca5df8bf-640x426.jpg 640w, https://doylestowncardinal.com/wp-content/uploads/2023/12/a9c9e67b-d32a-404c-9a4a-3392ca5df8bf-130x86.jpg 130w, https://doylestowncardinal.com/wp-content/uploads/2023/12/a9c9e67b-d32a-404c-9a4a-3392ca5df8bf-187x124.jpg 187w, https://doylestowncardinal.com/wp-content/uploads/2023/12/a9c9e67b-d32a-404c-9a4a-3392ca5df8bf-990x659.jpg 990w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" /></a><figcaption id=\"caption-attachment-18508\" class=\"wp-caption-text\">Wheat and Vine</figcaption></figure>\n<p class=\"p5\"><strong>Sarah Cornwell Jewelry</strong></p>\n<p class=\"p4\"><span class=\"s1\">Meanwhile, Cornwell’s space feels like a curiosity shop in Notting Hill, with charming wallpaper and thoughtfully designed nooks and crannies designed by her interior designer, Doylestown local and UK native Corinna Blair. Sarah Cornwell Jewelry houses her workshop and also offers custom candles, skincare products, textiles, stationery, and jewelry dishes, in addition to her handcrafted jewelry. Jewelry lovers can visit the store for custom and personalized jewelry, as well as permanent jewelry as well. Jewelry classes and special events for bridal groups and birthday parties are also offered, and other special events will launch in October. Cleverly, Sarah Cornwell Jewelry also gives out a “Bored Husband” voucher for a free cup of coffee at Wheat and Vine for the significant others of those perusing jewelry.</span></p>\n<p class=\"p5\"><strong>A Cozy Destination for Every Taste</strong></p>\n<p class=\"p4\"><span class=\"s1\">Cornwell and Jackson want a visit to their spaces to feel experiential, warm, joyous, and welcoming. They want to be a place to inspire connections for visitors and know that Doylestown is the perfect location for the elevated and upscale experience their stores provide. Visit their stores this month and know that it likely will be the first of many visits you’ll make.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s1\">Follow them on Instagram: @sarahcornwelljewelry, @wheatandvineprovisions. Store hours: Sarah Cornwell Jewelry: Wednesday-Saturday 10-6, Sunday 11-4; Wheat and Vine: Tuesday-Saturday 9-6, Sunday 9-4.</span></p>\n<p class=\"p4\"><span class=\"s1\">Be sure to visit Jackson’s upcoming Craftery markets as well, at the Mercer Museum on Saturday, October 21st from 10-4, and in Downtown Perkasie on Saturday, November 18th from 10-4.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/IMG_8067.jpg"
}