{
  "id": 11384,
  "title": "New Doylestown Historical Society Exhibit Highlights Delaware Valley University’s History",
  "slug": "new-doylestown-historical-society-exhibit-highlights-delaware-valley-universitys-history",
  "date": "2021-09-10T15:05:11",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live",
    "Style"
  ],
  "tags": [
    "Delaware Valley University",
    "doylestown cardinal",
    "Doylestown Historical Society",
    "Dr. Joseph Krauskopf"
  ],
  "excerpt": "<p>The exhibit explores Doylestown Agriculture and DelVal’s History. This year, Delaware Valley University is celebrating 125 years of experiential learning! As part of the University’s celebrations, DelVal is partnering with the Doylestown Historical Society on an exhibit titled, “The Doylestown Historical Society and Delaware Valley University: 125 Years of Experiential Learning and Doylestown Agriculture, 1896 [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><b><i>The exhibit explores Doylestown Agriculture and DelVal’s History.</i></b></span></p>\n<p class=\"p3\">This year, Delaware Valley University is celebrating 125 years of experiential learning! As part of the University’s celebrations, DelVal is partnering with the Doylestown Historical Society on an exhibit titled, “The Doylestown Historical Society and Delaware Valley University: 125 Years of Experiential Learning and Doylestown Agriculture, 1896 to 2021.” The exhibit is now open and runs through Jan. 29, 2022.</p>\n<p class=\"p5\">This collaborative exhibit features the University’s growth and expansion from the National Farm School to a college and then, to a university. The exhibit examines the University’s relationship to Doylestown and how the school fits into local history. Guests will be able to view artifacts, rare photos, and chronological information on the growth of the university, and explore DelVal’s connections to Doylestown. In support of the exhibit, is a newly researched tour of the Historic Shaw District and the Agricultural Works.</p>\n<p class=\"p5\">“We’re pleased to partner with the Doylestown Historical Society on this exhibit, which celebrates both Doylestown’s history and the history of DelVal,” said DelVal Interim President Dr. Benjamin E. Rusiloski. “We’re fortunate at DelVal to be a part of the surrounding Bucks County community and, to be able to partner with cultural organizations like the Doylestown Historical Society.”</p>\n<p class=\"p5\"><span class=\"s1\">Staff from the University library teamed up with the Doylestown Historical Society to help create the exhibit. Library staff played a key role in the process by going through the University’s archives and pulling interesting information and items to share with the community.</span></p>\n<p class=\"p5\">“In 1896, visionary scholar, educator and activist Dr. Joseph Krauskopf founded the school that would become Delaware Valley University on the idea of “science with practice,” a combination of classroom learning and hands-on experience,” said Dr. Tanya Casas, dean of the School of Business and Humanities and chair of the University’s 125th Anniversary Committee. “Dr. Krauskopf’s vision is still at the center of the student experience at DelVal, where today, 100 percent of our students gain real-world experience before graduation. The exhibit explores our University’s journey and evolution and DelVal’s role in the local history of Doylestown.”</p>\n<p class=\"p5\">Celebrations of the University’s 125th Anniversary will be ongoing and will involve the community. In addition to the historical exhibit, DelVal has launched a 125th Anniversary section of its website where special projects including events, a magazine, and videos will be shared. The University has also established the 125th Anniversary Scholarship Fund, which will help DelVal continue to provide students with generous scholarship support. For the latest updates on the celebrations, please visit delval.edu/125.</p>\n<p class=\"p5\"><b>About the Exhibit:</b></p>\n<p class=\"p5\">“The Doylestown Historical Society and Delaware Valley University: 125 Years of Experiential Learning and Doylestown Agriculture, 1896 to 2021”</p>\n<p class=\"p5\">Doylestown has a rich history as an agricultural center. In 1867, Doylestown Agricultural Works was constructed to produce farm machinery and ironwork and was the area’s largest employer for many years. In 1896, Rabbi Joseph Krauskopf, leader of the reform congregation Keneseth Israel in Philadelphia, founded the country’s first farm school, The National Farm School (NFS). He founded NFS with the mission of educating poor boys, who were living in urban slums, to become farmers so they could live a better life. He had a very innovative educational philosophy that he called, “science with practice.” These students would be educated in the science of farming with courses in plant science and animal science, but they would also be taught math, history, and English. And most importantly, they would learn in the classroom and then practice, literally, in the fields and laboratories on campus.</p>\n<p class=\"p5\">Today, “experiential education” is a hot topic in higher education. Over the last several decades, many colleges and universities have implemented successful internship programs and provided other hands-on learning opportunities. But the National Farm School, now Delaware Valley University, was founded on this principle and today experiential learning is woven into the curriculum from year one. It is more than an internship program. It is a way of learning that prepares DelVal students for success in their chosen career paths.</p>\n<p class=\"p5\"><span class=\"s1\">The Borough of Doylestown grew as the University grew. When Joseph Krauskopf realized his goal of a school where young men would find a future in farming, Doylestown was transforming itself. The arrival of the North Pennsylvania train line to the borough bought ready access to markets in Philadelphia. The Agricultural Works, a farm equipment manufacturing company, expanded and thrived, as did commerce along State Street and Main Street.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">DelVal students became a part of the town, from Homecoming parades to fraternity civic events. They grew flowers to beautify the town, painted the lobby of the YMCA and performed choral presentations at community venues. DelVal welcomed the community by hosting the annual high school Olympiads, the A-Day fair, musical concerts, and currently sponsors the Center for Learning in Retirement (CLR) Program for area seniors. Doylestown Borough celebrates its partner’s 125 years of experiential learning at Delaware Valley University.</span></p>\n<p class=\"p5\"><b>Learn More and Visit the Exhibit:</b></p>\n<p class=\"p5\">The Doylestown Historical Society, located at 56 South Main Street in Doylestown, Pennsylvania, is open and operating in sanitized conditions Wednesdays through Saturdays from 10 a.m. to 3 p.m. The exhibit is now open and runs through Jan. 29, 2022. To learn more, please visit <a href=\"http://doylestownhistorical.org/exhibits\" target=\"_blank\" rel=\"noopener noreferrer\">doylestownhistorical.org/exhibits</a>.</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/09/DeVal-Historical-Exhibit.jpg"
}