{
  "id": 11927,
  "title": "New Year, Thicker Wallet",
  "slug": "new-year-thicker-wallet",
  "date": "2021-12-20T13:52:17",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "brian pultro",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Brian Pultro, AIF, BFA, RFC® • The Cardinal Contributing Writer Happy New Year! You made it through 2021 and are poised to start 2022 off right! For many of us, The New Year focus tends to be on shedding pounds to get healthier. I would argue that we should be worried about putting weight [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Brian Pultro, AIF, BFA, RFC® • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">H</span><span class=\"s3\">appy New Year! You made it through 2021 and are poised to start 2022 off right! For many of us, The New Year focus tends to be on shedding pounds to get healthier. I would argue that we should be worried about putting weight on where it counts. How about adding some density to that wallet and transforming our financial health in 2022? You don’t need washboard abs to survive into your 90’s, but you do need enough money to make it through your twilight years. So, let’s start off 2022 right by putting pounds on that wallet and tightening up our finances.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">• </span>Make Cash Cool Again</strong></p>\n<p class=\"p6\"><span class=\"s3\">Sometimes modern conveniences can hinder us. Swiping a credit card is pretty easy and doesn’t illicit an emotion. Using Apple Pay from your phone is even easier. “Let me pay for something with this device that my brain has been wired to think has more to do with Candy Crush than exchanging money.” I like to urge folks that have a swiping and tapping problem to make cash cool again. Give yourself a monthly spending budget and put that amount, in an envelope, in cash. The exchange of money feels like a loss and when you are running low on funds, you will become more frugal to conserve your spending money. Once our envelope is empty, you have to wait until the next month to refill it.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">•</span> You Cut the Cord</strong></p>\n<p class=\"p6\"><span class=\"s3\">But you have 19 different streaming services. All of us have certain shows that we must watch, I get it. But do we need to pay for a streaming service year round just to binge Ted Lasso for a week or two? Most streaming services are month to month. So, if there are ones that you don’t need year round, consider waiting until the entire season of your favorite show has been released to pay for the subscription. Ten episodes of The Crown comes out to 4 months of payments to Netflix. You could just wait until all 10 are out and pay for 1 month to binge the entire season.</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">•</span> Check your January Bills</strong></p>\n<p class=\"p6\"><span class=\"s3\">Remember that time the kids wanted you to get the premium version of “My Talking Pet” for your phone, so they could make a photo of Doug, your golden retriever, sing Disney songs? Of course you don’t, because it was years ago, and you are still paying $23 per year for the app! If you had no idea you were paying for your kids to make a photo of a sloth tell Dad jokes, then what else are you paying for? Find out!</span></p>\n<p class=\"p5\"><strong><span class=\"s3\">•</span> Mornings are for (Coffee) Lovers</strong></p>\n<p class=\"p6\"><span class=\"s3\">A 1-pound bag of coffee costs $15 dollars on the high end and can net you roughly 10-14 pots of coffee. That comes out to less than $1 per pot…that’s like $0.10 per cup! I am not suggesting you can’t treat yourself to a cup of coffee in the drive-through (paid for in cash) every now-and-then, but if you do it every day, you could be spending $20 per week for 5 cups of coffee! Just think about how all of that adds up over time and then enjoy a little more time at home in the morning.</span></p>\n<p class=\"p6\"><span class=\"s3\">Some simple changes to start 2022 could really slim down that spending and make your wallet feel like it needs to grab those sweatpants after Thanksgiving dinner. Just think, you can use all the money you are saving to pay for a gym membership so you can have those washboard abs well into your 90’s!</span></p>\n<p class=\"p7\"><span class=\"s4\"><i>Brian Pultro is a Doylestown native, Navy Veteran, and local Financial Advisor. His practice is built upon the foundations of “Behavioral Finance” and training individuals and families on how to take natural human emotions out of the investment process.</i></span></p>\n<p class=\"p9\"><b>Pultro Financial Management</b></p>\n<p class=\"p9\"><b>(215) 489-3876 • <a href=\"mailto:brian.pultro@LPL.com\">brian.pultro@LPL.com</a></b></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/12/budgeting-money-save.jpg"
}