{
  "id": 14799,
  "title": "Popular Picnics on Pine",
  "slug": "popular-picnics-on-pine",
  "date": "2022-09-12T22:55:26",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "jamie stem",
    "Joe Montone",
    "picnics on pine"
  ],
  "excerpt": "<p>By Jamie Stem • The Cardinal Contributing Writer One of the great things about Doylestown is our active and lively art scene. From the Michener museum to the Doylestown arts or music fest, this little corner of Bucks County has a reputation as a harbor for artists from all walks of life.  For me, as [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Jamie Stem • </strong><span class=\"s1\">The Cardinal Contributing Writer</span></p>\n<p class=\"p3\"><span class=\"s3\">O</span><span class=\"s2\">ne of the great things about Doylestown is our active and lively art scene. From the Michener museum to the Doylestown arts or music fest, this little corner of Bucks County has a reputation as a harbor for artists from all walks of life.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">For me, as a Doylestown musician, it’s one of the things about my hometown I am proudest of; we are a community of artists, blessed with the venues and spaces to perform, observe and cheer for other artists.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Music is such a vital part of the arts scene in Doylestown, and you can’t talk about music in Doylestown without bringing up Joe Montone and his concert series, Picnics On Pine. This concert series, developed in 2020, is based 100% on live original music performed by huge acts like Anthony Green, Low Cut Connie, Snacktime, and Carsie Blanton outdoors in the heart of Doylestown.<span class=\"Apple-converted-space\"> </span></span></p>\n<figure id=\"attachment_14800\" aria-describedby=\"caption-attachment-14800\" style=\"width: 539px\" class=\"wp-caption alignleft\"><a href=\"https://doylestowncardinal.com/wp-content/uploads/2022/09/JOE-MIC-2.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\" wp-image-14800\" src=\"https://doylestowncardinal.com/wp-content/uploads/2022/09/JOE-MIC-2.jpg\" alt=\"\" width=\"539\" height=\"812\" srcset=\"https://doylestowncardinal.com/wp-content/uploads/2022/09/JOE-MIC-2.jpg 714w, https://doylestowncardinal.com/wp-content/uploads/2022/09/JOE-MIC-2-199x300.jpg 199w, https://doylestowncardinal.com/wp-content/uploads/2022/09/JOE-MIC-2-680x1024.jpg 680w\" sizes=\"auto, (max-width: 539px) 100vw, 539px\" /></a><figcaption id=\"caption-attachment-14800\" class=\"wp-caption-text\">Joe Montone</figcaption></figure>\n<p class=\"p5\"><span class=\"s2\">Picnics on Pine is, in its purest form, a block party celebrating music, food, life, and community. With a stage located at 84 East Oakland Avenue and a reputation as one of the best, if not only, places for people of all ages to see live original music in Doylestown, the concert series continues to grow in popularity.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Part of the reason for that is Joe Montone; he has done an incredible job bringing in musical talent to perform. This month Ceramic Animal, fresh off a three-week tour with The Black Keys and Band Of Horses, will be headlining the concert at Picnics on Pine on Saturday, September 24th at 4:30 pm.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Food is always an essential component of these concerts, and Joe has done a great job of recruiting the talent on that end as well, bringing in the Servis Events. These local twin brothers will provide a selection of tacos infused with their passion for intimate farm-to-table dining experience.</span></p>\n<p class=\"p5\"><span class=\"s2\">As if that’s not enough, the backdrop of the beautiful iconic red barn that Picnics on Pine is known for provides an unforgettable small-town concert experience like no other. Guests are encouraged to bring their own picnic blankets or chairs to enjoy the show and food as the sun goes down.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">When speaking with Joe about growing up in this town, we both agreed that having access to original music at a young age is a big part of what shaped us both into the musical adults we are today. What a blessing to have a venue that provides just that, a seasonal beacon of arts in the center of town in a beautiful, intimate setting!</span></p>\n<p class=\"p5\"><span class=\"s2\">All of this would never have been possible if not for a chance meeting with Kristin and Daniel Moore who provide the space for Picnics on Pine. Between the Moore’s and other local contributors, Picnics on Pine has been able to thrive and grow into what it is today.</span></p>\n<p class=\"p5\"><span class=\"s2\">For tickets and more info visit: <a href=\"http://picnicsonpine.com\" target=\"_blank\" rel=\"noopener noreferrer\">http://picnicsonpine.com</a> or @picnicsonpine on Facebook and Instagram</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/09/LCC-at-Distance-Picnic-On-Pine-e1663037709373.jpeg"
}