{
  "id": 17679,
  "title": "Quinoa: Family Roots From Peru and Mexico Thrive in Doylestown",
  "slug": "quinoa-family-roots-from-peru-and-mexico-thrive-in-doylestown",
  "date": "2023-06-14T17:28:17",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "Cinco de Mayo",
    "doylestown cardinal",
    "Fausto Egoavil",
    "lauren heine",
    "Quinoa restaurant",
    "Said Anguiano"
  ],
  "excerpt": "<p>By Lauren Heine • The Cardinal Contributing Writer Truth: I don’t know the secret to happiness but I’ve never been sad at a Mexican restaurant. Add BYO and you don’t need a reason to celebrate Cinco de Mayo only once a year.  The close-knit Egoavil and Anguiano families have this equation figured out, severing up [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By Lauren Heine • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">T</span><span class=\"s1\">ruth: I don’t know the secret to happiness but I’ve never been sad at a Mexican restaurant. Add BYO and you don’t need a reason to celebrate Cinco de Mayo only once a year.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The close-knit Egoavil and Anguiano families have this equation figured out, severing up authentic Peruvian and Mexican dishes for over a decade. Quinoa is their 2nd family-owned and operated restaurant located on East State Street in Doylestown.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">It all started when Said Anguiano shared his dream with his father-in-law, Fausto Egoavil, of opening a quality taco place. Fausto was retired and a dreamer himself with a fierce love for his family – he had to make it happen. El Tule in Lambertville NJ soon opened with Said and Fausto’s wife Carmen creating dishes from their native Mexico and Peru respectively.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">After the success of their Peruvian menu on Wednesdays and weekends the family saw the demand for traditional Peruvian cuisine and a Doylestown location. Carmen, who always loved to cook, traveled back to Peru for inspiring culinary studies. Their children Jack, Mechelle (married to Chef Said), and Silvia (married to husband Alexis) soon left their own professions to become a family of prosperous full-time restaurateurs.</span></p>\n<p class=\"p5\"><span class=\"s1\">Their love for each other and their cuisine is inspirational. They’re passionate about bringing forth conventional yet innovative dishes, such as their Arroz Con Marisco and Pisco sours (BYO brandy). They also source ingredients from Peru and Mexico including Leche de Tigre for their ceviche as well as all nine specialty peppers for their time-intensive mole sauce. They even created their own prep plant to ensure consistency and quality. It streamlines efficiency and distributes staples like its fresh salsa and handmade tortillas to both restaurant locations daily.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s1\">The entire menu is deliciously crafted regardless of the time of year. However, if you’re seeking a cultural foodie experience on this Cinco de Mayo there’s no better place to visit. Quinoa is celebrating its Mexican heritage with $5 crunchy tacos and a free house-made Margarita with your entrée (while supplies last). I think you’ll agree, it’s a nacho average Mexican restaurant!<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/06/IMG_1565.jpeg"
}