{
  "id": 16976,
  "title": "School Board Controversy",
  "slug": "school-board-controversy",
  "date": "2023-03-06T17:32:38",
  "author": "Staff",
  "category": [
    "Uncategorized"
  ],
  "tags": [],
  "excerpt": "<p>Opinion by Zandi Hall On Tuesday, February 7th, the Central Bucks School Board met, one month after the majority passed Policy 321, prohibiting pride flags and more. The most notable topic during public comment was the removal of Nobel Peace Prize winner Elie Wiesel’s quote from the CB South library wall, “We must always take [&hellip;]</p>\n",
  "content": "<p><strong>Opinion by Zandi Hall</strong></p>\n<p class=\"p1\"><span class=\"s1\">On Tuesday, February 7th, the Central Bucks School Board met, one month after the majority passed Policy 321, prohibiting pride flags and more. The most notable topic during public comment was the removal of Nobel Peace Prize winner Elie Wiesel’s quote </span><span class=\"s2\">from the CB South library wall</span><span class=\"s1\">, </span><span class=\"s2\">“We must always take sides. Neutrality helps the oppressor, never the victim. Silence encourages the tormentor, never the tormented.” This quote was removed </span>because it violated Policy 321, a decision that was later reversed after international outcry in the media.</p>\n<p class=\"p2\">The board limited public comment to two hours. Many people didn’t get to speak. In addition to anti-semitism, taxpayers spoke about hiring law firms connected to anti-LGBTQ<span class=\"Apple-converted-space\">  </span>hate groups, changes to the library book policy, and outrage at the waste of taxpayer dollars through a $15,000/month PR firm and a politically connected Philadelphia lawyer making $940/hour.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p2\">Sadly, this wasn’t enough for the Central Bucks school board to see the deep divisions they are creating in our community.<span class=\"Apple-converted-space\">  </span>The day after the outcry from community members, Sharon Collopy, a member of the school board majority, called for changes to Policy 011,<span class=\"Apple-converted-space\">  </span>Principles for Governance and Leadership, removing from the Advocate Earnestly section of the policy: “Promote public education as a keystone of democracy. Engage the community by seeking input, building support networks, and generating action.”</p>\n<p class=\"p2\">The last month confirms students&#8217; worst fears: we are political pawns in CBSD’s extremist agenda. This is only the beginning, and students and teachers are scared because we know more things like this are to come. However we take comfort in knowing that the staff and community is behind us even if the board isn’t.</p>\n<p class=\"p2\">The next school board meeting is on March 14th at 7 at 16 Welden Drive Doylestown. We hope you can attend.</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/03/Central-Bucks-School-Distict.jpg"
}