{
  "id": 19124,
  "title": "School of Rock Announces their Summer Tour",
  "slug": "school-of-rock-announces-their-summer-tour",
  "date": "2024-03-11T17:06:57",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown dardinal",
    "School of Rock"
  ],
  "excerpt": "<p>School of Rock Doylestown announces their 2024 Summer Tour and their performance students are in for an unforgettable experience! The tour, scheduled from July 1, 2024, to July 10, 2024, will kick off in Easton, PA and conclude at Main Line School in Berwyn, PA. This tour will feature not only students from School of [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">S</span><span class=\"s2\">chool of Rock Doylestown announces their 2024 Summer Tour and their performance students are in for an unforgettable experience! The tour, scheduled from July 1, 2024, to July 10, 2024, will kick off in Easton, PA and conclude at Main Line School in Berwyn, PA. This tour will feature not only students from School of Rock Doylestown, but also students from Perth, Australia, Princeton, New Jersey, and Sydney, Australia.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s3\">The opportunity to collaborate and connect with these musicians from diverse backgrounds and musical perspectives will create an environment that is both enriching and inspiring. Students will perform in Pittsburgh, Cincinnati, Cleveland at the Rock &amp; Roll Hall of Fame, Chapel Hill, Richmond, and more! With 8 shows in 10 days, this tour not only offers amazing performances, but also provides valuable learning opportunities for aspiring musicians.</span></p>\n<p class=\"p3\"><span class=\"s2\">This opportunity will foster a supportive and collaborative environment where students can form lifelong friendships and valuable connections. The shared experiences and challenges of touring will help students develop teamwork, communication, and problem-solving skills, all of which are essential in any musical endeavor. With each stop on the tour, students will not only advance their musical skills but also grow personally and professionally.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Touring requires a high level of discipline, from adhering to schedules to managing personal and group responsibilities. This instills a sense of professionalism and work ethic that will serve students well in their future musical endeavors.</span></p>\n<p class=\"p3\"><span class=\"s2\">Through collaboration with fellow musicians from different parts of the world, they will gain a broader understanding of music and its global impact. They will learn the importance of adaptability and resilience, as they navigate different cities, venues, and audiences.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s3\">Touring offers students a unique opportunity to step outside their comfort zones, grow as musicians, and forge unforgettable memories. As they embark on this musical journey, they will discover new musical influences and nurture their passion for music.</span></p>\n<p class=\"p3\"><span class=\"s2\">School of Rock Doylestown’s Performance Program is a standout music program with thousands of students enrolling annually. Tailored to students’ age, experience, and ability, the program features weekly group rehearsals and private lessons focused on iconic rock songs to prepare kids and teens for live performances at local Doylestown venues.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">Serving the Central Bucks County community and neighboring areas like New Hope and Jamison, School of Rock Doylestown offers music lessons in popular styles including indie rock, metal, pop, and grunge, taught by real musicians.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s3\">Students can develop their musical talents on guitar, bass guitar, drums, singing, keyboard, and piano, contributing to Doylestown’s vibrant music scene associated with artists like Pink and Dan Pawlovich of Panic! at the Disco, potentially launching the next music sensation from the area. From now until July 1, students from School of Rock Doylestown will be fundraising and searching for sponsors to help fund their tour.</span></p>\n<p class=\"p3\"><span class=\"s2\">Businesses or individuals interested in supporting the tour through sponsorship or other means can contact Karin, a representative of the fundraising committee (All-Inclusive Music Program) at <a href=\"mailto:ampdoylestown@gmail.com\">ampdoylestown@gmail.com</a>.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/03/School-of-Rock-Camp.jpg"
}