{
  "id": 14784,
  "title": "School Of Rock Rolls On!",
  "slug": "school-of-rock-rolls-on",
  "date": "2022-09-12T22:43:20",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "Annie Morton",
    "doylestown cardinal",
    "Michael Morpurgo",
    "School of Rock"
  ],
  "excerpt": "<p>School of Rock Doylestown is a family-owned and operated music program which delivers revolutionary music education for kids and adults. The location was opened in 2009 by Bucks County natives Annie Morton and Michael Morpurgo. As a locally operated business, they offer a more individualized approach to music education which is strengthened by their deep [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">S</span><span class=\"s2\">chool of Rock Doylestown is a family-owned and operated music program which delivers revolutionary music education for kids and adults. The location was opened in 2009 by Bucks County natives Annie Morton and Michael Morpurgo.</span></p>\n<p class=\"p3\"><span class=\"s2\">As a locally operated business, they offer a more individualized approach to music education which is strengthened by their deep understanding and appreciation of music composition and production. “Our goal is to offer personalized music lessons based on a collective love for the arts and performing while also participating actively in our local community,” says Morpurgo.</span></p>\n<p class=\"p3\"><span class=\"s2\">Their passion combined with their extensive background in the music industry provides an unmatched environment for personal and professional development.</span></p>\n<p class=\"p3\"><span class=\"s2\">Michael is an accomplished musician, writer, producer, and arranger. His passions have also driven him to dive into audio design and tour management. He has contributed to the curriculum development across the entire School of Rock franchise.</span></p>\n<p class=\"p3\"><span class=\"s2\">Annie oversees the school’s operations and team and has served as a General Manager in other schools owned by the pair. She has contributed to developing operations standards across the School of Rock franchise. Additionally, Annie is a photographer and photojournalist and studies fine art at Savannah College of Art and Design.</span></p>\n<p class=\"p3\"><span class=\"s3\">Michael and Annie opened the first franchise in Princeton in 2005 where they helped build the program based on a rock-and-roll curriculum. The curriculum is now being taught at over 300 locations worldwide. They have taught over 3,000 students which even includes their 12-year-old son, Oscar who has been a student in Doylestown since 2017.</span></p>\n<p class=\"p3\"><span class=\"s2\">Michael’s many accolades in the music industry, and Annie’s business insights combine to offer a quality school while teaching students from a more individualized approach. As a local, family-owned business, they bring authentic experience and a sense of community that makes for a very special learning environment.</span></p>\n<p class=\"p3\"><span class=\"s2\">Come explore all they have to offer! School of Rock Doylestown is located at 88 S. Main Street in Doylestown. For more information, please call 215-230-3406, email <a href=\"mailto:doylestown@schoolofrock.com\">doylestown@schoolofrock.com</a> or visit <a href=\"http://schoolofrock.com/locations/doylestown\" target=\"_blank\" rel=\"noopener noreferrer\">schoolofrock.com/locations/doylestown</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/09/School-of-Rock-pic.jpg"
}