{
  "id": 12019,
  "title": "Shaping Up In Town: The New You in 2022",
  "slug": "shaping-up-in-town-the-new-you-in-2022",
  "date": "2022-01-11T18:00:55",
  "author": "Staff",
  "category": [
    "Fit",
    "Live",
    "Play"
  ],
  "tags": [
    "BARRE 3",
    "brittany brown",
    "CLUB PILATES",
    "CORNERSTONE CLUBS",
    "doylestown cardinal",
    "GET REAL TRAINING",
    "GYM GUYZ OF LOWER BUCKS",
    "ORANGETHEORY",
    "TRAINING FOR WARRIORS"
  ],
  "excerpt": "<p>By Britt Around Town • The Cardinal Contributing Writer My name is Brittany and you are always sure to find me exploring one small town or another. I have a passion for photography, traveling and supporting all things local. Join me as I share some of the tastiest eats, trendiest shops, and places to explore [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Britt Around Town</strong> • The Cardinal Contributing Writer</p>\n<p class=\"p3\"><i>My name is Brittany and you are always sure to find me exploring one small town or another. I have a passion for photography, traveling and supporting all things local. Join me as I share some of the tastiest eats, trendiest shops, and places to explore throughout my adventures.</i></p>\n<p class=\"p3\"><i>This month I’m on a mission to hunt down some of the best workouts in Bucks County and the surrounding area. Yoga, Zumba, Weight Training, Barre&#8230;I’m eager to try it all and share it with you..</i></p>\n<p class=\"p5\"><strong><span class=\"s2\">CORNERSTONE CLUBS<span class=\"Apple-converted-space\">  </span></span></strong><strong><span class=\"s2\">(DOYLESTOWN &amp; NEW HOPE)</span></strong></p>\n<p class=\"p1\"><a href=\"https://www.cornerstoneclubs.com\" target=\"_blank\" rel=\"noopener noreferrer\"><em>https://www.cornerstoneclubs.com</em></a></p>\n<p class=\"p6\"><span class=\"s1\">The old Cornerstone Clubs in Warrington had been like a second home to me for over 3 years. I will never forget stepping into the gym for the first time with no idea what I was doing and having another member come right over to me and direct me on how to use the weight machines properly. That’s how my entire experience was at Cornerstone &#8211; everyone seemed like one big family. Cornerstone not only helped me to lose over 50 pounds before my wedding, but also helped me grow as a person.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><span class=\"s1\">There are dozens of different classes to choose from at Cornerstone Clubs, including: Zumba, Multiple Forms of Yoga, Tribe Team Training, Nutrition Counseling, Group Active / Group Power, Barr, Silver Sneakers, Cycling, Pilates, and more!</span></p>\n<p class=\"p5\"><strong>CLUB PILATES<span class=\"Apple-converted-space\">  </span></strong><strong>(DOYLESTOWN &amp; NEWTOWN)</strong></p>\n<p class=\"p1\"><a href=\"https://www.clubpilates.com/en-us\" target=\"_blank\" rel=\"noopener noreferrer\"><em>https://www.clubpilates.com/en-us</em></a></p>\n<p class=\"p6\"><span class=\"s1\">I have recently fallen in love with Club Pilates in both Doylestown and Newtown. Their classes incorporate the Pilates Reformer, Bosu Balance Ball, TRX, spring board, EXO-Chair and more. </span></p>\n<p class=\"p7\"><span class=\"s1\">The experience I get at Club Pilates is one that I have never found in any other style of workout. The reformer is so much fun to use and assists in stretches and workouts that leave me feeling like a whole new person with so much motivation after. Haven’t tried Pilates? Club Pilates has class types for all fitness levels, so check out their website for full class descriptions to see what class works best for you.  Your first class is free so you can try the Club Pilates experience for yourself and see what the excitement is all about! </span></p>\n<p class=\"p5\"><strong>BARRE 3  (DOYLESTOWN)</strong></p>\n<p class=\"p1\"><a href=\"https://barre3.com\" target=\"_blank\" rel=\"noopener noreferrer\"><em>https://barre3.com</em></a></p>\n<p class=\"p6\"><span class=\"s3\">The Barre3 Doylestown studio definitely receives my vote for the workout center with the greatest view! The large windows that make up the second-floor studio fill the studio with welcoming natural light which create a warm and peaceful atmosphere.  Owner, Angie, began her career as an instructor at the Newtown Barre3 studio and now lives out her dream of owning her own studio and “helping others through a movement focused on body-balance, mindfulness and empowerment.” The class I took was a “full body balance workout that combines strength conditioning, cardio and mindfulness.” I stretched and moved in ways that are not part of my daily routine and couldn’t believe how great I felt after class. Sore, but amazing at the same time. Highly recommended! </span></p>\n<p class=\"p8\"><strong>GYM GUYZ OF LOWER BUCKS</strong></p>\n<p class=\"p1\"><a href=\"https://www.gymguyz.com/lower-bucks\" target=\"_blank\" rel=\"noopener noreferrer\"><em>https://www.gymguyz.com/lower-bucks</em></a></p>\n<p class=\"p6\"><span class=\"s1\">Get visited by the magical red van! </span></p>\n<p class=\"p6\"><span class=\"s1\">I got to experience a workout by Emmanuel &#8211; the territory manager for GymGuyz Lower Bucks &#8211; who has been training clients for over three years. Emmanuel put together the perfect introductory workout to show me a little bit of the services that GymGuyz can provide. </span></p>\n<p class=\"p7\"><span class=\"s1\">GymGuyz is a personal training service that comes to YOU. No gym memberships or equipment is required as they bring it all. Their magical red van has everything including dumbbells, hurdles, mats, bosu, medicine balls, yoga balls, bands, step and so much more!</span></p>\n<p class=\"p7\"><span class=\"s3\">Their excellent trainers customize the workouts to fit you and your needs. They consider everything from your fitness experience to your physical abilities and make each workout specific just for you.<span class=\"Apple-converted-space\">  </span>GymGuyz offers the following services: Cardio Fitness, Virtual Personal Training, Group training, Nutrition Counseling, Pre/Post Natal Exercise, Senior Fitness, Specialty Services, Sports Conditioning, Strength Training, Weight Loss/Toning, Weight Resistance &amp; Training, Youth and Teen Fitness. Their workouts are perfect for anyBODY at any age and makes working out easier to accommodate you and your schedule. </span></p>\n<p class=\"p5\"><strong>GET REAL TRAINING (HATFIELD)</strong></p>\n<p class=\"p1\"><a href=\"http://www.getrealtraining.net\" target=\"_blank\" rel=\"noopener noreferrer\"><em>http://www.getrealtraining.net</em></a></p>\n<p class=\"p6\"><span class=\"s1\">Get Real Training is a personal training gym in Hatfield that offers one-on-one personal training sessions, group conditioning classes and youth fitness classes. Get Real Training is the gym that I try to attend for at least one class a week. I love the way that the group conditioning class is set up &#8211; the class is broken down into ten different sections that we complete for 30 seconds before transitioning to the next one. Each class is a whole new set of workouts too, so it’s always a mystery as to what the night will have in store for us. I’ve never been a fan of repetition in workouts as I get bored easily, so Get Real Training fits my style perfectly.</span></p>\n<p class=\"p5\"><strong>ORANGETHEORY</strong></p>\n<p class=\"p1\"><a href=\"http://www.Orangetheory.com\" target=\"_blank\" rel=\"noopener noreferrer\"><em>www.Orangetheory.com</em></a></p>\n<p class=\"p6\"><span class=\"s4\">If you’re looking for an effective, high-calorie burning, fast-paced workout, one of the best place to go is Orangetheory Fitness. Orangetheory is a heart-rate based, HIIT (high-intensity interval training) total-body group workout that incorporates rowing, cardio (at your own pace, on either the treadmill, bike, or strider) and strength training. During the 60-minute class, a coach will guide you through 5 different heart rate zones: resting, easy, challenging, uncomfortable and all out, telling you when to push harder and when to pull back for recovery.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><span class=\"s1\">The goal is to spend 12 minutes or more with your heart rate elevated in “The Orange Zone” (hence the class’s colorful name) to boost your metabolism, burn fat and burn more calories. January is a particularly great time to join, as a Transformation Challenge, which helps participants improve their overall health, starts on 1/17. Plus, Orangetheory offers a free trial class- no reason not to give it a try!</span></p>\n<p class=\"p5\"><strong>TRAINING FOR WARRIORS (DOYLESTOWN)</strong></p>\n<p class=\"p1\"><a href=\"https://tfw-doylestown.com\" target=\"_blank\" rel=\"noopener noreferrer\"><em>https://tfw-doylestown.com</em></a></p>\n<p class=\"p6\"><span class=\"s1\">Owner and trainer of the Doylestown Training for Warriors, Mike Subs, has so much love for what he does and it truly shows in the way he coaches. Strength training is the heart and soul of the TWF and the workout that I had the pleasure of participating in consisted of barbell squats, deadlifts and other workouts that encouraged us to push our limits. </span></p>\n<p class=\"p7\"><span class=\"s1\">Classes at Training For Warriors vary each day and consist of the following themes: Strength Day, Metabolic, Speed Strength, and Coach’s Choice.<span class=\"Apple-converted-space\">  </span>Programs available include: 30 Day Jumpstart, Transformation Programs and Core Membership.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p10\"><i>Britt Around Town has quickly become the Source of all things Bucks County, PA and beyond!<span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p10\"><i>With a following of over 7,700, the Arbiter of Local Culture has renewed interest in local and nature tourism, while highlighting small businesses along her adventures.<span class=\"Apple-converted-space\">  </span>Her visual editorial and description have injected much-needed revenue to local small businesses in local towns and takes followers on an experiential journey to the county’s hidden treasure. <span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p10\"><i>Britt Around Town pays homage to historic sites and attractions, entertainment venues, restaurants, and treasured natural resources.<span class=\"Apple-converted-space\"> </span></i></p>\n<p class=\"p10\"><i>Britt has won the title of 2021 Bucks Happening List’s Best of Bucks County: Social Media Personality and has been interviewed on multiple podcasts.<span class=\"Apple-converted-space\"> </span></i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/01/Orange-Theory.jpg"
}