{
  "id": 14413,
  "title": "Sikiru Adepoju &#8211; The Beat of His Drum",
  "slug": "sikiru-adepoju-the-beat-of-his-drum",
  "date": "2022-08-23T16:25:00",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "grateful dead",
    "mickey hart",
    "nigerian all starsBaba Olatunji",
    "Orlando Julius Eckemode",
    "Sikiru Adepoju",
    "Ukrainian Rugby Club"
  ],
  "excerpt": "<p>First off it’s an honor to be interviewing such an accomplished musician as yourself, thanks for taking the time to talk to The Cardinal. Can you tell us how did you wind up playing in the states being that you are originally from Nigeria?     I was performing with Orlando Julius Eckemode in a [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong><em>First off it’s an honor to be interviewing such an accomplished musician as yourself, thanks for taking the time to talk to The Cardinal. Can you tell us how did you wind up playing in the states being that you are originally from Nigeria?  </em><span class=\"s1\"><em>  </em></span></strong></p>\n<p class=\"p2\"><span class=\"s1\">I was performing with Orlando Julius Eckemode in a band called The Nigerian All Stars and we travelled to Oakland to do some shows back in 1985.  When I was in Oakland, I met a woman dancer from the opening act who knew Baba Olatunji, and she spoke to him about using me on a studio project called Beat Of My Drum. The rest is history.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p1\"><b>I understand that you have a close relationship with Mickey Hart of The Grateful Dead, how did you meet him?</b></p>\n<p class=\"p2\"><span class=\"s1\">It was actually at Fantasy Studios recording with Baba Olatunji that I met Mickey and we recorded Invocation, an amazing collaboration of world drumming. This is where my journey began with Mickey Hart and now, I am one of the three “Rhythm Devil’s” of The Dead and Company, rarified air for a drummer to be mentioned in the same breath as Bill Kreutzman and Mickey Hart. </span></p>\n<p class=\"p1\"><b>What musical projects are you currently working on?</b></p>\n<p class=\"p2\"><span class=\"s1\">My band mates and I in Riddim Doctors (with special guests Jay Lane of Primus and Ratdog and Jeff Chimenti of Dead and Company) just released our newest album OPE(gratitude), we are all super excited for everyone to hear it! The CD is available online if you would like to check it out.</span></p>\n<p class=\"p1\"><b>You have a couple of local performances in August where people can come check you out, can you tell us a bit about your upcoming shows?</b></p>\n<p class=\"p2\"><span class=\"s1\">My good friend Richie Nagan brought me to the East Coast for a host of shows with Jenn Durkin up in Connecticut.  I am following that up playing a few shows with Lovelight an amazing Grateful Dead tribute band including a special last performance here in Bucks County on August 12th at the Ukrainian Rugby Club on Lower State Rd in Horsham. This special musical performance is open to the public and in dedication to King Nick Mannino. </span></p>\n<p class=\"p1\"><span class=\"s3\"><b>For more event info:</b></span></p>\n<p class=\"p4\"><span class=\"s2\">• Denny Horn / Circle<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">“D Productions (Facebook)</span></p>\n<p class=\"p4\"><span class=\"s2\">• <a href=\"mailto:DLHORN16@gmail.com\">DLHORN16@gmail.com</a></span></p>\n<p class=\"p4\"><span class=\"s2\">• 215.681.8834</span></p>\n<p class=\"p4\"><span class=\"s2\">• Charlene Raco / HandiJam Productions (Facebook)</span></p>\n<p class=\"p4\"><span class=\"s2\">• <a href=\"mailto:Handijam2001@aol.com\">Handijam2001@aol.com</a></span></p>\n<p class=\"p4\"><span class=\"s2\">• 917-561-4800</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/08/ii_l5cvei763.jpeg"
}