{
  "id": 11641,
  "title": "Staying Healthy in Sweater Weather",
  "slug": "staying-healthy-in-sweater-weather",
  "date": "2021-11-14T07:35:30",
  "author": "Staff",
  "category": [
    "Fit"
  ],
  "tags": [
    "david ramoy",
    "doylestown cardinal",
    "sweater weather",
    "vegan pumpkin chili"
  ],
  "excerpt": "<p>By David Ramoy • The Cardinal Contributing Writer The change of season is upon us. So is the changing of the guard with our clothes, as well as our food! No longer are we looking for light airy tees and tanks to wear while out and about, we’re moving on to warm cozy fabrics to [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By David Ramoy • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">The change of season is upon us. So is the changing of the guard with our clothes, as well as our food! No longer are we looking for light airy tees and tanks to wear while out and about, we’re moving on to warm cozy fabrics to keep us snug. Sweater weather, as the coined phrase says, brings on a sense of home, comfy clothes and best of all…mashed potatoes and gravy! Or better yet, how about some warm chili with all the fixings…yumm.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">You’re probably thinking, “Isn’t this an article about staying healthy?!” It is! I’m going run through some healthy ideas that will keep you in tip top shape, and the best part, keep your pallet satisfied. Now back to the mashed potatoes!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s3\"><b>Flower Power<span class=\"Apple-converted-space\"> </span></b></span></p>\n<p class=\"p4\"><span class=\"s2\">Cauliflower is having a renaissance in 2021. With its high vitamin content, and low-calorie count, it has gone from being a boring vegetable to being a staple in most vegan and diet conscious meals. Fried rice, pizza crust and that’s right, mashed potatoes, can all be made deliciously with cauliflower. All you need is, you guessed it, cauliflower!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\"><i>Pro Tip:</i> There are plenty of options for cauliflower rice and pizza crust in the frozen section. It’s pre-made and easy to prepare. There are also tons of recipes online to get you started, enjoy!</span></p>\n<p class=\"p5\"><span class=\"s3\"><b>Vegan Pumpkin Chili . . . You’re Welcome!<span class=\"Apple-converted-space\"> </span></b></span></p>\n<p class=\"p4\"><span class=\"s2\">Most of us love a good chili. Especially as the weather starts to cool off and the sweaters come out of hiding. Personally, for me, there’s nothing more satisfying then coming home to the smell of chili on the stove. I’m in total heaven. What if there was a way to have all those same wonderful benefits of the chili experience, without the extra calories, and come out healthier than before you went in. Good news, there is! It’s called Pumpkin Chili! Add it to cauliflower rice or cauliflower mashed potatoes for extra health benefits. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\"><i>Pro Tip:</i> The more colorful the better. Add a variety of your favorite vegetables and beans with a can of pumpkin puree. Replace the unhealthy toppings with cilantro, avocado, and for some extra spice, jalapeno peppers. Enjoy!</span></p>\n<p class=\"p5\"><b>You Can Still Sweat in November<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p4\"><span class=\"s4\">A hurdle for most of us is how to stay active in the colder weather. It’s so easy to curl back up into the blanket or pour another cup of coffee. We can always exercise later or tomorrow, right? Then later comes around, and tomorrow sounds better. The vicious cycle continues. I only have one tip to help keep your exercise routine on track. Take a minute! That’s right, give yourself one minute a day to exercise. Too cold to go outside for a run? No problem! Do just one minute of jumping jacks at home, hold a plank or do some push-ups. It’s not so much about the workout, rather a habit to build upon.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\"><i>Pro Tip:</i> Here are a few at home exercises you can do for a minute each. If you get up to 10 exercises for 10 minutes, consider yourself a beast!<span class=\"Apple-converted-space\">  </span>Jumping Jacks, Plank, Burpees, Push-ups, Bicycles, Flutters, Leg Raises, Side Plank (both sides), Mountain Climbers, Sit-ups or Crunches. Get creative and have fun with it!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">To close out, health isn’t seasonal, despite our motivation to look good in a swimsuit. It’s about staying healthy to enjoy more life and sticking around longer for the people who love us. Now go break a sweat and eat some mashed potatoes!<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/11/sweater-weather.jpg"
}