{
  "id": 19968,
  "title": "Summer Must Does in Bucks County ",
  "slug": "summer-must-does-in-bucks-county",
  "date": "2024-07-03T11:54:00",
  "author": "Staff",
  "category": [
    "Play"
  ],
  "tags": [],
  "excerpt": "<p>By Emma Williams, Special to the Cardinal  July brings Bucks County the brightest and hottest days with the most highly anticipated events for everyone looking to enjoy quality time with friends, family, and other members of the community. From seasonal to annual events, theaters, organized runs, festivals, and parks many welcoming opportunities from great to [&hellip;]</p>\n",
  "content": "<p><b>By Emma Williams, </b><em>Special to the Cardinal </em></p>\n<p><span style=\"font-weight: 400;\">July brings Bucks County the brightest and hottest days with the most highly anticipated events for everyone looking to enjoy quality time with friends, family, and other members of the community. From seasonal to annual events, theaters, organized runs, festivals, and parks many welcoming opportunities from great to small offer summer activities for everyone to indulge.</span></p>\n<p><b>Washington Crossing Historic Park</b></p>\n<p><span style=\"font-weight: 400;\">Hosting live reenactments all year round of George Washington’s “daring crossing of the Delaware River on Christmas Night 1776,” the Washington Crossing Historic Park is celebrating Independence Day as “Living History Day” on July 4. Admittees will have the opportunity to see historians illustrate their knowledge and view a military encampment from 12 to 4 p.m., and sit in on readings of the Declaration of Independence from 12:30 to 3:30 p.m.. Food will also be provided onsite by Local Harvest Pizza and Rita’s Ice. From more information, visit <a href=\"http://washingtoncrossingpark.org\" target=\"_blank\" rel=\"noopener noreferrer\">washingtoncrossingpark.org</a></span></p>\n<p><b>Fonthill Castle 4th of July Celebration </b></p>\n<p><span style=\"font-weight: 400;\">Fonthill Castle celebrates Independence Day the old-fashioned way, with guests enjoying a day of fun, food, games, crafts, entertainment, and live music. Highlights of the day include the children’s decorated bike parade, wheelbarrow and sack races, tug-of-war, live musicians, and food trucks. Antique bicycles, historic town ball (a precursor to baseball!), and other fun activities make this a day to remember. Children will kick off the event by participating in the beloved Decorated Bicycle Parade at 12:30 p.m., where all participating children receive cheers from the crowd and a special certificate after pedaling down the historic site’s famed tree-lined driveway on their pre-decorated bicycles. For more information, visit <a href=\"http://mercermuseum.org/july4\" target=\"_blank\" rel=\"noopener noreferrer\">mercermuseum.org/july4</a></span></p>\n<p><b>Peddler’s Village</b></p>\n<p><span style=\"font-weight: 400;\">In Lahaska, Peddler’s has whipped up some fantastic events to keep the community moving, especially the annual Red, White, and Blueberry BBQ Bash from July 4-7 at 11-6 p.m. each day. The bash includes blueberry treats with the accompaniment of live entertainment, shopping, dining, and an array of activities for families to enjoy. </span></p>\n<p><span style=\"font-weight: 400;\">Following, Scoogie Events is hosting several all-age inclusive runs in the village. “Boogie with Scoogie Fun Run” on July 14 encourages event participants to “dig up [their] grooviest 60’s &amp; 70’s threads” for an experience that is unlike anything they have seen in a long time. In the evening and under the stars, Peddler’s is holding the monthly outdoor movie night, showing Wonka on July 19. Finally, to end it all off with another beloved decade, Cock n’ Bull Restaurant invites the community to an 80’s style murder mystery dinner on July 27 where parties work together to help solve a big concert tragedy.</span></p>\n<p><span style=\"font-weight: 400;\">For more information, visit <a href=\"http://peddlersvillage.com\" target=\"_blank\" rel=\"noopener noreferrer\">peddlersvillage.com</a></span></p>\n<p><b>Bucks County Playhouse</b></p>\n<p><span style=\"font-weight: 400;\">The new performance that debuted on the playhouse stage last month, “Last of the Red Hot Mamas,” continues to run through July 27. The story follows the iconic entertainer and household name of vaudeville, Sophia Tucker, and her rise to fame. Directed and choreographed by award-winner Shea Sullivan, this show is a must-see. For tickets and more information, visit <a href=\"http://bcptheater.org\" target=\"_blank\" rel=\"noopener noreferrer\">bcptheater.org</a></span></p>\n<p><b>Music Mountain Theatre</b></p>\n<p><span style=\"font-weight: 400;\">On the other side of the Delaware River in Lambertville, MMT is presenting two shows through July and into August. The first production, “Anything Goes” runs July 5-21,  and features everything a musical is and more, set aboard an ocean liner traveling from New York to London with romance in the air. A sensory-friendly performance takes place on July 14 at 3 p.m. for those who may want a show with less visual and auditory intensity. Close behind, “The King and I” will take the stage July 26 &#8211; August 18, following the true story of an English widow who travels with her son to teach a “barbaric” King’s children with whom she eventually forms a close connection. Both stage productions’ showtimes are Friday at 8 p.m., Saturday at 3 and 8 p.m., and Sunday at 3 p.m. throughout the days they are listed to perform. For more infomation, visit <a href=\"http://musicmountaintheatre.org\" target=\"_blank\" rel=\"noopener noreferrer\">musicmountaintheatre.org</a></span></p>\n<p><b>Doylestown at Dusk Car Show</b></p>\n<p><span style=\"font-weight: 400;\">Celebrating its 15th Annual event, the Dusk Car Show invites members of the community on Saturday, July 20 from 5-10 p.m. to the heart of Doylestown for a relaxing evening full of live music and entertainment while viewers have the opportunity to walk through a grandiose display of more than 500 vehicles. Later at night, specialty awards are handed out to recognize different vehicles in the show, including categories such as craftsmanship, horsepower, performance, and the club with the most car participation. Each award will be judged by an elite panel of show officials and volunteers of the community. In case of inclement weather, the rain date is the following day, Sunday, July 21.For more information, visit <a href=\"http://doylestownatdusk.com\" target=\"_blank\" rel=\"noopener noreferrer\">doylestownatdusk.com</a></span></p>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/07/Fonthill.png"
}