{
  "id": 18042,
  "title": "The First Annual Bucks County Eat, Drink &#038; Be Merry Month",
  "slug": "the-first-annual-bucks-county-eat-drink-be-merry-month",
  "date": "2023-08-12T15:09:37",
  "author": "Staff",
  "category": [
    "Live",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "Drink &amp; Be Merry Month",
    "The First Annual Bucks County Eat"
  ],
  "excerpt": "<p>We are happy to announce the debut of the First Annual Bucks County Eat, Drink and Be Merry Month set to run from August 15 through September 15.  When people throughout the community order a designated appetizer, entrée, drink or dessert from participating restaurant and bar partners, a percentage of their order will benefit Kin [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\">W</span><span class=\"s2\">e are happy to announce the debut of the First Annual Bucks County Eat, Drink and Be Merry Month set to run from August 15 through September 15.<span class=\"Apple-converted-space\">  </span>When people throughout the community order a designated appetizer, entrée, drink or dessert from participating restaurant and bar partners, a percentage of their order will benefit Kin Wellness and Support Center and our local cancer patients and their caregivers.<span class=\"Apple-converted-space\">  </span>People can eat, drink and be merry while both supporting local businesses and our cancer community at Kin.<span class=\"Apple-converted-space\">  </span>#LocalForLocal</span></p>\n<p class=\"p3\"><span class=\"s2\">We are currently seeking the most popular restaurants and bars across Bucks County to join the event.<span class=\"Apple-converted-space\">  </span>The Bucks County Eat, Drink and Be Merry Month has a dedicated webpage at www.welcometokin.org where participating locations are listed with a logo and a hyper-link to their business.<span class=\"Apple-converted-space\">  </span>As a visual indicator, all participating locations will receive a partnership decal to display on the window of their business, as well as branded table tents.<span class=\"Apple-converted-space\">  </span>For those interested in getting their restaurant or bar involved, please email <a href=\"mailto:keith@welcometokin.org\">keith@welcometokin.org</a> or call 267-544-5981.</span></p>\n<p class=\"p3\"><span class=\"s2\">Invitations to participate are being sent to over 100 local restaurants and bars.<span class=\"Apple-converted-space\">  </span>Several businesses have already confirmed their partnership, including: Ardana Food and Drink, KC Prime, Ardana Pizza Co., The Good Gyro, The Hattery, Penn Taproom, Nat’s Pizzeria, Quinoa, Karla’s Restaurant, Coaches Steak and Hoagie House and Spuddy Buddy Fry Factory.</span></p>\n<p class=\"p3\"><span class=\"s2\">Mike Christou and family have selected to include all of their restaurants; Ardana Food and Drink, KC Prime and Ardana Pizza Co. in the month-long event, the owner shares, “Our entire staff is excited to participate in Eat, Drink and Be Merry Month for Kin! Our chefs get to come up with a few seasonal menu items, and our servers get to tell the story of Kin while selling those new items. It’s a great way to get everyone engaged in the fundraiser!”</span></p>\n<p class=\"p3\"><span class=\"s2\">Keith Fenimore, Executive Director and Founding member of Kin adds, “We saw the success that our Bucks County Spa and Salon Self Care Month generated and decided to broaden the concept.<span class=\"Apple-converted-space\">  </span>Our goal is to bring the community together and shine a light on local businesses through our fundraising efforts while creating compelling collaborations, events and programs that everyone can enjoy.<span class=\"Apple-converted-space\">  </span>Our motivation lies in our results which are squarely focused on raising funds to help as many locals battling cancer as possible.”</span></p>\n<p class=\"p3\"><span class=\"s3\">For those interested in getting their restaurant or bar involved, email <a href=\"mailto:keith@welcometokin.org\">keith@welcometokin.org</a> or call 267-544-5981.</span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/08/Eat-drink-be-merry.jpg"
}