{
  "id": 19173,
  "title": "The BRIDGE Program Partners With The Cardinal Newspaper!",
  "slug": "the-bridge-program-partners-with-the-cardinal-newspaper",
  "date": "2024-03-15T15:34:09",
  "author": "Staff",
  "category": [
    "Live"
  ],
  "tags": [
    "bridge program",
    "dakoda carlson",
    "doylestown cardinal"
  ],
  "excerpt": "<p>By Dakoda Carlson  •  The Cardinal Contributing Writer It’s no surprise how community driven the town of New Hope truly is, and that extends beyond it’s town and into it’s school system.  New Hope school district is entering it’s second year with the BRIDGE program in full swing. (Building Responsible Independent Dependable Gainfully Employed Adults). [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><em><strong>By Dakoda Carlson</strong></em><span class=\"Apple-converted-space\"><em><strong> </strong></em> •  </span></span><span class=\"s1\">The Cardinal Contributing Writer</span></p>\n<p class=\"p3\"><span class=\"s3\">I</span><span class=\"s2\">t’s no surprise how community driven the town of New Hope truly is, and that extends beyond it’s town and into it’s school system.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">New Hope school district is entering it’s second year with the BRIDGE program in full swing. (Building Responsible Independent Dependable Gainfully Employed Adults). The BRIDGE program, originally created in 2022, is a program that bridges the gap between special needs students and high school employment.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">The teacher of the program, Rory Yerkes says this program came about when they saw a need for it within their school district. “We wanted to ensure our students could find jobs within their community. Many times when other organizations place them or support them, students are placed in jobs that are not within a reasonable distance for our students to get to independently and/or in a reasonable amount of time.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">The BRIDGE program’s participants go through on-site training, and the program teaches vocational skills in the classroom. Students enrolled in the district are the ones enrolled in the program itself and work together to provide jobs to the students in the community.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Back in September the BRIDGE program partnered up with The Doylestown Cardinal newspaper. The students deliver newspapers on a monthly basis for The Cardinal.</span></p>\n<p class=\"p5\"><span class=\"s2\">“It generally takes 2-3 days to complete the deliveries as students chat with business owners, and hand deliver the pages. Students greet the business and explain what the Bridge program is all about.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">By providing the students with real-life work, they are able to step into the world and get first-hand experience while still enrolled in school. The students do an absolute lovely job, and have created lasting relationships with the businesses they work alongside.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">Working with The Cardinal allows the students to enter many different businesses and get a well-rounded knowledge in many different fields. Their tasks include greeting staff of businesses and dropping off papers in a consistent spot, establishing new connections with businesses, keeping track of the amount of papers left each month, and updating the cardinal with any changes to take place.</span><span class=\"s5\"><span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">The program is hoping to expand their partnerships with the businesses to provide more opportunities! In addition, the program is also looking to expand so they can start to “accept tuition students from neighboring districts next year.” Says Yerkes.<span class=\"Apple-converted-space\"> </span></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/03/BRIDGE-PROGRAM.jpg"
}