{
  "id": 11650,
  "title": "The Latest Buzz in Doylestown: Follow the DoylestownBoroBuzz on Instagram!",
  "slug": "the-latest-buzz-in-doylestown-follow-the-doylestownborobuzz-on-instagram",
  "date": "2021-11-16T19:47:55",
  "author": "Staff",
  "category": [
    "Live",
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "DoylestownBoroBuzz",
    "john lund",
    "susan smith"
  ],
  "excerpt": "<p>By Dana Roberts • The Cardinal Contributing Writer If you haven’t yet stumbled across the DoylestownBoroBuzz on Instagram (or, if you don’t yet have Instagram), make it a priority to take a peek (and get yourself an account so you can follow them regularly!).  This charming account was created by Susan Smith and John Lund, [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong><span class=\"s1\">By Dana Roberts • </span></strong><span class=\"s1\">The Cardinal Contributing Writer</span></p>\n<p class=\"p3\"><span class=\"s3\">I</span><span class=\"s4\">f you haven’t yet stumbled across the DoylestownBoroBuzz on Instagram (or, if you don’t yet have Instagram), make it a priority to take a peek (and get yourself an account so you can follow them regularly!).<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">This charming account was created by Susan Smith and John Lund, a sweet and genuinely caring duo who are residents in the borough. It features the couple visiting various well-known establishments in town, as well as newer businesses and smaller shops and restaurants looking to reach a wider audience. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s5\">Fonthill Castle, Native Café, Sports Connection Doylestown, Heather Bleu Home, Spuntino, County Theater, Mercantile Doylestown, Raymer’s Homemade Candies, and Serendipity Shops are some of the many businesses that have been featured and benefited from Susan and John’s quest to promote what Doylestown has to offer.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">The idea came to them during the pandemic. Like many residents in the borough (and in towns and cities across the nation and world), the couple was concerned about the stresses the pandemic placed on local businesses.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">The couple said, “As residents of Doylestown Borough, we love the charm of this small town and being a part of the community. During the 2020 pandemic, we were sad to see the challenges put on the local businesses. The retail shops closed, and the restaurants were limited to a reduced, take-out only menu. We did what we could to support the businesses at that time…shopped local when the shops reopened and did as much take-out as we could. After the restrictions were lifted, we thought to ourselves, ‘what next?’<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s5\">What next became DoylestownBoroBuzz on Instagram! We thought we could utilize our combined majors in communications and create a platform to support our community. Our objective was simple; to promote as many of the small businesses and events within the Borough of Doylestown as possible.”</span></p>\n<p class=\"p5\"><span class=\"s4\">Maintaining an Instagram account with such meticulous and well-captured photos and videos is no easy feat, and Susan and John’s dedication and love for this town and the businesses in it is apparent in the lovely compilations and videos they have featured.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">Their goal is to do a full-scale business-focused post every 10 to 14 days with shorter entries like Stories and Reels in between the posts. The posts typically take the most time, between the filming and the editing. They aim to give each post a personality that fits with the personality of the business or event they’re covering.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">It can take them between 3 to 5 hours for each big video compilation. Their video post on Spuntino, a delicious pizzeria in Main Street Marketplace, from July 18, is a great example of the effort they make to showcase what the restaurant has to offer. It features Susan interviewing the owner, Robert, montages of delicious pizza to entice any viewer, and charming music overlaying the video.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">Like any new beginning, starting the account came with its own learning curve. Susan and John both used Instagram prior to starting DoylestownBoroBuzz, but only for the typical type of social media usage. Once they started to expand their platform, they had to consult with all their children (Susan has four children, two girls and two boys ages 22, 26, 27, and 28, and John has three girls ages 16, 20 and 21) for help utilizing all the different features of Instagram.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">Coming up with new and creative ways to share the stories has been a continued feat, but one they greet readily. This year, they invested in a drone to help provide a complete new set of opportunities.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">Their separate career paths have also helped in this endeavor. Susan has worked in the health and fitness industry and has had the wonderful opportunity of being an on-air talent for The QVC network. John has worked in the Consumer-Packaged Goods industry for over twenty-five years.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">Besides college backgrounds, career paths, and tech-savvy children contributing to making their Instagram such a success, their love for Doylestown is what is most apparent, and the biggest drive behind their Instagram’s start. They settled together in a lovely home on Court Street in 2019, after both having taken very different paths to get to the Borough.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">Susan had grown up in Lansdale and John was from Hatboro. The couple says that once they got settled in town, they never looked back. “We truly enjoy what we do because we love the character of this town and everything it has to offer.”</span></p>\n<p class=\"p5\"><span class=\"s4\">When asked about their favorite part of running their Instagram, the couple responded: “One of the best parts of bringing DoylestownBoroBuzz to life, for us, has been the interaction with, and getting to know, the different business owners in town. Every business owner or event coordinator has a unique and special story and getting to know them, and their story, has been a pleasure for us.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s2\">We also enjoy it when we get stopped in town by people who recognize us from our Posts and tell us how much they enjoy our site. That always makes us feel good and confirms that we are hopefully adding value.”</span></p>\n<p class=\"p5\"><span class=\"s4\">Susan and John note that they don’t have a strict methodology for choosing the establishments they feature. “Since we started the site, we tended to lean towards the businesses that we shopped or dined at prior to the pandemic. We also try to feature new businesses in town to help get them as much advertising as possible.”<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s6\">Whether you are an owner of a new business hopeful to be featured by the couple, an established business owner in the Borough, a resident, or just a lover of Doylestown, consider it a must to follow DoylestownBoroBuzz on Instagram to get a glimpse of all our sweet town, and its many diverse and devoted business owners, has to offer.</span></p>\n<p class=\"p5\"><span class=\"s4\">Be sure to check out John and Susan’s<span class=\"Apple-converted-space\">  </span>new Business Spotlight column on the cover of this month’s issue of The Cardinal.</span></p>\n<p class=\"p5\"><span class=\"s4\">For any additional questions or requests to be featured on the DoylestownBoroBuzz, please contact: <a href=\"mailto:dtownborobuzz@gmail.com\">dtownborobuzz@gmail.com<span class=\"Apple-converted-space\"> </span></a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/11/John-Lund-and-Susan-Smith.jpg"
}