{
  "id": 12663,
  "title": "The Roaming Realtor: This Olde House",
  "slug": "the-roaming-realtor-this-olde-house-2",
  "date": "2022-04-08T11:49:26",
  "author": "Staff",
  "category": [
    "Live",
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "jeff lavine",
    "T.O. Atkinson House"
  ],
  "excerpt": "<p>by Jeff Lavine • The Cardinal Contributing Writer This very grand, very beautiful Victorian Farmhouse at the corner of Maple Avenue and Spruce Street is a standout on the Avenue that we all love. The T.O. Atkinson House, circa 1871, is one more of our residences with a fascinating history to tell. Let me start [&hellip;]</p>\n",
  "content": "<p><strong>by Jeff Lavine • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p1\">This very grand, very beautiful Victorian Farmhouse at the corner of Maple Avenue and Spruce Street is a standout on the Avenue that we all love. The T.O. Atkinson House, circa 1871, is one more of our residences with a fascinating history to tell.</p>\n<p class=\"p3\">Let me start with the land itself, which will give you a history of how Doylestown’s land came to be, long before it was known as Doylestown. It’s also an opportunity to make you aware of Doylestown’s relationship to the<span class=\"Apple-converted-space\">  </span>African American community. Do you know of Cudjo and Jo, the two slaves who are an intrinsic part of our history<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p3\">Doylestown is comprised of various tracts of land, which were purchased by Jeremiah Langhorne, Esq in 1724, from the Free Society of Traders. The Society dispersed land for William Penn. When Jeremiah died in 1742, he left a will stating his 2,000 acres were to be divided equally between two of his slaves, Cudjo and Jo. They were to have ‘Lifetime Rights’ to the land. However, Jeremiah requested that they remain on his plantation in the lower portion of Bucks, known as Langhorne, until March 1751, in order to take care of the other slaves that remained there. At that time, in 1751, his nephew would turn 21 years old, and Langhorne would then be his. At the end of this waiting period, the land was surveyed to them, and they became<span class=\"Apple-converted-space\">  </span>free men. Jo settled on the east side of what is now East State Street, the sector which included all of todays Maple Avenue.</p>\n<p class=\"p3\">A lot has happened to the land in between, detailed<span class=\"Apple-converted-space\">  </span>by our esteemed historian and researcher Mrs. Wilma Brown Rezer, in her book “Doylestown (And How It Came To Be)”.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p3\"><span class=\"s1\">But, I will jump to 1871, when T.O. Atkinson built this residence at 299 Maple Avenue. It was then land owned by his father, Silas, who was in the real estate business. T.O. followed in his father’s footsteps and also became a realtor,<span class=\"Apple-converted-space\">  </span>forming a partnership with Samuel Tinsman as T.O. Atkinson &amp; Co. In 1886, he left real estate and helped to form Bucks County Trust Company , serving as 1st Treasurer and Secretary, posts he held for many years. He also served 3 terms as president of Borough Council. T.O. died December 5, 1920 having lived at 299 Maple for 49 years.</span></p>\n<p class=\"p3\"><span class=\"s2\">Due to<span class=\"Apple-converted-space\">  </span>Mrs. Rezer’s fantastic research, I can share a timeline of events about both the house at 299 and Maple Avenue itself. As it was reported in the Intelligencer over the years: 04/25/1876: A handsome ‘summer house, being built on the lawn; 11/30/1881: The borough will put up lights on Maple Ave, if the gas company will lay the pipes and furnish the gas; 03/24/1883: Gas lines and light posts have been put on Maple Avenue; 10/12/1888 T.O. Atkinson is painting his house a buff color with white trim; 02/21/1890 T.O. Atkinson was paid damages by the Borough for opening Spruce Street through his property; 04/18/1890 T.O. Atkinson building stone wall along Spruce Street; 05/30/1895 Maple Avenue being macadamized with stones broken by tramps in jail.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><span class=\"s2\">The current owner of 299 Maple was kind enough to open up her home to me. She was pleased that I would be featuring her home. This was just one wonderful moment out of many,<span class=\"Apple-converted-space\">  </span>that resulted from my undertaking<span class=\"Apple-converted-space\">  </span>as your Roaming Realtor of Doylestown. As I enter my 38th year as a realtor, listing and selling real estate in our community and all of Bucks County, I continue to love what I do and am incredibly appreciative of the hundreds of folks that have chosen to work with me.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\">This side gig, bringing the architectural styling and history of our town to you, has been a greatly unanticipated joy for me. I thank you for your following and support as your Real Estate Advisor and your Roaming Realtor.</p>\n<p class=\"p5\"><span class=\"s2\"><i>Jeff Lavine, a REALTOR with Keller Williams Real Estate, has been leading the industry since 1984. Jeff and his team can be reached at his office, 215-340-5700 x222, his cell. 215-280-2750 or website <a href=\"http://www.PropertyinBucksCounty.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.PropertyinBucksCounty.com</a>. The Roaming Realtor appears weekly on Facebook.</i></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/04/Maple-Ave-Cudjo.jpg"
}