{
  "id": 17955,
  "title": "The New Bucks County Flower Collective:  Growing Community One Bouquet at a Time",
  "slug": "the-new-bucks-county-flower-collective-growing-community-one-bouquet-at-a-time",
  "date": "2023-08-06T22:50:25",
  "author": "Staff",
  "category": [
    "Live",
    "Style"
  ],
  "tags": [
    "doylestown cardinal",
    "New Bucks County Flower Collective",
    "taylor shay ashton"
  ],
  "excerpt": "<p>By Taylor Shay Ashton • Special to The Cardinal In July, the Bucks County Flower Collective officially joined the community at a colorful opening meet-and-greet. The Collective is a collaboration of eight female-owned flower farms across the county with the goal of bringing locally grown flowers to the community and hosting community-based events.   Several [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b><em>By Taylor Shay Ashton</em> • </b>Special to The Cardinal</p>\n<p class=\"p3\">In July, the Bucks County Flower Collective officially joined the community at a colorful opening meet-and-greet. The Collective is a collaboration of eight female-owned flower farms across the county with the goal of bringing locally grown flowers to the community and hosting community-based events. <span class=\"Apple-converted-space\">  </span></p>\n<p class=\"p5\">Several years ago Bucks County’s old flower collective dissolved and left the area with a huge gap of a need for floral designers and growers. Ever since people in need of flowers had to either pay exorbitant fees to ship in flowers or took long drives to pick up flowers themselves.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\">The solution originated in the most unlikely of ways. A few years ago, Ann, the owner of Southern Pines Flower Farm, reached out to Ally, the owner of Rise and Shine Flower Farm. Ann asked if Ally was interested in teaching a wreath-making shop. Together, the women put together a successful and fulfilling event. The joy of working as a team sparked the idea for the Collective.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\">For over a year and a half Ally and all of the ladies had been communicating mostly over social media to create the vision for the Collective. Realizing that everyone is stronger together, the women created an environment for all of their businesses to thrive. The Collective cultivates a place where business owners can lean on and support each other. Christina, the owner of Honey Hollow Blooms, said it best: “Instead of being competitors we decided to collaborate.”<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\">The spirit of togetherness lives through the events the Collective hosts. The women radiate an aura of great admiration and respect for each other. And in a time where in just recent years the feelings of separation from others have been so prevalent, seeing a group as welcoming and supportive of others as this one is deeply touching.</p>\n<p class=\"p5\">The Collective offers retail bouquets, flower subscriptions, pop-flower markets, workshops, special events, and custom orders. In the upcoming months, The Collective plans to host a flower crown-making workshop, a pumpkin decorating workshop, and a wreath-making workshop in the winter. In time these ladies will bring forth a plethora of exciting events for flower lovers. To keep up with any of the upcoming events be sure to follow on Instagram @buckscountyflowercollective.</p>\n<p class=\"p6\"><b>The Collective is comprised of:</b></p>\n<p class=\"p7\"><em><span class=\"s2\">Ally (Founder)</span><span class=\"s1\">: Rise and Shine Flower Farm, Kintnersville<span class=\"Apple-converted-space\"> </span></span></em></p>\n<p class=\"p7\"><em><span class=\"s2\">Abby:</span><span class=\"s1\"> True Blooms Farm, Lambertville<span class=\"Apple-converted-space\"> </span></span></em></p>\n<p class=\"p7\"><em><span class=\"s2\">Amber:</span><span class=\"s1\"> Rising Hill Farm, Quakertown<span class=\"Apple-converted-space\"> </span></span></em></p>\n<p class=\"p7\"><em><span class=\"s2\">Becca:</span><span class=\"s1\"> Bleuquet Flowers, Pipersville<span class=\"Apple-converted-space\"> </span></span></em></p>\n<p class=\"p7\"><em><span class=\"s2\">Christina:</span><span class=\"s1\"> Honey Hollow Blooms, Solebury Twp,<span class=\"Apple-converted-space\"> </span></span></em></p>\n<p class=\"p7\"><em><span class=\"s2\">Kristin: </span><span class=\"s1\">Maple and Maple Flower Company, Doylestown,<span class=\"Apple-converted-space\"> </span></span></em></p>\n<p class=\"p7\"><em><span class=\"s2\">Trish: </span><span class=\"s1\">Enroot Flowers, Quakertown<span class=\"Apple-converted-space\"> </span></span></em></p>\n<p class=\"p7\"><em><span class=\"s2\">Ann:</span><span class=\"s1\"> Southern Pines Flower Farm (all events and pick-ups).</span></em></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/08/Bucks-County-Flower-Collective.jpg"
}