{
  "id": 20277,
  "title": "In Their Words: “Give it a Try!”: Tim Conniff Offers Clean Comedy with a Side of Motivation Talk. ",
  "slug": "tim-conniff-comedy",
  "date": "2024-09-15T18:00:40",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Play"
  ],
  "tags": [],
  "excerpt": "<p>By Dana Roberts • Cardinal Contributing Writer “In Their Words” is our monthly feature in which we get to know members of our community better as we ask them to finish sentences we provide; in any way they see fit.  We tapped into one of Doylestown’s somewhat hidden gems, Comedy Cabaret at Poco’s, to interview [&hellip;]</p>\n",
  "content": "<p><b><em>By Dana Roberts </em><em>• </em></b>Cardinal Contributing Writer</p>\n<p><i><span style=\"font-weight: 400;\">“In Their Words” is our monthly feature in which we get to know members of our community better as we ask them to finish sentences we provide; in any way they see fit. </span></i></p>\n<p><span style=\"font-weight: 400;\">We tapped into one of Doylestown’s somewhat hidden gems, Comedy Cabaret at Poco’s, to interview a hilarious and fast-rising local comedian, Tim Conniff. </span></p>\n<p><b>The first time I did an open-mic/stand-up was…</b><span style=\"font-weight: 400;\"> during college for an assignment for my Speech Comm class at the University of Scranton. The professor challenged us to go out of our comfort zone and give a speech about it. So, I drove 2.5 hours to Philadelphia and gave it a try. I got an A!</span></p>\n<p><b>The next time I did stand-up was…</b><span style=\"font-weight: 400;\"> about 30 years later. Got busy with life, wife, kids, etc. For about ten years in my 20s, I was a member of Doylestown Toastmasters, where I worked on my communication and leadership skills and participated in humorous speech contests. This experience laid a good foundation for stand-up comedy.</span></p>\n<p><b>The reaction I got from my first performance at Comedy Cabaret was…</b><span style=\"font-weight: 400;\">pretty good.  I got laughs, and the owner Andy Scarpati invited me back to do time on a regular show. One thing led to another and within six months, I was the weekly host of the show.</span></p>\n<p><b>The past three years of consistently doing stand-up…</b><span style=\"font-weight: 400;\"> have been so much fun. And challenging too. I’ve gotten to meet so many amazing people, including comedians and audience members.</span></p>\n<p><b>The keynote speaking talk I do, “Your Comfort Zone is No Joke”…</b><span style=\"font-weight: 400;\"> starts with some clean stand-up comedy, followed by a humorous talk detailing my comedy journey. I’ve done it for large companies, community groups, churches, and senior living venues. After the talk, I find it very rewarding when audience members tell me how much they liked the message and needed to hear it.</span></p>\n<p><b>Before heading up to the stage, I’m thinking&#8230; </b><span style=\"font-weight: 400;\">I really want to do a great job for the audience. They pay good money to see a show and may only go to one or two shows a year. It’s always exciting when someone comes up to me after a show and tells me it was their first comedy show. One woman, who was celebrating her 83rd birthday, came up to me and told me that I made her laugh and that she couldn’t remember the last time she laughed. That was so heartwarming.</span></p>\n<p><b>To be a good audience member at a comedy club, you should…</b><span style=\"font-weight: 400;\"> get out and support live comedy, laugh your heart out, and not talk loudly with others at your table. Not that the comedian can’t handle it, but it’s important to be respectful to your fellow audience members who want to see a show without interruption.  </span></p>\n<p><b>I would describe my comedy style as… </b><span style=\"font-weight: 400;\">first and foremost, clean. I know I can get additional laughs by cursing or talking about certain subjects, but keeping it clean has forced me to become a better writer and has afforded me many more opportunities such as corporate shows, community events, and even churches, which I couldn’t do if I didn’t work clean. Some of my go-to topics are marriage, kids, living here in Bucks County, and growing up in Northeastern P<a id=\"remove-post-thumbnail\" href=\"https://doylestowncardinal.com/wp-admin/post.php?post=20277&amp;action=edit#\">Remove featured image</a>A, just to name a few.</span></p>\n<p><b>My own favorite comedians are…</b><span style=\"font-weight: 400;\"> too many to list. Some of my favorites that I’ve seen live recently include Kevin Nealon, Steven Wright, Neal Brennan, and Gary Gulman. My favorite bit, if I had to pick one, is Gary Gulman’s “How the States Got their Abbreviations.” Google it!</span></p>\n<p><b>Jokes that always resonate are…</b><span style=\"font-weight: 400;\"> rare. I’ve found that comedy is very personal and what one person or one audience finds funny varies. There are surprises along the way that can catch you off guard.  Like the joke that always works doesn’t! Or a joke that doesn’t get huge laughs does. </span></p>\n<p><b>The hardest thing about getting in front of an audience and trying to make them laugh is… </b><span style=\"font-weight: 400;\">remembering all my material. I never have a drink before or during my set. It’s hard enough to remember jokes sober at my age…</span></p>\n<p><b>When people tell me, “I could never do that,” my response is:</b><span style=\"font-weight: 400;\">  Unfortunately, that’s the number one thing people say to me when I tell them I’m a comedian. I’ve even incorporated this into my keynote talk. I would tell them to stop saying they could never do something because they’re likely going to be right. We all need to turn those &#8220;I could never do that&#8221; moments into “I can do that” moments.</span></p>\n<p><b>My wife and kids’ reaction to me doing stand-up was…</b><span style=\"font-weight: 400;\"> thankfully very supportive. I couldn’t have done all this without a very supportive wife. And my boys are always willing to listen to a joke to let me know if it’s funny or not. They’re usually right.</span></p>\n<p><b>Right now, I do…</b><span style=\"font-weight: 400;\"> around 100 shows a year. More of my events lately have been my keynote talk, which I really enjoy because I still get to make people laugh, but also leave them with a powerful message about getting out of their comfort zones, embracing inevitable failures and avoiding negative self-talk. I also produce my own monthly show at FZ Works in Yardley. And I MC and host many events, such as fundraisers, which I really enjoy doing.</span></p>\n<p><b>My full-time job is… </b><span style=\"font-weight: 400;\">a Sales Director for a pharmaceutical company. Laughter is the best medicine but not the only medicine.</span></p>\n<p><b>Comedy Cabaret is…</b><span style=\"font-weight: 400;\"> a local treasure! It’s a real-world comedy club right here in Doylestown atop Poco’s Restaurant on North Main St. It has the stage, lights, and sound system &#8211; everything you would expect to see in a big city comedy club, with free parking!</span></p>\n<p><b>The owners of Comedy Cabaret, Andy and Marilyn Scarpati, are… </b><span style=\"font-weight: 400;\">amazing people! I would not have been able to accomplish what I have over the past few years without Andy giving me stage time, but more importantly, the coaching and mentorship he provided. Learning stand-up is like learning any other art form &#8211; playing an instrument, dancing, etc. You need someone to observe, encourage, and provide feedback to help you develop. And he’s been doing that for over 40 years, 37 of them here in Doylestown. So many of the amazing headliners that I get to work with started out with him decades ago.</span></p>\n<p><b>If you haven’t yet been to Comedy Cabaret at Poco’s, you…</b><span style=\"font-weight: 400;\"> really should go. I have been going there as a customer since the early 90s, well before I became a professional comedian. They get great nationally touring headliners along with outstanding regional performers. And they also take the time to develop new, local talent. You will always see a great show of diverse acts.</span></p>\n<p><b>If you are considering doing stand-up or an open mic, you should…</b><span style=\"font-weight: 400;\"> muster up the courage and give it a try. If you go to </span><span style=\"font-weight: 400;\">www.comedycabaret.com</span><span style=\"font-weight: 400;\"> you will find a list of upcoming open mics and how to get on. There are many other venues across the Delaware and Lehigh Valley as well where you can get on stage. I recommend going out to watch one first so you can get a feel for what they’re all about. What’s the worst thing that can happen? Give it a try!</span></p>\n<p><b>To see me perform or book me for a corporate, community or private event…</b><span style=\"font-weight: 400;\"> you can go to my website at </span><span style=\"font-weight: 400;\">www.timconniff.com</span><span style=\"font-weight: 400;\"> which has my updated schedule.  I’ll be at Comedy Cabaret on Aug. 24, Sept. 13 and 28. My upcoming shows at  FZ Works in Yardley are Aug. 3 and Sept. 26. Plus, many other dates through 2024.  A couple months ago, I started booking holiday parties already.  That felt like walking into a big box store in July and seeing Christmas trees for sale!</span></p>\n<p>&nbsp;</p>\n<p><span style=\"font-weight: 400;\">Head to Comedycabaret.com to learn more and find the schedule of upcoming shows, and if you’re interested in performing or have any questions, email </span><a href=\"mailto:Marilyn@ComedyCabaret.com\"><span style=\"font-weight: 400;\">Marilyn@ComedyCabaret.com</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p>&nbsp;</p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2024/09/Tim-Conniff-Headshot-Stage-1.jpg"
}