{
  "id": 18588,
  "title": "TOP BUCKS COUNTY HOLIDAY HAPPENINGS",
  "slug": "top-bucks-county-holiday-happenings",
  "date": "2023-12-14T17:48:52",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Live",
    "Play",
    "Taste"
  ],
  "tags": [
    "bucks countym christmas",
    "doylestown cardinal"
  ],
  "excerpt": "<p>ALL IS BRIGHT Annual Holiday Light Show Shady Brook Farm.  Through January 8, 2024 Remember the season with a photo of Santa. Don’t leave without a car or open-air wagon ride through the Holiday Light Show. With more than 3 million lights illuminating the vast farm, this 2-mile ride around is something to behold on [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span style=\"color: #ff0000;\"><b>ALL IS BRIGHT</b></span></p>\n<p class=\"p2\"><b>Annual Holiday Light Show</b></p>\n<p class=\"p2\">Shady Brook Farm.  Through January 8, 2024</p>\n<p class=\"p2\">Remember the season with a photo of Santa. Don’t leave without a car or open-air wagon ride through the Holiday Light Show. With more than 3 million lights illuminating the vast farm, this 2-mile ride around is something to behold on a chilly wintry night. Finally, bundle up and toast some S’mores at a private or public fire pit!<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p2\"><b>Gingerbread Competition and Display</b></p>\n<p class=\"p2\">Peddler’s Village.  Through January 13, 2024</p>\n<p class=\"p2\">A holiday tradition at Peddler’s Village since 1984, the Gingerbread Competition and Display is a feast for the eyes with more than 75 creative and whimsical entries in these categories: Traditional Holiday Gingerbread House, Holly Jolly, Authentic Reproduction of a Bucks County Landmark and more!</p>\n<p class=\"p2\"><b>Holly Jolly Weekend</b></p>\n<p class=\"p2\">Peddler’s Village.  December 2 &amp; 3, 2023</p>\n<p class=\"p2\">The holiday season celebrations at Peddler’s Village culminate with the Holly Jolly Weekend, which includes among other happenings a Santa Parade through the Village on both Saturday and Sunday at 1:30 p.m.</p>\n<p class=\"p1\"><span style=\"color: #ff0000;\"><b>JINGLE BELL ROCK</b></span></p>\n<p class=\"p2\"><b>White Christmas</b></p>\n<p class=\"p2\">Bucks County Playhouse.  Through December 31, 2023 <span class=\"Apple-converted-space\">                                                                                                                                            </span></p>\n<p class=\"p2\">Based on the classic Hollywood movie musical, “Irving Berlin’s White Christmas” is a technicolor, Broadway musical extravaganza filled with Berlin’s classic tunes including “Blue Skies,” “Sisters,” “How Deep Is the Ocean?”, “The Best Things Happen When You’re Dancing,” “Count Your Blessings” and more. Song-and-dance men, Bob Wallace and Phil Davis team up after the war to become of the hottest acts in show business.</p>\n<p class=\"p2\"><b>Gerald Dickens’ A Christmas Carol Performance</b></p>\n<p class=\"p2\">Byers’ Choice.  December 9 &amp; 10, 2023</p>\n<p class=\"p2\"><span class=\"s1\">Byers’ Choice in Chalfont has been handcrafting Caroler® figurines for more than 40 years. Stop in the factory to see how they are made and tour their Christmas Museum. This year “A Christmas Carol,” performed by Gerald Dickens, Charles Dickens great-great-grandson, will be performed on Saturday, December 9 at 1:00 p.m. and 5:30 p.m., and Sunday, December 10 at 1:30 p.m.</span></p>\n<p class=\"p2\"><b>A Christmas Story</b></p>\n<p class=\"p2\">Bristol Riverside Theatre.  Through December 31, 2023 <span class=\"Apple-converted-space\">                                                                                                                                            </span></p>\n<p class=\"p2\">The classic movie comes to hilarious life on stage! In 1940s Indiana, a young, bespectacled Ralphie schemes his way toward the holiday gift of his dreams, an official Red Ryder Carbine-Action 200-Shot Range Model Air Rifle. An infamous leg lamp, an outrageous set of pink bunny pajamas, a maniacal department store Santa, and a triple-dog-dare to lick a freezing flagpole are just a few of the obstacles that stand between Ralphie and his Christmas wish.</p>\n<p class=\"p2\"><b>It’s A Wonderful Life</b></p>\n<p class=\"p2\">Town and Country Players.  Through December 2, 2023 <span class=\"Apple-converted-space\">                                                                                                                                            </span></p>\n<p class=\"p2\"><span class=\"s2\">This beloved American holiday classic comes to life as a live 1940s radio broadcast. With the help of an ensemble that brings a few dozen characters to the stage, the story of George Bailey, the Everyman from the small town of Bedford Falls, whose dreams of escape and adventure have been squashed by family obligations and civic duty, and whose guardian angel has to descend on Christmas Eve to save him from despair, and to remind him – by showing him what the world would have been like had he never been born – that he has had, after all, a wonderful life.</span></p>\n<p class=\"p1\"><span style=\"color: #ff0000;\"><b>YULETIDE CHEER</b></span></p>\n<p class=\"p2\"><b>‘A Very Furry Christmas’</b></p>\n<p class=\"p2\">Sesame Place® Philadelphia.  Through January 7, 2024</p>\n<p class=\"p2\">Head to Sesame Place® Philadelphia in Langhorne for a special holiday performance from everyone’s favorite furry friends. The fun music and dance specials are a festive way for the family to enjoy some fun holiday spirit while singing along! Do a Christmas Dine with Elmo and Friends, see the 1-2-3 Christmas Tree Show, and join in on the Hanukkah &amp; Menorah Lighting Celebration with Baby Bear!</p>\n<p class=\"p2\"><b>The North Pole Express</b></p>\n<p class=\"p2\">New Hope Railroad.  <span class=\"s2\">Weekends Through December 24, 2023</span></p>\n<p class=\"p2\"><span class=\"s2\">Sip hot chocolate and enjoy a freshly baked cookie while singing along with the railroad’s roaming musicians as they play Christmas carols. The North Pole Express offers similar amenities, but is pulled by a vintage diesel locomotive instead. Gear up in pajamas and enjoy the relaxing holiday ride through historic Bucks County. Rent a private caboose or coach car for you and your close ones.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><b>Holly Nights</b></p>\n<p class=\"p2\">Pennsbury Manor.  December 7-8, 2023</p>\n<p class=\"p2\">Come and experience the enchantment of Pennsbury Manor by candlelight. Enjoy crackling bonfires, the merry sound of carolers, candlelit tours of the Manor House, colonial craft demonstrations, and a visit from Father Christmas himself!</p>\n<p class=\"p1\"><span style=\"color: #ff0000;\"><b>DECK THE HALLS</b></span></p>\n<p class=\"p2\"><b>Holidays at Fonthill Castle<span class=\"Apple-converted-space\">    </span></b>Fonthill Castle</p>\n<p class=\"p2\">Starting on Saturday, November 18th on all weekdays throughout this holiday season, the daily one-hour guided tours of historic Fonthill Castle showcase Henry Mercer’s home decked for the holidays while sharing the history of Mercer and the construction of this unique property. Tours are 60 minutes and guided. Fonthill Castle’s interior features Mercer’s renowned, handcrafted ceramic tiles designed at the height of the Arts and Crafts movement, and the castle serves as an early example of reinforced concrete architecture with forty-four rooms, two hundred windows, and eighteen fireplaces.</p>\n<p class=\"p2\"><b>Christmas at Aldie<span class=\"Apple-converted-space\"> </span></b></p>\n<p class=\"p2\">Aldie Mansion.  December 3, 2023</p>\n<p class=\"p2\"><span class=\"s1\">With gilded hallways, sparkling decorations, festive music, and delicious cuisine, Christmas at Aldie will be a magical evening starting at 5:00 p.m. You will delight in a holiday-themed cocktail and a delicious dinner from Jeffrey A. Miller Catering and are sure to head home in the festive spirit. Limited capacity to 160 guests. Reservations required.</span></p>\n<p class=\"p2\"><b>Festival of Trees</b></p>\n<p class=\"p2\">Pearl S. Buck House &amp; Historic Site.  Through January 7, 2024</p>\n<p class=\"p2\">Each year during the Annual Festival of Trees, the rooms of Pearl S. Buck’s iconic Bucks County stone farmhouse come alive with the glow of holiday decorations. The event showcases beautiful trees and vignettes designed by Bucks County’s best artists, decorators, and local community groups to convey the spirit of Pearl S. Buck’s legacy as an author, humanitarian, and activist. Visitors have the opportunity to vote for their favorite display.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p2\"><b>Take a Driving Tour</b></p>\n<p class=\"p2\">Explore the many self-guided driving tours Visit Bucks County has online. Take the famous Covered Bridge Driving Tour. Or, try out one featuring Stone Barns, Haunted Stops, stops along the Underground Railroad – and more!</p>\n<p class=\"p1\"><span style=\"color: #ff0000;\"><b>JOY TO THE WORLD</b></span></p>\n<p class=\"p2\"><b>The Crossing Reenactment</b></p>\n<p class=\"p2\">Washington Crossing Historic Park.  December 10 &amp; 25, 2023</p>\n<p class=\"p2\">Held every year on Christmas Day at the location of Washington’s Delaware River crossing is a reenactment of the treacherous crossing itself! There are two chances to see the crossing with narrator Peter Hegseth, enjoy special colonial-era activities and demonstrations in the Historic Village. The park will be decked out in period wreaths, candles and holiday trees.</p>\n<p class=\"p2\"><b>Grinchmas Food Truck Fest &amp; Holiday House</b></p>\n<p class=\"p2\">Bolton Mansion.  December 2 &amp; 3, 2023</p>\n<p class=\"p2\">Ho-Ho-Ho! Santa Claus (and The Grinch!) are coming to town! Join Bolton Mansion for holiday fun for the whole family! This event will be held from 11 a.m. &#8211; 4 p.m. and will feature the arrival of Santa via firetruck, visits and photos with Santa and The Grinch (free with your own camera!), food trucks, children’s activities, a DJ, beer/cocktail garden, vendors/crafters for your holiday shopping and more.</p>\n<p class=\"p1\"><span style=\"color: #ff0000;\"><b>DRINK &amp; BE MERRY</b></span></p>\n<p class=\"p2\"><b>Holiday Celebration &amp; Light Up the Vines</b></p>\n<p class=\"p2\">Bucks County Wine Trail.  December 9, 2023 &#8211; January 1, 2024</p>\n<p class=\"p2\"><span class=\"s2\">Join the six wineries of the Bucks County Wine Trail for the second annual Light Up the Vines holiday illumination! Come, see the beauty of the holiday season in Bucks County’s beautifully lit vineyards. Join in for the event kickoff following the Holiday Celebration on Saturday, December 4 at each of the six member wineries of the Bucks County Wine Trail illuminating the vineyard each evening at dusk. Each winery will have its own hours and special happenings.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p2\"><b>Bucks County Ale Trail</b></p>\n<p class=\"p2\">Grab a brew (or two!) at one of the many breweries along the Bucks County’s Ale Trail! Relax and kick back with seasonal brews as you complete your passport to win a limited-edition t-shirt.</p>\n<p class=\"p2\"><b>Bucks County Distilleries</b></p>\n<p class=\"p2\">Visit Bucks County’s distilleries are offering take-out this holiday season! Warm up and sip on aged spirits, such as Whiskey with a Port Wine finish from Dad’s Hat or Sunday Morning Stout Corn Whiskey from Triple Sun Spirits Co. A bottle of one of their hand-crafted spirits makes the perfect holiday gift!</p>\n<p class=\"p4\"><a href=\"http://www.visitbuckscounty.com\" target=\"_blank\" rel=\"noopener noreferrer\"><span class=\"s3\"><b>www.visitbuckscounty.com</b></span></a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2023/12/Christmas-Banner-e1702594126522.jpg"
}