{
  "id": 13944,
  "title": "Two Fathers, Two Sons, Great Beer",
  "slug": "two-fathers-two-sons-great-beer",
  "date": "2022-06-26T15:55:31",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "john lund",
    "Ryan Seiz",
    "Scott Seiz",
    "susan smith",
    "Tim “Timmy” Taber",
    "Warwick Farm Brewing"
  ],
  "excerpt": "<p>By John Lund and Susan Smith • The Cardinal Contributing Writers Through the proverbial Bucks County grapevine (yes, Instagram and Facebook), we had heard about this local brewery that had just opened its new tasting room, so we decided to check it.  Being a bit of a lower-level beer connoisseur, I was excited to try [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b>By John Lund and Susan Smith • </b>The Cardinal Contributing Writers</p>\n<p class=\"p3\"><span class=\"s2\">T</span><span class=\"s3\">hrough the proverbial Bucks County grapevine (yes, Instagram and Facebook), we had heard about this local brewery that had just opened its new tasting room, so we decided to check it.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">Being a bit of a lower-level beer connoisseur, I was excited to try the beer at Warwick Farm Brewing. As we drove to the farm, I was unsure what to expect from the location. I’ve been to plenty of breweries and tasting rooms tucked in the back of an industrial park or sitting in an old, “shabby chic” warehouse.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s3\">As I quickly learned after making the right off Almshouse Road, Warwick Farm is not your typical brewery environment. At least not in Bucks County. Traveling up the short driveway and passing the large tasting room on our righthand side, I was struck by both the size of the tasting room and – more importantly &#8211; the opposing view on our lefthand side. A view that overlooks Ivyland and Richboro &#8211; could be one of the best views in Bucks County.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><span class=\"s4\">The property sits at the highest point of Jamison, and trust me, it is a view best described with your own two eyes as you sit on the massive deck of the tasting room…with a Juicy Pils at the ready.</span></p>\n<p class=\"p6\"><strong>The Start</strong></p>\n<p class=\"p5\"><span class=\"s3\">Warwick Farm Brewing had a unique business conception. The idea started with a pair of father and sons. This group of four men shared a passion for brewing, farming, and of course, drinking beer. Scott Seiz and his son Ryan have shared a love for home brewing since 2015. Tom Taber and his son Tim had a passion for farming and preserving the historic nature of Bucks County’s abundant farmland. The father and son pair started a microbrewery and brew farm. This was a first for the Bucks County area, better known for the established wineries. Warwick Farm Brewing was designed to bring beer enthusiasts a complete craft experience you might find at one of the local wineries. Today the sons run the business. Tim “Timmy” Taber is the General Manager, and Ryan Seiz is the Head Brewer.</span></p>\n<p class=\"p6\"><strong>The Beer</strong></p>\n<p class=\"p5\"><span class=\"s3\">If you haven’t been living under a rock for the past twenty years, you are likely familiar with the term farm to table or farm to fork. The concept is sourcing a restaurant’s food ingredients from local farmers to offer more flavorful and fresh produce. This idea has also been infiltrating the beer business, and Warwick Farm is no exception. The brewery sits atop a 22-acre farm that yields its own hops for many hop-forward brewing options. As you sit on the tasting room deck or even in the Biergarten, you are within a stone’s throw of one of the hop farms on the property. Having the hops and other ingredients on-site allows Ryan to experiment across all beer varieties and flavors. From hop-forward IPAs to farmhouse ales and from English stouts to Belgian style ales, the range of brews is made to meet the high standards of enthusiasts as well as the casual beer drinker.</span></p>\n<p class=\"p5\"><span class=\"s3\">So this month, on Father’s Day weekend, take dad to the brew farm that sits atop a hill in Jamison, PA, and enjoy your time together talking, observing, and of course, tasting some of the best beer to be found in Bucks County.</span></p>\n<p class=\"p8\"><i>Susan and John live in Doylestown Boro and support local business and events in Doylestown (and Beyond) with their Instagram account @doylestownborobuzz.</i></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/06/Taber-Seiz-Pic.jpg"
}