{
  "id": 14821,
  "title": "Up Close with Singer Nicole Gordon",
  "slug": "up-close-with-singer-nicole-gordon",
  "date": "2022-09-12T23:13:45",
  "author": "Staff",
  "category": [
    "Arts/Music"
  ],
  "tags": [
    "doylestown cardinal",
    "nicole gordon"
  ],
  "excerpt": "<p>Meet Doylestown’s own Nicole Gordon. She is a singer/songwriter and has released 11 CDs and toured the US.  Her songs have been featured in over 75 films and TV shows!   What was your initial inspiration for becoming a musician?  Probably growing up in a home with music-loving parents. There were various genres of albums, [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><span class=\"s1\"><i>Meet Doylestown’s own Nicole Gordon. She is a singer/songwriter and has released 11 CDs and toured the US.<span class=\"Apple-converted-space\">  </span>Her songs have been featured in over 75 films and TV shows! </i></span><span class=\"s2\"><span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><strong><span class=\"s5\">What was your initial inspiration for becoming a musician?<span class=\"Apple-converted-space\"> </span></span></strong></p>\n<p class=\"p4\"><span class=\"s4\">Probably growing up in a home with music-loving parents. There were various genres of albums, tapes, and CD’s playing in our house and we had instruments around too, so I just started tinkering on them. Also, my mom took me to see a show at The Bucks County Playhouse as a kid, and I knew I wanted to do something related to music!</span></p>\n<p class=\"p3\"><strong>You are an amazing singer and a talented songwriter to boot, what is your favorite song you’ve ever written and could you tell us a bit about it?</strong></p>\n<p class=\"p4\"><span class=\"s4\">Thank you very much. I think you know how difficult it is to pick a favorite as they are all labors of love but I’ll say the first song I ever wrote and recorded was called “A Heart Outgrown” with my friend, Bill Hartley. That song still gets me.<span class=\"Apple-converted-space\">  </span>Before that, it was all just a dream or a hope, and then when I got the first one under my belt, I was hooked! I also have to mention “Every Night about this Time” and “Church”. “Church” is about how a person can find spirituality in nature, and “Every Night. . .” is about a mother’s nightly ritual from her child’s perspective and questioning what it means.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p3\"><strong>How did you get started recording professionally?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p4\"><span class=\"s4\">I was playing locally in Bucks County as a teenager and was approached by a fellow singer who needed a backing vocalist on his bands’ next recording. Through him, I met Bill Hartley, who is a producer/songwriter out of Glenside and after I recorded the backing part, he asked if I wanted to try and write songs together for a different project, which turned into my first original band. I learned so much about recording through and with Bill.<span class=\"Apple-converted-space\">  </span>That experience was helpful as I moved into being a session vocalist in California.</span></p>\n<p class=\"p3\"><strong>You recently had songs on the TV show Filthy Rich and the film Gabriel’s Inferno. That has to be so exciting! How did you get involved and what was it like to have your songs used for those projects?<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p4\"><span class=\"s4\">I lived in Los Angeles for about 18 years and met and worked with so many incredible people -songwriters, producers, musicians, you name it! During the Pandemic, I re-connected with many contacts that I had lost touch with and recorded from home, here in Doylestown.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">The “Gabriel’s Inferno” placement was through a streaming platform/production company called “Passionflix”. They make films from romance novels and it was started by Tosca Musk, Elon’s sister.<span class=\"Apple-converted-space\">  </span>A woman I used to work with is the film editor and had been holding onto a song of mine called “Catch Me” for many years. She wanted to use it in a film somewhere and this was the right film!<span class=\"Apple-converted-space\">  </span>It was exciting and I was invited to go to the premiere in Boston last December and sing.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">The “Filthy Rich” project was through a music supervisor/friend of mine. He had placed a few of my songs on television shows years ago and gave me an opportunity to get involved with this new one. He asked if I would record “Hallelujah” and submit it for a spot on the show. They wanted KD Lang’s version but could not afford it, so I reconnected with my old buddy Bill Hartley and recorded the song and they used it!<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><strong>Nicole will be performing at The Waterwheel Sept 23rd and Nov 10th. <span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p6\"><strong>Learn more about her <a href=\"https://nicolegordon.net\" target=\"_blank\" rel=\"noopener noreferrer\">https://nicolegordon.net</a></strong></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/09/Nicole-Gordon.jpeg"
}