{
  "id": 11583,
  "title": "Visit Bucks County Shares Tourism Figures at 2021 Annual Meeting",
  "slug": "visit-bucks-county-shares-tourism-figures-at-2021-annual-meeting",
  "date": "2021-11-13T11:53:17",
  "author": "Staff",
  "category": [
    "Stay"
  ],
  "tags": [
    "doylestown cardinal",
    "odette's",
    "paul bencivengo",
    "Visit Bucks County"
  ],
  "excerpt": "<p>Info Reflects Recovery Efforts, Visitation Numbers and Marketing Strategies Visit Bucks County (VBC), the official tourism promotion agency for Bucks County, Pennsylvania, held its Annual Meeting on Thursday, October 14 at the River House at Odette’s. “Over the past year we’ve seen hospitality development in nearly every corner of the County,” said Frank Lyons, Board [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong><i>Info Reflects Recovery Efforts, Visitation Numbers and Marketing Strategies</i></strong></p>\n<p class=\"p3\"><span class=\"s2\">Visit Bucks County (VBC), the official tourism promotion agency for Bucks County, Pennsylvania, held its Annual Meeting on Thursday, October 14 at the River House at Odette’s.</span></p>\n<p class=\"p4\"><span class=\"s3\">“Over the past year we’ve seen hospitality development in nearly every corner of the County,” said Frank Lyons, Board Chairperson of Visit Bucks County and proprietor of Yardley’s Continental Tavern restaurant. “We have worked closely with the County of Bucks, other Bucks County economic development agencies, U.S. Travel Association and the Pennsylvania Restaurant &amp; Lodging Association to bring much needed funding, resources and timely information to Bucks County’s hospitality industry.”</span></p>\n<p class=\"p4\"><span class=\"s3\">The afternoon event also included a presentation from guest speaker Brian Kelly, a Bucks County native, and the founder and CEO of The Points Guy, the leading voice in loyalty programs, points, miles, credit cards and travel that reaches more than 11 million unique monthly visitors around the world.</span></p>\n<p class=\"p4\"><span class=\"s3\">Paul Bencivengo, President &amp; COO of Visit Bucks County presented on key economic indicators and initiatives. “VBC’s responsible marketing leveraged our location between two metropolitans, outdoor attractions, walkable towns and pent-up demand to navigate the pandemic’s impact on the hospitality industry,” he stated.</span></p>\n<p class=\"p5\"><strong><span class=\"s4\">RECORD-BREAKING REBOUND</span></strong></p>\n<p class=\"p4\"><span class=\"s3\">Starting in early spring 2021, VBC launched effective seasonal campaigns supported by CARES dollars through the County of Bucks. For the first six months of 2021, Bucks County saw a 32% increase over 2020 in hotel occupancy and was nearly flat compared to 2019. Average daily room rate and revenue per available room also rebounded strongly from 2020 and both were up 3% over 2019.</span></p>\n<p class=\"p4\"><span class=\"s3\">Hotel occupancy was strong in June, July and August at 74.4%, 77.3% and 74.6% respectively. Demand in the summer also drove room rates up with the average daily rates setting records at $117.14, $123.78 and $123.93. Revenue per available room also saw record numbers. Though still awaiting final numbers, all indicators are showing this could be the best September on record.</span></p>\n<p class=\"p5\"><strong><span class=\"s4\">MARKETING CAMPAIGNS</span></strong></p>\n<p class=\"p4\"><span class=\"s3\">Visit Bucks County’s summer marketing campaign featured bold, beautiful outdoor photography showcasing Bucks County. Television commercials, billboards and digital ads focused on welcoming visitors from diverse backgrounds were run in target markets, including New York, Northern New Jersey and Philadelphia. These marketing efforts drove visitors to VisitBucksCounty.com. Year to date, pageviews are up 50%, users up nearly 53% and new users are up 55% vs. 2020. Compared to 2019, which was a record-breaking year for website traffic and visitation to the County, pageviews are up 21%, users are up 53% and new users are up 54%.</span></p>\n<p class=\"p4\"><span class=\"s3\">VBC will be relaunching the Holidays in Bucks County campaign in November and December, enticing visitors with even more festive, outdoor offerings than last year. The advertising will build on the strong Holidays in Bucks County campaign launched in 2020.</span></p>\n<p class=\"p4\"><span class=\"s3\">Visit Bucks County’s YouTube channel @VisitBucksPA also saw large increases in traffic attracting more than 4.5 million views over the past year. Newly developed video content included additions to the “Check-In” series and trailers promoting the popular “Bucks County Is My Home” and “Towns &amp; Main Streets” series. VBC also has three new commercials set to launch in 2022.</span></p>\n<p class=\"p4\"><span class=\"s5\">VBC has long recognized the local community as marketing advocates. The “From the Locals” blog section of VisitBucksCounty.com, written entirely by passionate residents, was enhanced this year with new layouts and updated design elements. Local blogger, Brooke Hillman, also continued to host Visit Bucks County’s “From the Locals” podcast. Each episode tells the story of an entrepreneur exploring why they chose Bucks County as their place of business.</span></p>\n<p class=\"p4\"><span class=\"s3\">The craft beer scene continues to boom in Bucks County. Since the launch of the Ale Trail in 2019, there are now nearly 30 brewery locations throughout Bucks County. To continue the momentum, VBC released a new Ale Trail t-shirt. The t-shirt was announced through SMS push notifications and emails, as well as social media. VBC tracked more than 7,000 individuals checking in their Ale Trail passports at the breweries in 2021 – up almost 1,000% vs. 2020 – and to date has shipped nearly 4,000 t-shirts to Ale Trail goers. Visiting multiple breweries has visitors and locals traversing the County creating economic impact and stopping at our restaurants, shops and attractions.</span></p>\n<p class=\"p5\"><strong><span class=\"s4\">SUPPORTING THE INDUSTRY</span></strong></p>\n<p class=\"p4\"><span class=\"s3\">The Visit Bucks County team remained committed to supporting the hospitality industry throughout 2020 and 2021 in a variety of ways, from 25+ virtual webinars to countless phone conversations and site visits.</span></p>\n<p class=\"p4\"><span class=\"s3\">The Bucks County Visitor Center’s Visitor Services team fulfilled 7,500 Destination Guide requests and supported nearly 12,000 interested travelers in 2021 through walk-ins, phone calls, live chats and emails.</span></p>\n<p class=\"p4\"><span class=\"s3\">VBC also supported the County of Bucks with their critical funding streams through multiple rounds of the Bucks Back to Work Programs. VBC assisted in the Governor’s COVID-19 Hospitality Industry Recovery Program (CHIRP) program in collaboration with the County of Bucks, Bucks County Economic Development Corporation and the Redevelopment Authority. CHIRP provided more than $7,000,000 to local restaurants and lodging properties in Bucks County.</span></p>\n<p class=\"p4\"><span class=\"s6\">In addition, VBC worked with the County to reopen the Bucks County Tourism Grant Program this year to both for profits and non-profits. For more visit <a href=\"http://www.VisitBucksCounty.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.VisitBucksCounty.com</a></span></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2021/11/2021-VBC-Annual-Meeting.jpg"
}