{
  "id": 12523,
  "title": "What’s New in Town? Union Street Studio",
  "slug": "whats-new-in-town-union-street-studio",
  "date": "2022-03-02T21:05:50",
  "author": "Staff",
  "category": [
    "Arts/Music",
    "Taste"
  ],
  "tags": [
    "doylestown cardinal",
    "jess ramoy",
    "Kristine Aylmer",
    "union street studio"
  ],
  "excerpt": "<p>By Jess Ramoy • The Cardinal Contributing Writer The Cardinal had the pleasure of chatting with Kristine Aylmer owner of Union Street Studio, a cozy spot where local women can participate in creative community events. Learn about the studio and Kristine’s future vision for this lovely space.    UNION Street Studio is….  A studio with [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><strong>By Jess Ramoy • </strong>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><i>T</i><i>he Cardinal had the pleasure of chatting with Kristine Aylmer owner of Union Street Studio, a cozy spot where local women can participate in creative community events. Learn about the studio and Kristine’s future vision for this lovely space.<span class=\"Apple-converted-space\">  </span></i><span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p5\"><strong>UNION Street Studio is….<span class=\"Apple-converted-space\"> </span></strong></p>\n<p class=\"p6\"><span class=\"s1\">A studio with limitless possibilities. Currently hosting two weekly events; Thursday Ladies Night Out and Saturday Coffee and Crafting. At these events, the ladies listen to music, get creative, and drink wine or coffee while enjoying the company of other local women. The space is also available to rent for Girl Scout events or other private women’s group events.</span></p>\n<p class=\"p6\"><span class=\"s1\">“I love meeting new friends, talking, and learning from each other. I am not an expert at anything. I just love crafting and learning. I feel at peace when I’m here”. Kristine says about her cozy, inviting space.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">How the Business Got Started…</span></strong></p>\n<p class=\"p6\"><span class=\"s1\">The business idea started in 2018. Kristine was approaching her mom’s age when she passed away. At that time, she worked as an office manager and started feeling that sense of YOLO (You Only Live Once). She longed for something creative that would bring passion into her career. Something flexible, of course, because, in Kristine’s words, “being a mom is NOT easy”! She loved interior design, crafting, and bringing the community together.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">With the help of Brad Frith, a brilliant friend who guided her along the way, Scott Little, a commercial banker who believed in her and her business plan, and her husband and boys, her biggest cheerleaders, she was able to purchase the entire Union Street Studio building. She rehabbed and designed the space in a year, then decided to lease the space slotted for her studio.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">She needed a break after that intense year of renovation. Her tenants left after a year. She considered leasing it again, but three motivators pushed her to go for it. First, her family, as they had heard about her workshop/studio dream for years, and in Kristine’s opinion, they were sick of hearing about it. Second, she didn’t want to manage another renter because she quickly learned that rental property management is challenging on many levels—lastly, YOLO.</span></p>\n<p class=\"p5\"><strong><span class=\"s2\">About Kristine….</span></strong></p>\n<p class=\"p6\"><span class=\"s1\">Kristine graduated from Lehigh University with a degree in accounting. She met her husband at her first job in Philadelphia. “He is the love of my life, although half the time I want to kill him, he has always supported my dreams for our life together and brought so much love and humor into my life”, Kristine says about her husband.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">Shortly after getting married, she became a middle school teacher then had her first son, Charlie. He was born with hydrocephalus and had multiple surgeries in his first couple of years, but as an 18-year-old is thriving thanks to CHOP neurologists. Kristine explains “Through the grace of God, we were able to adopt our son, Melore (Peter), from Ethiopia. He is now 13 and keeps the family very busy with his passion for basketball”. Her family has lived in Doylestown for 11 years and loves the community here. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p5\"><strong><span class=\"s2\">The Future Vision&#8230;</span></strong></p>\n<p class=\"p6\"><span class=\"s1\">Union Street Studio has the current goal of perfecting the current events to get them to full capacity.<span class=\"Apple-converted-space\">  </span>Kristine envisions Union Street Studio to be where local nonprofits can meet as she is cause-driven and passionate about diversity and inclusion. She sees collaborating with like-minded people at the studio in the future. Her 10–year vision includes her husband as he has his ideas too, including using the space in some way to support the special needs community. <span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p6\"><span class=\"s1\">“It’s scary. It’s a risk putting yourself out there. It’s nerve-wracking trying to find your way. I’m lucky to have a lot of great friends who support me. I recently joined the chamber of commerce, so I think that can help me navigate this small business world. I know I have worked tirelessly to convert this old stable from the 1800s to the beautiful space it is now. So far, it’s just the beginning!”</span></p>\n<p>For more visit <a href=\"https://www.ussdtown.com\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.ussdtown.com</a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/03/Union-Street-Studio.jpg"
}