{
  "id": 12280,
  "title": "Where To Eat On Valentine’s Day",
  "slug": "where-to-eat-on-valentines-day",
  "date": "2022-02-08T13:04:33",
  "author": "Staff",
  "category": [
    "Taste"
  ],
  "tags": [
    "dana roberts",
    "doylestown cardinal",
    "Genevieve’s Kitchen",
    "Honey Restaurant",
    "Lovebird",
    "Native Café",
    "Omiza",
    "Ooka",
    "Paganini",
    "The Hattery Stove &amp; Still",
    "valentines day"
  ],
  "excerpt": "<p>Recommendations Based on Your Love Stage By Dana Roberts • The Cardinal Contributing Writer Whether your relationship status is single, attached, or looking- show yourself, your partner, and the Doylestown restaurant scene a little love this Valentine’s Day by dining in (or getting take-out!). There’s nothing better than a delicious meal to nourish the body [&hellip;]</p>\n",
  "content": "<p class=\"p1\"><b><i>Recommendations Based on Your Love Stage</i></b></p>\n<p class=\"p1\"><b>By Dana Roberts • </b>The Cardinal Contributing Writer</p>\n<p class=\"p3\"><span class=\"s2\">Whether your relationship status is single, attached, or looking- show yourself, your partner, and the Doylestown restaurant scene a little love this Valentine’s Day by dining in (or getting take-out!). There’s nothing better than a delicious meal to nourish the body and soul on a day when we’re meant to give love.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Luckily for us, Doylestown abounds with excellent restaurants (far too many to include in this article!), and to make it easy to narrow it down, we’ve come up with some helpful suggestions for what restaurant to choose based on your love stage. No matter where you pick, you can’t go wrong, since one thing is certain: food is a love language we all speak.</span></p>\n<p class=\"p5\"><b>For your first anniversary….</b></p>\n<p class=\"p4\"><span class=\"s2\">There is nowhere sweeter to celebrate this special milestone than </span><span class=\"s3\"><strong>Genevieve’s Kitchen</strong>.</span><span class=\"s2\"> This wonderful BYOB, headed by Chef Joey Mcalinden (friend and long-time coworker of Genevieve, the former owner of the eponymous restaurant), serves up the best New American cuisine with an Italian influence in the coziest, loveliest atmosphere. Start your meal off with the fried lobster ravioli, move on to the short rib Bolognese and duck cassoulet, and end the meal with any of the fantastic desserts (limoncello mascarpone cake! Chocolate peanut butter pie! Warm apple cobbler! Are you drooling yet?). The wait staff here are truly superb, and you’ll find the chef walking around to check on his (very satisfied) customers at every sitting.</span></p>\n<p class=\"p7\"><em>Genevieve’s Kitchen, 19 E. State Street <span class=\"Apple-converted-space\">  </span>267-614-9635    </em><a href=\"http://www.genevieveskitchen.com\" target=\"_blank\" rel=\"noopener noreferrer\"><em>www.genevieveskitchen.com</em></a></p>\n<p class=\"p5\"><b>All the single ladies (and people)…</b></p>\n<p class=\"p4\"><span class=\"s2\">Beyonce and I both would send you right to </span><strong><span class=\"s3\">Lovebird</span></strong><span class=\"s2\">. Look past the irony in this recommendation and head here to enjoy a fast-casual meal (either dine-in or get take-out to bring back to your couch). Created by the owners of Jules Thin Crust, Lovebird is a high-quality chicken restaurant that serves up delicious, made-to-order sandwiches, salads, and quinoa bowls. Vegetarian and gluten-free options are available.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Take advantage of this month’s specials, the Banh Mi Bowl and the Apple Jack chicken sandwich, featuring local apples, Sharp Cheddar cheese, and cinnamon-infused maple syrup. Who knows, you might even meet your soulmate while waiting in line!</span></p>\n<p class=\"p7\"><em>Lovebird, 19 E. Oakland Avenue<span class=\"Apple-converted-space\">     </span></em><em>267-406-4712 <span class=\"Apple-converted-space\">     </span><a href=\"http://lovebirdpa.com\" target=\"_blank\" rel=\"noopener noreferrer\">lovebirdpa.com</a></em></p>\n<p class=\"p5\"><b>For a first date…</b></p>\n<p class=\"p4\"><span class=\"s2\">….during the daytime, head to </span><span class=\"s3\"><strong>Native Café</strong>.</span><span class=\"s2\"> Owners Jay and Kate have created what is truly a neighborhood coffee shop right in the center of town. With plenty of little nooks to tuck into with a cup of coffee or latte and a baked good or the famous Holy Basil Breakfast burrito, this café is the perfect place to take someone you’re meeting in the flesh after swiping right.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">With lots of foot traffic and people watching, you’ll have plenty to talk about. A busy café also means no need to worry if your match turns out to be a bit of a creeper- lots of bystanders to make you feel at ease ;).<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><em>Native Café, 12 S. Main Street<span class=\"Apple-converted-space\">    </span></em><em>267-247-5096      </em><em>Native Cafe Doylestown on Facebook</em></p>\n<p class=\"p4\"><strong><span class=\"s3\">….at night</span></strong><span class=\"s2\"><strong>,</strong> make a reservation at </span><strong><span class=\"s3\">The Hattery Stove &amp; Still</span></strong><span class=\"s2\">, or snag two seats at the bar. The Hattery, connected to the Doylestown Inn, offers modern American fare and comfort food in a beautiful, ‘antique industrial’ space. If you’re at the bar, make sure you try one of the specialty drinks (the Apple Cinnamon Mule, Apple Cider Mimosa, and the Hattery Highball are delightful) and share the Hot Chips with blue cheese fondue.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s4\">If you’re sitting down to dine, show your date what you’re made of and order the Chicken or the Egg Sandwich. Sure, you might get messy, but you’ll impress your dining partner with your appetite and, at the very least, will leave incredibly satisfied. The Hattery is also offering a Valentine’s Day prix fixe menu in addition to their regular menu. And, if things go very well with your date, you might even take advantage of the Doylestown Inn’s special rates.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><em>The Hattery Stove &amp; Still, 18 W. State Street    </em><em>215-345-1527 <span class=\"Apple-converted-space\">     </span><a href=\"http://hatterydoylestown.com\" target=\"_blank\" rel=\"noopener noreferrer\">hatterydoylestown.com</a></em></p>\n<p class=\"p5\"><b>For the couple in need of a sexy, spicy evening…</b></p>\n<p class=\"p4\"><span class=\"s2\">Dust off your good jewelry, put on that top with the plunging neckline, and head to </span><strong><span class=\"s3\">Honey</span></strong><span class=\"s2\">. Owned by husband-and-wife Amy and Joe McAtee (Amy runs the front-of-house and server training/liquor programs, and Joe is the chef). Honey offers truly delicious, unique small plates with flavor combinations that will make you moan upon tasting. My favorites are the foie gras sliders, black tea glazed spare ribs, “black velvet” oysters, and truffle and smoke potato chips.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">The restaurant’s ambiance is just as seductive as the food, with dim lighting, cozy tables, and attentive, knowledgeable waitstaff. The magic of being run by a married couple is evident: Amy said that Honey has witnessed 15 marriage proposals, almost all of which have taken place in the first, curtained booth in the restaurant, many of which Amy has been a part of in executing. This Valentine’s Day, Honey offers a special, multi-course shared tasting menu, priced per couple. Do your relationship and your palate a favor and call Honey today to experience a foodie’s dream come true.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><em>Honey Restaurant, 42 Shewell Avenue   </em><em>215-489-4200 <span class=\"Apple-converted-space\">    </span><a href=\"http://honeyrestaurant.com\" target=\"_blank\" rel=\"noopener noreferrer\">honeyrestaurant.com</a></em></p>\n<p class=\"p5\"><b>For the together-forever couple….</b></p>\n<p class=\"p4\"><span class=\"s2\">You must dine at</span><span class=\"s3\"><strong> Paganini</strong>,</span><span class=\"s2\"> one of Doylestown’s long-standing restaurants that is proud to be celebrating its 31st anniversary. Opened in 1990 by owners Karen and Raouf, who met while working in Paris at an Italian restaurant, Paganini offers hand-crafted, locally-sourced Italian and European-inspired dishes in a comfortable atmosphere.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">With a full bar selection and delicious daily house-made pasta specials, fresh salads, wood-oven pizza, seafood, specialty sandwiches, and mouth-watering desserts, Paganini is the best place to honor your long-time love on Valentine’s Day.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\"><em>Paganini, 81 W. State Street   </em><em><span class=\"s5\">215-348-5922 <span class=\"Apple-converted-space\">    </span><a href=\"http://www.paganinidoylestown.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.paganinidoylestown.com</a></span></em><b> </b></p>\n<p class=\"p5\"><b>For the couple who can’t get a babysitter…</b></p>\n<p class=\"p4\"><span class=\"s2\">Fear not, Valentine’s Day doesn’t need to go to shambles just because your babysitter bailed (or you didn’t get one in the first place). Bring the kids along for fun entertainment, get a Korean barbecue at </span><strong><span class=\"s3\">Omiza</span></strong><span class=\"s2\"> or sit down for hibachi at </span><strong><span class=\"s3\">Ooka</span></strong><span class=\"s2\">.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">Both of these restaurants offer captivating dining experiences for the five and up crowd, leaving parents some time to sip on a specialty cocktail and enjoy a (brief) moment of peace. Omiza and Ooka both offer menus with a wide variety.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p4\"><span class=\"s2\">In addition to hibachi, Ooka serves up Japanese cuisine and sushi, while Omiza also offers dumplings, “kochi” (skewered meats and vegetables), sushi, noodles, and rice and grill specialties.<span class=\"Apple-converted-space\"> </span></span></p>\n<p class=\"p7\">Omiza, 641 North Main Street   267-579-4222 <span class=\"Apple-converted-space\">    </span><a href=\"http://omizarestaurant.com\" target=\"_blank\" rel=\"noopener noreferrer\">omizarestaurant.com</a></p>\n<p class=\"p7\">Ooka, 110 Veterans Lane    215-348-8185 <span class=\"Apple-converted-space\">     </span><a href=\"http://ookasushi.com\" target=\"_blank\" rel=\"noopener noreferrer\">ookasushi.com</a></p>\n",
  "thumbnail": "https://doylestowncardinal.com/wp-content/uploads/2022/02/Paganini.jpg"
}