{
  "articles": [
    {
      "id": 1,
      "title": "How Our Emotions Contribute to Heart Disease",
      "subtitle": "Understanding the crucial link between emotional well-being and heart health",
      "author": "Jill Sonlin",
      "authorRole": "Senior Reporter",
      "authorImage": "/images/annikaVerma.jpg",
      "slug": "emotions-heart-disease-connection",
      "category": "Live",
      "tags": ["Live", "Health", "Wellness"],
      "date": "2025-02-01T09:00:00Z",
      "readingTime": "6 min read",
      "image": "/article-images/HeartHealthy.jpg",
      "mainImage": "/article-images/HeartHealthy.jpg",
      "excerpt": "Did you know that our emotions can also contribute to risks of heart attack and stroke? Understanding this connection is crucial for holistic heart health.",
      "content": "<h2>Persuasive emotions that harm</h2><p>Negative states of mind, including emotions of anger, bitterness, depression, loneliness, and anxiety, can each carry risks of doing a lot of damage to the heart and the body. To lower potential health risks, we must account for and nurish the mind-body connection.</p><p>If you are experiencing emotional pain, know that you are not alone.</p><p>Seek help to talk about your feelings with a trusted friend, family member, pastor, or therapist. Talking openly about negative feelings can be the start of dealing effectively with and healing emotional burdens of the heart that can affect physical heart health.</p>"
    },
    {
      "id": 2,
      "title": "Stage United Hosts A Night of Song at Tile Works",
      "subtitle": "Local musicians gather for a magical evening of storytelling through song",
      "author": "Lauren Heine",
      "authorRole": "Arts & Culture Reporter",
      "authorImage": "/images/leiaRiggins.jpg",
      "slug": "stage-united-night-of-song",
      "category": "Arts",
      "tags": ["Arts", "Music", "Local Events"],
      "date": "2025-01-13T14:30:00Z",
      "readingTime": "4 min read",
      "image": "/article-images/Screenshot-2025-01-13.png",
      "mainImage": "/article-images/Screenshot-2025-01-13.png",
      "excerpt": "Join in the history of the Tile Works in Doylestown for A Night of Song, a monthly songwriter showcase hosted by Joe Montone, a Bucks County music producer.",
      "content": "<h2>A Celebration of Local Talent</h2><p>The historic Moravian Pottery and Tile Works transforms into an intimate concert venue as Stage United presents its monthly songwriter showcase. Local music producer Joe Montone curates an evening featuring the region's most compelling voices in contemporary folk and acoustic music.</p><p>This month's lineup includes emerging artists from across Bucks County, each bringing their unique perspective to the storytelling tradition of folk music. The historic setting of the Tile Works provides perfect acoustics and atmosphere for these intimate performances.</p>"
    },
    {
      "id": 3,
      "title": "Organizational Wisdoms from Wingmoms",
      "subtitle": "Finding order in the chaos of family life",
      "author": "Natalya Bucuy",
      "authorRole": "Family & Lifestyle Editor",
      "authorImage": "/images/natalya-Bucuy.jpg",
      "slug": "organizational-wisdoms-wingmoms",
      "category": "Family",
      "tags": ["Live", "Family", "Organization"],
      "date": "2025-02-01T12:00:00Z",
      "readingTime": "5 min read",
      "image": "/article-images/458305498_392015483999134_6822641435809695635.png",
      "mainImage": "/article-images/458305498_392015483999134_6822641435809695635.png",
      "excerpt": "Nothing is for certain except death and taxes. And laundry. A loyal friend through life's trials, Laundry will always be there for us.",
      "content": "<h2>The Art of Family Organization</h2><p>In the grand symphony of family life, organization is the conductor that keeps everything in harmony. Local moms share their tried-and-true methods for maintaining order in the beautiful chaos of raising children.</p><p>From innovative storage solutions to time-management strategies, these Doylestown parents have mastered the art of keeping their households running smoothly while preserving their sanity.</p><h2>Beyond Basic Organization</h2><p>The secret, they say, isn't in pursuing perfection but in finding systems that work for your unique family dynamic. These practical solutions have evolved through years of trial and error, resulting in methods that actually stick.</p>"
    },
    {
      "id": 4,
      "title": "“Not If I Can Help It”: Memoir Calls for Justice for Domestic Violence Victims",
      "subtitle": "As far as life-changing events go, a 3 a.m. bang on the door resides towards the top of the list. It certainly was so for Meg Groff.",
      "author": "Natalya Bucuy",
      "authorRole": "Family & Lifestyle Editor",
      "authorImage": "/images/natalya-Bucuy.jpg",
      "slug": "not-if-i-can-help-it",
      "category": "Live",
      "tags": ["Live"],
      "date": "2025-03-01T12:00:00Z",
      "readingTime": "8 min read",
      "mainImage": "/article-images/not-if-i-can-help-it.png",
      "excerpt": "In her debut memoir, Not If I Can Help It, A Family Lawyer’s Battles for Justice for Victims of Domestic Violence and the Poor, Meg Groff documents her experiences.",
      "content": "<h2>Not If I Can Help It: A Family Lawyer’s Battles for Justice</h2><p>As far as life-changing events go, a 3 a.m. bang on the door resides towards the top of the list. It certainly was so for Meg Groff.</p><p>The hysterical night-gowned woman at the door couldn’t even explain her distress until Meg wrapped her in a blanket and held her to calm her down. Then, Lily told the horrific story. Her abusive boyfriend, from whom Lily fled with her newborn baby, found her. He beat her up and drove away in the night with the baby. The police officer on the phone told her there was nothing they could do. Meg suspected miscommunication. But when she called, she got a similar response. A lawyer echoed the police’s sentiments in another call Meg placed the next day.</p><h2>The Early Fight for Victims’ Rights</h2><p>The year was 1974. It would be two years before Meg’s native Pennsylvania enacted the Protection from Abuse (PFA) Act, becoming the second state to pass a law in defense of domestic violence victims. People like Lily were out of luck. Meg set out to help. She became a lawyer and an abuse victims’ advocate. She remains one today.</p><p>In her debut memoir, <em>Not If I Can Help It, A Family Lawyer’s Battles for Justice for Victims of Domestic Violence and the Poor</em>, Meg Groff documents her experiences. The book’s pages share Lily’s story among those of dozens of others. Sadly, Meg encountered these in her early years as a Bucks County Legal Aid lawyer. For over four decades, Meg defended women and their children against abusive partners, an unfair legal system, and economic injustice. In Lily’s case, things turned out well — the baby was eventually returned to the mother. But many of these stories are sad and tragic.</p><h2>Shining Light on a Difficult Topic</h2><p>The topic on hand is difficult and complex. Meg engages the reader with tales of creative ways she employed within the system to best serve her clients. Her witty and personal voice takes us through the nightmare world of domestic violence in a way that inspires action. And that is the goal of the book — to educate readers about the devastating realities victims face. “For years, as a lawyer, I worked to educate the judges, often prejudiced to victims of domestic abuse,” Meg says. “Now, I hope to educate the public. I want people to know that this is not something that happened in the past. It’s happening now. It’s happening in our communities.”</p><h2>The Woman Behind the Work</h2><p>A natural storyteller, Meg says she always knew she wanted to write and share her clients’ stories. She does so beautifully in the book, but her hard work is evident not only in her words but in her stand in the community.</p><p>As I interviewed Meg about her career and the book, I mentioned her name to a friend. Her eyes lit up and then got sad — lit up, because Meg was her lawyer who saved her life; sad, because that time of her life was so hard. My friend is among many. Meg encountered and helped countless women and families as a staff lawyer at Bucks County Legal Aid, a volunteer at the local domestic violence organization, the Woman’s Place, and as a consultant and strong supporter of Kayden’s Law.</p><h2>Kayden’s Law and the Road Ahead</h2><p>The latter is a Bucks County–based state initiative that gives judges guidance on how to include evidence of domestic violence in their custody judgments. Prior to the law’s enactment in 2024, Groff helped draft the legislation. Following the publishing of her book, she is leading an Impact Campaign to further educate people about Kayden’s Law.</p><h2>From Hippie to Hero</h2><p>How did this Philadelphia-born hippie who hated school so much that she joined the traffic committee just to skip classes turn into a community keystone whose actions save lives?</p><p>That midnight visitor was Meg’s first encounter with the issue. There would be more night-gowned, bruised women crying in Meg’s arms. A few years later, she finished her degree in psychology — an accomplishment of many years, as Meg took courses for over a decade while also raising a daughter.</p><p>“I had no marketable skills,” Meg writes in the book, describing her unfortunate adventures as a clumsy waitress, a lost taxicab driver, and a night industrial sock-machine operator. Eventually, Meg found her way to Temple Law School. There, she felt more out of place than ever — everyone had a lawyer connection. She, on the other hand, was a hippie before hippies were in and remained one after, now in the 1980s. But to drop out meant she had to pay back the $5k student loan right away, something she could not afford. And so Meg became a lawyer. Her path took her to a small rural Pennsylvania town and then back to her husband Jim in Bucks County.</p><h2>The Roots of Strength</h2><p>Meg says she also owes her success to her parents. Born in 1943 (something she hopes to change to “something more reasonable”), Meg lucked out with progressive and supportive parents. They instilled deep values in her, always prioritizing justice and the responsibility to help neighbors. It was her mother’s advice to enroll in college that put Meg on her path to her passion for helping people in need.</p><h2>March Forth</h2><p><em>Not If I Can Help It</em> is out on March 4 with Rivertowns Publishing. March 4 is also Meg’s birthday. She says she tried to change it once because everyone is miserable in March, asking her friends to instead celebrate her birthday in May. It didn’t stick, but it occurred to Meg that the date precisely stated her life’s purpose: March “Forth.” And so, she does.</p><p>For more information about the book and the Impact Campaign for Kayden’s Law, visit <a href=\"https://meggroff.com\">meggroff.com</a>.</p><p>Release party information available on Facebook.</p>"
    }
  ]
}
